Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/01__CONTRIBUTING.md.po
Languages: uk

source: # Contributing
uk: # Внески

source: [Software Carpentry][swc-site], [Data Carpentry][dc-site], and [Library Carpentry][lc-site] are open source projects, and we welcome contributions of all kinds: new lessons, fixes to existing material, bug reports, and reviews of proposed changes are all welcome.
uk: [Software Carpentry][swc-site], [Data Carpentry][dc-site], та [Library Carpentry][lc-site] є проектами з відкритим кодом, і ми вітаємо будь-які внески: нові уроки, виправлення існуючого матеріалу, звіти про помилки, і огляди запропонованих змін.

source: ## Contributor Agreement
uk: ## Авторська угода

source: By contributing, you agree that we may redistribute your work under [our license](LICENSE.md). In exchange, we will address your issues and/or assess your change proposal as promptly as we can, and help you become a member of our community. Everyone involved in [Software Carpentry][swc-site], [Data Carpentry][dc-site], and [Library Carpentry][lc-site] agrees to abide by our [code of conduct](CONDUCT.md).
uk: Здійснюючи внесок, ви погоджуєтеся з тим, що ми можемо поширювати вашу роботу згідно з [our license] (LICENSE.md). Натомність, ми розглянемо ваші питання та/або оцінимо вашу пропозицію щодо змін якнайшвидше, і допоможемо вам стати членом нашої спільноти. Усі учасники [Software Carpentry][swc-site], [Data Carpentry][dc-site] та [Library Carpentry][lc-site] погоджуються дотримуватися нашого [code of conduct](CONDUCT.md).

source: ## How to Contribute
uk: ## Як долучитися

source: The easiest way to get started is to file an issue to tell us about a spelling mistake, some awkward wording, or a factual error. This is a good way to introduce yourself and to meet some of our community members.
uk: Найпростіший спосіб почати партнерство – подати повідомлення про орфографічну помилку, якесь недбале формулювання або фактичну помилку. Це гідний спосіб представити себе і познайомитися з деякими членами нашої спільноти.

source: 1. If you do not have a [GitHub][github] account,
uk: 1. Якщо у вас немає облікового запису [GitHub][github] ,

source: you can [send us comments by email][contact]. However, we will be able to respond more quickly if you use one of the other methods described below.
uk: ви можете [send us comments by email][contact]. Однак, ми зможемо відповісти швидше, якщо ви скористаєтеся одним із інших методів, описаних нижче.

source: 2. If you have a [GitHub][github] account,
uk: 2. Якщо у вас є обліковий запис [GitHub][github] ,

source: or are willing to [create one][github-join], but do not know how to use Git, you can report problems or suggest improvements by [creating an issue][issues]. This allows us to assign the item to someone and to respond to it in a threaded discussion.
uk: або ви готові [create one][github-join], але не знаєте, як використовувати Git, ви можете повідомити про проблеми або запропонувати покращення за адресою [creating an issue][issues]. Це дозволить нам призначити питання комусь і відповісти на нього у поточному обговоренні.

source: 3. If you are comfortable with Git,
uk: 3. Якщо вам зручно працювати з Git,

source: and would like to add or change material, you can submit a pull request (PR). Instructions for doing this are [included below](#using-github).
uk: і хотіли б додати або змінити матеріал, ви можете надіслати запит на зміну ( pull request). Інструкції щодо цього знаходяться за адресою [included below](#using-github).

source: ## Where to Contribute
uk: ## Куди зробити внесок

source: 1. If you wish to change this lesson,
uk: 1. Якщо ви хочете змінити цей урок,

source: please work in <https://github.com/carpentries/instructor-training>, which can be viewed at <https://carpentries.github.io/instructor-training>.
uk: будь ласка, попрацюйте з файлом <https://github.com/carpentries/instructor-training>, який можна переглянути на <https://carpentries.github.io/instructor-training>.

source: 2. If you wish to change the example lesson,
uk: 2. Якщо ви бажаєте змінити приклад уроку,

source: please work in <https://github.com/carpentries/lesson-example>, which documents the format of our lessons and can be viewed at <https://carpentries.github.io/lesson-example>.
uk: будь ласка, попрацюйте з файлом <https://github.com/carpentries/lesson-example>, який документує формат наших уроків і який можна переглянути на <https://carpentries.github.io/lesson-example>.

source: 3. If you wish to change the template used for workshop websites,
uk: 3. Якщо ви бажаєте змінити шаблон, який використовується для веб-сайтів семінарів,

source: please work in <https://github.com/carpentries/workshop-template>. The home page of that repository explains how to set up workshop websites, while the extra pages in <https://carpentries.github.io/workshop-template> provide more background on our design choices.
uk: будь ласка, попрацюйте з файлом <https://github.com/carpentries/workshop-template>. Домашня сторінка цього репозиторію пояснює, як налаштувати веб-сайти семінарів, а додаткові сторінки <https://carpentries.github.io/workshop-template> забезпечують інформацією про наш вибір дизайну.

source: 4. If you wish to change CSS style files, tools,
uk: 4. Якщо ви бажаєте змінити файли стилів CSS, інструменти,

source: or HTML boilerplate for lessons or workshops stored in `_includes` or `_layouts`, please work in <https://github.com/carpentries/styles>.
uk: або шаблон HTML для уроків чи семінарів, що зберігається в `_includes` або `_layouts`, будь ласка, працюйте у <https://github.com/carpentries/styles>.

source: ## What to Contribute
uk: ## Що внести

source: There are many ways to contribute, from writing new exercises and improving existing ones to updating or filling in the documentation and submitting [bug reports][issues] about things that don't work, aren't clear, or are missing. If you are looking for ideas, please see [the list of issues for this repository][issues], or the issues for [Data Carpentry][dc-issues], [Software Carpentry][swc-issues] , and [Library Carpentry][lc-issues] projects.
uk: Є багато способів зробити внесок, від написання нових вправ і вдосконалення існуючих до оновлення або заповнення документації і подання [bug reports][issues] про речі, які не працюють, незрозумілі або відсутні. Якщо ви шукаєте ідеї, дивіться, будь ласка [the list of issues for this repository][issues], або перелік проблем з [Data Carpentry][dc-issues], [Software Carpentry][swc-issues] , і [Library Carpentry][lc-issues] проєктів.

source: Comments on issues and reviews of pull requests are just as welcome: we are smarter together than we are on our own. Reviews from novices and newcomers are particularly valuable: it's easy for people who have been using these lessons for a while to forget how impenetrable some of this material can be, so fresh eyes are always welcome.
uk: Коментарі щодо проблем і огляди запитів на зміни також вітаються: разом ми розумніші, ніж поодинці. Особливо цінні відгуки новачків: для людей, які вже деякий час користуються цими уроками, легко забути, наскільки незрозумілим може бути цей матеріал, тому свіжі очі завжди вітаються.

source: ## What *Not* to Contribute
uk: ## Що *не* вносити

source: Our lessons already contain more material than we can cover in a typical workshop, so we are usually *not* looking for more concepts or tools to add to them. As a rule, if you want to introduce a new idea, you must (a) estimate how long it will take to teach and (b) explain what you would take out to make room for it. The first encourages contributors to be honest about requirements; the second, to think hard about priorities.
uk: Наші уроки вже містять більше матеріалу, ніж ми можемо розглянути на типовому семінарі, тому ми зазвичай *не* шукаємо більше концепцій або інструментів, щоб додати до них. Як правило, якщо ви хочете представити нову ідею, ви повинні (а) оцінити, скільки часу займе навчання і (б) пояснити, що ви б винесли, щоб звільнити для нього місце. Перша умова заохочує учасників бути чесними щодо вимог; друга - добре подумати про пріоритети.

source: We are also not looking for exercises or other material that only run on one platform. Our workshops typically contain a mixture of Windows, Mac OS X, and Linux users; in order to be usable, our lessons must run equally well on all three.
uk: Ми також не шукаємо вправи чи інші матеріали, які працюють лише на одній платформі. На наших семінарах зазвичай працюють користувачі Windows, Mac OS X і Linux; щоб бути корисними, наші уроки мають однаково добре працювати у всіх трьох операційних системах.

source: ## Using GitHub
uk: ## Використання GitHub

source: If you choose to contribute via GitHub, you may want to look at [How to Contribute to an Open Source Project on GitHub][how-contribute]. In brief:
uk: Якщо ви вирішите зробити внесок через GitHub, ви можете подивитися [How to Contribute to an Open Source Project on GitHub][how-contribute]. Якщо коротко:

source: 1. The published copy of the lesson is in the `gh-pages` branch of the repository
uk: 1. Опублікована копія уроку знаходиться у гілці `gh-pages` сховища

source: (so that GitHub will regenerate it automatically). Please create all branches from that, and merge the [master repository][repo]'s `gh-pages` branch into your `gh-pages` branch before starting work. Please do *not* work directly in your `gh-pages` branch, since that will make it difficult for you to work on other contributions.
uk: (отже, GitHub відновить цю гілку автоматично). Будь ласка, створюйте звідти всі гілки і об'єднайте [master repository][repo]'s `gh-pages` гілку з вашою `gh-pages` гілкою перед початком роботи. Будь ласка, *не* працюйте безпосередньо у своїй гілці `gh-pages`, оскільки це ускладнить вам роботу над іншими внесками.

source: 2. We use [GitHub flow][github-flow] to manage changes:
uk: 2. Ми використовуємо [GitHub flow][github-flow] для керування змінами:

source: 1. Create a new branch in your desktop copy of this repository for each significant change. 2. Commit the change in that branch. 3. Push that branch to your fork of this repository on GitHub. 4. Submit a pull request from that branch to the [master repository][repo]. 5. If you receive feedback, make changes on your desktop and push to your branch on GitHub: the pull request will update automatically.
uk: 1. Створіть нову гілку у вашій локальній копії цього репозиторію для кожної значної зміни. 2. Зафіксуйте зміну в цій гілці. 3. Відправте зміни в локальному репозиторії в GitHub. 4. Надішліть запит на зміни з цієї гілки до [master repository][repo]. 5. Якщо ви отримуєте відгук, внесіть зміни на робочому столі та надішліть у свою гілку на GitHub: запит на зміни оновиться автоматично.

source: Each lesson has two maintainers who review issues and pull requests or encourage others to do so. The maintainers are community volunteers, and have final say over what gets merged into the lesson.
uk: Кожен урок має двох супроводжуючих, які розглядають питання та запити або заохочують до цього інших. Супроводжувачі - це волонтери спільноти, і вони мають останнє слово щодо того, що буде включено в урок.

source: ## Other Resources
uk: ## Інші ресурси

source: General discussion of [Software Carpentry][swc-site], [Data Carpentry][dc-site], and [Library Carpentry][lc-site] happens on the [discussion mailing list][discuss-list], which everyone is welcome to join. You can also [reach us by email][contact].
uk: Загальне обговорення щодо [Software Carpentry][swc-site], [Data Carpentry][dc-site] та [Library Carpentry][lc-site] відбувається в [discussion mailing list][discuss-list], до якого можуть приєднатися всі бажаючі. Ви також можете [зв’язатися з нами електронною поштою] [contact].
