Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/02__LICENSE.md.po
Languages: uk

source: --- layout: page title: "Licenses" root: . ---
uk: --- layout: page title: "Ліцензії" root: . ---

source: ## Instructional Material
uk: ## Навчальні матеріали

source: All Carpentries instructional material is made available under the [Creative Commons Attribution license][cc-by-human]. The following is a human-readable summary of (and not a substitute for) the [full legal text of the CC BY 4.0 license][cc-by-legal].
uk: Всі навчальні матеріали Carpentry доступні згідно [Creative Commons Attribution license][cc-by-human]. Нижче наведено зрозумілий для людини короткий виклад (що не є заміною) [повного юридичного тексту CC BY 4.0 license][cc-by-legal].

source: You are free:
uk: Ви маєте право:

source: * to **Share**---copy and redistribute the material in any medium or format
uk: * **Поділитися**---копіювати та розповсюджувати матеріал у будь-якому носії чи форматі

source: * to **Adapt**---remix, transform, and build upon the material
uk: * **Адаптувати**---реміксувати, трансформувати та будувати на основі матеріалу

source: for any purpose, even commercially.
uk: для будь-яких цілей, навіть комерційних.

source: The licensor cannot revoke these freedoms as long as you follow the license terms.
uk: Ліцензіар не може скасувати ці свободи, якщо ви дотримуєтесь умов ліцензії.

source: Under the following terms:
uk: На таких умовах:

source: * **Attribution**---You must give appropriate credit (mentioning that
uk: * **Посилання на джерело**--- Ви повинні вказати належне джерело (зазначити, що

source: your work is derived from work that is Copyright © Software Carpentry and, where practical, linking to http://software-carpentry.org/), provide a [link to the license][cc-by-human], and indicate if changes were made. You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.
uk: ваша робота є похідною від роботи, яка захищена авторським правом © Software Carpentry та, де це можливо, пов'язати її з джерелом http://software-carpentry.org/), надати [посилання на licence][cc-by-human] і вказати, чи були внесені зміни. Ви можете зробити це будь-яким розумним способом, але не будь-яким способом, який наводить на думку ліцензіар схвалює вас або ваше використання.

source: **No additional restrictions**---You may not apply legal terms or technological measures that legally restrict others from doing anything the license permits. With the understanding that:
uk: **Жодних додаткових обмежень**---Ви не можете застосовувати юридичні умови або технологічні заходи, які юридично обмежують інших осіб здійснювати дії, дозволені ліцензією. З розумінням того, що:

source: Notices:
uk: Примітки:

source: * You do not have to comply with the license for elements of the
uk: * Вам не потрібно дотримуватися ліцензії для елементів

source: material in the public domain or where your use is permitted by an applicable exception or limitation. * No warranties are given. The license may not give you all of the permissions necessary for your intended use. For example, other rights such as publicity, privacy, or moral rights may limit how you use the material.
uk: матеріалу, що є суспільним надбанням або де ваше використання дозволено як застосовний виняток або обмеження. * Гарантії не надаються. Ліцензія може не давати вам усіх дозволів, необхідних для використання за призначенням. Наприклад, інші права, як публічність, конфіденційність або моральні права можуть обмежувати те, як ви використовуватимете матеріал.

source: ## Software
uk: ## Програмне забезпечення

source: Except where otherwise noted, the example programs and other software provided by Software Carpentry, Data Carpentry, and Library Carpentry are made available under the [OSI][osi]-approved [MIT license][mit-license].
uk: Якщо не зазначено інше, приклади програм та інше програмне забезпечення, надане Software Carpentry, Data Carpentry і Library Carpentry, доступне за умовами [OSI][osi]-approved [MIT license][mit-license].

source: Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
uk: Цим дозвіл надається безкоштовно будь-якій особі щодо копії цього програмного забезпечення та відповідних файлів документації ( у подальшому «Програмне забезпечення»), на використання Програмного забезпечення без обмежень, у тому числі без обмежень права на використання, копіювання, зміни, об'єднання, публікації, поширення, субліцензування та/або продажу копії Програмного забезпечення.

source: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
uk: Наведені вище зауваження про авторські права та це повідомлення про дозвіл мають бути включені в усі копії або основні частини Програмного забезпечення.

source: THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
uk: ПРОГРАМНЕ ЗАБЕЗПЕЧЕННЯ НАДАЄТЬСЯ «ЯК Є», БЕЗ ЖОДНИХ ГАРАНТІЙ, ПРЯМО АБО НЕПРЯМО, ВКЛЮЧАЮЧИ, АЛЕ НЕ ОБМЕЖУЮЧИСЯ ГАРАНТІЯМИ КОМЕРЦІЙНОЇ ЦІННОСТІ, ПРИДАТНОСТІ ДЛЯ ВИКОРИСТАННЯ ЗА ПРИЗНАЧЕННЯМ І НЕПОРУШЕННЯ ПРАВ. У ЖОДНОМУ РАЗІ АВТОРИ АБО ВЛАСНИКИ АВТОРСЬКИХ ПРАВ НЕ НЕСУТЬ ВІДПОВІДАЛЬНІСТЬ ЗА БУДЬ-ЯКУ ПРЕТЕНЗІЮ, ЗБИТКИ АБО ІНШУ ВІДПОВІДАЛЬНІСТЬ, В ДІЇ ДОГОВОРУ, ПРАВОПОРУШЕННЯ АБО ІНАКШЕ, ЩО ВИНИКАЄ ПОЗА ТА У ЗВ’ЯЗКУ ІЗ ПРОГРАМНИМ ЗАБЕЗПЕЧЕННЯМ АБО ВИКОРИСТАННЯМ ТА ІНШИМИ ОПЕРАЦІЯМИ З ПРОГРАМНИМ ЗАБЕЗПЕЧЕННЯМ.

source: ## Trademark
uk: ## Торгова марка

source: "Software Carpentry" and "Data Carpentry" and their respective logos are registered trademarks of [Community Initiatives][CI].
uk: «Software Carpentry» і «Data Carpentry» і відповідні логотипи є зареєстрованими торговими марками [Community Initiatives][CI].
