Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/04__01-welcome.md.po
Languages: uk

source: --- title: "Welcome" start: true teaching: 10 exercises: 15 questions: - "Who are we and how do we approach teaching?" - "What should you expect from this workshop?" objectives: - "Introduce yourself to your fellow workshop participants." - "Describe what will and will not be covered in this workshop." - "Understand that the Carpentries are communities of volunteers who develop lessons and teach workshops on basic computing and data skills for researchers." keypoints: - "The Carpentries are communities of practice. We strive to provide a welcoming environment for all learners and take our Code of Conduct seriously." - "This episode sets the stage for the entire workshop. The introductions and exercises help everyone begin to develop a relationship and trust." - "This workshop will cover general teaching pedagogy and how it applies specifically to the Carpentries." - "Learner motivation and prior knowledge vary widely, but can be assessed with a quick multiple choice question." ---
uk: --- title: "Вітаємо" start: true teaching: 10 exercises: 15 questions: - "Хто ми і як підходимо до навчання?" - "Чого очікувати від цього семінару?" цілі: - «Представтеся своїм колегам-учасникам семінару». - «Опишіть, що буде, а що не буде розглянуто на цьому семінарі». – «Зрозумійте, що Carpentries – це спільноти волонтерів, які розробляють уроки та проводять семінари з базових навичок програмування та обробки даних для дослідників». Ключові моменти: – «Carpentries — це спільноти практиків. Ми прагнемо створити комфортне середовище для всіх слухачів і серйозно ставимося до нашого Кодексу поведінки». – «Цей епізод закладає основу для всього семінару. Знайомство та вправи допомагають кожному почати розвивати стосунки та довіру». - «Цей семінар охоплюватиме загальну педагогіку викладання та її застосування конкретно до Carpentries». - «Мотивація слухача та попередні знання дуже відрізняються, але їх можна оцінити за допомогою швидкого питання з множинним вибором». ---

source: ## Before The Course Begins
uk: ## Перед початком курсу

source: > ## Getting to know each other
uk: > ## Знайомство

source: > > If the trainer has chosen an [icebreaker question]({{training_site}}/instructor-training/icebreakers/index.html), > participate by writing your answers in the course's shared notes.
uk: > > Якщо тренер вибрав [криголамне запитання]({{training_site}}/instructor-training/icebreakers/index.html), > беріть участь, записуючи свої відповіді в спільних нотатках курсу.

source: ## Code of Conduct
uk: ## Кодекс поведінки

source: To make clear what is expected, everyone participating in Carpentries activities is required to conform to our [Code of Conduct]({{ site.coc }}). This Code of Conduct applies to all spaces managed by the Carpentries including, but not limited to workshops, email lists, online forums and on GitHub. Please review [the Code of Conduct]({{ site.coc }}) to familiarise yourself with it.
uk: Для розуміння правил та обмежень усі, хто бере участь у заходах Carpenters мають відповідати нашому [Кодексу поведінки]({{ site.coc }}). Цей Кодекс поведінки застосовується до всіх середовищ, якими керує Carpentries, включаючи, але не обмежуючись, семінари, списки розсилки, онлайн-форуми та GitHub. Будь ласка, завантажте [Кодекс поведінки]({{ site.coc }}) та ознайомтеся з ним.

source: ## Introductions
uk: ## Введення

source: > Introductions set the stage for learning.
uk: > Введення створюють основу для навчання.

source: > — Tracy Teal, Executive Director, The Carpentries
uk: > — Tracy Teal, Виконавчий директор, The Carpentries

source: Hello everyone, and welcome to the the Carpentries instructor training. We're very pleased to have you with us.
uk: Привіт усім, і ласкаво просимо до навчання інструкторів Carpenters. Ми дуже раді, що ви з нами.

source: > ## Today's Trainers
uk: > ## Сьогоднішні тренери

source: > > To begin class, each Trainer should give a brief introduction of themselves. > > (For some guidelines on introducing yourself, see some content from > later in the workshop: [Workshop Introductions](http://carpentries.github.io/instructor-training/23-introductions/index.html))
uk: > > Щоб почати заняття, кожен тренер повинен коротко представитися. > > (Для ознайомлення з деякими вказівками щодо самопредставлення перегляньте вміст > [Ведення в семінар](http://carpentries.github.io/instructor-training/23-introductions/index.html))

source: Now we would like to get to know all of you.
uk: Тепер ми хочемо познайомитися з усіма вами.

source: > ## Reviewing Carpentries Experience and Goals
uk: > ## Огляд досвіду та цілей Carpentry

source: > > Please answer the following questions in the shared notes document: > > *Have you ever participated in a Software Carpentry, Data Carpentry, or Library Carpentry Workshop?* > > 1. Yes, I have taken a workshop. > 2. Yes, I have been a workshop helper. > 3. Yes, I organized a workshop. > 4. No, but I am familiar with what is taught at a workshop. > 5. No, and I am not familiar with what is taught at a workshop. > > *Which of these most accurately describes your teaching experience?* > > 1. I have been a graduate or undergraduate teaching assistant for a university/college course. > 2. I have not had any teaching experience in the past. > 3. I have taught a seminar, workshop, or other short or informal course. > 4. I have been the instructor-of-record for my own university/college course. > 5. I have taught at the primary or secondary education level. > 6. I have taught informally through outreach programs, hackathons, libraries, laboratory demonstrations, and similar activities. > > **Why are you taking this course? What goals do you have for today and tomorrow?** > > If time permits, the trainer may have you discuss these answers in small groups > (in breakout rooms if online), or all together as a group.
uk: > > Будь ласка, дайте відповіді на такі запитання в документі спільного використання: > > *Чи брали ви коли-небудь участь у семінарі Carpentry з програмного забезпечення, даних або бібліотек Carpentry?* > > 1. Так, я пройшов семінар. > 2. Так, я був помічником на семінарі. > 3. Так, я організував семінар. > 4. Ні, але я знайомий з тим, що викладають на семінарі. > 5. Ні, та я не знайомий з тим, що викладають на семінарі.. > > *Що з цього найточніше описує ваш педагогічний досвід??* > > 1. Я був асистентом викладача в університеті/коледжі. > 2. Я не мав досвіду викладання в минулому. > 3. Я проводив семінар, воркшоп або інший короткий чи неформальний курс. > 4. Я був зареєстрованим викладачем свого курсу в університеті/коледжі. > 5. Я викладав на рівні початкової або середньої освіти. > 6. Я викладав неформально за допомогою інформаційних програм, хакатонів, бібліотек, лабораторних демонстрацій тощо. > > **Чому ви проходите цей курс? Які у вас цілі на сьогодні і завтра?** > > Якщо дозволяє час, тренер може попросити вас обговорити ці відповіді в малих групах > (у сеансах підключення, якщо онлайн), або всі разом як група.

source: To make sure everyone has the same context, we'll give a brief overview of the Carpentries organization before starting the training.
uk: Щоб переконатися, що всі мають однаковий контекст, ми дамо короткий огляд організації Carpentry перед початком навчання

source: ## A Brief Overview of the Carpentries
uk: ## короткий огляд Carpentries

source: Software Carpentry, Data Carpentry, and Library Carpentry are official Lesson Programs of the Carpentries. Together, they comprise communities of volunteer researchers, educators, and more who develop lessons and teach intensive one to two day workshops on basic computing and data skills for researchers. * Software Carpentry focuses on helping researchers develop foundational computational skills * Data Carpentry focuses on helping researchers work effectively with their data through its lifecycle * Library Carpentry focuses on teaching data skills to people working in library- and information-related roles.
uk: Програмне забезпечення Carpentry, дані Carpentry і бібліотека Carpentry є офіційними програмами уроків Carpentries. Ці програми об'єднують спільноти волонтерів-дослідників, викладачів тощо, які розвивають уроки та викладають інтенсивні одно-дводенні семінари з базових навичок програмування та обробки даних для дослідників. * Програмне забезпечення Carpentry зосереджується на допомозі дослідникам у розробці фундаментальних навичок програмування * Дані Carpentry фокусуються на допомозі дослідникам ефективно працювати зі своїми даними протягом їх життєвого циклу * Бібліотека Carpentry зосереджується на навчанні навичкам обробки даних для людей, які працюють у бібліотеці та в галузі інформаційного забезпечення.

source: The main goal of these organizations is not to teach specific skills, per se - although those are covered - but rather, to convey best practices that will enable researchers to be more productive and do better research.
uk: Основна мета цих програм не полягає в тому, щоб навчати конкретним навичкам, як таким - хоча й тим охоплюються, а скоріше, щоб передати найкращі практики, які дозволять дослідникам бути більш продуктивними та проводити кращі дослідження.

source: ## Instructor Training Workshop Overview
uk: ## Огляд тренінгу для інструкторів

source: The goal of this two-day training is to provide you with the skills and information you need to become a certified Carpentries instructor. Our expectations of certified Carpentries instructors is that they:
uk: Мета цього дводенного тренінгу — надати вам необхідні навички та інформацію, що необхідні для того, щоб стати сертифікованим інструктором Carpentry. Наші очікування від сертифікованих інструкторів Carpentry полягає в тому, що вони:

source: - be familiar with and understand how to apply research-based teaching principles,
uk: - знати та розуміти, як застосовувати науково-обґрунтовані принципи навчання,

source: especially as they apply to the Carpentries audience. - understand the importance of a respectful and inclusive classroom environment; commit to creating such an environment; and be able to identify and implement Carpentries policies and general practices to accomplish this. - practice and develop skills in the teaching methods used in Carpentries workshops - learn enough about the Carpentries organization to know where to go for help, how to start organizing a workshop, and how to get involved with community activities.
uk: особливо якщо вони стосуються аудиторії Carpentry. - розуміти важливість створення поважного та інклюзивного середовища в аудиторії; готовність взяти на себе зобов'язання створення такого середовища; і вміти визначати та впроваджувати політику та загальні практики Carpentry для досягнення цього. - практикувати та розвивати навички в методах навчання, які використовуються в семінарах Carpentry - знати достатньо про організацію Carpentries, щоб орієнтуватися, куди звернутися за допомогою, як розпочати організацію семінару та як долучитися до громадської діяльності.

source: These four goals are broken down into four main modules of content:
uk: Зміст тренінгу розбитий на чотири основні модулі згідно цих чотирьохи цілей:

source: ### How Learning Works
uk: ### Як працює навчання

source: One of our main emphases will be discussing the "best practices" of teaching. We will be introducing you to a handful of key educational research findings and demonstrating how they can be used to help people learn better and faster.
uk: Одним із наших головних акцентів буде обговорення «найкращих практик» викладання. Ми познайомимо вас із кількома ключовими освітніми дослідженнями визначимо та продемонструємо, як їх можна використовувати, щоб допомогти людям навчатися краще та швидше.

source: ### Building Teaching Skill
uk: ### Формування навичок викладання

source: Just like learning a new language, a musical instrument, or a sport, teaching is a skill that requires practice and feedback. We will have many opportunities to practice and give each other feedback throughout this workshop. We welcome questions and dialogue at any point. We'll be using the Etherpad to help facilitate discussion. Please feel free to ask questions verbally or to put them into the notes or chat box of the Etherpad.
uk: Так само, як вивчення нової мови, музичного інструменту, або виду спорту, навчання – це навичка, яка потребує практики та зворотного зв’язку. Протягом цього семінару ми матимемо багато можливостей попрактикуватися та надати один одному зворотний зв’язок. Ми вітаємо запитання та діалог протягом семінару. Ми будемо використовувати Etherpad, щоб полегшити обговорення. Будь ласка, не соромтеся задавати запитання усно або залишати їх у нотатках чи вікні чату Etherpad.

source: ### Creating a Positive Learning Environment
uk: ### Створення позитивного навчального середовища

source: One part of making this a productive two days for all of us is a community effort to treat one another with kindness and respect. This training, as in all Carpentries workshops, is subject to the [Code of Conduct]({{ site.coc }}). We will be able to give our best effort (and have the most fun!) if everyone abides by these guidelines. We will also be discussing and practicing teaching techniques to create a positive and welcoming environment in your classrooms.
uk: Щоб зробити ці два дні продуктивними для всіх нас, необхідні: спільні зусилля ставитися один до одного ввічливо та з повагою. Цей тренінг, як і всі семінари Carpentry, підлягає [Кодексу поведінки]({{ site.coc }}). Ми зможемо досягти найкращого результату (і отримати максимум задоволення!), якщо всі дотримуватимуться цих правил. Ми також будемо обговорювати та практикувати методи навчання для створення позитивного та приємного середовища у ваших аудиторіях.

source: ### Carpentry History and Culture
uk: ### Історія та культура Carpentry

source: We will be introducing you to the teaching practices that have been adopted by the Carpentries communities, and our overall philosophy and procedures in order to prepare you to teach Carpentries workshops. The greatest asset of the Carpentries is people like yourselves - people who want to help researchers learn about these ideas and share their own experience and enthusiasm. We hope that this training gives everyone a chance to meet new people and share ideas.
uk: Ми познайомимо вас із практикою викладання, яка була прийнята спільнотами Carpenters і нашою загальною філософією та процедурами для того, щоб підготувати вас до викладання на семінарах Carpentry. Найбільше надбання Carpentry – це люди, як і ви самі - люди, які хочуть допомогти дослідникам дізнатися про ці ідеї і поділитися власним досвідом та ентузіазмом. Сподіваємося, що цей тренінг дає кожному можливість познайомитися з новими людьми та поділитися ідеями.

source: To orient yourself, there is a schedule on the workshop webpage which is linked through this workshop's Etherpad.
uk: Щоб зорієнтуватися, на веб-сторінці семінару є розклад, посилання на який здійснюється через сторінку Etherpad семінару.

source: ## What We Leave Out
uk: ## Що ми залишаємо поза увагою

source: We will **not** be going over Data Carpentry, Library Carpentry, or Software Carpentry workshop content in detail (although you will get familiarity with some of the content through the exercises), This workshop is a significant requirement for becoming a certified Carpentries instructor. The additional steps for certification will require that you dig into the workshop content yourself. We'll talk about that more tomorrow afternoon.
uk: Ми **не** будемо детально розглядати зміст семінарів Data Carpentry, Library Carpentry або Software Carpentry (хоча ви зможете познайомитись з частиною змісту цих програм за допомогою вправ). Цей семінар є важливою вимогою для того, щоб стати сертифікованим інструктором Carpentry. Додаткові кроки для сертифікації вимагатимуть від вас самостійного вивчення вмісту семінару. Ми поговоримо про це більше завтра вдень.

source: We also do not discuss how to develop lessons. Many of the ideas we present can be applied to lesson development, and we will briefly touch on a method of lesson design called "Reverse Instructional Design", but it won't be an emphasis of this particular course.
uk: Ми також не обговорюємо, як розвивати уроки. Багато ідей, які ми презентуємо, можна застосувати до розробки уроку, і ми коротко торкнемося методу дизайну уроку під назвою «Зворотний навчальний дизайн», але це не буде акцент цього конкретного курсу.

source: If there's a particular topic that you would like us to address, let the trainers know.
uk: Якщо є конкретна тема, яку б ви хотіли запропонувати до розгляду, дайте тренерам знати.

source: ## Let's Get Started
uk: ## Давайте почнемо

source: Now that we have a road map of what we're covering ready to begin our training. Our goal is that by the end, you will have acquired some new knowledge, confidence, and skills that you can use in your teaching practice in general and in teaching Carpentries workshops specifically.
uk: Тепер, коли у нас є дорожня карта того, що ми покриваємо, ми готові розпочати наше навчання. Наша мета полягає в тому, щоб ви це зробили придбали деякі нові знання, впевненість і навички, які ви можете використовувати у своїй викладацькій практиці загалом і під час проведення семінарів Carpentry.
