Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/05__02-practice-learning.md.po
Languages: uk

source: --- title: "Building Skill With Practice" block: "How Learning Works" teaching: 20 exercises: 40 questions: - "How do people learn?" - "Who is a typical Carpentries learner?" - "How can we help novices become competent practitioners?" objectives: - "Explain why practice and feedback are important for learning." - "Use formative assessments to guide your teaching." keypoints: - "Our goal when teaching novices is to help them construct useful mental models." - "This requires practice and feedback." - "Formative assessments provide practice for learners and feedback to learners and instructors." ---
uk: --- title: "Розвиток навичок за допомогою практики" block: "Як працює навчання" teaching: 20 exercises: 40 questions: - "Як люди вчаться?" - "Хто є типовим слухачем спільноти Carpentry?" - "Як ми можемо допомогти новачкам стати компетентними практиками?" objectives: - "Поясніть, чому практика та зворотній зв’язок важливі для навчання." - "Використовуйте формуюче оцінювання в процесі викладання." keypoints: - "Наша мета під час навчання новачків — допомогти їм побудувати корисні розумові моделі." - "Це потребує практики та зворотного зв’язку." - "Формуюче оцінювання забезпечує практику для слухачів і зворотний зв’язок для слухачів та інструкторів." ---

source: We'll now get started with a discussion of how learning works. We'll learn some key findings from educational research and identify how these principles are put into practice in Carpentry workshops.
uk: Почнемо з обговорення того, як працює навчання. Ми навчимося деяким ключовим результатам освітніх досліджень і визначимо, як ці принципи впроваджуються на практиці під час семінарів Carpentry.

source: ## The Carpentries Pedagogical Model
uk: ## Педагогічна модель Carpentry

source: The Carpentries aims to teach computational competence to learners. We take an applied approach, avoiding the theoretical and general in favor of the practical and specific. By showing learners how to solve specific problems with specific tools and providing hands-on practice, we develop learners' confidence and lay the foundation for future learning.
uk: Carpentry має на меті навчити слухачів обчислювальній компетенції. Ми використовуємо прикладний підхід, уникаючи теоретичного та загального на користь практичного і конкретного. Показуючи слухачам, як розв’язувати конкретні проблеми за допомогою певних інструментів, і надаючи практичні навички, ми розвиваємо впевненість услухачів і закладаємо основу для майбутнього навчання.

source: A critical component of this process is that learners are able to practice what they are learning in real time, get feedback on what they are doing, and then apply those lessons learned to the next step in the learning process. Having learners help each other during the workshops also helps to reinforce concepts taught during the workshops.
uk: Критичним компонентом цього процесу є те, що слухачі можуть практикувати те, що вони вивчають, у режимі реального часу отримати відгук про те, що вони роблять, а потім застосувати отримані навички на наступному етапі процесу навчання. Маючи можливість допомогти один одному під час семінарів, слухачі також закріплюють викладені концепції.

source: A Carpentries workshop is an interactive event -- for learners and instructors. We give and receive feedback throughout the course of a workshop. We incorporate assessments within the lesson materials and ask for feedback on sticky notes during lunch breaks and at the end of each day. In this way, instructors can adjust the pace and content of a workshop to meet the needs of the learners in that group, as well as collect feedback that will help us improve lesson materials or methodology for future workshops. Instructors and helpers also provide feedback to learners throughout workshops in order to get them unstuck or provide a greater depth of understanding about the materials. Interacting in this way with the learners helps us determine how they are doing and figure out what concepts people are having trouble with or where we might be able to move along more quickly.
uk: Семінар Carpentry - це інтерактивний захід для слухачів та інструкторів. Ми надаємо знання отримуємо зворотний зв’язок протягом усього семінару. Ми включаємо оцінювання в матеріали семінару та запитуємо про відгуки на наліпках під час обідньої перерви та в кінці кожного дня. Таким чином інструктори можуть налаштувати темп і зміст семінару, щоб задовольнити потреби слухачів у цій групі, в той же час збирання відгуків допомагає покращити навчальні матеріали або методологію для майбутніх семінарів. Інструктори та їх помічники також забезпечують зворотний зв’язок зі слухачами під час семінарів, щоб створити невимушену атмосферу та забезпечити більш глибоке розуміння матеріалу. Взаємодія зі слухачами таким чином допомагає визначити, як вони справляються, і зрозуміти, з вивченням яких понять виникають проблеми, або де можна було б рухатися швидше.

source: ## The Acquisition of Skill
uk: ## Набуття навичок

source: Our approach is based on the work of researchers like Patricia Benner, who applied the [Dreyfus model of skill acquisition][wikipedia-dreyfus-skill] in her studies of [how nurses progress from novice to expert](http://journals.sagepub.com/doi/10.1177/0270467604265061) ([see also books by Benner](https://www.worldcat.org/search?q=au%3ABenner%2C+Patricia+E.&qt=hot_author)). This work indicates that through practice and formal instruction, learners acquire skills and advance through distinct stages. In simplified form, the three stages of this model are:
uk: Наш підхід базується на роботі таких дослідників, як Патриція Беннер, яка застосувала [модель Дрейфуса для отримання навичок][wikipedia-dreyfus-skill] в своїх дослідженнях [як медсестри просуваються від новачка до експерта](http://journals.sagepub.com/doi/10.1177/0270467604265061) ([див. також книги Беннер](https://www.worldcat.org/search?q=au%3ABenner%2C+Patricia+E.&qt=hot_author)). Ця робота свідчить про те завдяки практиці та формальному навчанню учні набувають навичок і просуваються через різні етапи. У спрощеному вигляді, три етапи цієї моделі мають вигляд:

source: ![Novice, Competent Practitioner, Expert](../fig/skill-level.svg)
uk: ![Новачок, Компетентний практик, Експерт](../fig/skill-level.svg)

source: * *Novice*: someone who doesn't know what they don't know, i.e.,
uk: * *Новачок*: тип учнів, які не знають, що саме вони не знають, тобто,

source: they don't yet know what the key ideas in the domain are or how they relate. One sign that someone is a novice is that their questions "aren't even wrong".
uk: вони ще не знають, які ідеї є ключовими в даній області або як вони пов'язані Однією з ознак того, що хтось є новачком, є те, що його запитання «навіть не є неправильними».

source: > Example: A *novice* learner in a Carpentries workshop might never have heard of the bash shell, and therefore may have no understanding of how it relates to their file system or other programs on their computer.
uk: > Приклад: слухач-"новачок" семінару Carpentry може раніше ніколи не чути про оболонку bash, тому може не розуміти, як це стосується його файлової системи чи інших програм на його комп’ютері.

source: * *Competent practitioner*: someone who has enough understanding for everyday purposes. They won't know all the details
uk: * *Компетентний практик*: це той, хто має достатнє розуміння повсякденних цілей. Він не знатиме усіх подробиць

source: of how something works and their understanding may not be entirely accurate, but it is sufficient for completing normal tasks with normal effort under normal circumstances.
uk: того, як щось працює, і його розуміння може бути не зовсім точним, але цього достатньо для завершення типового завдання з нормальними зусиллями за звичайних обставин.

source: > Example: A *competent practitioner* in a Carpentries workshop might have used the shell before and understand how to move around directories and use individual programs, but they might not understand how they can fit these programs together to build scripts and automate large tasks.
uk: >Приклад: *компетентний практик* у семінарі Carpentry, можливо, раніше використовував оболонку та розуміє, як переміщатися по каталогах і використовувати окремі програми, але він може не розуміти, як використовувати ці програми разом для створення сценаріїв та автоматизації великих завдань.

source: * *Expert*: someone who can easily handle situations that are out of the ordinary.
uk: * *Експерт*: це той, хто може легко впоратися з нестандартними ситуаціями.

source: > Example: An *expert* in a Carpentries workshop may have experience writing and running shell scripts and, when presented with a problem, immediately sees how these skills can be used to solve the problem.
uk: > Приклад: *експерт* семінару Carpentry може мати досвід написання та виконання сценаріїв оболонки та коли стикається з певною проблемою, відразу бачить, як ці навички можна використати для її вирішення

source: For now, we are primarily concerned with novices, as this tends to characterize the Carpentries audience. (We, as instructors, are more likely to be competent practitioners or experts, and we'll discuss this in a later section). We'll next use an additional concept to help us differentiate between novices and competent practitioners, which will have implications for how we teach novices.
uk: Наразі ми в першу чергу орієнтуємося на новачків, оскільки цей тип зазвичай характеризує аудиторію Carpentery. (Ми, як інструктори, швидше за все, є компетентними практиками чи експертами, і ми це обговоримо це в наступному розділі). Далі ми використовуватимемо додаткову концепцію, яка дозволяє відрізняти новачків від компетентних практиків і впливає на процес навчання новачків.

source: ## Cognitive Development and Mental Models
uk: ## Когнітивний розвиток і розумові моделі

source: Effective learning is facilitated by the creation of a well-founded mental model. A mental model is a collection of concepts and facts, along with the relationships between those concepts, which a person has about a topic. For example, a long-time resident of the United States may have an advanced understanding of the location of US states, major cities and landmarks, weather patterns, regional economies and demographic patterns, as well as the relationships among these, compared with their understanding of these relationships for other countries. In other words, their mental model of the United States is more complex compared with their mental model of other countries.
uk: Ефективному навчанню сприяє створення добре обґрунтованої розумової моделі. Розумова модель - це сукупність понять і фактів, які людина має щодо предметної області, разом зі зв'язками між тими поняттями. Наприклад, давні жителі Сполучених Штати можуть мати глибоке розуміння щодо розташування штатів США, великих міст і пам’яток, погодних умов, характеристик регіональних економік та демографічних моделей, а також взаємозв'язків між ними, порівняно з розумінням цих відносин для інших країн. Іншими словами, їх розумова модель Сполучених Штатів є більш складною порівняно з їх розумовою моделлю інших країн.

source: We can distinguish between a *novice* and a *competent practitioner* for a given domain based on the complexity of their mental models.
uk: Ми можемо розрізняти *новачка* і *компетентного практика* для певної предметної області на основі складності їх розумових моделей.

source: * A *novice* is someone who has not yet built a mental model of the domain.
uk: * *Новачок* це той, хто ще не створив розумову модель певної предметної області.

source: They therefore reason by analogy and guesswork, borrowing bits and pieces of their mental models of other domains which seem superficially similar. * A *competent practitioner* is someone who has a mental model that's good enough for everyday purposes. This model does not have to be completely accurate in order to be useful: for example, the average driver's mental model of how a car works probably doesn't include most of the complexities that a mechanical engineer would be concerned with.
uk: Тому новачки розмірковують за аналогією та здогадками, запозичуючи частини своїх розумових моделей з інших областей, які зовні здаються схожими. * *Компетентний практик* — це той, хто має розумову модель, яка є достатньо придатною для повсякденних цілей. Ця модель не обов’язково має бути абсолютно точною, щоб бути корисною: наприклад, розумова модель середньостатистичного водія про те, як працює автомобіль, ймовірно, не включає більшість характеристик, якими опікується інженер-механік.

source: ![Mental Models](../fig/mental_models.svg)
uk: ![Розумові моделі](../fig/mental_models.svg)

source: We will discuss the mental models of experts in more detail in [a later lesson]({{ page.root }}/03-expertise/).
uk: Ми обговоримо розумові моделі експертів більш детально в [пізніше]({{ page.root }}/03-expertise/).

source: > ## Your Mental Models
uk: > ## Ваші розумові моделі

source: > > In the Etherpad, write your primary research domain or area of expertise and some aspects of the mental model you use to frame > and understand your work. What concepts/facts are included? What types of relationships are included? > > This discussion should take about 5 minutes.
uk: > > У редакторі Etherpad опишіть свою основну дослідницьку сферу чи сферу знань і деякі аспекти розумової моделі, яку ви використовуєте для формування > і виконання своєї роботи. Які поняття/факти включені? Які типи відносин включені? > > Це обговорення має тривати приблизно 5 хвилин.

source: One key insight from research on cognitive development is that novices, competent practitioners, and experts each need to be taught differently. In particular, presenting novices with a pile of facts early on is counter-productive, because they don't yet have a model or framework to fit those facts into. In fact, presenting too many facts too soon can actually reinforce an incorrect mental model.
uk: Одним із ключових висновків досліджень когнітивного розвитку є те, що новачків, компетентних практиків і експертів потрібно навчати по-різному. Зокрема, подавати новачкам купу фактів на ранній стадії є контрпродуктивним, тому що вони ще не мають моделі чи основи, в яку можна вписати ці факти. Насправді, подання занадто великої кількості фактів занадто рано може закріпити неправильну розумову модель

source: Most learners coming to Carpentries lessons are novices, and do not have a strong mental model of the concepts we are teaching. Thus, our primary goal is *not* to teach the syntax of a particular programming language, but *to help them construct a working mental model* so that they have something to attach facts to. In other words, our goal is to teach people *how to think* about programming and data management in a way that will allow them to learn more on their own or understand what they might find online.
uk: Більшість слухачів, які приходять на семінари Carpentry, є новачками, і не мають сильної розумової моделі тих концепцій, які ми викладаємо. Таким чином, наша основна мета *не* навчити синтаксису певної мови програмування, але *допомогти їм побудувати робочу розумову модель* щоб їм було до чого прикладати факти. Іншими словами, наша мета — навчити людей *думати* про програмування та управління даними таким чином, щоб вони могли дізнатися більше самостійно або зрозуміти, що вони можуть знайти в інтернеті.

source: ### The Importance of Going Slowly
uk: ### Важливо рухатися повільно

source: > If someone feels it's too slow, they'll be a bit bored. If they feel it's too fast, they'll never come back to programming.
uk: > Якщо комусь здасться, що це надто повільно, йому буде трохи нудно. Якщо вони відчують, що це занадто швидко, вони ніколи не повернуться до програмування.

source: > — Kunal Marwaha, SWC instructor
uk: > — Kunal Marwaha, SWC інструктор

source: If our goal is to help novices construct an accurate and useful mental model of a new intellectual domain, this will impact our teaching. For example, we principally want to help learners form the right categories and make connections among concepts. We *don't* want to overload them with a slew of unrelated facts, as this will be confusing.
uk: Якщо наша мета — допомогти новачкам побудувати точну та корисну розумову модель нової інтелектуальної сфери, це вплине на перебіг нашого навчання. Наприклад, ми принципово хочемо допомогти слухачам формувати правильні категорії та встановлювати зв’язки між поняттями. Ми *не* хочемо перевантажити їх купою непов’язаних фактів, оскільки це тількі заплутає.

source: An important practical implication of this latter point is the pace at which we teach. In the first main episode of Software Carpentry's [lesson on the Unix shell][swc-shell-novice], which covers "Navigating Files and Directories", there are only four "commands" for 40 minutes of teaching. Ten minutes per command may seem glacially slow, but that episodes's real purpose is to teach learners about paths; later on, they will learn about history, wildcards, pipes and filters, command-line arguments, redirection, and all the other big ideas on which the shell depends, and without which people cannot understand how to use commands.
uk: Важливим практичним наслідком цього останнього моменту є темп навчання. У першому основному епізоді [урок про оболонку Unix][swc-shell-novice] від Software Carpentry, який охоплює тему "Навігація файлами та каталогами", є лише чотири "команди" за 40 хвилин навчання. Десять хвилин на команду можуть здатися надзвичайно повільними, але справжня мета епізодів — навчити слухачів шляхам використання команд; в подальшому вони дізнаються про історію, символи підстановки, канали та фільтри, аргументи командного рядка, перенаправлення, і всі інші великі ідеї, від яких залежить оболонка, і без яких люди не можуть зрозуміти, як використовувати команди.

source: That mental model of the shell also includes things like:
uk: Ця розумова модель оболонки також включає такі концепти, як:

source: * Anything you repeat manually, you'll eventually get wrong
uk: * Якщо ви повторюєте команди вручну, ви з часом можете помилитися

source: (so let the computer repeat things for you by using tab completion and the `history` command). * Lots of little tools, combined as needed, are more productive than a handful of programs. (This motivates the pipe-and-filter model.)
uk: (тому дозвольте комп’ютеру повторювати речі за вас за допомогою застосування табуляції і команди `history`). * Множина маленьких інструментів, об'єднаних за потребою, продуктивніша, ніж декілька програм. (Це є реалізацією архітектури труб та фільтрів).

source: These two examples illustrate something else as well. Learning consists of more than "just" building mental models and adding information to them; creating linkages between concepts and facts is at least as important. Telling people that they shouldn't repeat things, and that they should try to think in terms of little pieces loosely joined, both set the stage for discussing functions. Explicitly referring back to pipes and filters in the shell when introducing functions helps solidify both ideas.
uk: Ці два приклади також ілюструють дещо інше. Навчання є більшим, ніж «просто» створення розумових моделей і додавання до них інформації; не менш важливим є створення зв'язків між поняттями та фактами. Основою для обговорення функцій є дві ідеї про те, що слухачі мають не повторювати відомі речі, і що вони повинні намагатися мислити категоріями невеликих слабо з’єднаних компонентів (фільтрів) Явне посилання на канали та фільтри в оболонці під час представлення функцій допомагає зміцнити обидві ідеї.

source: > ## Meeting Learners Where They Are
uk: > ## Зустрічайте слухачів там, де вони є

source: > One of the strengths of Carpentry workshops is that we meet learners where they're at. Carpentry instructors
uk: > Однією з сильних сторін семінарів Carpentry є те, що ми зважаємо на рівень підготовки слухачів. Інструктори Carpentry

source: > strive to help learners
uk: > прагнуть допомогти слухачам

source: > progress from whatever starting point they happen to be at, without making anyone
uk: > прогресувати з будь-якої початкової точки, на якій вони знаходяться, нікого не змушуючи

source: > feel inferior about their current practices or skillsets. We do this in part by teaching relevant and useful skills
uk: >відчувати себе неповноцінними щодо рівня своїх поточних практик або навичок. Частково ми робимо це, навчаючи актуальним і корисним навичкам

source: > building an inclusive learning environment, and continually getting (and paying attention to!) feedback
uk: > завдяки створенню інклюзивного навчального середовища та організації постійного (і це важливо!) зворотнього зв’язку

source: > from learners. We'll be talking in more depth about each of these strategies as we go forward in our workshop.
uk: > зі слухачами. Ми детальніше поговоримо про кожну з цих стратегій упродовж нашого семінару.

source: ## How "Knowledge" Gets in the Way
uk: ## Шляхи отримання знань

source: Besides going slowly, what else can we do to facilitate the formation of sufficiently accurate mental models? One important action is to address the misconceptions of broken mental models.
uk: Окрім забезпечення повільного руху, що ще ми можемо зробити, щоб полегшити формування достатньо точної розумової моделі? Однією з важливих дій є аналіз помилкових уявлень у хибних розумових моделях.

source: Mental models are hardly ever built from scratch. Every learner comes to a topic with some amount of information, ideas and opinions about the topic. This is true even in the case where a learner can't articulate their prior knowledge and beliefs.
uk: Розумові моделі майже ніколи не будуються з нуля. Кожен слухач приходить з певною кількістю інформації, ідей та думок щодо певної теми. Це має місце навіть у випадку, коли слухач не може сформулювати свої попередні знання та переконання.

source: In many cases, this prior knowledge is incomplete or inaccurate. Inaccurate beliefs can be termed "misconceptions" and can impede learning by making it more difficult for learners to incorporate new, correct information into their mental models. Correcting learners' misconceptions is at least as important as presenting them with correct information. Broadly speaking, misconceptions fall into three categories:
uk: У багатьох випадках ці попередні знання є неповними або неточними. Невірні переконання, які можна назвати «помилковими уявленнями», можуть перешкоджати навчанню, ускладнюючи слухачам включення нової, правильної інформації у свої розумові моделі. Виправлення помилкових уявлень слухачів є принаймні таким же важливим, як і надання їм правильної інформації. Загалом кажучи, помилкові уявлення поділяються на три категорії:

source: * Simple *factual errors*, such as believing that Vancouver is the capital of British Columbia.
uk: * Прості *фактичні помилки*, наприклад, вважати Ванкувер столицею Британської Колумбії.
