Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/05__02-practice-learning.md.po
Languages: uk

source: These are the easiest to correct. * *Broken models*, such as believing that motion and acceleration must be in the same direction. We can address these by having learners reason through examples to see contradictions. * *Fundamental beliefs*, such as "the world is only a few thousand years old" or "human beings cannot affect the planet's climate". These beliefs are deeply connected to the learner's social identity and are the hardest to change.
uk: Ці помилки найлегше виправити. * *Хибні моделі*, як-от переконання, що напрямки руху та прискорення мають збігатися. Ми можемо виправити це, запропонувавши слухачам міркувати на прикладах, щоб побачити протиріччя. * *Фундаментальні переконання*, наприклад "світ існує лише кілька тисяч років" або «люди не можуть впливати на клімат планети». Ці переконання глибоко пов'язані з соціальною ідентичністю слухача і їх найважче змінити.

source: Since the Carpentries workshops are focused on novices, and the building of strong mental models, we're most interested in the middle category of misconceptions. While teaching, we want to expose learners' broken models so that we can help them build better ones.
uk: Оскільки семінари Carpentry зосереджені на новачках та побудові строгих розумових моделей, нас найбільше цікавить середня категорія помилкових уявлень. Під час навчання ми хочемо визначити "хибні" моделі слухачів, щоб допомогти їм побудувати кращі.

source: ## Identifying and Correcting Misconceptions
uk: ##Виявлення та виправлення помилкових уявлень

source: How do we expose misconceptions, especially as they pertain to broken models? How can we, in-class, know whether the learners already understand this topic (so that the class can move on), and if not, what misconceptions and gaps in their knowledge we should address.
uk: Як ми викриваємо помилкові уявлення, особливо якщо вони стосуються хибних моделей? Як ми можемо в аудіторії визначити, чи слухачі вже розуміють цю тему (щоб можна було рухатися далі), а якщо ні, які помилкові уявлення та прогалини в їхніх знаннях нам слід усунути.

source: To be effective, instructors need feedback on their learners' progress, and insight into their learners' mental models. This feedback comes through what we call *formative assessments* (in contrast to *summative assessment*).
uk: Щоб бути ефективними, інструктори потребують зворотного зв’язку щодо прогресу своїх слухачів і розуміння їх розумових моделей. Цей зворотній зв’язок надходить шляхом так званого *формуючого оцінювання* (на відміну від *підсумкового оцінювання*).

source: > ## Summative Assessment
uk: > ## Підсумкове оцінювання

source: > *Summative assessment* is used
uk: > *Підсумкове оцінювання* застосовується

source: > to judge whether a learner has reached an acceptable level of competence.
uk: > щоб оцінити, чи досяг слухач прийнятного рівня компетентності.

source: > Learners either "pass" or "fail" a summative assessment.
uk: > Слухачі «проходять» або «не проходять» підсумкове оцінювання.

source: > One example is a driving exam,
uk: > Одним із прикладів є іспит з водіння,

source: > which tells the rest of society whether someone can safely be allowed on the road. Most assessment done in university
uk: > який повідомляє решті суспільства, чи можна безпечно пустити когось на дорогу. Більшість оцінок за університетські

source: > courses is summative, and is used to assign course grades.
uk: > курси є підсумковими.

source: *Formative assessment* takes place during teaching and learning. It sounds like a fancy term, but it can be used to describe any interaction or activity that provides feedback to both instructors and learners about learners' level of understanding of the material. For learners, this feedback can help focus their study efforts. For instructors, it allows them to refocus their instruction to respond to challenges that learners are facing.
uk: *Формуюче оцінювання* відбувається під час викладання та навчання. Звучить як химерний термін, але його можна використовувати для опису будь-якої взаємодії чи діяльності яка надає зворотний зв’язок як інструкторам, так і слухачам щодо рівня розуміння слухачами матеріалу. Слухачам цей відгук може допомогти зосередити зусилля на навчанні. Інструкторам це дозволяє переорієнтувати їхні інструкції для реагування на виклики, з якими стикаються слухачі.

source: Learners don't "pass" or "fail" formative assessments; they are simply a feedback mechanism. For example, a music teacher might ask a learner to play a scale very slowly in order to see whether they are breathing correctly, and if not, what they should change.
uk: Слухачі не «проходять» або «провалюють» формуюче оцінювання, бо це просто механізм зворотного зв'язку. Наприклад, учитель музики може попросити учня зіграти гамму дуже повільно, щоб побачити, чи правильно він дихає, а якщо ні, то підказати, що він має змінити.

source: Formative assessment is most useful when it happens frequently (we'll talk about how frequently later) and when the results are easily interpretable by the learner and instructor.
uk: Формуюче оцінювання є найбільш корисним, якщо воно відбувається часто (як часто, ми поговоримо пізніше) і коли результати легко інтерпретуються слухачем і інструктором.

source: > ## Repetition vs. Reflective Practice
uk: > ## Повторення vs. рефлексивна практика

source: > > The idea that ten thousand hours of practice will make someone an expert in some field > is widely known, > but reality is much more complex. > Practice is not doing the same thing over and over again: > practice is doing similar but subtly different things, > getting feedback, > and then changing behavior in response to that feedback to get cumulatively better. > Doing the same thing over and over again is much more likely to solidify bad habits than perfect performance. > This is why we emphasize practice and feedback for learners at our workshops and for trainees in our > instructor training program.
uk: > > Ідея про те, що десять тисяч годин практики зроблять когось експертом у якійсь галузі, > є широко відомою, > але реальність набагато складніша. > Практика — це не повторення одного й того ж знову і знову: > практика - це виконання подібних, але дещо різних речей, > це отримання зворотного зв'язку, > а потім зміна алгоритму дій у відповідь на цей зворотній зв’язок, щоб стати кумулятивно кращим. > Виконання одного й того ж знову і знову має набагато більше шансів закріпити шкідливі звички, ніж підвищити ефективність. > Ось чому ми надаємо особливу увагу практиці та зворотному зв’язку для слухачів на наших семінарах і для інструкторів у наших > програмах підготовки

source: ## Formative Assessments Come in Many Forms
uk: ## Формуюче оцінювання набуває багатьох форм

source: There are many types of formative assessment, and each have their advantages and disadvantages.
uk: Існує багато типів формуючого оцінювання, і кожен має свої переваги та недоліки.

source: > ## Formative Assessments
uk: > ## Формуюче оцінювання

source: > > Based on your previous educational experience (or even this training so far!) > what types of formative assessments do you know about? > > Write your answers in the etherpad; or go around and have each person in the group name one.
uk: > > На основі вашого попереднього освітнього досвіду (або навіть цього тренінгу!) > які типи формуючого оцінювання ви знаєте? > > Запишіть свої відповіді в блокнот; або обійдіть і попросіть кожного в групі назвати по одному.

source: One example of formative assessment that we would like to highlight is the multiple choice question (MCQ). When designed well, these can do much more than just measure how much someone knows. For example, suppose we are teaching children multi-digit addition. A well-designed MCQ would be:
uk: Одним з прикладів формуючого оцінювання, який ми хотіли б висвітлити, є питання з множинним вибором (ПМВ). Якщо питання добре спроектовані, вони можуть зробити набагато більше, ніж просто слугувати виміром знань. Наприклад, припустимо, ми вчимо дітей правилам додавання багатозначних чисел. Добре розроблені ПМВ є такими:

source: ~~~ Q: what is 27 + 15 ? a) 42 b) 32 c) 312 d) 33 ~~~
uk: ~~~ Питання: Якою буде сума 27 + 15 ? a) 42 b) 32 c) 312 d) 33 ~~~

source: The correct answer is 42, but each of the other answers provides valuable insight.
uk: Правильна відповідь 42, але кожна з інших відповідей дає цінну інформацію.

source: > ## Identify the Misconceptions
uk: > ## Визначте помилкові уявлення

source: > > Choose one wrong answer and write in the Etherpad what the misconception is associated with that wrong answer. > This discussion should take about 10 minutes. > >> ## Solution >> >> * If the child answers 32, they are throwing away the carry completely. >> * If they answer 312, they know that they can't just discard the carried '1', >> but doesn't understand that it's actually a ten >> and needs to be added into the next column. >> In other words, >> they are treating each column of numbers as unconnected to its neighbors. >> * If they answer 33 then they know they have to carry the 1, >> but are carrying it back into the same column it came from.
uk: > > Виберіть одну неправильну відповідь і напишіть в Etherpad, яке помилкове уявлення пов’язане з цією неправильною відповіддю. > Це обговорення має тривати близько 10 хвилин. > >> ## Рішення >> >> * Якщо дитина відповідає 32, вона повністю відкидає перенесення розрядної одиниці. >> * Якщо вона відповідає 312, вона знає, що не може просто відкинути перенесення розрядної одиниці, >> але не розуміє, що це насправді десятка >> і її потрібно додати в попередній стовпець. >> Іншими словами, >> дитина розглядає кожен розрядний стовпець чисел як непов'язаний із сусідніми. >> * Якщо дитина відповідає 33, вона знає, що має перенести розрядну одиницю, >> але повертає її назад у ту саму колонку, з якої вона надійшла.

source: Each of these incorrect answers is a *plausible distractor* with *diagnostic power*. "Plausible" means that it looks like it could be right: instructors will often put supposedly-silly answers like "a fish!" on MCQs, but (a) they don't provide any insight and (b) learners actually don't find them funny. "Diagnostic power" means that each of the distractors helps the instructor figure out what concepts learners are having difficulty with.
uk: Кожна з цих неправильних відповідей є *правдоподібним відволікаючим фактором* із певною *діагностичною силою*. «Правдоподібність» означає, що це виглядає так, ніби це може бути правильним: інструктори часто ставлять нібито безглузді відповіді на зразок "риба!" на ПМВ, але (а) вони не дають жодного розуміння і (б) слухачі насправді не знаходять їх смішними. «Діагностична сила» означає, що кожен із дистракторів допомагає інструктору розібратися з якими поняттями слухачі відчувають труднощі.

source: Formative assessments are most powerful when an instructor modifies their instruction depending on the results of the assessment. An instructor may learn they need to change their pace or review a particular concept. Knowing how to respond to the results of a formative assessment is a skill that you will develop over time.
uk: Формуюче оцінювання є найпотужнішим, коли інструктор змінює викладення матеріалу в залежності від результатів оцінювання. Інструктор може дізнатися, що йому потрібно змінити темп або переглянути певну концепцію. Вміння реагувати на результати формуючого оцінювання, — це навичка, яку ви розвиватимете з часом.

source: > ## Handling Outcomes
uk: > ## Обробка результатів

source: > > Formative assessments allow us as instructors to adapt our instruction to our audience. > What should we do as instructors if the class chooses: > > 1. mostly one of the wrong answers? > 2. mostly the right answer? > 3. an even spread among options? > > For one of the above, enter your answer in the Etherpad. > > This discussion should take about 5 minutes. > >> ## Solution >> 1. If the majority of the class votes for a single wrong answer, you should go back >> and work on correcting that particular misconception. >> 2. If most of the class votes >> for the right answer, it's probably safe to move on. >> 3. If answers are pretty evenly >> split between options, learners are probably guessing randomly and it's a good >> idea to go back to a point where everyone was on the same page.
uk: > > Формуюче оцінювання дозволяє нам як інструкторам адаптувати темп і методи навчання до нашої аудиторії. > Що ми повинні робити як інструктори, якщо слухачі обирають: > > 1. переважно одну з неправильних відповідей? > 2. переважно правильну відповідь? > 3. рівномірний розподіл варіантів? > > Для одного з наведених вище введіть свою відповідь в Etherpad. > > Це обговорення має тривати близько 5 хвилин. > >> ## Рішення >> 1. Якщо більшість слухачів проголосує за одну і ту ж неправильну відповідь, вам слід повернутися >> і працювати над виправленням цього помилкового уявлення. >> 2. Якщо більшість аудиторії проголосує >> за правильну відповідь, скоріше за все можна безпечно рухатися далі. >> 3. Якщо кількість правильних та неправильних відповідей >> є досить однаковою, то слухачі, ймовірно, вгадують випадково, і в цьому випадку >> доречно повернутися до точки, де всі мали правильні уявлення.

source: > ## Modeling Novice Mental Models
uk: > ## Моделювання розумових моделей для новачків

source: > > Take 10 minutes to create a multiple choice question related to a topic you intend to teach. > Type it into the Etherpad > and explain the diagnostic power of each its distractors, > i.e., what misconception is each distractor meant to identify?
uk: > > Виділіть 10 хвилин, щоб створити питання з множинним вибором відповідей, пов’язане з темою, яку ви збираєтеся викладати. > Введіть його в Etherpad > і поясніть діагностичну силу кожного з його відволікаючих факторів, > тобто, яке помилкове уявлення має виявити кожен відволікаючий фактор?

source: > ## A Note on MCQ Design
uk: > ## Зауваження щодо проєктування МПВ

source: > > * A good MCQ tests for conceptual misunderstanding rather than simple factual knowledge. > If you are having a hard time coming up with diagnostic distractors, > then either you need to think more about your learners' mental models, > or your question simply isn't a good starting point for an MCQ. > * When you are trying to come up with distractors, > think about questions that learners asked or problems they had > the last time you taught this subject. > If you haven't taught it before, > think about your own misconceptions > or ask colleagues about their experiences.
uk: > > * Хороше ПМВ перевіряє концептуальні непорозуміння, а не просто фактичні знання. > Якщо вам важко придумати діагностичні відволікаючі фактори, > тоді або вам потрібно більше думати про розумові моделі ваших слухачів, > або ваше запитання просто не є хорошою відправною точкою для ПМВ. > * Коли ви намагаєтеся придумати відволікаючі фактори, > подумайте про запитання, які поставили слухачі, або проблеми, які вони мали, > коли ви востаннє викладали цей предмет. > Якщо ви цьому не вчили раніше, > подумайте про власні помилкові уявлення > або запитайте колег про їхній досвід.

source: Designing an MCQ with plausible distractors is useful even if it is never used in class because it forces the instructor to think about the learners' mental models and how they might be broken---in short, to put themselves into the learners' heads and see the topic from their point of view.
uk: Розробка ПМВ з правдоподібними відволікаючими факторами є корисною, навіть якщо ці питання ніколи не використовуються в під час семінарів, оскільки це змушує інструктора думати про розумові моделі слухачів і як чому вони можуть бути хибними --- точніше, поставити себе на місце слухача і подивитися на тему з їхньої точки зору.

source: There are many types of formative assessments other than MCQs. One (non-exhaustive) list to supplement the earlier exercise can be found in the [Edutopia assessment group](https://www.edutopia.org/groups/assessment/250941).
uk: Існує багато типів формуючого оцінювання, крім ПМВ. Один такий (неповний) список, щоб доповнити попередню вправу, можна знайти в[Edutopia assessment group](https://www.edutopia.org/groups/assessment/250941).

source: ## Formative Assessments Should Be Frequent
uk: ## Формуючі оцінювання мають бути регулярними

source: Instructors should use a formative assessment ideally every 5 minutes and at least every 10-15 minutes in order to make sure that the class is actually learning. Since the average attention span is usually only this long, formative assessments also help break up instructional time and re-focus attention. Formative assessments can also be used preemptively: if you start a class with a question and everyone can answer it correctly, then you can safely skip the part of the lecture in which you were going to explain something that your learners already know.
uk: В ідеалі інструктори мають проводити формуюче оцінювання кожні 5 хвилин, щонайменше кожні 10-15 хвилин щоб переконатися, що аудіторія дійсно навчається. Оскільки середня тривалість уваги зазвичай становить саме стільки, формуюче оцінювання також допомагає скоротити навчальний час і знову зосередити увагу. Формуюче оцінювання також можна використовувати превентивно: якщо ви починаєте урок із запитання, і кожен може правильно відповісти на нього, то можете сміливо пропустити частину лекції, в якій ви збиралися пояснити те, що ваші слухачі вже знають.

source: > ## How Many?
uk: > ## Скільки?

source: > > The Carpentries use formative assessments often. How many have we done since the start of this > workshop? Put your guess in the Etherpad along with one example and the purpose that assessment served. > > This discussion should take about 5 minutes. > >> ## Solution >> This will depend on the event they are attending. Most attendees will guess low. >> The purpose of this exercise is to emphasize the importance of frequent formative >> assessments and that an individual assessment doesn't have to take a lot of time.
uk: > > Інструктори Carpentry часто використовують формуюче оцінювання. Скільки ми зробили таких оцінювань з початку цього > семінару? Помістіть свої припущення в Etherpad разом із одним прикладом і метою, якій слугувало це оцінювання. > > Це обговорення має тривати близько 5 хвилин. > >> ## Рішення >> Це залежатиме від події, яку вони відвідують. Більшість учасників не вгадають. >> Мета цієї вправи - підкреслити важливість частого формуючого >> оцінювання та визначення, що індивідуальне оцінювання не потребує багато часу.

source: > ## A Corollary Regarding Novices
uk: > ## Висновок відносно новачків

source: > > Learners are commonly _far_ too satisfied to not understand key points > and remain confused. If learners remain confused, they are far less likely > to adopt our "good enough" practices at the conclusion of the workshop. > Encourage helpers to support confused learners as far as possible within > the flow of the workshop.
uk: > > Слухачі зазвичай далекі від задоволення, якщо вони не розуміють ключові моменти > і залишаються спантеличеними. Якщо слухачі спантеличені, вони з набагато меншою імовірністю > сприймуть наші «досить хороші» практики до завершення семінару. > Заохочуйте помічників підтримувати розгублених слухачів, наскільки це можливо, > протягом семінару.

source: ## Optional exercises
uk: ## Факультативні вправи

source: > ## Confronting the Contradiction
uk: > ## Опрацювання протиріччя

source: > > Describe a misconception you have encountered in your own learning or teaching > and how to get learners to confront it.
uk: > >Опишіть помилкове уявлення, з яким ви зустрілися під час власного навчання чи викладання, > і як навчити слухачів протистояти цьому.
