Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/06__03-expertise.md.po
Languages: uk

source: They may not care how hash tables work, or even that hash tables exist; they just want to know how to process data faster. We therefore have to make sure that everything we teach is useful right away, and conversely that we don't teach anything just because it's "fundamental". - Believing that something will be hard to learn is a self-fulfilling prophecy. Researchers already believe that computing is hard, a belief that is exacerbated by "experts" telling them that things should be easy when, in the researcher's experience, they're not. Paradoxically, this is why it’s important not to say that something is easy. If someone who has been told that tries it, and it doesn’t work, they are more likely to become discouraged.
uk: Їм може бути байдуже, як працюють хеш-таблиці, або навіть те, що хеш-таблиці існують; вони просто хочуть знати, як швидше обробляти дані. Тому ми повинні переконатися, що все, чого ми навчаємо, буде корисним одразу, і навпаки, що ми нічого не навчаємо тільки тому, що це "фундаментальне". – Вірити в те, що щось буде важко вивчити, – це пророцтво, що самореалізується. Дослідники завжди вірять, що програмувати важко, і це переконання посилюється тим, що «експерти» кажуть їм, що все повинно бути легко, хоча, як показує досвід дослідників, це не так. Парадоксально, але тому важливо не говорити, що щось дається легко. Якщо хтось, кому це сказали, спробує це, і це не спрацює, він, швидше за все, впаде у відчай.

source: It's also why installing and configuring software is a much bigger problem for us than experienced programmers like to acknowledge. It isn't just the time we lose at the start of workshops as we try to get a Unix shell working on Windows, or set up a version control client on some idiosyncratic Linux distribution, or ask people to download and unzip files. It isn't even the unfairness of asking learners to debug things that depend on precisely the knowledge they have come to learn, but which they don't yet have. The real problem is that every such failure reinforces the belief that computing is hard, and that they'd have a better chance of making next Thursday's conference submission deadline if they kept doing things the way they always have. For these reasons, we have adopted a "teach most immediately useful first" approach. We'll talk much more about this when we discuss [motivation]({{ page.root }}/08-motivation/).
uk: Це також стосується встановлення та налаштування програмного забезпечення, що є набагато більшою проблемою для нас, ніж люблять визнавати досвідчені програмісти. І ми не просто витрачаємо час на початку семінарів коли ми намагаємося змусити оболонку Unix працювати під Windows, або налаштовуємо клієнта контролю версій на якомусь унікальному дистрибутиві Linux, або просимо слухачів завантажити та розпакувати файли. Це навіть не є несправедливістю просити слухачів налагодити речі, які залежать саме від тих знань, яких вони прийшли навчитися, але яких вони ще не мають. Справжня проблема полягає в тому, що кожен такий збій зміцнює переконання, що програмування – це важко, і що вони матимуть більше шансів встигнути подати заявку на конференцію наступного четверга якби вони продовжували робити все так, як завжди. З цих причин ми прийняли підхід «спочатку навчи найкориснішому». Ми ще поговоримо про це під час обговорення теми [мотивація]({{ page.root }}/08-motivation/).

source: > ## The Carpentries Is Not Computer Science
uk: > ## Carpentries - це не комп'ютерні науки

source: > > Many of the foundational concepts of computer science, > such as computability, > are difficult to learn and not immediately useful. > This does *not* mean that they aren't important, > or aren't worth learning, > but if our aim is to convince people that they can learn this stuff, > and that doing so will help them do more science faster, > they are less compelling than things like automating repetitive tasks.
uk: > > Багато основоположних концепцій комп'ютерних наук, > наприклад, обчислюваність, > є такими, що важко засвоюються, і не статють в пригоді відразу. > Це *не* означає, що вони не важливі, > або їм не варто вчитися, > але якщо наша мета — переконати людей, що вони можуть цьому навчитися, > і що це допоможе їм швидше розвивати науку, > вони менш переконливі, ніж такі речі, як автоматизація повторюваних завдань.

source: ## The Importance of Practice (Again)
uk: ## І знов про важливість практики

source: All of the above points illustrate the importance of using formative assessments frequently. The right formative assessment at the right time will give you valuable information about your learners' goals and motivations, making it easier for you to target your lesson materials to their needs. This strategy also helps you as an instructor overcome your expert blind spot. It doesn't matter how easy you think a task is, if your learners aren't getting it, it's probably more complicated than you thought.
uk: Усі наведені вище пункти ілюструють важливість частого використання формуючого оцінювання. Правильне формуюче оцінювання в потрібний час дасть вам цінну інформацію про цілі та мотивацію ваших слухачів, що полегшить вам орієнтацію матеріалів семінару на їхні потреби. Ця стратегія також допоможе вам, як інструктору, подолати експертну сліпу пляму. Неважливо, наскільки легким ви вважаєте завдання, якщо ви учні цього не розуміють, можливо, це складніше, ніж ви думали.
