Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/06__03-expertise.md.po
Languages: uk

source: --- title: "Expertise and Instruction" block: "How Learning Works" teaching: 15 exercises: 30 questions: - "What type of instructor is best for novices?" - "How are we (as instructors) different from our learners and how does this impact our teaching?" objectives: - "Identify situations where you have an expert blind spot." - "Demonstrate strategies for compensating for your expert blind spot." - "Demonstrate strategies for avoiding demotivating language." keypoints: - "Experts face challenges when teaching novices due to expert blind spot." - "Expert blind spot: knowing something so well that it seems easy when it's not." - "With practice, we can learn to overcome our expert blind spot." ---
uk: --- title: "Експертиза та інструктаж" block: "Як працює процес навчання" teaching: 15 exercises: 30 запитання: - "Який тип інструктора найкращий для новачків?" - «Чим ми (як інструктори) відрізняємося від наших учнів і як це впливає на наше навчання?» цілі: - «Визначте ситуації, в яких у вас виникає сліпа пляма експерта». - «Продемонструйте стратегії для компенсації сліпої плями експерта». - «Продемонструйте стратегії уникнення демотиваційної мови». Ключові моменти: - "Експерти стикаються з проблемами під час навчання новачків через сліпу пляму експерта." - «Сліпа пляма експерта: знати щось настільки добре, що це здається легким, коли це не так». - «З практикою ми можемо навчитися долати нашу сліпу пляму експерта». ---

source: Having previously discussed the transition from novice to competent practitioner, via the formation of a mental model, we now shift our attention to experts. It's unlikely that you'll be teaching experts; the expert we want to talk about is you! You might not yet think of yourself as an expert, but chances are you have already advanced to the point where some of these key characteristics -- and potential pitfalls -- apply to you. We'll discuss what distinguishes expertise from novices/competent practitioners, how being an expert can make it more difficult to teach novices, and some tools to help instructors identify and overcome these difficulties.
uk: Попередньо обговоривши перехід від новачка до компетентного практика через формування розумової моделі, тепер ми переключаємо увагу на експертів. Малоймовірно, що ви будете навчати експертів; експерт, про якого ми хочемо поговорити, це ви! Можливо, ви ще не вважаєте себе експертом, але, швидше за все, ви це вже зробили просунулися до точки, де деякі з ключових характеристик експерта і потенційні підводні камені стосуються вас. Ми обговоримо, що відрізняє експерта від новачків/компетентних практиків, що експерту може виявитися важче навчати новачків, а також інструменти, що допомагають інструкторам виявити та подолати ці труднощі.

source: ## What Makes an Expert?
uk: ## Основні характеристики експерта

source: An [earlier topic]({{ page.root }}/02-practice-learning/) described a key difference between novices and competent practitioners. Novices lack a mental model, or have only a very incomplete model with limited utility. Competent practitioners have mental models that work well enough for most situations. How are experts different from both of these groups?
uk: У [попередній темі]({{ page.root }}/02-practice-learning/) описано ключову різницю між новачками та компетентними практиками. У новачків бракує розумової моделі або є лише дуже неповна модель з обмеженою корисністю. Компетентні практики мають розумові моделі, які достатньо добре працюють у більшості ситуацій. Чим експерти відрізняються від обох цих груп?

source: > ## What Is An Expert?
uk: > ## Що таке експерт?

source: > > 1. Name someone that you think is an expert (doesn't matter what they're > an expert in). As an expert, what makes them special or different from > other people? > OR > 2. What is something that you're an expert in? How does your experience > when you're acting as an expert differ from when you're not an expert? > > This discussion should take about 5 minutes.
uk: > > 1. Назвіть когось, кого ви вважаєте експертом (неважливо, в чому саме > вони є експертами). Що робить цих експертів особливими чи відмінними від > інших людей? > АБО > 2. У чому ви експерт? Як ваш досвід, > коли ви виступаєте як експерт, відрізняється від того, коли ви не є експертом? > > Це обговорення має тривати близько 5 хвилин.

source: The answer is not that experts know more facts (although they almost always do have a lot of knowledge): competent practitioners can memorize a lot of information without any noticeable improvement to their performance. The answer is rather that experts have more connections among pieces of knowledge; more "short-cuts", if you will.
uk: Відповідь полягає не в тому, що експерти знають більше фактів (хоча вони майже завжди мають багато знань): компетентні практики можуть запам'ятати багато інформації без будь-якого помітного покращення їх продуктивності. Відповідь така: скоріше експерти мають більше зв’язків між частинами знань; більше "швидких шляхів", якщо хочете.

source: One way to illustrate this is to model storing knowledge as a graph in which facts are nodes and relationships are arcs. (This is emphatically *not* how our brains work, but it's a useful metaphor.) The key difference between experts and competent practitioners is that experts have many more connections among concepts. Their mental models are much more densely connected. Therefore experts can
uk: Одним із способів проілюструвати це є побудувати модель зберігання знань у вигляді графа, в якому факти є вузлами, а зв’язки – дугами. (Наш мозок працює категорично *не* так, але це корисна метафора.) Ключова відмінність експертів від компетентних практиків полягає в тому, що експерти мають набагато більше зв’язків між концепціями. Розумові моделі експертів мають значно більше звязків, тому експерти можуть

source: * see connections between two topics or ideas that no one else can see
uk: * бачити зв’язки між двома темами чи ідеями, які жоден інший не може побачити

source: * see a single problem in several different ways
uk: * побачити одну проблему з різних точок зору

source: * know how to solve a problem, or "what questions to ask"
uk: * знати, як вирішити проблему, або «які питання поставити»

source: * jump directly from a problem to its solution
uk: * перейти безпосередньо від формулювання проблеми до її вирішення

source: because there is a direct link between the two in their mind. Where a competent practitioner would have to reason "A therefore B therefore C therefore D therefore E", the expert can go from A to E in a single step ("A therefore E").
uk: оскільки в їхній свідомості існує прямий зв’язок між ними. Там, де компетентний практик мав би міркувати «А, отже, B, отже, C, отже, D, отже, E», експерт може переходити від А до Е за один крок («А, отже, Е»).

source: We'll expand on some of these below and how they can manifest in the way you teach.
uk: Нижче ми розглянемо деякі перелічених характеристик експертів і розглянемо, їх застосування у методах, якими ви навчаєте.

source: > ## Connections and Mental Models
uk: > ## Зв’язки та розумові моделі

source: > > The graph model of knowledge explains why > helping learners make connections is as important as introducing them to facts. > The more connections a fact has to other facts, > the more likely the fact is to be remembered. This builds on our earlier idea > of mental models - a mental model is (in part) a set of connections or relationships > among facts or concepts.
uk: > > Графова модель знань пояснює чому > допомогти слухачам встановити зв’язки так само важливо, як і ознайомити їх з фактами. > Чим більше факт пов’язаний з іншими фактами, > тим більше шансів, що факт запам'ятається. Це базується на нашій попередній ідеї > розумових моделей - розумова модель є (частково) набором зв'язків або відносин > між фактами чи поняттями.

source: ## Expertise and Teaching
uk: ## Експертиза та викладання

source: Because your learners' mental models will likely be less densely connected than your own, a conclusion that seems obvious to you will not seem that way to your learners. It's important to explain what you're doing step-by-step, and how each step leads to the next one.
uk: Оскільки розумові моделі ваших слухачів, ймовірно, будуть менш тісно пов’язані, ніж ваші власні, висновок, який здається вам очевидним, не здасться таким вашим слухачам. Важливо пояснювати, що ви робите крок за кроком, і як поточний крок веде до наступного.

source: Another feature of expertise that has important consequences for teaching is the ability of experts to make use of *fluid representations*. Two ways of thinking about a problem will seem interchangable to an expert, but will not seem that way to a novice. For example, someone with experience using the bash shell will be able to change back and forth between absolute and relative paths with no difficulty and in fact may not even notice they are doing so. A novice learner, however, would be confused by this unexplained use of two different ways of representing a concept.
uk: Ще одна особливість досвіду, яка має важливі наслідки для навчання, це здатність експертів використовувати *гнучке представлення*. Два способи мислення про проблему буде здаватися взаємозамінним для експерта, але не буде таким для новачка. Наприклад, хтось із досвідом використання оболонки bash зможе перемикатися між абсолютним і відносним шляхами без труднощів і насправді може навіть не помітити, що він це застосовує. Слухача-новачка, однак, це непояснене використання двох різних способів представлення концепції може збентежити.

source: > ## More Examples of Fluid Representations
uk: > ## Більше прикладів гнучкого представлення

source: > > - Programming: Referring to an R object like `abcde` as both "character vectors" and "strings". > - Programming: Switching among `df[,1]`, `df[,'foo']`, and `df$foo` notation when talking about columns in a data.frame. > - Biology: Switching between common species names and Latin names (e.g. "mouse" vs "*Mus musculus*"). > - Biology: Using both three letter and one letter amino acid codes interchangeably (e.g. Lys = K = Lysine). > - Chemistry: Switching between "Reference material" and "Standard" > - Mathematics: Thinking of things algebraically vs geometrically. > - Navigation: Switching among different routes between two locations.
uk: > > - Програмування: посилання на R-об’єкт, наприклад, `abcde`, як на «вектор символів» і «рядок». > - Програмування: переключення між позначеннями `df[,1]`, `df[,'foo']` і `df$foo`, коли йдеться про стовпці у data.frame. > - Біологія: переключення між загальними назвами видів і латинськими назвами (наприклад, «миша» проти «*Mus musculus*»). > - Біологія: взаємозамінне використання як трьохбуквених, так і однолітерних кодів амінокислот (наприклад, Lys = K = Lysine). > - Хімія: переключення між «Довідковий матеріал» і «Стандарт» > - Математика: мислення про речі алгебраїчно чи геометрично. > - Навігація: переключення між різними маршрутами між двома місцями.

source: > ## Fluid Representations
uk: > ## Гнучке представлення

source: > > In the Etherpad, give at least one example of a fluid representation that you use in your > own work. If you can, also give an example of a fluid representation that might occur in a > Carpentry lesson. > > Building awareness of how you can represent the same concept in multiple different ways > will help you avoid doing so without explanation while teaching. > > This discussion should take about 5 minutes.
uk: > >У Etherpad наведіть принаймні один приклад гнучкого представлення, яке ви використовуєте у своїй > власній роботі. Якщо можете, також наведіть приклад гнучкого представлення, яке може мати місце під час > уроку Carpentry. > > Розвиток усвідомлення того, як ви можете представити ту саму концепцію кількома різними способами > допоможе вам уникнути такого представлення без пояснень під час навчання. > > Це обговорення має тривати близько 5 хвилин.

source: Experts are also better at diagnosing errors than novices or competent practitioners. If faced with an error message while teaching, an expert will often figure out the cause of the error and develop a solution before a novice has even finished reading the error message. Because of this, it is very important while teaching to be explicit about the process you are using to diagnose and correct errors, even if they seem trivial to you, as they often will.
uk: Експерти також краще діагностують помилки, ніж новачки чи компетентні практики. Отримавши повідомлення про помилку під час навчання, експерт часто з’ясує причину помилки та розробить рішення до того, як новачок навіть закінчить читати повідомлення про помилку. Через це це дуже важливо в процесі навчання чітко розповідати про засоби діагностики та виправлення помилок, навіть якщо вони здаються вам тривіальними, якими вони часто бувають.

source: > ## Diagnosis (Optional)
uk: > ## Діагностіка (необов'язково)

source: > > What is an error message that you encounter frequently in your work? (These are often syntax errors.) > Take a few minutes to plan out how you would explain that error message to your learners. Write the > error and your explanation in the Etherpad. > > This discussion should take about 5 minutes.
uk: > > Яке повідомлення про помилку ви часто отримуєте під час роботи? (Часто це синтаксичні помилки.) > Виділіть кілька хвилин, щоб спланувати, як ви поясните це повідомлення про помилку своїм слухачам. Напишить > помилку та ваше пояснення в Etherpad. > > Це обговорення має тривати близько 5 хвилин.

source: Another potential challenge for experts who teach is what we call *expert blind spot*. Experts are frequently so familiar with their subject that they can no longer imagine what it's like to *not* see the world that way - this inability to see things from a non-expert perspective is an expert blind spot and can lead to what's known as the *expertise-reversal effect* - experts are often less good at teaching a subject to novices than people with less expertise who still remember what it's like to have to learn the things. This effect can be overcome with training, but it's part of the reason world-famous researchers are often poor lecturers.
uk: Ще одним потенційним викликом для експертів, які викладають, є те, що ми називаємо *сліпою плямою експерта*. Експерти часто настільки знайомі зі своїм предметом що вони взагалі не можуть уявити, як це – *не* дивитися на світ таким чином – саме ця нездатність бачити речі з неекспертної точки зору є сліпою плямою експерта і може призвести до так званого *ефекту зворотного досвіду* – експерти часто гірше викладають предмет для новачків, ніж люди з меншим досвідом, які все ще пам’ятають, як це – навчатися різним речам. Цей ефект можна подолати тренуваннями, але це одна з причин, чому всесвітньо відомі дослідники часто є поганими лекторами.

source: > ## Blind Spots (Optional)
uk: > ##Сліпі плями (необов'язково)

source: > > 1. Is there anything you're learning how to do right now? Can you identify > something that you still need to think about, but your teacher can do without > thinking about it? > 2. Think about the area of expertise you identified for yourself earlier. What could a > potential blind spot be?
uk: > > 1. Наразі є щось, що ви вчитеся робити? Чи можете ви ідентифікувати > те, про що вам ще потрібно подумати, а ваш викладач може це виконати > не роздумуючи? > 2. Подумайте про сферу знань, яку ви визначили для себе раніше. Що могло > бути потенційною сліпою плямою?

source: The challenge of identifying and working around expert blind spots is one reason why we welcome instructors who still identify as "novices"! Someone who is still in the process of learning can be a more effective instructor because they are speaking from their own recent experience.
uk: Проблема виявлення і роботи зі сліпими плямами експерта є однією з причин, чому ми запрошуємо інструкторів, які все ще вважають себе "новачками" і перебуваючи щє в процесі навчання, можуть бути більш ефективними інструкторами тому що вони говорять з власного недавнього досвіду.

source: ## Dismissive Language
uk: ## Зневажлива мова

source: Experts often betray their blind spot by using the word "just" in explanations, as in, "Oh, it's easy, you just fire up a new virtual machine and then you just install these four patches to Ubuntu and then you just re-write your entire program in a pure functional style---no problem." This gives learners the very clear signal that the instructor thinks their problem is trivial and that they therefore must be stupid.
uk: Експерти часто видають свою сліпу пляму, використовуючи в поясненнях слово «просто», наприклад: «О, це легко, ви просто запускаєте нову віртуальну машину, а потім ви просто встановлюєте ці чотири виправлення для Ubuntu а потім ви просто переписуєте всю свою програму в чистому функціональному стилі --- без проблем." Це дає слухачам дуже чіткий сигнал що інструктор вважає їхню проблему незначною, і тому вони повинні бути дурними.

source: With practice, we can change the way we speak to avoid this type of demotivating language and replace it with more positive and motivating word choices.
uk: З практикою ми можемо змінити манеру говорити, щоб уникнути такого типу демотивуючої мови та замінити її більш позитивним і мотивуючим вибором слів.

source: > ## Changing Your Language
uk: > ## Зміна мови

source: > > What other words or phrases can have the effect of demotivating learners? What alternatives can we use to > express this meaning in a positive and motivational way? > > In the Etherpad, make a list of demotivating words/phrases and alternatives. > > This discussion should take about 5 minutes. > >> ## Solution >> Courtney Seiter lists [10 words and phrases][motivation-words] that can change a conversation: *if*, *could*, *yes*, >> *together*, *thank you*, >> *choose to*, *and*, *because*, *willing*, and the person's name. These are motivating words and phrases that can shift mindsets. >> Jason Fried lists several dirty [four-letter words:][four-letter-words] *need*, *must*, *can’t*, *easy*, >> *just*, *only*, and *fast*, as well as >> examples of how they are used to demotivate. Statements like: >> * "We really need it." >> * "If we don’t we can’t ..." >> * "Wouldn’t it be easy if we just did it like that?" >> * "Can you try it real fast?" >> can be perceived as dismissive or demeaning or worse. >>
uk: > Які ще слова чи фрази можуть мати ефект демотивації слухачів? Які альтернативи ми можемо використовувати, > щоб виражати зміст навчання в позитивній та мотиваційній формі? > > У Etherpad складіть список демотивуючих слів/фраз і альтернатив. > > Це обговорення має тривати близько 5 хвилин. > >> ## Рішення >> Кортні Сейтер перераховує [10 слів і фраз][мотиваційних слів], які можуть змінити розмову: *якщо*, *може*, *так*, >> *разом*, *дякую*, >> *вибрати*, *і*, *тому що*, *бажаючи* та ім’я людини. Це мотиваційні слова та фрази, які можуть змінити мислення. >> Джейсон Фрід перераховує кілька брудних [слів із чотирьох літер:][слів із чотирьох літер] *потрібно*, *треба*, *не можу*, *легко*, >> *просто*, *тільки* і *швидко*, а також >> надає приклади того, як вони використовуються для демотивації. Такі заяви, як: >> * "Нам це дуже потрібно." >> * "Якщо ми цього не зробимо, ми не зможемо..." >> * "Чи не було б легко, якби ми просто зробили це так?" >> * "Чи можете ви спробувати дуже швидко?" >> можуть сприйматися як зневажливі, принизливі або ще гірше. >>

source: Another language choice that can have very positive effects on learner mindset is to ask "What questions do people have?" rather than "Does anyone have any questions?" Asking "Does anyone have any questions?" can create the impression that you hope people don't have questions, so that you can continue on with the lesson. By asking what questions people have, you are setting up an expectation that people will, indeed, have questions, and that that is normal and expected.
uk: Інший мовний прийом, який може дуже позитивно вплинути на мислення слухача, це запитання: «Які виникли запитання?» а не «У когось є запитання?» Питання "У когось є запитання?" може створити враження, що ви сподіваєтеся на те, що у людей немає запитань, отже, ви моможете продовжити семінар. Запитуючи, які запитання мають люди, ви створюєте очікування, що у людей справді будуть запитання, і це нормально та очікувано.

source: ## Expert Advantages
uk: ## Переваги експерта

source: In these ways and others, the high connectivity of an expert's mental model poses challenges while teaching novices. However, that's not to say that experts can't be good teachers. Experts can be effective as long as they take the time to identify and correct for their own expert blind spots. You can use some of the exercises we've done while preparing to teach to help you overcome these challenges.
uk: У цих та інших випадках висока зв’язність розумової моделі експерта створює проблеми під час навчання новачків. Однак це не означає, що експерти не можуть бути хорошими вчителями. Експерти можуть бути ефективними до тих пір, поки вони мають час для виявлення та виправлення своїх власних сліпих плям експерта. Ви можете скористатися деякими вправами, які ми виконали при підготовці до навчання, щоб допомогти вам подолати ці виклики.

source: Because of their well-connected knowledge, self-aware experts are well-poised to help students make meaningful connections among their knowledge, to confidently turn an error into a learning opportunity, or to explain a complex topic in multiple ways. The important thing is to be aware of blind spots and to try to identify from the learner's perspective as much as possible.
uk: Завдяки своїм добре пов’язаним знанням самосвідомі експерти добре врівноважені допомогти слухачам встановити значущі зв’язки між своїми знаннями, впевнено перетворити помилку на можливість навчання або пояснити складну тему багатьма засобами. Головне усвідомлювати сліпі зони та спробувати спробувати ідентифікувати якомога більше з точки зору слухача.

source: ## You Are Not Your Learners
uk: ## Ви не ваші слухачі

source: One way to overcome these limitations is by understanding the goals and motivations of your learners. We will discuss motivation in more depth in a [later lesson]({{ page.root }}/08-motivation/) but for now, consider some of these ideas about the typical audience for Carpentry workshops.
uk: Один із способів подолання цих обмежень – це розуміння цілей і мотивації ваших слухачів. Ми обговоримо мотивацію докладніше у [подальшому]({{ page.root }}/08-motivation/) але зараз розглянемо деякі з цих ідей щодо типової аудиторії для семінарів Carpentry.

source: - Most scientists' primary goal is not to program, but to do scientific research.
uk: - Головною метою більшості вчених є не програмування, а проведення наукових досліджень.
