Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/08__05-memory.md.po
Languages: uk

source: --- title: "Memory and Cognitive Load" block: "How Learning Works" teaching: 20 exercises: 25 questions: - "What is cognitive load and how does it affect learning?" - "How can we design instruction to work with, rather than against, memory constraints?" objectives: - "Identify when cognitive load is likely to limit learning." - "Use a concept map to plan a formative assessment strategy." keypoints: - "Most adults can store only a few items in short-term memory for a few seconds before they lose them again." - "Things seen together are remembered (or mis-remembered) in chunks." - "Teaching consists of loading short-term memory and reinforcing it long enough for items to be transferred to long-term memory." - "Use formative assessments to avoid overloading short-term memory." ---
uk: --- title: "Пам'ять та когнітивне навантаження" block: "Як працює навчання" teaching: 20 exercises: 25 questions: - «Що таке когнітивне навантаження і як воно впливає на навчання?» - "Як ми можемо розробити інструкцію для роботи з обмеженнями пам'яті, а не проти них?" цілі: - «Визначте, коли когнітивне навантаження може обмежити навчання». - «Використовуйте концептуальну карту для планування стратегії формуючого оцінювання». Ключові моменти: - «Більшість дорослих можуть зберігати лише кілька предметів у короткочасній пам’яті на кілька секунд, перш ніж вони знову їх втратять». - "Речі, побачені разом, запам'ятовуються (або запам'ятовуються неправильно) уривками". - "Навчання складається із завантаження короткочасної пам'яті та її зміцнення на достатній час для перенесення елементів у довготривалу пам'ять". - «Використовуйте формуюче оцінювання, щоб уникнути перевантаження короткочасної пам'яті». ---

source: In our final topic in how people learn (and therefore, how we can be more effective instructors), we'll be learning more about human memory: specifically, how to remove unnecessary "load" in order to facilitate learning.
uk: У нашій останній темі про те, як люди навчаються (і, отже, як ми можемо бути більш ефективними інструкторами), ми дізнаємося більше про людську пам’ять: зокрема, як зняти непотрібне «навантаження», щоб полегшити навчання.

source: ## Types of Memory
uk: ## Типи пам'яті

source: Learning involves memory. For our purposes, human memory can be divided into two different layers. The first is called *long-term*. It is where we store persistent information like our passwords and our home address. It is essentially unbounded (barring injury or disease, we will die before it fills up) but it is slow to access.
uk: Навчання включає пам'ять. Для наших цілей людську пам'ять можна розділити на дві різні шари. Перший називається *довгостроковим*. Тут ми зберігаємо постійну інформацію, як-от наші паролі та домашню адресу. Він по суті необмежений (за винятком травм або хвороб, ми помремо, перш ніж він заповниться) але доступ до нього повільний.

source: Our second layer of memory is called *short-term*. This is the type of memory you use to actively think about things and is often called working memory. It is much faster, but also much smaller: in 1956, George Miller estimated that the average adult's short-term memory could hold [7±2 items][wikipedia-7] for a few seconds before things started to drop out. This is [why phone numbers are typically 7 or 8 digits long][phone-nums]: back when phones had dials instead of keypads, that was the longest sequence of numbers most adults could remember accurately for as long as it took the dial to go around and around.
uk: Наш другий шар пам’яті називається *короткостроковим*. Це тип пам’яті, який ви використовуєте, щоб активно думати про речі, і він часто називається робочою пам’яттю. Це набагато швидше, але також набагато менше: у 1956 році Джордж Міллер підрахував, що короткострокова пам’ять середньостатистичного дорослого може втримати [7±2 об'єктів][wikipedia-7] на кілька секунд, перш ніж щось втратить. Ось [чому телефонні номери зазвичай складаються з 7 або 8 цифр][телефонні номери]: коли телефони мали циферблати замість клавіатури, це була найдовша послідовність цифр, яку більшість дорослих могли точно пам’ятати стільки часу, скільки знадобилося циферблату, щоб обертатися і обертатися.

source: More recent research suggests that short-term memory is actually even smaller than this. Regardless of its exact size, which may differ across people and contexts, we know that short-term memory is limited. This has important implications for teaching. If we present our learners with large amounts of information, without giving them the opportunity to practice using it (and thereby transfer it into long-term memory), they won't retain the material as well as if we present small amounts of information interspersed with practice opportunities. This is yet another reason why going slowly and using frequent formative assessment is important.
uk: Останні дослідження показують, що короткострокова пам’ять насправді навіть менша. Незалежно від її точного розміру, який може відрізнятися залежно від людей і контекстів, ми знаємо, що короткочасна пам'ять є обмеженою. Це має важливі наслідки для навчання. Якщо ми надамо нашим слухачам великі обсяги інформації, не даючи їм можливості попрактикуватися в його використанні (і таким чином перенести його в довготривалу пам’ять), вони не збережуть матеріал, як і у випадку, якщо ми представимо невеликі обсяги інформації з вкрапленнями можливості практики. Це ще одна причина, чому важливо йти повільно і використовувати досить часто формуюче оцінювання.

source: > ## Test Your Working Memory (5 min)
uk: > ## Перевірте свою робочу пам'ять (5 хвилин)

source: > > [This website][memory-test] implements a short test of working memory. > > Take 5 minutes to complete the exercise. What was your score? Write your answer > in the Etherpad.
uk: > > [This website][memory-test] implements a short test of working memory. > > Витратьте 5 хвилин на виконання вправи. Який твій бал? Напишіть свою відповідь > в Etherpad.

source: > ## Test Your Working Memory - Analog version (5 min)
uk: > ## Проверьте свою рабочую память — аналоговая версия (5 мін.)

source: > > Read the following list and try to memorize the items in it: > > cat, apple, ball, tree, square, head, house, door, box, car, king, > hammer, milk, fish, book, tape, arrow, flower, key, shoe > > Without looking at the list again, write down as many words from the list as > you can. How many did you remember? Write your answer in the Etherpad.
uk: > >Прочитайте наведений нижче список і спробуйте запам’ятати слова з нього: > > кіт, яблуко, м'яч, дерево, квадрат, голова, будинок, двері, скринька, машина, король, > молоток, молоко, риба, книга, стрічка, стріла, квітка, ключ, черевик > > Не переглядаючи список знову, запишіть стільки слів зі списку, скільки > ви запам'ятали. Скільки ви запам'ятали? Напишіть свою відповідь в Etherpad.

source: Most people will have found they only remember 5-7 words. Don't worry if you remembered fewer - many factors can affect short-term memory in different situations. Fortunately, there are techniques that we can use to improve our effective short-term memory. We'll illustrate one of these techniques and then describe how this is applicable to our workshops.
uk: Більшість людей пам'ятають лише 5-7 слів. Не хвилюйтеся, якщо ви запам'ятали менше - багато факторів можуть впливати на короткочасну пам'ять у різних ситуаціях. На щастя, є методи, які ми можемо використовувати для покращення нашої ефективної короткочасної пам’яті. Ми проілюструємо один із цих методів, а потім опишемо, як це можна застосувати до нашого семінару.

source: ## Strategies For Memory Management
uk: ## Стратегії управління пам'яттю

source: Our role as instructors, therefore, is to help our learners by not flooding their short term memory with too much information, partially by providing strategies and exercises to help them form the connections that will move concepts into long-term memory. What are some tools for doing this?
uk: Отже, наша роль як інструкторів полягає в тому, щоб допомогти нашим слухачам, не займаючи їх короткострокову пам’ять занадто великою кількістю інформації, частково через надання стратегій запамятовування і вправ, які допоможуть їм сформувати зв’язки для переміщення понять у довгострокову пам'ять. Які існують інструменти для цього?

source: ### Chunking
uk: ### Групування

source: One is by explicitly forming connections or groupings. Our minds can store larger numbers of facts in short-term memory by creating *chunks*, or relationships among separate items, causing them to be remembered as a single item. For example, most of us will remember a word we read as a single item ("cat"), rather than as a sequence of letters ("c-a-t"). Similarly, the pattern made by five spots on cards or die is remembered as a whole rather than as five separate pieces of information.
uk: Один з таких інструментів – явне формування зв’язків або груп. Наш розум може зберігати більшу кількість фактів у короткочасній пам’яті, створюючи *фрагменти* або зв’язки між окремими елементами, завдяки чому вони запам’ятовуються як єдиний елемент. Наприклад, більшість із нас запам’ятає слово, яке ми прочитали, як одне ціле («кіт») ніж як послідовність літер ("k-і-т"). Подібним чином візерунок із п’яти плям на картках або кубику запам’ятовується як єдине ціле, а не як п’ять окремих частин інформації.

source: > ## Improving Short-term Memory with Chunking
uk: > ## Поліпшення короткострокової пам'яті за допомогою групування

source: > > Repeat the memory exercise you did earlier, but this time, > try to form short stories or phrases, or a visual image, from the words you see. > > Write the number of words you remembered in the Etherpad. > How does this compare with your first attempt?
uk: > > Повторіть вправу на пам’ять, яку ви робили раніше, але цього разу > спробуйте зі слів, які ви бачите, скласти короткі розповіді чи фрази чи візуальний образ. > > Напишіть кількість слів, які ви запам’ятали, в Etherpad. > Як це можна порівняти з вашою першою спробою?

source: Storing words in groups reduces the number of effective items in your short-term memory, allowing you to keep more information in your head at once. This is one reason why helping our learners to see the connections among the concepts we are teaching is so important.
uk: Зберігання слів у групах зменшує кількість ефективних елементів у вашій короткостроковій пам’яті, що дозволяє зберегти більше інформації у вашій голові одночасно. Це одна з причин, чому дуже важливо допомагати нашим слухачам побачити зв’язки між поняттями, яким ми навчаємо.

source: ### Active Learning Through Formative Assessment
uk: ### Активне навчання через формуюче оцінювання

source: Formative assessment is a key component in helping learners solidify their understanding and transfer ideas from short-term memory into long-term memory. It's important to use formative assessments frequently to help learners transition new concepts into their long-term memory, before their short-term memory fills up. It can be helpful to use pedagogical planning tools to identify the number of concepts that are being introduced in a lesson and plan where to include formative assessments.
uk: Формуюче оцінювання є ключовим компонентом, який допомагає слухачам зміцнити своє розуміння і переносити ідеї з короткострокової пам’яті в довгострокову. Важливо часто використовувати формуюче оцінювання, щоб допомогти слухачам перенести нові концепції у довгострокову пам’ять, перш ніж їх короткострокова пам’ять заповниться. Також було б корисно використовувати інструменти педагогічного планування для визначення кількості понять які мають вводитися на семінарі, і моментів включення формуючого оцінювання.

source: ### Limit concepts
uk: ### Концептуальні рамки

source: In the same vein as "going slowly," it's important to limit the number of concepts introduced in a lesson; no matter how many exercises or formative assessments you do, you can't overcome the limit of items that can be shored in short-term memory.
uk: Аналогічно втіленню ідеї "рухатися поступово", важливо обмежити кількість понять, що вводяться на семінарі; незалежно від того, скільки вправ або формуючих оцінок ви робите, ви не можете подолати ліміт інформації, яка може бути збережена в короткостроковій пам'яті.

source: ## Concept Maps as Instructional Planning Tools
uk: ## Концептуальні карти як інструменти планування навчання

source: One tool that can be used to identify the number of concepts being introduced in a lesson is the *concept map*. A concept map is a picture of someone's mental model of a domain: facts are bubbles, and connections are labelled arcs. It is important that they are labelled: saying "X and Y are related" is only helpful if we explain what the relationship *is*.
uk: Одним з інструментів, який можна використовувати для ідентифікації множини понять, представлених на семінарі, є *концептуальна карта*. Концептуальна карта – це зображення чиєїсь розумової моделі предметної області: факти подані як бульбашки, а зв’язки позначені дугами. Важливо, щоб вони були марковані: Висловлювання «X і Y зв’язані між собою» буде корисним, лише якщо ми пояснимо, який тип зв’язку *застосовано*.

source: To show what concept maps look like, consider this example of a `for` loop in Python:
uk: Щоб показати, як виглядають концептуальні карти, розглянемо приклад циклу for в Python:

source: The three key concepts used in this loop are:
uk: У цьому циклі використовуються три ключові поняття:

source: ![Key Concepts](../fig/for-loop-concepts.png)
uk: ![Ключові поняття](../fig/for-loop-concepts.png)

source: The key relationships, which are as important as the concepts themselves, are:
uk: Ключові зв'язки, які є такими ж важливими, як і самі поняття, вигляду:

source: ![Relationships](../fig/for-loop-arcs.png)
uk: ![Зв'язки](../fig/for-loop-arcs.png)

source: A quick count shows that there are actually 6 things here, not just 3, so we're already brushing up against the limits of short-term memory. If we add two more facts to show things that are usually (but not always) true:
uk: Швидкий підрахунок показує, що насправді тут є 6 концептів, не тільки 3, тому ми вже починаємо працювати над межами короткострокової пам’яті. Якщо ми додамо ще два факти, щоб показати речі, які зазвичай (але не завжди) правдиві:

source: ![Recommendations](../fig/for-loop-rec.png)
uk: ![Рекомендації](../fig/for-loop-rec.png)

source: the count rises to 8, which is a good size for a single teaching episode. A few other concept maps drawn by previous participants in this training course are listed below:
uk: загальна кількість зростає до 8, що є хорошим розміром для одного навчального епізоду. Кілька інших концептуальних карт, створених попередніми учасниками цього навчального курсу, перераховані нижче:

source: Most of these are much larger than our recommended limit, but that's not necessarily a bad thing. An instructor can draw a concept map for an entire topic, and use that to decide where to introduce a formative assessment to avoid overloading short-term memory.
uk: Більшість із них значно перевищують наш рекомендований ліміт, але це не обов'язково погано. Інструктор може створити концептуальну карту для всієї теми, і використовувати це, щоб вирішити, де запровадити формуюче оцінювання, щоб уникнути перевантаження короткострокової пам'яті.

source: It's very important to use a technique like concept mapping for a lesson before teaching it - an instructor needs to identify just how many pieces of separate information will need to be "stored" in memory during each part of the lesson. This can be particularly useful for experts who are trying to unpack their own knowledge.
uk: Дуже важливо перед викладанням на семінарі застосовувати таку техніку, як побудова концептуальної карти - інструктор має визначити, скільки окремих фрагментів інформації протягом кожної частини семінару потрібно буде «зберігати» в пам'яті . Це може бути особливо корисним для експертів, які намагаються розпакувати свої власні знання.

source: > ## Concept Mapping
uk: > ## Концептуальні карти

source: > > Create a hand-drawn concept map for a part of a Carpentry lesson you would teach in > five minutes (i.e. > the amount of material you would teach before doing a formative assessment). > You can use the same subject about which you created a multiple choice question, or > a different subject. > Trade with a partner, and critique each other's maps. Are there any concepts > missing in your partner's map that you would include? Are there more than a handful > of concepts in your map? If so, how would you re-divide those concepts to avoid > overwhelming your learners' short-term memory? > > Take 10 minutes to draw the concept maps and share with your neighbor. > Write "*done*" in the Etherpad chat once you have finished.
uk: > > Створіть намальовану від руки концептуальну карту для частини уроку Carpentry, яку ви б викладали протягом > п'яти хвилин (тобто > кількість матеріалу, який ви б викладали перед проведенням формуючого оцінювання). > Ви можете використовувати ту саму тему, щодо якої ви створили питання з множинним вибором, або > іншу тему. > Дискутуйте з партнером і критикуйте карти один одного. Є якісь поняття, > яких бракує на карті вашого партнера, та які б ви включили? Є більше, ніж жменька > понять у вашій карті? Якщо так, то як би ви повторно розділили ці концепції, щоб уникнути > перевантаження короткострокової пам'яті ваших слухачів > > Виділіть 10 хвилин, щоб намалювати концептуальні карти та поділитися ними з вашим сусідом. > Після завершення напишіть «*готово*» в чаті Etherpad.

source: > ## Other Uses of Concept Maps
uk: > ## Інше використання концептуальних карт

source: > In addition to helping you plan where to introduce formative assessments, concept maps can
uk: > Крім допомоги в плануванні проведення формувального оцінювання, концептуальні карти

source: > be used in many other ways:
uk: > можуть бути використані багатьма іншими способами:

source: > > 1. To aid solo design of a lesson by helping authors figure > out what they're trying to teach. > 2. To aid communication with fellow lesson designers. > 3. To aid communication with learners. > While it's possible to give learners a pre-drawn map at the start of a lesson for them > to annotate, it's better to draw it piece by piece while teaching > to reinforce the ties between what's in the map and what the instructor said. > 4. Concept maps can be used as a classroom discussion exercise. > Put learners in small groups (2-4 people each), > give each group some sticky notes on which a few key concepts are written, > and have them build a concept map on a whiteboard by placing those sticky notes, > connecting them with labelled arcs, > and adding any other concepts they think they need. > 5. Concept maps are also a useful formative assessment technique: > having learners draw concept maps of what they think they just > heard shows the instructor what was missed and what was misunderstood.
uk: > > . Сприяти самостійному оформленню семінару, допомагаючи авторам > побудувати схему результатів навчання. > 2. Сприяти спілкуванню з колегами-розробниками уроків. > 3. Сприяти спілкуванню зі слухачами. > Можна дати слухачам попередньо побудовану карту на початку уроку та заохотити > надавати коментарі, але краще малювати карту по частинах під час навчання > щоб зміцнити зв'язок між тим, що на карті, і тим, що сказав інструктор. > 4. Концептуальні карти можна використовувати як вправу для обговорення в класі. > Об’єднайте слухачів у малі групи (по 2-4 особи в кожній), >роздайте кожній групі папірці з кількома ключовими поняттями, >і попросіть їх побудувати концептуальну карту на дошці, розмістивши ці наліпки, >з'єднуючи їх позначеними дугами, >і додаючи будь-які інші поняття, які вони вважають за потрібне. > 5. Концептуальні карти також є корисною технікою формуючого оцінювання: > якщо слухачі намалюють концептуальні карти того, що вони думають про те, що вони щойно > почули, інструктор може визначити, що пропущено або залишилось незрозумілим.

source: ## Why Guided Practice is Important
uk: ## Чому керована практика важлива

source: Another way to think about the challenge of managing memory is through the theory of *[cognitive load][wikipedia-cognitive-load]*. It posits that people have to deal with three things when they're learning:
uk: Інший спосіб подумати про проблему управління пам'яттю - через теорію *[когнітивного навантаження][wikipedia-cognitive-load]*. Ця теорія передбачає, що під час навчання людям доводиться мати справу з трьома речами:

source: * *Intrinsic* load is what they have to keep in mind in order to carry out a learning task.
uk: * *Внутрішнє* навантаження – це те, про що вони повинні пам’ятати, щоб виконати навчальне завдання.

source: * *Germane* load is the (desirable) mental effort required to create linkages between new information and old
uk: * *Німецьке* навантаження — це (бажане) розумове зусилля, необхідне для створення зв’язків між новою та старою інформацією

source: (which is one of the things that distinguishes learning from memorization). * *Extraneous* load is everything else that distracts or gets in the way.
uk: (що є однією з ознак, яка відрізняє навчання від запам'ятовування). * *Стороннє* навантаження - це все інше, що відволікає або заважає.

source: Cognitive load theory's proponents claim that eliminating extraneous cognitive load accelerates learning. One way to do this is by using *guided practice*: we set up a structure in which learners can apply their skills with direction and get feedback on their progress.
uk: Прихильники теорії когнітивного навантаження стверджують, що усунення стороннього когнітивного навантаження прискорює навчання. Це можна зробити з використанням *керованої практики*: ми створили структуру, за якою слухачі можуть застосовувати свої навички ціленаправлено та отримувати відгуки про свій прогрес.

source: > ## Why We Don't Use Minimal Guidance
uk: > ## Чому ми не використовуємо техніку мінімального керівництва
