Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/08__05-memory.md.po
Languages: uk

source: > > An alternative to guided practice is a *minimal guidance* approach, where > learners are given raw materials (for example a text or reference) and > asked to explore and learn to solve problems on their own. > Minimal guidance practice comes from another teaching strategy > variously known as *constructivist*, *discovery*, *problem-based*, *experiential* > or *inquiry-based* learning. > > You may have heard of some of these strategies, and they are not without > merit! But they frequently fall flat. Cognitive load theory, introduced by [Kirshner et al.][kirschner-paper] > in response to the popularity and uneven success of these approaches, applies what we know about > human cognitive architecture to understand why minimal guidance often fails. > > Minimally-guided instruction requires learners to simultaneously > master a domain's factual content > and its search and problem-solving strategies. > Fostering creativity and independence is intuitively appealing, > but that doesn't mean it works.
uk: > > Альтернативою керованій практиці є підхід *мінімального керівництва*, де > услухачам надаються вихідні матеріали (наприклад, текст або посилання) і > завдання дослідити та навчитися вирішувати проблеми самостійно. > Техніка мінімального керівництва походить від іншої стратегії навчання, > також відомої як *конструктивізм*, *відкриття*, *технологія проблемного навчання*, *експериментальна* > або *навчання на основі запитів*. > > Можливо, ви чули про деякі з цих стратегій, і вони не безуспішні! > Але в цілому ці стратегії не спрацьовують. Теорія когнітивного навантаження, представлена [Kirshner et al.][kirschner-paper] > у відповідь на популярність і нерівний успіх цих підходів застосовує те, що ми знаємо > про когнітивну архітектуру людей, щоб зрозуміти, чому мінімальне керівництво часто не дає результатів. > > Мінімально кероване навчання вимагає від слухачів одночасно > освоїти фактичний зміст предметної області > і стратегії пошуку та вирішення проблем. > Розвиток творчості та незалежності є інтуїтивно привабливим, > але це не означає, що він працює.

source: In the framework of cognitive load, some additional predictions can be made.
uk: У рамках теорії когнітивного навантаження можна зробити деякі додаткові прогнози.

source: One example is work by Mayer and colleagues on the *[split-attention effect][wikipedia-split-attention]*. Linguistic and visual input are processed by different parts of the human brain, and linguistic and visual memories are stored separately as well. This means that correlating different linguistic, auditory, and visual streams of information takes cognitive effort: when someone reads one thing while hearing something else spoken aloud, their brain can't help but check that it's getting the same information on both channels. Discrepancies between these channels increase cognitive load and decrease learning. Learning is therefore more effective when information that is being presented simultaneously in two different channels is redundant, rather than different.
uk: Одним із прикладів є робота Майєра та його колег *[ефект розділеної уваги][wikipedia-split-attention]*. Мовні та візуальні дані обробляються різними частинами людського мозку, лінгвістичні та візуальні спогади також зберігаються окремо. Це означає, що кореляція різних мовних, слухових та зорових потоків інформації потребує когнітивних зусиль: коли хтось читає одне, чуючи вголос щось інше, його мозок не може не перевірити, чи отримує він однакову інформацію на обох каналах. Розбіжності між цими каналами збільшують когнітивне навантаження та знижують здатність до навчання. Таким чином, навчання є більш ефективним, коли інформація, що подається одночасно у двох різних каналах є надлишковою, а не різною.

source: For our workshops, this means the instructor should say out loud commands as they type them on the screen while engaging learners in [participatory live coding]({{ page.root }}/14-live/).
uk: Для наших семінарів це означає, що інструктор має вимовляти команди мови програмування вголос, коли він вводить їх на екрані, залучаючи слухачів до [активного кодування] ({{ page.root }}/14-live/).

source: ## Guided Practice at Work
uk: ## Керована практика

source: How do we implement guided practice, lessening the burden of extraneous cognitive load and allow people to focus on what's important? There are many different types of exercises that implement this guided practice; some are listed in this [blog post by Greg Wilson][GW-exercise-post], including Parson's Problems and labelling diagrams.
uk: Як ми реалізуємо керовану практику, зменшуючи тягар стороннього когнітивного навантаження та дозволяючи слухачам зосередитися на тому, що важливо? Є багато різних типів вправ, які реалізують цю керовану практику; декілька перераховані в цьому [дописі в блозі Грега Вілсона] [GW-exercise-post], зокрема Проблеми Парсона та діаграми маркування.

source: To learn more about a specific guided practice exercise called *faded examples*, read on.
uk: Щоб дізнатися більше про конкретну практичну вправу, яка називається *вицвітаючі приклади*, читайте далі.

source: According to cognitive load theory, searching for a solution strategy is an extra burden on top of applying that strategy. We can therefore accelerate learning by giving learners worked examples that show them a problem and a detailed step-by-step solution, followed by a series of faded examples. The first of these presents a nearly-complete use of the same problem-solving strategy with a small number of blanks for the learner to fill in. The next problem is also of the same type, but has more blanks, and so on until the learner is asked to solve the entire problem.
uk: Відповідно до теорії когнітивного навантаження, пошук стратегії вирішення є додатковим тягарем. на додаток до застосування цієї стратегії. Тому ми можемо прискорити навчання, надаючи слухачам робочі приклади, які показують їм проблему та детальне покрокове рішення, за якими слідує серія вицвітаючих прикладів. Перший з них представляє майже повне використання тієї самої стратегії вирішення проблеми з невеликою кількістю пропусків, які повинен заповнити слухач. Наступна задача також такого ж типу, але має більше порожніх місць, і так далі, доки слухача не попросять розв’язати всю проблему цілком.

source: Faded examples work because they introduce the problem-solving strategy piece by piece. At each step, learners have one new problem to tackle. This is less intimidating than a blank screen or a blank sheet of paper. It also encourages learners to think about the similarities and differences between various approaches, which helps create the linkages in the mental model that instructors want them to form.
uk: Вицвітаючі приклади працюють, тому що вони поступово вводять стратегію вирішення проблеми. На кожному кроці слухачі мають одну нову проблему для вирішення. Це менш лякає, ніж порожній екран або чистий аркуш паперу. Це також заохочує слухачів думати про схожість і відмінність між різними підходами, що допомагає створити зв’язки в розумовій моделі, яку хочуть сформувати інструктори.

source: For example, someone teaching Python might start by explaining this:
uk: Наприклад, інструктор, який викладає Python, може почати з пояснення цього:

source: ~~~ def total_length(words): """Returns the total length of all words in a list combined. Example: total_length(["red", "green", "blue"]) => 12 """ total = 0 for word in words: total += len(word) return total ~~~
uk: ~~~ def total_length(words): """Повертає загальну довжину всіх слів у списку. Приклад: total_length(["red", "green", "blue"]) => 12 """ total = 0 for word in words: total += len(word) return total ~~~

source: then ask learners to fill in the blanks in:
uk: потім попросіть слухачів заповнити пропуски в:

source: ~~~ def word_lengths(words): """Returns a list of lengths of each word in a list. Example: word_lengths(["red", "green", "blue"]) => [3, 5, 4] """ lengths = ____ for word in words: lengths ____ return lengths ~~~
uk: ~~~ def word_lengths(words): """Повертає загальну довжину всіх слів у списку. Приклад: word_lengths(["red", "green", "blue"]) => [3, 5, 4] """ lengths = ____ for word in words: lengths ____ return lengths ~~~

source: The next problem might be:
uk: Наступною проблемою може бути:

source: ~~~ def concatenate_all(words): """Combines all words in a list into one. Example: concatenate_all(["red", "green", "blue"]) => "redgreenblue" """ result = ____ for ____ in ____: ____ return result ~~~~
uk: ~~~ def concatenate_all(words): """Об’єднує всі слова зі списку в одне. Приклад: concatenate_all(["red", "green", "blue"]) => "redgreenblue" """ result = ____ for ____ in ____: ____ return result ~~~~

source: and learners would finally be asked to tackle:
uk: і нарешті слухачам буде запропоновано взятися за:

source: ~~~ def acronymize(words): """Returns the first letter of each word in a list capitalised in a single string. Example: acronymize(["red", "green", "blue"]) => "RGB" """ ____ ~~~
uk: ~~~ def acronymize(words): """Повертає першу літеру кожного слова у списку, написаному великими літерами в одному рядку. Приклад: acronymize(["red", "green", "blue"]) => "RGB" """ ____ ~~~

source: Another situation in which a concept map can be helpful is in deciding where to place the blanks in a faded example. Each blank (or set of blanks) would ideally correspond to one concept in your concept map.
uk: Інша ситуація, в якій концептуальна карта може бути корисною, полягає у вирішенніЮ де саме розмістити порожні місця у вицвітаючому прикладі. Кожен пропуск (або набір пропусків) має точно відповідати одному концепту у вашій концептуальній карті.

source: > ## Create a Faded Example from a Lesson (Optional)
uk: > ##Створення вицвітаючого прикладу на семінарі (необов’язково)

source: > > The following exercise should be done in groups of 2-3. > > 1. Pick a block of code from an existing Carpentries lesson, > or from another lesson you have taught recently. > 2. Replace 2-3 pieces of the code with a blank. > 3. Write a question to test the learner's ability to correctly fill in that blank. > 5. Paste your faded example in the Etherpad. > > This exercise should take about 10 minutes. > >> ## Solution >> >> Your solution to this exercise could look similar to the example >> given above, or something like this: >> >> **Question** >> In this example, we will graph the change in life expectancy over time >> as a line graph, giving each country a unique color and each continent >> its own unique panel or facet. >> What would you add to the blank spaces to create this graph? >>``` >> ggplot(data = az.countries, aes(x = year, y = lifeExp, color = ________)) + >> geom_line() + facet_wrap( ~ _______) >>``` >> >>**Answer** `country` and `continent` >>
uk: > Наступну вправу слід виконувати в групах по 2-3 особи. > > 1. Виберіть блок коду з існуючого семінару Carpentry, > або з іншої лекції, яку ви нещодавно викладали. > 2. Замініть 2-3 фрагменти коду пропусками. > 3. Напишіть запитання, щоб перевірити здатність слухача правильно заповнити цей пропуск. > 5. Вставте свій вицвітаючий приклад у Etherpad. > > Ця вправа займає близько 10 хвилин. > >> ## Рішення >> >> Ваше рішення цієї вправи може виглядати подібно до прикладу, >> який наведено вище, або щось на зразок цього: >> >> **Питання** >> У цьому прикладі ми наведемо графік зміну очікуваної тривалості життя з часом >> у вигляді лінійного графіка, що надає кожній країні унікальний колір і кожному континенту >> власну унікальну панель або фасету. >> Що б ви додали до порожніх місць, щоб створити цей графік? >>``` >> ggplot(data = az.countries, aes(x = year, y = lifeExp, color = ________)) + >> geom_line() + facet_wrap( ~ _______) >>``` >> >>**Відповідь** `країна` і `континент` >>

source: ## Summary
uk: ## Висновки

source: The process of learning is constrained by the limits of short-term memory. In order to move new information into long-term memory, it must be actively applied, but activities that make excessive demands on short-term memory are likely to induce cognitive overload and can easily harm learner motivation. Instructional tools that expand short-term memory by increasing connectivity (chunking) among new concepts can improve outcomes for subsequent memory-intensive exercises. Formative assessments, when performed frequently, help learners by prompting them to apply new content before it has been overwritten. Faded examples or other types of guided practice both minimize demands on short-term memory and offer context that helps improve connectivity for future work, in which the "scaffolding" of contextual support can be gradually removed. Anything you can do to a) recognize and b) support learners in working with the limitations of short-term memory will improve the effectiveness of your teaching.
uk: Процес навчання стримується межами короткострокової пам'яті. Для перенесення нової інформації в довгострокову пам'ять, вона повинна активно застосовуватися, але діяльність, яка висуває надмірні вимоги до короткострокової пам’яті, може спричинити когнітивне перевантаження та легко зашкодити мотивації слухачів. Навчальні інструменти, що розширюють короткострокову пам'ять завдяки підвищенню зв’язності (групуванню) нових концепцій, можуть покращити результати для наступних вправ, що потребують інтенсивної пам’яті. Формуюче оцінювання, коли воно виконується, часто допомагає слухачам, пропонуючи їм застосувати новий вміст до того, як він був перезаписаний. Вицвітаючі приклади або інші типи керованої практики мінімізують вимоги до короткострокової пам’яті та пропонують такий контекст, що допомагає покращити зв'язок для майбутньої роботи, в якому "риштування" контекстної підтримки можна поступово видаляти. Усе, що ви можете зробити, щоб а) визнати та б) підтримати слухачів у роботі з обмеження короткострокової пам'яті, підвищить ефективність вашого навчання.
