Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/09__06-feedback.md.po
Languages: uk

source: --- title: "Building Skill With Feedback" block: "Building Teaching Skill" teaching: 10 exercises: 10 questions: - "How can I get feedback from learners?" - "How can I use this feedback to improve my teaching?" objectives: - "Describe three feedback mechanisms used in Carpentries workshops." - "Give feedback to your instructors." keypoints: - "Give your learners time to fill out the post-workshop survey at the end of your workshop." - "Take the time to respond to your learners' feedback." ---
uk: --- title: "Розвиток навичок за допомогою зворотного зв'язку" block: "Формування педагогічної майстерності" teaching: 10 exercises: 10 questions: - "Як я можу отримати зворотній зв'язок від слухачів?" - "Як я можу використати цей відгук, щоб покращити своє навчання?" цілі: - «Опишіть три механізми зворотного зв'язку, які використовуються на семінарах Carpentry». - «Надайте відгук своїм інструкторам». Ключові моменти: - «Надайте своїм слухачам час, щоб заповнити опитування в кінці вашого семінару». - «Знайдіть час, щоб відповісти на відгуки слухачів». ---

source: We use formative assessment of learners during workshops to help track learners' progress and adjust our approach to teaching the content as needed. But formative assessment isn't just for learners. As we'll discuss in more detail [later]({{ page.root }}/11-practice-teaching/), teaching is also a skill that is improved through regular practice and feedback. We gather feedback from our learners at multiple points in the workshop and in different forms.
uk: Ми використовуємо формуюче оцінювання слухачів під час семінарів, щоб допомогти відстежити прогрес слухачів і за потреби коригувати наш підхід до викладання змісту. Але формуюче оцінювання призначене не лише для слухачів. Про це ми поговоримо докладніше [пізніше]({{ page.root }}/11-practice-teaching/), бо навчання також є навичкою, яку можна вдосконалити завдяки регулярній практиці та зворотному зв’язку. Ми збираємо відгуки від наших слухачів в різних формах та у різні моменти часу на семінарах.

source: ## Surveys
uk: ## Опитування

source: Carpentries learners fill out a survey before attending and immediately after a workshop. These surveys include questions to help instructors get an idea of their attendees prior experience and backgrounds before the workshop starts. Using this information, instructors can start to plan how they will approach the materials and what level of exercises are likely to be appropriate for their learners.
uk: Учасники курсів Carpentries заповнюють опитування перед участю в семінарі та одразу після нього. Ці опитування містять питання, які допомагають інструкторам отримати уявлення про попередні знання та досвід учасників перед початком семінару. Використовуючи цю інформацію, інструктори можуть почати планувати, як вони підходитимуть до матеріалів і який рівень вправ буде найбільш відповідним для учнів.

source: You can preview the surveys your learners will receive at the links below: - [Software Carpentry pre-workshop survey](https://www.surveymonkey.com/r/Preview/?sm=V6gQbbOKn3NoPKfYKHjAKu_2BBCdtXXsTS2pf1BIdARccEtJQqlu1KFB2j2TcF0MCn) - [Software Carpentry post-workshop survey](https://www.surveymonkey.com/r/Preview/?sm=uN5QPa4MbF1_2BB1plbLWnL1ZUc7Nttqici0Nc0e3G4RahMwwGW5NUp4U5PKQDYmky) - [Data Carpentry pre-workshop survey](https://www.surveymonkey.com/r/Preview/?sm=zdE7x498WxTrpyiD6WEQJaspyjn2T7djLpBg2pc36ylXiMCwflbQtv6puqE01NB4) - [Data Carpentry post-workshop survey](https://www.surveymonkey.com/r/Preview/?sm=Mrj4bb21g1tgjNuilRh0cOT5mrUI7P2KQPzKG6FqkomqgWhHqR_2BsNWTJLHGif1VF) - [Library Carpentry pre-workshop survey](https://www.surveymonkey.com/r/lcpreworkshopsurvey?workshop_id=) - [Library Carpentry post-workshop survey](https://www.surveymonkey.com/r/lcpostworkshopsurvey?workshop_id=)
uk: Ви можете переглянути опитування, які отримають ваші слухачі, за посиланнями нижче: - [Software Carpentry pre-workshop survey](https://www.surveymonkey.com/r/Preview/?sm=V6gQbbOKn3NoPKfYKHjAKu_2BBCdtXXsTS2pf1BIdARccEtJQqlu1KFB2j2TcF0MCn) - [Software Carpentry post-workshop survey](https://www.surveymonkey.com/r/Preview/?sm=uN5QPa4MbF1_2BB1plbLWnL1ZUc7Nttqici0Nc0e3G4RahMwwGW5NUp4U5PKQDYmky) - [Data Carpentry pre-workshop survey](https://www.surveymonkey.com/r/Preview/?sm=zdE7x498WxTrpyiD6WEQJaspyjn2T7djLpBg2pc36ylXiMCwflbQtv6puqE01NB4) - [Data Carpentry post-workshop survey](https://www.surveymonkey.com/r/Preview/?sm=Mrj4bb21g1tgjNuilRh0cOT5mrUI7P2KQPzKG6FqkomqgWhHqR_2BsNWTJLHGif1VF) - [Library Carpentry pre-workshop survey](https://www.surveymonkey.com/r/lcpreworkshopsurvey?workshop_id=) - [Library Carpentry post-workshop survey](https://www.surveymonkey.com/r/lcpostworkshopsurvey?workshop_id=)

source: > ## Timing Matters
uk: > ## Вибір оптимального моменту

source: > We've found that learners are much more likely to fill out the post-workshop survey
uk: Ми виявили, що слухачі значно більш схильні заповнити післясемінарське опитування,

source: > while they're still at the workshop than they are after they leave the venue. At the end
uk: коли вони все ще перебувають на семінарі, ніж після того, як вони покинуть місце його проведення. По завершенні

source: > of a two-day workshop, your learners' brains will be very tired. Rather than trying to
uk: дводенного семінару мозки ваших слухачів будуть дуже виснажені. Замість того, щоб намагатися

source: > fit in another 15 minutes worth of teaching, give your learners time to complete the
uk: вкласти ще 15 хвилин навчання, дайте своїм учням час заповнити

source: > post-workshop survey at the end of your workshop. You'll be helping them (they get a
uk: післясемінарське опитування в кінці семінару. Ви допоможете їм (вони

source: > bit of a rest), yourself (you'll get more useful feedback), and the Carpentries.
uk: трохи відпочинуть), собі (отримаєте більш цінний відгук) і Carpentries.

source: ## Minute Cards
uk: ## Хвилинні картки

source: Before each lunch break and at the end of the first day, we use sticky notes as *minute cards* to get anonymous feedback from learners. Learners write one positive thing on their blue sticky note, and one negative thing on their yellow one. Instructors can change the prompt to elicit different types of feedback at each break.
uk: Перед кожною обідньою перервою та в кінці першого дня ми використовуємо самоклеючі записки як "хвилинні картки" для збору анонімного відгуку від слухачів. Учасники пишуть одну позитивну річ на синій записці та одну негативну річ на жовтій. Інструктори можуть змінювати формулювання запитання, щоб отримати різні типи відгуку перед кожною перервою.

source: **Example "positive" prompts:** - What is the most important thing you learned today. - What new skill are you most excited about using?
uk: **Приклади "позитивних" запитань:** - Що є найважливішим з того, що ви сьогодні вивчили? - Яку нову навичку ви з найбільшим нетерпінням хочете використовувати?

source: **Example "negative" prompts:** - Write down one thing that is confusing and you'd like clarification on. - What is one specific question you have about the material?
uk: **Приклади "негативних" запитань:** - Запишіть одну річ, яка вас збиває з пантелику і ви хотіли б отримати пояснення. - Яке одне конкретне питання у вас є щодо матеріалу?

source: Over lunch and before the second day starts, the instructors read through the minute cards and look for patterns. At the start of day two and each afternoon, the instructors take a few minutes to address commonly raised issues with the whole class. The non-teaching instructor can also type answers to the questions in the Etherpad.
uk: Під час обідньої перерви та перед початком другого дня інструктори перечитують хвилинні картки та шукають загальні тенденції. На початку другого дня та щоразу після обідньої перерви інструктори виділяють кілька хвилин, щоб звернутися до всього класу з найчастіше підніманими питаннями. Асистуючий інструктор також може друкувати відповіді на питання в Etherpad.

source: > ## Be Explicit
uk: > ## Будьте конкретними

source: > Learners are more likely to give useful feedback if they feel that their feedback
uk: Учасники ймовірніше надаватимуть корисний відгук, якщо вони відчувають, що їх відгук

source: > is being taken seriously. Spending a few minutes talking about the feedback you got
uk: отримує серйозну увагу. Витрачення кількох хвилин на обговорення отриманого відгуку

source: > and being explicit about what changes you're making in light of that feedback
uk: та конкретизація змін, які ви зробите на основі цього відгуку,

source: > will encourage learners to continue to give informative feedback throughout the workshop.
uk: заохочуватиме учасників продовжувати надавати інформативний відгук протягом всього семінару.

source: ## One-Up, One-Down
uk: ## Один плюс, один мінус

source: In addition to minute cards, we also ask learners to give us feedback at the end of each day using a technique called "one up, one down". The instructor asks the learners to alternately give one positive and one negative point about the day, without repeating anything that has already been said. This requirement forces people to say things they otherwise might not: once all the "safe" feedback has been given, participants will start saying what they really think. The instructor writes down the feedback in the Etherpad or a text editor, but does not comment on the feedback while collecting it. The instructors then discuss this feedback and how they plan to act on it. Like with minute cards, be explicit about how you're responding to learner feedback.
uk: Окрім хвилинних карток, ми також просимо учасників надавати нам відгук в кінці кожного дня, використовуючи методику під назвою "один плюс, один мінус". Інструктор просить учасників по черзі називати один позитивний та один негативний аспект дня, уникаючи повторень того, що вже було сказано. Ця вимога змушує людей говорити те, що вони можуть у протилежних обставинах утримувати: коли всі "безпечні" відгуки вже сказано, учасники починають висловлювати свою дійсну думку. Інструктор записує отриманий відгук у примітках Etherpad або текстовому редакторі, проте не коментує його під час збору. Потім інструктори обговорюють цей відгук та як планують діяти на його основі. Так само, як з хвилинними картками, будьте конкретними щодо того, як ви реагуєте на відгуки слухачів.

source: > ## Give Us Feedback
uk: > ## Надайте нам відгук

source: > > Write one thing you learned this morning that you found useful on > your blue sticky note, and one question you have about the material > on the yellow. Do *not* put your name on the notes: this is meant to > be anonymous feedback. Add your notes to the pile by the door as > you leave for lunch.
uk: Напишіть на синій самоклейкій записці одну корисну річ, яку ви вивчили сьогодні вранці, і на жовтій - одне питання, яке у вас є стосовно матеріалу. Не пишіть свого імені на записках: це анонімний відгук. Покладіть свої записки до стопки біля дверей, коли ви йдете на обід.
