Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/11__08-motivation.md.po
Languages: uk

source: --- title: "Motivation and Demotivation" block: "Creating a Positive Learning Environment" teaching: 30 exercises: 45 questions: - "Why is motivation important?" - "How can we create a motivating environment for learners?" objectives: - "Identify authentic tasks and explain why teaching using them is important." - "Develop strategies to avoid demotivating learners." - "Recognize and overcome imposter syndrome in yourself and your learners." keypoints: - "A positive learning environment helps people concentrate on learning." - "People learn best when they see the utility in what they're learning, so teach what's most immediately useful first." - "Imposter syndrome is a powerful force, but can be overcome." - "Accessibility benefits everyone." ---
uk: --- title: "Мотивація та демотивація" block: "Створення позитивного навчального середовища" teaching: 30 exercises: 45 questions: - «Чому важлива мотивація?» - «Як ми можемо створити мотиваційне середовище для слухачів?» цілі: - «Визначте автентичні завдання та поясніть, чому навчання з їх використанням є важливим». - «Розробіть стратегії, щоб уникнути демотивації слухачів». - «Розпізнайте та подолайте синдром самозванця в собі та своїх слухачах». Ключові моменти: - «Позитивне навчальне середовище допомагає людям зосередитися на навчанні». - «Люди вчаться найкраще, коли бачать користь у тому, що вони вивчають, тому спочатку навчайте того, що є найбільш корисним». - «Синдром самозванця - потужна сила, але її можна подолати». - «Доступність приносить користь усім». ---

source: In the morning we covered some educational research and how we can apply it to teaching Carpentries workshops. Part of this afternoon will cover another important aspect of being a Carpentries instructor: fostering a positive learning environment.
uk: Вранці ми розглянули деякі освітні дослідження та те, як ми можемо їх застосувати для викладання семінарів Carpentry. Розглянемо тепер ще один важливий аспект роботи інструктора Carpentry: формування позитивного навчального середовища.

source: This section discusses typical ways that learners are motivated (and can be demotivated!) and provides practice opportunities for you to become confident in motivating your learners.
uk: У цьому розділі розглядаються типові способи мотивації (або демотивації) слухачів і надаються можливості для практики, щоб ви могли впевнено мотивувати своїх слухачів.

source: ## Creating A Positive Learning Environment
uk: ## Створення позитивного навчального середовища

source: Creating a positive learning environment is an important first step to setting the stage for learner success. As instructors, it is crucial to establish the workshop setting as a safe space for learning. Establishing a safe space for learning is a combination of many factors:
uk: Створення позитивного навчального середовища є важливим першим кроком на шляху забезпечення успіху слухача. Інструкторам дуже важливо налаштувати семінар як безпечний простір для навчання. Створення безпечного простору для навчання є поєднанням багатьох факторів:

source: + *Presenting the instructor as a learner*. Admitting that you don't know everything is part of showing that it is acceptable to make mistakes, and encouraging a growth mindset in learners (we'll talk much more about growth mindset in [a later lesson]({{ page.root }}/09-mindset/)). Using [participatory live coding]({{ page.root }}/14-live/), our chosen method for teaching concepts, is very useful for this reason. It is common to make errors while coding. When done well, these errors can be very instructive for novice learners.
uk: + *Подання інструктора як учня*. Визнання того, що ви знаєте не все, є частиною демонстрації того, що робити помилки прийнятно, і це заохочує до розвитку мислення слухачів (ми поговоримо більше про розвиток мислення [пізніше]({{ page.root }}/09-mindset/)). Тому використання [активного кодування за участю]({{ page.root }}/14-live/) в рамках обраного нами методу викладання концепцій, є дуже корисним. Під час кодування часто допускаються помилки. При правильному виконанні ці помилки можуть бути дуже повчальними для початківців.

source: + *Establishing norms for interaction*. This can be done by having, discussing, and enforcing a [Code of Conduct](https://docs.carpentries.org/topic_folders/policies/code-of-conduct.html) or by having rules of interaction such as ensuring turn taking in discussions, possibly by passing around a talking stick, or by encouraging quieter people to contribute.
uk: + *Встановлення норм взаємодії*. Це можна зробити шляхом наявності, обговорення та дотримання [Кодексу поведінки](https://docs.carpentries.org/topic_folders/policies/code-of-conduct.html) або встановлення правил взаємодії, таких як забезпечення черги брати участь у дискусіях, можливо, передаючи паличку для розмови або заохочуючи небагатослівних людей до участі.

source: + *Encouraging learners to learn from each other*. Acknowledge that some of the material can be difficult and that they will learn more working together. Asking more advanced learners to help beginner learners is a good way to maximize learning for both.
uk: + *Заохочення слухачів вчитися один в одного*. Визнайте, що частина матеріалу може бути складною і що вони дізнаються більше, працюючи разом. Попросить досвідчених слухачів допомогти початківцям — це хороший спосіб максимізувати навчання для всіх.

source: + *Acknowledging when learners are confused.* Understanding why learners are confused provides useful feedback for instructors. We use formative assessments to pinpoint learners' misunderstandings. Acknowledging that their misunderstandings are valid is also key to encouraging a growth mindset.
uk: +*Визначення, коли слухачі плутаються.* Розуміння того, чому слухачі плутаються, забезпечує корисний зворотний зв’язок для викладачів. Ми використовуємо формуюче оцінювання, щоб виявити нерозуміння слухачів. Визнання того, що їхні непорозуміння є дійсними, також є ключовим фактором для заохочення мислення до зростання.

source: ## Teach Most Useful First
uk: ## Спочатку навчіть найкориснішому

source: One way to build a positive classroom environment is to create a space that cultivates and encourages learners' motivations.
uk: Один із способів створити позитивне середовище в класі – створити простір що розвиває та заохочує мотивацію слухачів.

source: People learn best when they care about a topic and believe they can master it. Many scientists might know vaguely the value of programming but find it intimidating, and struggle with how to get started. This presents us with a problem because believing that something will be hard to learn often becomes a self-fulfilling prophecy.
uk: Люди вчаться найкраще, коли їм цікава якась тема, і вони вірять, що можуть її опанувати. Багато вчених можуть смутно знати цінність програмування, але вважати, що це лякає, і важко зрозуміти, як почати. Це створює для нас проблему, оскільки коли ми віримо, що щось буде важко вивчити, це часто стає пророцтвом, що самореалізується.

source: We have therefore adopted a "teach most immediately useful first" approach. We try to have learners do something that *they* think is useful in their daily work within 15 minutes of starting each lesson. This not only motivates them, it also helps build their confidence in us, so that if it takes longer to get to something they find useful in a later topic, they'll persist with the lesson.
uk: Тому ми прийняли підхід «спочатку навчайте найкориснішому». Ми намагаємося, щоб слухачі робили те, що *вони* вважають корисним у своїй щоденній роботі протягом 15 хвилин після початку кожного семінару. Це не тільки мотивує їх, це також допомагає зміцнити їхню довіру до нас, тому, якщо знадобиться більше часу, щоб дістатися до чогось, що вони вважають корисним у наступній темі, вони будуть наполягати на навчанні.

source: To do this, we as instructors need to go through the work of identifying what to teach first (or at all!). Imagine a graph whose axes are labelled "mean time to master" and "usefulness once mastered". Everything that's quick to master, and immediately useful should be taught first; things in the opposite corner that are hard to learn and have little near-term application don't belong in our workshops.
uk: Для цього нам як інструкторам потрібно виконати роботу по ідентифікації того, чому навчати спочатку (або взагалі!). Уявіть собі графік, вісі якого позначено як «середній час освоєння» та «корисність після освоєння». Усьому, що швидко засвоюється і що відразу стає корисним, слід навчити спочатку; а в протилежному кутку графіка зібрані речі, які важко вивчити і які не мають практичного сенсу, і тому не вивчаються на наших семінарах.

source: ![What to Teach](../fig/what-to-teach.png)
uk: ![Що вивчати](../fig/what-to-teach.png)

source: Another way to think about the graph shown above is "authentic tasks." An authentic task is exactly what it sounds like -- a real task performed by someone doing their work. If you can identify authentic tasks from your own work that could be useful to others, these examples will be highly motivating.
uk: Інший спосіб подумати про графік, показаний вище, це "автентичні завдання". Автентичне завдання – це саме те, як воно звучить – справжнє завдання, яке виконує хтось як свою повсяденну роботу. Якщо ви можете визначити автентичні завдання з вашої власної роботи, яка могла б бути корисною іншим, ці приклади будуть надзвичайно мотивуючими.

source: > ## Authentic Tasks: Think, Pair, Share
uk: > ## Автентичні завдання: поміркуйте, об’єднайте в пари, поділіться

source: > > **Think** about some task you did this week that uses one or more of the skills we teach, > (e.g. wrote a function, bulk downloaded data, built a plot in R, forked a repo) > and explain how you would use it (or a simplified version of it) as an exercise or example in class. > **Pair** up with your neighbor and decide where this exercise fits on a graph of "short/long time to master" and "low/high usefulness". > In the class Etherpad, **share** the task and where it fits on the graph. > As a group, we will discuss how these relate back to our "teach most immediately useful first" approach. > > This exercise and discussion should take about 10 minutes.
uk: > >**Подумайте** про якесь завдання, яке ви виконували цього тижня, де застосвувались одна чи декілька навичок, яким ми навчаємо, > (наприклад, написав функцію, масово завантажив дані, побудував графік у R, розгалужив репо) > і поясніть, як би ви використовували це завдання (або його спрощену версію) як вправу чи приклад на семінарі. > **Об’єднайтеся** в пари зі своїм сусідом і вирішіть, де це завдання поміщається на графіку «короткий/довгий час на засвоєння» та «низька/висока корисність». > У класі Etherpad **поділіться** завданням і місцем його розміщення на графіку. > У групі ми обговоримо, як це пов’язано з нашим підходом «спочатку навчити найкориснішому». > > Ця вправа та обговорення мають тривати приблизно 10 хвилин.

source: > ## Actual Time
uk: > ## Фактичний час

source: > > Any useful estimate of how long something takes to master must take into account > how frequent failures are > and how much time is lost to them. > For example, > editing a text file seems like a simple task, > but most graphical editors save things to the user's desktop or home directory. > If people need to run shell commands on the files they've edited, > a substantial fraction won't be able to navigate to the right directory without help. > If this seems like a small problem to you, > please revisit the discussion of [expert blind spot]({{ page.root }}{% link _episodes/03-expertise.md %}#expertise-and-teaching).
uk: > > Необхідно враховувати будь-яку корисну оцінку того, скільки часу потрібно для освоєння чогось, > наскільки часті збої, > і скільки часу на них втрачається. > Наприклад, > редагування текстового файлу здається простим завданням, > але більшість графічних редакторів зберігають дані на робочому столі користувача або в домашньому каталозі. > Якщо людям потрібно виконати команди оболонки для файлів, які вони редагували, > значна частина не зможе без сторонньої допомоги перейти до потрібного каталогу. > Якщо це здається вам невеликою проблемою, > перегляньте обговорення [сліпа пляма експерта]({{ page.root }}{% link _episodes/03-expertise.md %}#expertise-and-teaching).

source: ## Other Motivational Strategies
uk: ## Інші мотиваційні стратегії

source: In addition to teaching things that will make our learners' lives easier and focusing on authentic tasks, there are a number of other strategies we can use to motivate learners.
uk: На додаток до навчання речам, які зроблять життя наших слухачів легшим і зосередженим на автентичних завданнях, існує ряд інших стратегій, які ми можемо використовувати для мотивації слухачів.

source: > ## Strategies for Motivating Learners
uk: > ## Стратегії мотивації слухачів

source: > > *[How Learning Works][worldcat-hlw]* by Susan Ambrose, et al., > contains this list of evidence-based methods to motivate learners. > > In groups of two or three, pick three of these points and briefly describe > in the Etherpad how we can apply these strategies in our workshops. > > * Strategies to Establish Value > 1. Connect the material to learners' interests. > 2. Provide authentic, real-world tasks. > 3. Show relevance to learners' current academic lives. > 4. Demonstrate the relevance of higher-level skills to learners' future professional lives. > 5. Identify and reward what you value. > 6. Show your own passion and enthusiasm for the discipline. > * Strategies to Build Positive Expectations > 1. Ensure alignment of objectives, assessments, and instructional strategies. > 2. Identify an appropriate level of challenge. > 3. Create assignments that provide an appropriate level of challenge. > 4. Provide early success opportunities. > 5. Articulate your expectations. > 6. Provide rubrics. > 7. Provide targeted feedback. > 8. Be fair. > 9. Educate learners about the ways we explain success and failure. > 10. Describe effective study strategies. > * Strategies for Self-Efficacy > 1. Provide learners with options and the ability to make choices. > 2. Give learners an opportunity to reflect. > > This exercise and discussion should take about 5 minutes.
uk: > >*[Як працює навчання][worldcat-hlw]* Сьюзен Амброуз та ін., > містить список заснованих на фактах методів мотивації слухачів, наведений нижче. > > Об’єднавшись у групи по два або три учасники, виберіть три з цих пунктів і коротко опишіть > в Etherpad, як можна застосувати ці стратегії на наших семінарах. > > * Стратегії встановлення цінності > 1. Пов’яжіть матеріал з інтересами учнів. > 2. Забезпечуйте автентичні, реальні завдання. > 3. Покажіть актуальність для поточного академічного життя слухачів. > 4. Продемонструйте актуальність навичок вищого рівня для майбутнього професійного життя слухачів. > 5. Визначайте та винагороджуйте те, що ви цінуєте. > 6. Проявіть власну пристрасть та ентузіазм щодо дисципліни. > * Стратегії формування позитивних очікувань > 1. Забезпечте узгодження цілей, оцінювання та навчальних стратегій. > 2. Визначте відповідний рівень виклику. > 3. Створюйте завдання, які забезпечують відповідний рівень виклику. > 4. Надайте можливості для раннього успіху. > 5. Сформулюйте свої очікування. > 6. Надайте рубрики. > 7. Надайте цілеспрямований зворотний зв'язок. > 8. Будьте чесним. > 9. Розкажіть слухачам, як ми пояснюємо успіх і невдачу. > 10. Опишіть ефективні стратегії навчання. > * Стратегії самоефективності > 1. Надайте слухачам варіанти та можливість робити вибір. > 2. Дайте слухачам можливість поміркувати. > > Ця вправа та обговорення мають тривати близько 5 хвилин.

source: > ## Provide an Example
uk: > ## Наведіть приклад

source: > > Insert a personal story here about how you establish value in the classroom. > > Or, insert an example story about establishing value, which goes like this: > > "In the [SWC Unix "Finding Things" episode](http://swcarpentry.github.io/shell-novice/07-find/), > a haiku is used to to teach grep. > This is a great didactic tool, but it can be hard for learners to see how it applies to research. > After the didactic example, I connect my bioinformatics users with domain-specific examples by showing > [a list of one-line unix commands](https://wikis.utexas.edu/display/bioiteam/Scott's+list+of+linux+one-liners) > consisting of `grep`, `sort`, `head`, and `uniq` to explore biological sequence data. > This emphasizes how they can apply what they learned with haikus to real bioinformatics research problems."
uk: > > Вставте тут особисту історію про те, як ви створюєте цінність в аудиторії. > > Або вставте приклад історії про встановлення цінності, яка виглядає так: > > "У [серії SWC Unix "Finding Things"] (http://swcarpentry.github.io/shell-novice/07-find/), > хокку використовується для навчання утіліті grep. > Це чудовий дидактичний інструмент, але слухачам може бути важко зрозуміти, як його можна застосувати до дослідження. > Після дидактичного прикладу я поєдную моїх користувачів - біоінформатиків з прикладами, що стосуються конкретної області застосування, пропонуючи > [список однорядкових команд Unix](https://wikis.utexas.edu/display/bioiteam/Scott's+list+of+linux+one-liners), > що складається з `grep`, `sort`, `head` і `uniq` для дослідження даних біологічної послідовності. > Це підкреслює, як вони можуть застосувати те, що вони дізналися за допомогою хокку, до реальних проблем дослідження біоінформатики".

source: > ## Brainstorming Motivational Strategies
uk: > ## Мотиваційні стратегії мозкового штурму

source: > > *Think* back to a computational (or other) course you took in the past, and > identify one thing the instructor did that motivated you. > *Pair* up with your neighbor and discuss what motivated you. > *Share* the motivational story in the Etherpad. > > This exercise should take about 5 minutes.
uk: > > *Згадайте* курс з програмування (або інший) , який ви пройшли в минулому, і > визначте одну річ, яку вчитель зробив і яка мотивувала вас. > *Об’єднайтеся в пари* зі своїм сусідом і обговоріть, що вас мотивувало. > *Поділіться* мотиваційною історією в Etherpad. > > Ця вправа займає близько 5 хвилин.

source: > ## Not Just Learners
uk: > ## Не просто учні

source: > > What's missing from this list is strategies to motivate the *instructor*. > As we said in the introduction, > learners respond to an instructor's enthusiasm, > and instructors need to care about a topic in order to keep teaching it, > particularly when they are volunteers.
uk: > > У цьому списку не вистачає стратегій мотивації *інструктора*. > Як ми сказали у вступі, > слухачі реагують на ентузіазм викладача, > і викладачі мають піклуватися про курс, щоб продовжувати його викладати, > особливо коли вони є волонтерами.

source: > ## Why Do You Teach? (Optional)
uk: > ## Чому ви вчите? (необов'язково)

source: > > We all have a different motivation for teaching, and that is a really good thing! > The Carpentries want instructors with diverse backgrounds because you each bring something > unique to our community. > > What motivates you to teach? Write a short explanation of what motivates you to teach. > Save this as part of your teaching philosophy for future reference. > > This exercise should take about 5 minutes.
uk: > > Ми всі маємо різну мотивацію до викладання, і це справді добре! > У Carpentry потрібні інструктори з різним досвідом, тому що кожен із вас щось приносить > унікальне для нашої спільноти. > > Що спонукає вас викладати? Напишіть коротке пояснення того, що спонукає вас викладати. > Збережіть це як частину вашої філософії навчання для використання в майбутньому. > > Ця вправа займає близько 5 хвилин.

source: ## How Not to Demotivate Your Learners
uk: ## Як не демотивувати своїх слухачів

source: Motivation can go both ways. Besides using strategies to motivate learners, one of our additional challenges as instructors is to not **demotivate** participants through our words or actions. None of us goes into a workshop with the intention of creating a hostile environment or making the learners hate the tools we're teaching, but we can all accidentally do just that if we don't pay attention to what we say and how we interact with our learners. We'll discuss some common demotivators and help you develop strategies for avoiding them.
uk: Мотивація може бути двох типів. Окрім використання стратегій для мотивації слухачів, один із наших додаткових викликів як інструкторів полягає в тому, щоб не **демотивувати** учасників своїми словами чи діями. Ніхто з нас не входить семінар з наміром створити вороже середовище або заставити слухачів ненавидити інструменти, яким навчаємо, але всі ми можемо випадково зробити це, якщо не звернемо увагу на те, що ми говоримо і як ми взаємодіємо з нашими слухачами. Ми обговоримо деякі загальні демотиватори та допоможемо вам розробити стратегії їх уникнення.

source: > ## Brainstorming Demotivational Experiences
uk: > ## Демотиваційний досвід мозкового штурму

source: > > *Think* back to a time when you were demotivated as a student (or when you demotivated a student). > *Pair* up with your neighbor and discuss what could have been done differently in the situation to make it not demotivating. > *Share* your story in the Etherpad. > > If time, what themes do you see among the stories? What are positive actions you could take to avoid these? > > This exercise should take about 5 minutes.
uk: > > *Згадайте* той час, коли ви були демотивовані як студент (або коли ви демотивували студента). > *Об’єднайтеся в пари* зі своїм сусідом і обговоріть, що можна було б зробити по-іншому в цій ситуації, щоб уникнути демотивації. > *Поділіться* своєю історією в Etherpad. > > Якщо є час, то розгляньте, які теми ви бачите серед наданих історій? Які позитивні дії ви могли б зробити, щоб цього уникнути? > > Ця вправа займає близько 5 хвилин.

source: ### Things You Shouldn't Do in a Workshop
uk: ### Чого не варто робити під час семінару

source: * Tell learners they are rubbish because they use Excel and/or Word,
uk: * Говорити слухачам, що це маячня використовувати Excel та/або Word,
