Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/11__08-motivation.md.po
Languages: uk

source: don't modularize their code, etc. * Say negative things about Windows and praise Linux, e.g., say that the former is for amateurs. * Criticize GUI applications (and by implication their users) and describe command-line tools as the One True Way. * Talk contemptuously or with scorn about any tool. Regardless of its shortcomings, many of your learners may be using that tool. Convincing someone to change their practices is much harder when they think you disdain them. * Dive into complex or detailed technical discussion with the one or two people in the audience who clearly don't actually need to be there. * Pretend to know more than you do. People will actually trust you more if you are frank about the limitations of your knowledge, and will be more likely to ask questions and seek help. * Use the J word ("just") or other demotivating words we talked about in a [previous lesson]({{ page.root }}/03-expertise/). These signal to the learner that the instructor thinks their problem is trivial and by extension that they therefore must be stupid for not being able to figure it out. * Take over the learner's keyboard. It is rarely a good idea to type anything for your learners. Doing so can be demotivating for the learner (as it implies you don't think they can do it themselves or that you don't want to wait for them). It also wastes a valuable opportunity for your learner to develop muscle memory and other skills that are essential for independent work. * Feign surprise. Saying things like "I can't believe you don't know X" or "You've never heard of Y?" signals to the learner that they do not have some required pre-knowledge of the material you are teaching, that they don't belong at the workshop, and it may prevent them from asking questions in the future. (For more on this see the Recurse Center's [Social Rules][recurse-social-rules]).
uk: не модулювати свій код тощо. * Говорити негативно про Windows і хвалити Linux, наприклад, сказати, що перша ОС - для любителів. * Критикувати програми з графічним інтерфейсом (і, відповідно, користувачів цих програм) і описувати інструменти командного рядка як єдиний вірний шлях. * Говорити зневажливо або з презирством про будь-який інструмент. Незалежно від його недоліків багато ваших слухачів можуть використовувати цей інструмент. Переконувати когось змінити свою практику набагато важче, якщо вони думають, що ти ними зневажаєш. * Занурюватися в складну або детальну технічну дискусію з одним або двома слухачами в аудиторії, якій це явно не потрібно * Робити вигляд, що знаєте більше, ніж є насправді. Люди дійсно довірятимуть вам більше, якщо ви відверто говорите про обмеженість своїх знань, і з більшою ймовірністю ставитимуть запитання та шукатимуть допомоги. * Використовувати слово J ("просто") або інші демотивуючі слова, про які ми говорили у [попередньому епізоді]({{ page.root }}/03-expertise/). Вони сигналізують слухачеві, що інструктор вважає, що їхня проблема тривіальна і, відповідно, вони повинні бути дурними, тому що не змогли це зрозуміти. * Брати до себе клавіатуру слухача. Рідко буває гарною ідеєю друкувати щось для своїх слухачів. Це може демотивувати слухача (оскільки це означає, що ви не думаєте, що він може зробити це сам або що ви не хочете їх чекати). Слухач також втрачає цінну можливість розвивати м’язову пам’ять та інші навички, необхідні для самостійної роботи. * Удавати здивування. Говорити такі речі, як "Я не можу повірити, що ти не знаєш X" або "Ви ніколи не чули про Y?" означає надати слухачам сигнал, що вони не мають певні необхідні попередні знання матеріалу, який ви викладаєте, тому вони не відповідають рівню семінару, і це може перешкодити їм ставити запитання у подальшому. (Щоб дізнатися більше про це, перегляньте [Соціальні правила][recurse-social-rules] Центру рекурсів).

source: It can be difficult to avoid these demotivators entirely. Some people are so used to making fun of Windows-users with their friends, or talking about how terrible Excel is that they initially fail to realize they're doing it while teaching. Teaching yourself to avoid these types of comments takes practice, but is well worth the effort. No one likes to be made fun of, and talking badly about people who use GUIs, or who aren't writing their thesis in LaTeX is unlikely to make them excited about learning your favorite scripting language.
uk: Буває важко повністю уникнути цих демотиваторів. Деякі люди так звикли висміювати користувачів Windows з друзями або говорити про те, який жахливий Excel що вони спочатку не усвідомлюють, що роблять це під час навчання. Щоб навчитися уникати таких коментарів, потрібна практика, але це варте зусиль. Ніхто не любить бути об'єктом жартів, і погано говорити про людей, які використовують GUI, або не використовують LaTeX для написання дипломної роботи, навряд чи надихне їх вивчати вашу улюблену мову сценаріїв.

source: ## Systemic and Psychological Demotivators
uk: ## Системні та психологічні демотиватори

source: As instructors, we can learn to avoid talking disparagingly about our learners' choice of text editors and levels of technical knowledge. There are other factors, however, that contribute to demotivation, some of which are either systemic, or built into our psychological makeup as human beings. We can't always control these demotivators - often they come from outside classrom - but we can be aware of them, and take certain actions to lessen their impact by thinking carefully about the language that we use and how we interact with our learners.
uk: Як інструктори, ми можемо навчитися уникати зневажливих розмов про вибір текстових редакторів та рівні технічних знань наших слухачів. Однак існують інші фактори, які сприяють демотивації, деякі з них є або системними, або вбудованими в наш психологічну свідомість. Ми не можемо завжди контролювати ці демотиватори - часто вони надходять ззовні, - але ми можемо пам’ятати про них і вживати певних дій, щоб зменшити їх вплив, ретельно продумавши мову, якою ми користуємося, і те, як ми взаємодіємо з нашими слухачами.

source: ### Stereotype Threat
uk: ### Загроза стереотипу

source: One major psychological demotivator is *stereotype threat*. Reminding people of negative stereotypes, even in subtle ways, can make them anxious about the risk of confirming those stereotypes, in turn reducing their performance. This is called *[stereotype threat][wikipedia-stereotype-threat]*, and the clearest examples in computing are gender-related. Depending on whose numbers you trust, only 12-18% of programmers are women, and those figures have actually been getting worse over the last 20 years. There are many reasons for this (see Margolis and Fisher's *[Unlocking the Clubhouse][worldcat-clubhouse]* and Margolis's *[Stuck in the Shallow End][worldcat-shallow-end]*). Steele's *[Whistling Vivaldi][worldcat-whistling-vivaldi]* summarizes what we know about stereotype threat in general and presents some strategies for mitigating it in the classroom.
uk: Одним з основних психологічних демотиваторів є *загроза стереотипу*. Нагадуючи людям про негативні стереотипи, можна, навіть непомітно, викликати у них занепокоєння щодо ризику підтвердження цих стереотипів, у свою чергу погіршуючи їх якість їх виконання. Це називається *[загроза стереотипу][wikipedia-stereotype-threat]*, і найяскравіші приклади в програмуванні є гендерними. Залежно від того, якій статистиці ви довіряєте, лише 12-18% програмістів – жінки, і ці цифри фактично погіршуються протягом останніх 20 років. На це є багато причин (див. публікації Марголіса та Фішера *[Unlocking the Clubhouse][worldcat-clubhouse]* і Марголіса *[Stuck in the Shallow End][worldcat-shallow-end]*). Публікація К. Стила *[Whistling Vivaldi][worldcat-whistling-vivaldi]* узагальнює те, що ми знаємо про загрозу стереотипів в цілому, і представляє деякі стратегії її пом’якшення в аудиторії.

source: While there's lots of evidence that unwelcoming climates demotivate members of under-represented groups, it's not clear that stereotype threat is the underlying mechanism. Part of the problem is that [the term has been used in many ways][shapiro-neuberg-stereotype-threat]. Another is that there are [questions about the replicability of key studies][jussim-stereotype-threat]. What *is* clear is that we need to avoid thinking in terms of a deficit model (i.e., we need to change the members of under-represented groups because they have some deficit, such as lack of prior experience) and instead use a systems approach (i.e., we need to change the system because it produces these disparities). We can also not highlight people based on their identity with a minority group; for example, it's not a good idea to say something like "I'm so glad you're here because we don't get enough women in programming." That may sound positive, but draws attention to the stereotype that women aren't good at programming.
uk: Хоча є багато доказів того, що несприятливий клімат демотивує членів недостатньо представлених груп, не є очевидним, що стереотипна загроза є основним механізмом. Частина проблеми полягає в наступному [термін використовувався багатьма способами][шапіро-нойберг-стереотип-загроза]. Інша частина проблеми викликана існуванням [питань щодо відтворюваності ключових досліджень][jussim-stereotype-threat]. Що *очевидно*, так це те, що нам потрібно уникати мислення в рамках моделі дефіциту (тобто нам потрібно замінити членів недостатньо представлених груп, оскільки вони мають певний дефіцит, наприклад відсутність попереднього досвіду) і натомість використовувати системний підхід (тобто нам потрібно змінити систему, оскільки вона створює ці розбіжності). Ми також не можемо виділяти людей на основі їхньої приналежності до групи меншин; наприклад, не варто говорити щось на зразок «Я дуже радий, що ти тут, тому що у нас недостатньо жінок у програмуванні". Це може здатися позитивним, але звертає увагу на стереотип про те, що жінки погано вміють програмувати.

source: > ## Never Learn Alone
uk: > ## Ніколи не навчайся самотужки

source: > > One way to support at-risk learners of all kinds is to ask people to sign up for workshops in small teams > rather than as individuals when possible. > If an entire lab group comes, > or if attendees are drawn from the same (or closely-related) disciplines, > everyone in the room will know in advance > that they will be with at least a few people they trust, > which increases the chances of them actually coming. > Furthermore, > if people attend a workshop with their labmates, it's more likely they will > work together to implement what they've learned after the workshop has ended.
uk: > Один із способів підтримати слухачів із груп ризику – це попросити людей записатися на семінари невеликими командами > а не як окремі особи, коли це можливо. > Якщо приходить ціла лабораторна група, > або якщо учасники зібрані з тих самих (або тісно пов’язаних) напрямів діяльності, > всі в аудиторії будуть знати заздалегідь > що вони навчатимуться принаймні з кількома людьми, яким довіряють, > що збільшує шанси на їх участь в навчанні. > Крім того, > якщо люди відвідають семінар зі своїми колегами по лабораторії, то цілком ймовірно, що вони > працюватимуть разом, щоб реалізувати те, чому вони навчилися, після закінчення семінару.

source: ### Impostor Syndrome
uk: ### Синдром самозванця

source: Another major psychological demotivator is *[impostor syndrome][wikipedia-impostor-syndrome]*. Imposter syndrome is the belief that one is not good enough for a job or position, and that one's achievements are due to luck rather than talent or skill. This is also accompanied by the fear of being "found out".
uk: Ще одним важливим психологічним демотиватором є *[синдром самозванця][wikipedia-impostor-syndrome]*. Синдром самозванця - це чиєсь переконання, що він недостатньо підходить для певної роботи чи посади, і що своїх успіхів досяг завдяки удачі, а не таланту чи вмінню. Це також супроводжується страхом бути «розкритим».

source: Academic work is frequently undertaken alone or in small groups but the results are shared and criticized publicly. In addition, we rarely see the struggles of others, only their finished work, which can feed the belief that everyone else finds it easy. Women and minority groups, who already feel additional pressure to prove themselves in some settings, [may be particularly affected][high-achieving-women].
uk: Навчальна робота часто виконується одноосібно або в малих групах, але результати розголошуються та критикуються публічно. До того ж, ми рідко бачимо складність процесу виконання для інших, лише їх завершену роботу, яка може живити віру в те, що кожен виконав це легко. Жінки та групи меншин, які вже відчувають додатковий тиск, щоб проявити себе в певних умовах [можуть особливо постраждати] [high-achieving-women].

source: Two ways of dealing with your own impostor syndrome are:
uk: Два способи впоратися з власним синдромом самозванця, є такими:

source: 1. Ask for feedback from someone you respect and trust.
uk: 1. Попросіть зворотній зв'язок у того, кого ви поважаєте та якому довіряєте.

source: Ask them for their honest thoughts on your strengths and achievements, and commit to believing them. 2. Look for role models. Who do you know who presents as confident and capable? Think about how they conduct themselves. What lessons can you learn from them? What habits can you borrow? (Remember, they quite possibly also feel as if they are making it up as they go.)
uk: Запитайте їх відверту думку про ваші сильні сторони та досягнення, і візьміть на себе зобов’язання вірити їм. 2. Шукайте зразки для наслідування. Хто, кого ви знаєте, є впевненим в собі і здібним? Проаналізуйте, як вони себе поводять. Які уроки ви можете з цого винести? Які звички можна запозичити? (Пам’ятайте, що вони цілком можливо також відчувають, ніби вони вигадують це на ходу.)

source: As an instructor, you can help people with their impostor syndrome by sharing stories of mistakes that you have made or things you struggled to learn. This reassures the class that it's OK to find topics difficult. Being open with the group makes it easier to build trust and make learners confident to ask questions. (Live coding is great for this: typos let the class see you're not superhuman.)
uk: Як інструктор, ви можете допомогти людям із синдромом самозванця ділитися історіями про помилки, які ви зробили, або про те, чому вам було важко навчитися. Це запевняє клас, що вважати поточні теми складними для вивчення – це нормально. Відкритість у групі полегшує встановлення довіри та дозволяє студентам впевнено ставити запитання. (Для цього чудово підходить кодування безпосередньо в аудиторії: можуть бути помилки, нехай аудиторія побачить, що ти не надлюдина.)

source: You can also emphasize that you want questions: you are not succeeding as a teacher if no one can follow your class, so you're asking learners to help you learn and improve. Remember, it's much more important to *be* smart than to *look* smart.
uk: Ви також можете підкреслити, що вам потрібні запитання: ви не досягнете успіху як вчитель, якщо ніхто не зможе сприйняти ваше навчання, тому ви просите учнів допомогти вам навчатися та вдосконалюватися. Пам'ятайте, набагато важливіше *бути* розумним, ніж *виглядати* розумним.

source: The Ada Initiative has [some excellent resources][ada-initiative-resources] for teaching about and dealing with imposter syndrome.
uk: Ініціатива Ада має [кілька чудових ресурсів][ada-initiative-resources] для навчання та боротьби з синдромом самозванця.

source: > ## Overcoming Imposter Syndrome (Optional)
uk: > ## Подолання синдрому самозванця (опціонально)

source: > > Think of a time when learning something was difficult for you, or > you made a mistake that seemed silly or embarrassing. Is that task still hard for you? > In the Etherpad, describe how you might use this as a motivational story to help your learners > overcome their own imposter syndrome. > > This exercise should take about 5 minutes.
uk: > > Згадайте випадок, коли вам було важко щось вивчити, або > ви зробили помилку, яка здавалася безглуздою або незручною. Для вас це завдання все ще є важким? > У Etherpad опишіть, як ви можете використовувати цей випадок як мотиваційну історію, щоб допомогти своїм слухачам > подолати власний синдром самозванця. > > Ця вправа займає близько 5 хвилин.

source: ### Accessibility Issues
uk: ### Проблеми з доступністю

source: Not providing equal access to lessons and exercises is about as demotivating as it gets. If you look at [our old lesson on Python][swc-python-v4], for example, you'll find that the text beside the slides includes all of the narration---but none of the Python source code. Someone using a [screen reader][wikipedia-screen-reader] would therefore be able to hear what was being said about the program, but wouldn't know what the program actually was.
uk: Не надання рівного доступу до теоретичного материалу та вправ вкрай демотивує. Якщо ви подивитесь на [наш старий урок з Python][swc-python-v4], наприклад, ви побачите, що текст поруч зі слайдами включає весь текст---але жодного вихідного коду Python. Той, хто використовує [зчитувач з екрана][wikipedia-screen-reader] міг би почути, що мова йде про програму, але так і не довідався би, що це за програма насправді.

source: While it may not be possible to accommodate everyone's needs, it *is* possible to get a good working structure in place without any knowledge of what specific disabilities people might have. Having at least some accommodations prepared also makes it clear that hosts and instructors care enough to have thought about problems in advance, and that any additional concerns are likely to be addressed.
uk: Хоча можливо неможливо задовольнити потреби кожного, *можливо* отримати хорошу робочу структуру без будь-яких знань про те, які конкретні вади можуть мати люди. Наявність принаймні деяких підготовлених пристосувань також дає зрозуміти, що організатори та інструктори настільки дбайливі, що заздалегідь подумали про проблеми, і що будь-які додаткові проблеми, ймовірно, будуть вирішені.

source: > ## It Helps Everyone
uk: > ## Це допомагає всім

source: > > [Curb cuts][wikipedia-curb-cuts] > (the small sloped ramps joining a sidewalk to the street) > were originally created to make it easier for wheelchair users to move around, > but proved to be equally helpful to people with strollers and grocery carts. > Similarly, > steps taken to make lessons more accessible to people with various disabilities > also help everyone else. > Proper captioning of images, > for example, > benefits people with no or limited vision by giving screen readers something to say: > but it also makes the images more findable > by exposing their content to search engines.
uk: > > [Curb cuts][wikipedia-curb-cuts] > — невеликі похилі пандуси, що приєднують тротуар до проїжджої частини, > були спочатку створені, щоб полегшити пересування людей на інвалідних візках, > але виявилися однаково корисним для людей з колясками та продуктовими візками. > Так само, > якщо вжити заходів, щоб зробити уроки більш доступними для людей з різними вадами, > можна також допомогти всім іншим. > Правильні підписи до зображень, > наприклад, > приносять користь людям із відсутнім або обмеженим зором, дозволяючи програмам зчитування з екрана щось сказати: > але це також робить зображення доступними для пошуку > шляхом показу їх вмісту пошуковим системам.

source: The first step is to know what you need to do. There are a number of good resources for learning about accessibility.
uk: Перший крок — знати, що вам потрібно зробити. Є кілька хороших ресурсів для навчання про доступність.

source: > ## Learning about Accessibility
uk: > ## Навчання про доступність.

source: > > The [UK Home Office](https://hodigital.blog.gov.uk/category/accessibility/) has put together a set of posters of dos and don'ts for making > visual and web-based materials more accessible for different populations. Take a look at one of > [these posters](https://github.com/UKHomeOffice/posters/blob/master/accessibility/dos-donts/posters_en-UK/accessibility-posters-set.pdf) and > put one thing you've learned in the Etherpad. > > Note: There are [translations](https://github.com/UKHomeOffice/posters/tree/master/accessibility) > available in a number of languages, including Dutch, French, Spanish, Swedish, Portuguese, German, and > Chinese. > > This exercise should take about 5 minutes.
uk: > > [Міністерство внутрішніх справ Великобританії] (https://hodigital.blog.gov.uk/category/accessibility/) зібрало набір постерів із зазначенням того, як зробити > візуальні та веб-матеріали більш доступними для різних груп населення. Подивіться на один із > [цих постерів](https://github.com/UKHomeOffice/posters/blob/master/accessibility/dos-donts/posters_en-UK/accessibility-posters-set.pdf) і > помістіть те, про що ви дізналися, в Etherpad. > > Примітка: є [переклади](https://github.com/UKHomeOffice/posters/tree/master/accessibility) > доступні кількома мовами, зокрема голандською, французькою, іспанською, шведською, португальською, німецькою та > китайською. > > Ця вправа займає близько 5 хвилин.

source: > ## Accessibility and PDFs
uk: > ## Доступність і PDF-файли

source: > > The posters above are in PDF format - which itself can sometimes be inaccessible to people > who use screen readers. If you know of a similar resource describing accessibility guidelines > that would be more accessible than what's linked above, open an issue on our instructor > training curriculum respoistory here: https://github.com/carpentries/instructor-training/issues
uk: > > Наведені вище постери виконані у форматі PDF, який інколи може бути недоступним для людей, > які використовують програми зчитування екрана. Якщо ви знаєте подібний ресурс із описом вказівок щодо доступності, який > єбільш прийнятним, ніж наведений вище, відкрийте проблему на нашому сховищі > навчальних програм інструкторів за адресою: https://github.com/carpentries/instructor-training/issues

source: The [W3C Accessibility Initiative's checklist for presentations][w3c-accessible] is a good starting point focused primarily on assisting the visually impaired, while Liz Henry's blog post about [accessibility at conferences][conference-accessibility] has a good checklist for people with mobility issues, and this [interview with Chad Taylor][deaf-accessibility] is a good introduction to issues faced by those with no or limited hearing.
uk: [Перелік презентацій Ініціативи забезпечення доступності W3C][w3c-accessible] є хорошою відправною точкою, зосередженою насамперед на допомозі людям із вадами зору, тоді як публікація в блозі Ліз Генрі про [доступність на конференціях][доступність конференцій] має хороший перелік для людей з проблемами мобільності, і це [інтерв’ю з Чедом Тейлором][доступність глухих] є хорошим вступом до проблем, з якими стикаються люди, які не чують або мають обмежений слух.

source: The second is to know how well you're doing. For example, sites like [WebAIM][webaim] allow you to check how accessible your online materials are to users with no or limited vision.
uk: Крім того, важливо знати, наскільки добре ви робите. Наприклад, такі сайти, як [WebAIM][webaim], дозволяють перевірити наскільки ваші онлайн-матеріали доступні для користувачів без або з обмеженим зором.
