Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/11__08-motivation.md.po
Languages: uk

source: The third, and most important, is to *involve people with disabilities in decision-making*. Our mailing lists are a good place to ask for advice, and updates to [our accessibility checklist](https://docs.carpentries.org/topic_folders/hosts_instructors/workshop_needs.html#accessibility) are always welcome.
uk: Але найголовніше полягає в *залученні людей з обмеженими можливостями до прийняття рішень*. Наші списки розсилки – гарне місце, щоб отримати пораду, та оновлення [нашого переліку доступності](https://docs.carpentries.org/topic_folders/hosts_instructors/workshop_needs.html#accessibility) завжди вітається.

source: > ## What Happens When Accessibility is an Issue? (Optional)
uk: > ## Що відбувається, коли доступність є проблемою? (необов'язково)

source: > > Think of a time when you've been affected by, or noticed someone else > being affected by issues with accessibility. This may have been at a > conference you attended where the elevator was out of service, or maybe > a class you were taking relied on audio delivery of content. Describe what happened, > how it impacted your (or someone else's) ability to be involved and what could > have been done to provide better accessibility in this case. > > This exercise should take about 5 minutes.
uk: > > Згадайте випадок, коли на вас вплинув чи ви помітили когось іншого, > хто постраждав від проблем із доступністю. Це могла бути > конференція, на якій ви були присутні, де ліфт не працював, або, можливо > курс, який ви відвідували, покладався на аудіодоставку контенту. Опишіть, що сталося, > як це вплинуло на вашу (або чиюсь) здатність брати участь і що могло > були зроблено для забезпечення кращої доступності в цьому випадку. > > Ця вправа займає близько 5 хвилин.

source: > ## Every Little Bit Counts
uk: > ## Кожна дрібниця має значення

source: > > Looking at people who work with disability and accessibility, it's > easy to be overwhelmed by all the different ways we could make > instruction more accessible. *Don't panic.* Instead: > > * *Don't do everything at once.* > We don't ask learners in our workshops to adopt all our best practices or tools in one go, > but instead to work things in gradually at whatever rate they can manage. > Similarly, try to build in accessibility habits when preparing for workshops > by adding something new each time. > * *Do the easy things first.* > There are plenty of ways to make workshops more accessible > that are both easy and don't create extra cognitive load for anyone: > font choices, general text size, > checking in advance that your room is accessible via an elevator or ramp, etc.
uk: > > Дивлячись на людей, які працюють з інвалідністю та доступністю, можна > бути приголомшеним різними способами, якими ми можемо зробити > інструкції доступнішими. *Не панікуйте.* Натомість: > > * *Не робіть усе відразу.* > Ми не просимо слухачів, які навчаються на наших семінарах, засвоїти всі наші передові методи чи інструменти за один раз, > але натомість працювати поступово з тією швидкістю, яка їм під силу. > Так само спробуйте виробити звички доступності під час підготовки до семінарів > щоразу додаючи щось нове. > * *Спочатку робіть легкі речі.* > Існує багато способів зробити семінари доступнішими. > Ці способи прості і не створюють ні для кого додаткового когнітивного навантаження: > вибір шрифту, загальний розмір тексту, > заздалегідь перевірте, чи доступний ліфт чи пандус у вашу аудиторію тощо.

source: > ## Accessibility Testing
uk: > ## Тестування доступності

source: > > Find the nearest public transportation drop-off point to your building > and walk from there to your office and then to the nearest washroom, > making notes about things you think would be difficult for a wheelchair user. > Now borrow a wheelchair and repeat the journey. > How complete was your list of challenges? > And did you notice that the first sentence in this challenge > assumed you could walk?
uk: > > Знайдіть найближчу до вашої будівлі зупинку громадського транспорту > і пройдіть звідти до свого офісу, а потім до найближчої вбиральні, > занотовуючи все, що, на вашу думку, було б важко для користувача інвалідного візка. > А тепер позичте інвалідний візок і повторіть подорож. > Наскільки повним був ваш список викликів? > А ви помітили, що перше речення в цьому виклику > припустив, що ви можете ходити?

source: ### Inclusivity
uk: ### Інклюзивність

source: *Inclusivity* is a policy of including people who might otherwise be excluded or marginalized. In computing, it means making a positive effort to be more welcoming to women, people of color, people with various sexual orientations, the elderly, people with physical disabilities, the formerly incarcerated, the economically disadvantaged, and everyone else who doesn't fit Silicon Valley's white/Asian male demographic. Lee's paper "[What can I do today to create a more inclusive community in CS?]({{ page.root }}/files/papers/lee-create-inclusive-community-2015.pdf)" is a brief, practical guide with references to the research literature. These help learners who belong to one or more marginalized or excluded groups, but help motivate everyone else as well.
uk: *Інклюзивність* — це політика залучення людей, які інакше могли б бути виключеними або маргіналізованими. У програмуванні це означає докладати зусиль, щоб бути більш гостинним для жінок, людей інших національностей, осіб з різною сексуальною орієнтацією, людей похилого віку, з обмеженими фізичними можливостями, осіб, які перебувають у місцях позбавлення волі, економічно знедолених та всіх інших, хто не відповідає демографічній групі білих/азіатських чоловіків Кремнієвої долини. Стаття Cynthia Lee «[What can I do today to create a more inclusive community in CS?]({{ page.root }}/files/papers/lee-create-inclusive-community-2015.pdf)» є коротким практичним посібником із посиланнями на наукову літературу. Це допомога слухачам, які належать до однієї чи кількох маргіналізованих чи виключених груп, але може також мотивувати всіх інших.

source: Many of these can be applied to our workshops, such as:
uk: Багато з цих ідей можна застосувати на наших семінарах, як от:

source: * asking learners to email you before the workshop
uk: * просити слухачів надіслати вам електронний лист перед семінаром

source: to explain how they believe the training could help them achieve their goals; * reviewing notes to make sure they are free from gendered pronouns, that they include culturally diverse names, etc.; * emphasizing that what matters is the rate at which they are learning, not the level of knowledge they had when they started; * encouraging pair programming; and * actively mitigating behavior that some learners may find intimidating, e.g., use of jargon or "questions" that are actually asked to display knowledge.
uk: щоб пояснити, як, на їхню думку, навчання може допомогти їм досягти цілей; * переглядати нотатки, щоб переконатися, що вони вільні від гендерних займенників, що вони включають культурно різноманітні імена, тощо; * наголошувати на тому, що має значення швидкість, з якою вони навчаються, а не той рівень знань, з якого вони починали; * заохочувати парне програмування; і * активно пом'якшувати поведінку, яка може лякати деяких слухачів, наприклад, використання жаргону або «запитань», які фактично задаються для демонстрації знань.

source: ## Setting Expectations with the Code of Conduct
uk: ## Визначення очікувань за допомогою Кодексу поведінки

source: Finally, a important way that the Carpentries foster an inclusive, respectful learning environment is our [Code of Conduct]({{ site.coc }}).
uk: Нарешті, важливим засобом, за допомогою якого в спільноті Carpentry сприяють інклюзивності та створенню поважного навчального середовища, є наш [Кодекс поведінки]({{ site.coc }}).

source: To make clear what is expected, all participants in our workshops are required to conform to the [Code of Conduct]({{ site.coc }}). Its details are important, but the most important thing about it is that it exists: knowing that we have rules tells people a great deal about our values and about what kind of learning experience they can expect.
uk: Щоб зрозуміти, що очікується, усі учасники наших семінарів зобов’язані дотримуватися [Кодексу поведінки]({{ site.coc }}). Його деталі важливі, але найголовніше в ньому те, що він існує: знаючи, що у нас є правила, розповідати людям багато про наші цінності і про те, на який навчальний досвід вони можуть розраховувати.

source: We will discuss the Code of Conduct in greater detail tomorrow.
uk: Ми обговоримо Кодекс поведінки більш детально завтра.
