Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/12__09-mindset.md.po
Languages: uk

source: > A [previous exercise]({{ page.root }}{% link _episodes/08-motivation.md %}#overcoming-imposter-syndrome-optional) asked you to think of a time when learning something was difficult for you, or
uk: > У [попередній вправі]({{ page.root }}{% link _episodes/08-motivation.md %}#overcoming-imposter-syndrome-optional) ви мали пригадати час, коли вам було важко щось вивчити, або

source: > you made a mistake that seemed silly or embarrassing.
uk: > ви робили помилку, яка здавалася безглуздою.

source: > > How did you motivate yourself to continue learning? How did it feel to persist in the face of challenge? > How do you feel now about your capabilities in this area? > > In the Etherpad, describe how you could use this story to illustrate the importance of grit for your learners. > > This exercise should take about 5 minutes.
uk: > Як ви мотивували себе продовжувати навчання? Що ви відчували, коли вистояли перед цим викликом? > Як ви зараз оцінюєте свої можливості в цій сфері? > > У Etherpad опишіть, як ви можете використати цю історію, щоб проілюструвати важливість завзятості для ваших учнів. > > Ця вправа займає близько 5 хвилин..

source: ## Habits of Lifelong Learners
uk: ## Звички тих, хто навчається протягом усього життя

source: Adopting beliefs and qualities like those listed above will help people become lifelong learners. By helping learners develop the habits of lifelong learning, we are not only preparing them to learn beyond the workshop, but hopefully, contributing to their overall career success. Surviving the job market nowadays requires the ability to be a lifelong learner, in order to learn and adapt to new skills that may be required by employers. Many of these positions can be described as *Knowledge Work*, work that requires ["non-routine" problem solving](http://doi.wiley.com/10.1002/kpm.378). Knowledge workers need to be capable of what Cal Newport calls "[deep work](http://calnewport.com/books/deep-work/)": defined as the "ability to focus intensely on cognitively demanding tasks".
uk: Прийняття переконань і якостей, подібних до перелічених вище, допоможе людям стати такими, навчаються протягом усього життя. Допомагаючи слухачам формувати звички вчитися протягом усього життя, ми не лише готуємо їх до навчання поза межами семінару, але, сподіваємося, робимо внесок у загальний успіх їх кар’єри. Щоб вижити на сучасному ринку праці, потрібні вміння навчатися протягом усього життя, щоб адаптуватися до нових навичок, яких можуть вимагати роботодавці. Багато з цих позицій можна описати як *роботу зі знаннями*, роботу, яка вимагає ["нестандартного" вирішення проблем](http://doi.wiley.com/10.1002/kpm.378). Інтелектуальні працівники повинні бути здатними до того, що Cal Newport називає «[поглибленою роботою](http://calnewport.com/books/deep-work/)»: що визначається як «здатність інтенсивно зосереджуватися на когнітивно складних завданнях».

source: Lifelong learning arises from those who have the growth mindset. Both grit and [curiosity](https://blog.udacity.com/2017/02/grit-yes-curiosity.html) have been identified as [success factors in lifelong learning](https://www.enterrasolutions.com/lifelong-learners-embrace-curiosity-grit/). Often, the process of learning is a difficult journey. By modeling "gritty" behavior and how it has helped us achieve long-term goals, we can foster a "learn-it-all" rather than a "know-it-all" attitude in learners.
uk: Звичка навчання протягом усього життя виникає у тих, хто має мислення зростання. Впевненість і [допитливість](https://blog.udacity.com/2017/02/grit-yes-curiosity.html) визначені як [фактори успіху в навчанні впродовж життя](https://www.enterrasolutions.com/lifelong-learners-embrace-curiosity-grit/). Часто процес навчання є складною подорожжю. Моделюючи «завзяту» поведінку та те, як це допомогло нам досягти довгострокових цілей, ми можемо виховати в слухачах прагнення «про все дізнатися», а не «все знати».

source: Emphasizing the role of [help-seeking behavior in the lifelong learning process](https://en.wikiversity.org/wiki/Learning_theories_in_practice/Help-seeking) is important, as it is a critical skill of lifelong learners. Encouraging learners to seek help can be difficult when societal norms view seeking help as "stigmatizing, self-threatening behavior". Because of this, we need to reframe help-seeking behavior as a positive behavior to cope with difficulties. Part of this reframing can be modeled by instructors emphasizing that they are also lifelong learners and by admitting the limits of their knowledge. Emphasizing that one's cohort is a powerful source of help is important to establishing a positive learning community.
uk: Підкреслення ролі [пошуку допомоги в процесі навчання впродовж життя](https://en.wikiversity.org/wiki/Learning_theories_in_practice/Help-seeking) є важливим, оскільки це критично важлива навичка тих, хто навчається протягом усього життя. Заохочувати слухачів шукати допомоги може бути складно з огляду на суспільні норми, що трактують звернення за допомогою як «стигматизуючу, самозагрозливу поведінку». Через це нам потрібно переосмислити поведінку пошуку допомоги як позитивна поведінку для подолання труднощів. Частину цього рефреймінгу можуть моделювати інструктори, наголошуючи, що вони також навчаються все життя і визнають межі своїх знань. Підкреслення того, що спільнота інструкторів є потужним джерелом допомоги, є важливим для встановлення позитивного навчального середовища.
