Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/12__09-mindset.md.po
Languages: uk

source: --- title: "Mindset" block: "Creating a Positive Learning Environment" teaching: 15 exercises: 15 questions: - "How does mindset influence learning?" - "How should we praise our learners?" - "How should we talk about errors?" - "What are successful habits of lifelong learners?" objectives: - "Explain the difference between fixed and growth mindset and its implications for classroom performance." - "Develop strategies for giving effort-based and improvement-based praise." - "Respond positively to learner errors." - "Model habits of lifelong learners." keypoints: - "Growth mindset and grit promote learning by making effort a positive thing." - "Presenting errors as essential to the learning process helps learners learn from their mistakes." - "Successful lifelong learners aren't embarrassed to ask for help." ---
uk: --- title: "Мислення" block: "Створення позитивного навчального середовища" teaching: 15 exercises: 15 questions: - «Як мислення впливає на навчання?» - «Як хвалити наших слухачів?» - «Як говорити про помилки?» - "Які успішні звички тих, хто навчається протягом усього життя?" цілі: - «Пояснити різницю між фіксованим мисленням і мисленням зростання, і їх вплив на продуктивність навчання». - «Розробити стратегії для похвали на основі зусиль і вдосконалення». - «Позитивно реагувати на помилки слухачів». - «Моделювати звички навчатися протягом усього життя». Ключові моменти: - «Мислення зростання та завзятість сприяють навчанню, роблячи зусилля позитивними». - «Сприйняття помилок як істотного фактору у процесі навчання допомагає слухачам вчитися на своїх помилках». - «Успішні люди, які навчаються протягом усього життя, не соромляться просити допомоги». ---

source: Our beliefs and attitudes about learning can impact how we learn! In this section we examine how learners can create a "positive learning environment" for themselves by how they think about learning; and how to model these behaviors as an instructor.
uk: Наші переконання та ставлення до навчання можуть впливати на те, як ми навчаємося! У цьому розділі ми досліджуємо, як слухачі можуть створити для себе «позитивне навчальне середовище» завдяки тому, як вони думають про навчання; і як інструктору моделювати цю поведінку .

source: ## The Importance of Mindset
uk: ## Важливість мислення

source: One example of how our beliefs impact learning is Carol Dweck's theory of "mindset".
uk: Одним із прикладів того, як наші переконання впливають на навчання, є теорія «мислення» Керол Двек.

source: Dweck, a professor of Psychology at Stanford University, has conducted decades of research focused on understanding people's attitudes towards ability, our beliefs about whether ability is ingrained or developed, and how those beliefs affect our perseverance in learning. She's discovered that, in any given area, people tend to have either a fixed mindset - believing that someone's ability in that area is intrinsic, you're either born with it or you're not - or a growth mindset - believing that, with enough effort, almost anyone can learn almost anything. (She's written a very accessible popularized [summary][worldcat-dweck] of her findings. There's also a [short summary][cardiff-dweck] available.)
uk: Двек, професор психології Стенфордського університету, проводила десятиліття досліджень, спрямованих на розуміння ставлення людей до здібностей та вивчення наших переконань щодо того, чи є здібності вкоріненими чи розвиненими, і як ці переконання впливають на нашу наполегливість у навчанні. Вона виявила, що в будь-якій предметній галузі люди мають або фіксоване мислення - вважаючи, що чиїсь здібності в цій сфері є внутрішніми, тобто ви або народилися з ними, або ні; або мислення зростання - вірячи, що, доклавши достатніх зусиль, майже кожен може навчитися майже всьому. (Вона написала дуже доступне популяризоване [резюме][worldcat-dweck] своїх результатів. Також є доступною [коротка анотація][cardiff-dweck].)

source: Do you believe that you're just not good at math? Or maybe you're not artistic? Not good at sports? If any of these sound like you, you probably have a fixed mindset when it comes to mathematical, artistic and/or athletic ability. People with a fixed mindset tend to avoid effort and to give up when faced with failure or challenge. They also tend to take fewer risks, be less likely to take an opportunity to learn something new and to feel best about themselves when they perform flawlessly. In contrast, people with a growth mindset tend to actively seek challenges and to work harder when faced with failure. They regularly take risks and take advantage of opportunities for learning new skills. In fact, initial difficulties in a topic make them more interested and motivated to learn!
uk: Ви вважаєте, що погано розумієтесь у математиці? А може ти не артист? Не товаришуєте зі спортом? Якщо щось з цього схоже на вас, ви, ймовірно, маєте фіксоване мислення, коли справа доходить до математичних, художніх та/або спортивних здібностей. Люди з фіксованим мисленням, як правило, уникають зусиль і здаються, коли стикаються з невдачею чи викликом. Вони також схильні менше ризикувати, рідше користуються можливістю дізнатися щось нове та почувати себе найкраще, коли вони працюють бездоганно. Навпаки, люди з мисленням зростання, як правило, активно шукають викликів і працюють більше, коли стикаються з невдачами. Вони регулярно ризикують і користуються можливостями для отримання нових навичок. Насправді початкові труднощі в у певній предметній галузі роблять їх більш зацікавленими та мотивованими до навчання!

source: People who believe that ability is intrinsic view every situation as a test. A failure indicates that they don't have the natural ability they need to succeed. Thus, students with a fixed-mindset will *decrease* their study time after receiving a poor exam score, because they see this score as a judgment that they aren't good at that subject and shouldn't waste their time trying. In the same situation, a growth-mindset student will increase the amount of time that they study, seeing the poor score as an indication that they need to try harder to improve in that area.
uk: Люди, які вірять, що здатність є внутрішньою, сприймають кожну ситуацію як випробування. Невдача вказує на те, що вони не мають необхідних природних здібностей для досягнення успіху. Таким чином, студенти з фіксованим мисленням *зменшуватимуть* свій час на навчання після отримання поганої оцінки іспиту, оскільки вони сприймають цю оцінку як судження, що вони погано володіють цією темою і не повинні витрачати час на спроби. У цій же ситуації студент з мисленням зростання збільшить кількість часу на навчання, розглядаючи низький бал як ознаку того, що їм потрібно докладати більше зусиль для вдосконалення в цій галузі.

source: Their attitude towards failure leads fixed-mindset people to avoid situations where they will be required to perform. They will not volunteer to answer questions in class or to demonstrate a sports technique to their team. This tendency prevents fixed-mindset people from using opportunities to practice and receive feedback, which, [as we've discussed]({{ page.root }}{% link _episodes/02-practice-learning.md %}), is essential to learning.
uk: Ставлення до невдач у людей із фіксованим мисленням спонукає їх уникати ситуацій, коли від них вимагатимуть виконання. Вони не зголошуються відповідати на запитання в аудиторії або продемонструвати спортивну техніку своїй команді. Ця тенденція заважає людям із фіксованим мисленням використовувати можливості для практики і отримувати відгуки, які, [як ми обговорювали] ({{ page.root }}{% link _episodes/02-practice-learning.md %}), є важливими для навчання.

source: > ## Does Mindset Matter?
uk: > ## Чи має значення мислення?

source: > Think: What kind of mindset do you have about different areas? Is there anything you believe you are "not naturally
uk: > Подумайте: яке у вас ставлення до різних сфер діяльності? Чи є щось, на що ви вважаєте, що ви «не маєте природнього

source: > talented" at? Mindset often varies in different areas -- someone might have a fixed mindset with respect to artistic
uk: > таланту"? Мислення часто відрізняється в різних сферах діяльності - хтось може мати фіксоване мислення щодо художньої

source: > ability, but a growth mindset with respect to computing skill. Then, think about your learners. How might a learner's
uk: > здібності, але мислення зростання щодо навичок програмування. Тоді подумайте про своїх слухачів. Як може мислення

source: > mindset about computational skill influence their learning in a workshop setting?
uk: > слухача щодо навичок програмування впливати на їх навчання в умовах семінару?

source: > > Pair: Discuss your thoughts about the influence of mindset in a workshop. Try to come up with a few different ways or > situations in which mindset might be relevant. > > Share: A few thoughts in the Etherpad (or go around the room and discuss) > > This exercise should take about 5 minutes.
uk: > > Пара: обговоріть свої думки щодо впливу типу мислення на семінарі. Спробуйте придумати кілька різних способів або > ситуації, в яких тип мислення може бути актуальним. > > Поділіться: кілька думок в Etherpad (або пройдіться аудиторією та обговоріть ці питання). > > Ця вправа займає близько 5 хвилин.

source: If you recognize aspects of the fixed mindset in yourself, don't panic! Like everything else, a growth mindset can be learned. We're going to talk about some strategies that will help you promote a growth mindset in your learners and yourself.
uk: Якщо ви розпізнаєте в собі аспекти фіксованого мислення, не панікуйте! Як і всьому іншому, мисленню зростання можна навчитися. Ми поговоримо про деякі стратегії, які допоможуть вам сприяти мисленню зростання ваших слухачів і вас самих.

source: ## Praise Influences Mindset
uk: ## Похвала впливає на мислення

source: One specific way in which instructors can foster a growth mindset in learners is in how we praise. [Carol Dweck's research](http://www.ascd.org/publications/educational-leadership/oct07/vol65/num02/The-Perils-and-Promises-of-Praise.aspx) investigated three types of praise: performance-based, effort-based and improvement-based, and looked at how these types of praise influence learner's mindsets.
uk: Один із конкретних способів, за допомогою якого інструктор можє сприяти зростанню мислення слухачів полягає в тому, як ми хвалимо. [В роботі Керол Двек](http://www.ascd.org/publications/educational-leadership/oct07/vol65/num02/The-Perils-and-Promises-of-Praise.aspx) досліджено три типи похвали: на основі продуктивності, на основі зусиль і на основі вдосконалення, і розглянуто, як ці типи похвал впливають на мислення учня.

source: We're most used to hearing **performance-based praise**. This sort of praise focuses on outcomes and implies that the outcome (for example, getting a correct answer) is the most important part of the task. It is often (but not always) combined with language that explicitly or implicitly supports the "intrinsic" model of competence. For example, "You did a great job! You must be very smart."
uk: Ми звикли чути **похвалу за ефективність**. Цей вид похвали зосереджується на результатах і має на увазі, що результат (наприклад, отримання правильної відповіді) є найважливішою частиною завдання. Часто (але не завжди) у поєднанні з мовою, яка явно чи неявно підтримує «внутрішню» модель компетентності. Наприклад, «Ти зробив чудову роботу! Ти маєш бути дуже розумним».

source: **Effort-based praise** focuses on the learner's hard work. For example, "You did a good job, you must have worked very hard." Exposing learners frequently to this type of praise helps them to transition from a fixed mindset to a growth mindset by changing their perception of effort. For fixed-mindset people, if something doesn't come easy to you, it means that you don't have natural ability and shouldn't bother. People with a growth mindset are much more likely to persevere in the face of challenge and accomplish their goals.
uk: **Похвала на основі зусиль** зосереджується на важкій роботі учня. Наприклад, «Ти добре попрацював, ти, мабуть, дуже старався». Часті похвали такого типу похвали допомагають учням перейти від фіксованого мислення до мислення зростання, змінюючи своє сприйняття зусиль. Для людей із фіксованим мисленням, якщо щось дається вам нелегко, це означає, що ви не маєте природних здібностей і не повинні турбуватися. Люди з мисленням зростання мають набагато більше шансів вистояти перед викликами і досягти своїх цілей.

source: **Improvement-based praise** is related to praise based on effort, but explicitly draws a learner's attention to the progress they've made. For example, "You're doing so much better at this than last time, you must have worked very hard." This helps reinforce a growth-mindset by highlighting our ability to improve with effort.
uk: **Похвала на основі вдосконалення** пов’язана з похвалою на основі зусиль, але чітко привертає увагу учня до прогресу, якого він досяг. Наприклад, «Ти справляєшся набагато краще, ніж минулого разу, ти, мабуть, дуже багато працював». Це допомагає зміцнити мислення зростання підкреслюючи нашу здатність вдосконалюватися, докладаючи зусиль.

source: > ## Choosing our Praises
uk: > ## Вибір наших похвал

source: > Since we're so used to being praised for our performance, it can be challenging to change the way we praise our learners. Which of these
uk: > Оскільки ми так звикли до того, що нас хвалять за нашу роботу, може бути складно змінити спосіб, у який ми хвалимо наших слухачів. Який із цих

source: > are examples of performance-based, effort-based, or improvement-based praise?
uk: > прикладів є похвалою на основі продуктивності, зусиль або вдосконалення?

source: > > - I like the way you tried a couple of different strategies to solve that problem. > - You're getting really good at that. Keep up the hard work! > - You're really talented. > - That was a hard problem. You didn't get the right answer, but look at how much you learned trying to solve it! > >> ## Solution >> - Effort-based. >> - Improvement-based. >> - Performance-based. >> - Improvement-based.
uk: > > - Мені подобається те, як ви спробували кілька різних стратегій для вирішення цієї проблеми. > - Ти справді добре справляєшся з цим. Так продовжуй! > - Ти дійсно талановита. > - Це була важка проблема. Ви не отримали правильної відповіді, але подивіться, скільки ви навчилися, намагаючись її вирішити! > >> ## Рішення >> - На основі зусиль. >> - На основі вдосконалення. >> - На основі продуктивності. >> - На основі вдосконалення.

source: ## Errors are Essential to Learning
uk: ## Помилки є необхідними для навчання

source: > The typos are the pedagogy.
uk: > Помилки - це педагогіка.

source: Another example of how our beliefs (in this case, our emotions) impact learning is in how we think about errors. One of the barriers to learning is avoidance of making errors. Errors are associated with negative emotions, which leads to learners being fearful of making them.
uk: Ще один приклад того, як наші переконання (в даному випадку наші емоції) впливають на навчання полягає в тому, як ми думаємо про помилки. Однією з перешкод для навчання є уникнення помилок. Помилки пов'язані з негативними емоціями, які призводять до того, що учні бояться їх зробити.

source: *Positive error framing* is the process of presenting errors as an integral part of the learning process and using them as teaching opportunities. Error framing encourages learners to understand that making errors provides valuable learning opportunities instead of having negative consequences. For example, the [Language Acquisition Made Practical](http://www.worldcat.org/title/language-acquisition-made-practical-field-methods-for-language-learners/oclc/935845446?referer=di&ht=edition) (LAMP) system for learning language encourages learners to develop phrases and try them in a variety of social situations with native speakers. By being willing to make mistakes, LAMP learners receive useful feedback from native speakers in real-world social situations. Error framing has shown to be useful in learning complex tasks such as programming. In one study, Steele-Johnson showed that error framing showed [positive effects on metacognition and self-efficacy](https://www.ncbi.nlm.nih.gov/pubmed/24617273).
uk: *Позитивне формування помилок* — це процес представлення помилок як невід’ємної частини процесу навчання та використання їх як можливостей для навчання. Формування помилок спонукає слухачів зрозуміти, що помилки надають цінні можливості для навчання і не мають негативних наслідків. Наприклад, система вивчення мови [Language Acquisition Made Practical](http://www.worldcat.org/title/language-acquisition-made-practical-field-methods-for-language-learners/oclc/935845446?referer=di&ht=edition ) (LAMP) заохочує учнів складати фрази та пробувати їх у різноманітних соціальних ситуаціях з носіями мови. будучи готовими робити помилки, учні LAMP отримують корисні відгуки від носіїв мови в реальних соціальних ситуаціях. Визначення помилок виявилося корисним для вивчення складних завдань, таких як програмування. В одному дослідженні Стіл-Джонсон показала, що фреймування помилок показує [позитивний вплив на метапізнання та самоефективність](https://www.ncbi.nlm.nih.gov/pubmed/24617273).

source: How can we incorporate error framing into our lessons? We need to reduce the negative emotions associated with errors, instead casting errors as a "[natural part of learning](https://www.researchgate.net/publication/292881989_Enhancing_firm_performance_and_innovativeness_through_error_management_culture)". Sharing experiences of learning from errors can encourage learners to adopt a growth-mindset. Associating improvement-based praise with errors can also encourage positive emotions associated with making errors in learning. Finally, the use of [participatory live coding]({{ page.root }}/14-live/) as the focus for teaching allows for instructors to model how errors can be positively framed and the process for overcoming them.
uk: Як ми можемо включити обробку помилок у наші уроки? Нам потрібно зменшити негативні емоції, пов’язані з помилками, замість того, щоб відкидати помилки, які є «[природною частиною навчання](https://www.researchgate.net/publication/292881989_Enhancing_firm_performance_and_innovativeness_through_error_management_culture)». Обмін досвідом навчання на помилках може спонукати слухачів прийняти мислення зростання. Кореляція похвали за вдосконалення з помилками також може заохочувати позитивні емоції, пов’язані з помилками в навчанні. Нарешті, використання [спільного кодування в реальному часі] ({{ page.root }}/14-live/) в якості фокусу навчання дозволяє інструкторам моделювати, як помилки можуть бути позитивно виправлені і яким є процес їх подолання.

source: > ## Helping Learners Learn From Mistakes (optional)
uk: > ## Допомогаючи слухачам вчитися на помилках (опціонально)

source: > A learner at your workshop asks for your help with an exercise and shows you their attempt at solving it. You see they've made an error
uk: > Слухач вашого семінару просить вашої допомоги у вправі та показує вам свою спробу її розв’язати. Ви бачите, що він зробив помилку

source: > that shows they misunderstand something fundamental about the lesson (for example, in the shell lesson, they forgot to put a space between
uk: > яка показує, що він неправильно розуміє фундаментальний елемент матеріалу семінару (наприклад, в при вивченні shell він забув поставити пробіл між

source: > `ls` and the name of the directory they are looking at). What would you say to the learner?
uk: > `ls` і назвою каталогу, який вони переглядають). Що б ви сказали слухачу?

source: > > In the Etherpad, describe the error your learner has made and how you would respond. > > This exercise and discussion should take about 5 minutes.
uk: > > У Etherpad опишіть помилку, яку зробив ваш слухач, і як би ви відповіли. > > Ця вправа та обговорення мають тривати близько 5 хвилин.

source: ## Perseverance Predicts Success
uk: ## Наполегливість забезпечує успіх

source: Finally, have you ever thought about how the quality of persistence can impact someone's learning?
uk: Нарешті, ви коли-небудь замислювалися про те, як якість наполегливості може вплинути на навчання?

source: Angela Duckworth, a Psychology professor from University of Pennsylvania, suggests that something called *grit* is an essential trait in learning. Grit can be defined as [perseverance and passion in the face of difficulty towards a defined long term goal](https://www.dropbox.com/s/cvg1mbz0xrfx25l/DuckworthGross2014.pdf). Learners with grit are willing to fail in their pursuit if they feel that it gets them closer to their goal. Learning and recovering from failure is an essential skill in many fields. Learners with grit have shown to have a higher degree of success later on in life. However, grit is not an innate trait; there is much evidence that suggests that grit is a trait that can be learned and instilled in learners.
uk: Анжела Дакворт, професор психології з Університету Пенсільванії, припускає, що те, що називається *впевненість*, є важливою рисою в навчанні. Впевненість можна визначити як [наполегливість і пристрасть перед обличчям труднощів у досягненні визначеної довгострокової мети] (https://www.dropbox.com/s/cvg1mbz0xrfx25l/DuckworthGross2014.pdf). Наполегливі учні готові зазнати невдачі у своєму прагненні, якщо відчувають, що це наближає їх до мети. Навчання та відновлення від невдач є важливою навичкою в багатьох сферах. Впевнені учні продемонстрували вищий ступінь успіху у подальшому житті. Однак впевненість не є вродженою рисою; є багато доказів того, що впевненість — це риса, якій можна навчитися та яку можна прищепити учням.

source: There are many ways we can help our learners attain grit.
uk: Є багато способів, як ми можемо допомогти нашим слухачам стати наполегливими.

source: - *Modeling resilience by sharing experiences of struggle*. Sharing your own experiences of having difficulty learning certain computing
uk: - *Моделювання стійкості шляхом обміну досвідом боротьби*. Поділіться власним досвідом труднощів з вивченням певних аспектів програмування.

source: concepts may help learners understand that the process of learning can be difficult. Sharing failures that were learning experiences may aid in modeling resilience. - *Promoting Perseverance*. Part of grit is being able to push through even when things are difficult. Improvement-based praise is an important motivating tool to promote perseverance. - *Sharing Passion*. Talking about why you persist in working in your field despite the difficulties and challenges is another way to instill grit. - *Emphasizing Long-Term Goals*. Showing the effects of learning the concepts in terms of learners' individual long-term goals can instill passion and drive for learning despite the difficulties of the topic.
uk: Це може допомогти слухачам зрозуміти, що процес навчання може бути важким. Обмін невдачами, які виникали при навчанні, може допомогти моделюванню стійкості. - *Сприяння наполегливості*. Частково впевненість полягає в здатності йти далі, долаючи труднощі, навіть коли все складно. Похвала, заснована на вдосконаленні, є важливим мотиваційним інструментом сприяння наполегливості. - *Ділитися пристрастю*. Говорити про те, чому ви наполегливо працюєте у своїй сфері, незважаючи на труднощі та виклики, є ще одним способом прищепити наполегливість. - *Наголошення на довгострокових цілях*. Демонстрація ефектів вивчення концепцій з точки зору індивідуальних довгострокових цілей слухачів може прищепити пристрасть і потяг до навчання, незважаючи на труднощі теми.

source: > ## How Are You Gritty? (Optional)
uk: > ## Наскільки ти завзятий? (опціонально)
