Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/14__11-practice-teaching.md.po
Languages: uk

source: --- title: "Teaching is a Skill" block: "Building Teaching Skill" teaching: 15 exercises: 55 questions: - "How can I improve my teaching?" objectives: - "Use peer-to-peer lesson practice to transform your instruction." - "Give thoughtful and useful feedback." - "Incorporate feedback into your teaching practices." keypoints: - "Like all other skills, good teaching requires practice and feedback." - "Lesson study is essential to transferring skills among teachers." - "Feedback is most effective when those involved share ground rules and expectations." ---
uk: --- title: "Викладання – це навичка" block: "Формування навичок викладання" teaching: 15 exercises: 55 questions: - "Як я можу покращити своє вміння викладати?" objectives: - «Використовуйте практику викладання "рівний-до -рівного", щоб трансформувати ваші інструкції». - «надайвате вдумливий і корисний зворотній зв'язок». - «Включіть зворотній зв'язок у свою практику викладання». keypoints: - «Як і всі інші навички, якісне викладання потребує практики та зворотного зв’язку». - «Навчання на уроках має важливе значення для передачі навичок між вчителями». – «Зворотний зв’язок є найефективнішим, коли учасники діляться основними правилами та очікуваннями». ---

source: So far, we've focused on how we can be effective instructors by understanding how people learn and how to create a positive classroom environment, covering two of our primary goals in helping you become a certified Carpentries instructor. Now our focus will shift to developing additional teaching skills that you can use in a Carpentries workshop setting, starting with the process of "lesson study", or teaching observation and feedback.
uk: Поки що ми зосереджувалися на тому, як ми можемо бути ефективними інструкторами завдяки розумінню як люди навчаються та як створити позитивне середовище в класі, висвітлюючи дві наші головні цілі, щоб допомогти вам стати сертифікованим інструктором спільноти Carpentry. Тепер ми зосередимося на розвитку додаткових навичок викладання, які ви можете використати в умовах семінарів Carpentry, починаючи з процесу «вивчення уроку», або спостереження за навчанням та зворотнім зв'язком.

source: ## Lesson Study: Applying a Growth Mindset to Teaching
uk: ## Lesson Study: Дослідження уроку: Застосування концепції мислення зростання до викладання

source: We've seen that providing opportunities for practice and giving useful feedback to learners are essential components in the learning process. Learning to teach is no different.
uk: Ми бачили, що надання можливостей для практики та забезпечення слухачам корисного зворотного зв'язку є важливими компонентами процесу навчання. Навчання викладанню нічим не відрізняється.

source: However, many people assume that teachers are born, not made. From politicians to researchers and teachers themselves, most reformers have designed systems to find and promote those who can teach and eliminate those who can't. As Elizabeth Green describes in *[Building a Better Teacher][worldcat-babt]*, though, that assumption is wrong, which is why educational reforms based on it have repeatedly failed.
uk: Однак багато людей вважають, що вчителями народжуються, а не стають. Від політиків для самих дослідників і викладачів більшість реформаторів розробили системи, щоб знаходити і підтримувати тих, хто може навчати, і виключати тих, хто не може. Однак, як описує Елізабет Грін у *[Building a Better Teacher][worldcat-babt]*, це припущення є хибним, тому освітні реформи, засновані на ньому, неодноразово зазнавали невдачі.

source: To assume that teaching is an "inherited" or innate skill is to take on a fixed mindset about teaching. A growth mindset believes that anyone can become a better teacher by the same methods we use to learn any subject -- reflective practice. More specifically, instructors develop teaching skill over time through practice and improve most when given feedback on their performance from other instructors who share their pedagogical model.
uk: Припускати, що викладання є «успадкованою» або вродженою навичкою, означає прийняти концепцію фіксованого мислення. Мислення зростання вірить, що будь-хто може стати кращим вчителем за тими ж методами, які ми використовуємо для вивчення будь-якого предмету -- рефлексивна практика. Зокрема, інструктори розвивають навички викладання з плином часу через практику та покращуються найбільше, коли отримують відгуки про їх продуктивність від інших інструкторів, які поділяють їх педагогічну модель.

source: We know that teachers can learn how to teach because of research done on the Japanese method of jugyokenkyu or "lesson study."
uk: Ми знаємо, що вчителі можуть навчитися викладати завдяки проведеним дослідженням за японським методом jugyokenkyu або «вивчення уроку».

source: In the 1980s and 90s, an educational psychologist named James Stigler observed teachers in the US and Japan. In the [OECD's annual rankings][oecd-pisa] of countries' educational achievements, Japanese students routinely test near the top in reading, math and science, while American students rank at or below average.
uk: У 1980-90-х роках педагог-психолог Джеймс Стіглер вивчав досвід вчителів у США та Японії. У [щорічному рейтингу ОЕСР] [oecd-pisa] освітніх країн досягнень, японські студенти регулярно демострують найкращі знання з читання, математики та природничих наук Американські студенти мають рейтинг на рівні або нижче середнього.

source: Looking at differences in teaching methods, Stigler found that American teachers met at most once a year to exchange ideas about teaching, compared to the weekly or even daily meetings of Japanese teachers. During these meetings, teachers in the US described their lessons to each other, but they did not observe each others' teaching in practice. In contrast, Japanese teachers regularly conducted lesson study: observing each other at work, discussing the lesson afterward, and studying curriculum materials with their colleagues.
uk: Розглядаючи відмінності в методах навчання, Стіглер виявив, що американські вчителі зустрічалися щонайбільше один раз на рік, щоб обмінятися думками про викладання, порівняно з тижневими чи навіть щоденними зустрічами японських вчителів. Під час цих зустрічей вчителі в США описували один одному свої уроки, але вони це робили, не спостерігаючи за викладанням один одного на практиці. Навпаки, японські вчителі регулярно проводили уроки, спостерігаючи один за одним за роботою, обговорювали уроки після цього та вивчали разом навчальні матеріали колег.

source: The situation is different in many English-language school systems: in the US, Canada, the UK, Australia, and elsewhere, where often what happens in the classroom stays in the classroom. Teachers aren't able to watch each other's lessons on a regular basis, so they can't borrow each other's good ideas. The result is that *every teacher has to invent teaching on their own*. They may get lesson plans and assignments from colleagues, the school board, a textbook publisher, or the Internet, but each teacher has to figure out on their own how to combine that with the theory they've learned in their educational programs to deliver an actual lesson in an actual classroom for actual learners. When teachers don't observe each other teaching, the tricks and techniques that each instructor has painstakingly incorporated into their practice don't have the opportunity to spread, limiting forward momentum on system-wide improvements to teaching.
uk: У багатьох англомовних шкільних системах ситуація інша: у США, Канаді, Великобританії, Австралії та інших країнах часто те, що відбувається в класі, залишається в класі. Вчителі не можуть регулярно спостерігати за уроками один одного, тому вони не можуть запозичити гарні ідеї у колег. Результатом є те, що *кожен вчитель повинен винаходити стратегії викладання самостійно*. Вони можуть отримати плани уроків і завдання від колег, шкільної ради, видавця підручників, або Інтернету, але кожен учитель повинен сам з’ясувати, як поєднати це з теорією, яку вони вивчали в своїх освітніх програмах провести справжній урок у реальному класі для справжніх учнів. Коли вчителі не спостерігають за технлогією викладання один одного, трюками та техніками кожного інструктора, які тот включив в свою практику, то вони не мають можливості розвиватися, обмежуючи просування імпульсу для загальносистемних удосконалень викладання.

source: > ## Reading It Isn't Enough
uk: > ## Читати недостатньо

source: > Several research studies (in [2007][fincher-warren], [2012][fincher-stories], and [2015][barker-practice]) have shown
uk: > Кілька досліджень (такі, як [2007][fincher-warren], [2012][fincher-stories], and [2015][barker-practice]) показали

source: > that teachers don't adopt instructional practices based on reports about the effectiveness of those practices.
uk: > що вчителі не сприймають навчальні практики на основі звітів про ефективність цих практик.

source: > Social norms, institutional
uk: > Соціальні норми, інституційна

source: > culture, and lack of time and support prevent many teachers from moving out of
uk: > культура, брак часу та підтримки заважає багатьом вчителям розвивати

source: > their accustomed teaching habits. Change in teaching doesn't come about through reading about new teaching practices, but by seeing
uk: > набуті раніше звички викладання. Зміни у викладанні відбуваються не через читання про нові практики викладання, а завдяки можливості

source: > these practices in action, practicing them and getting feedback from other instructors.
uk: > спостереження за цими практиками в дії, беручи в них участь і отримуючи зворотній зв'язок від інших інструкторів.

source: Therefore, just like other disciplines (sports and music are two good examples), teachers benefit from closely observing the work of others. The Carpentries pedagogical model supports lesson study by providing many opportunities for our instructors to learn from each other. In this training workshop, you will have opportunities to practice teaching for one another and to give each other feedback. You'll also have the opportunity to practice in front of an experienced instructor as part of your instructor training checkout. In addition, Carpentries instructors always teach in pairs (or more), giving you the opportunity to learn by observing and to get feedback from your fellow instructors.
uk: Тому, як і в інших дисциплінах (спорт і музика – два гарних приклади), вчителі отримують велику користь спостерігаючи за роботою інших. Педагогічна модель, що реалізується у Carpentries, підтримує процес навчання, надаючи багато можливостей для наших інструкторів вчитися один у одного. На цьому навчальному семінарі ви матимете можливість попрактикуватися в навчанні один для одного і давати один одному зворотний зв’язок. Ви також матимете можливість потренуватися перед досвідченим інструктором у рамках перевірки навчання інструктора. Крім того, інструктори Carpentries завжди навчаються парами (або більше), що дає вам можливість навчатися, спостерігаючи та отримуючи відгуки від ваших колег-інструкторів.

source: > ## Giving Feedback
uk: > ## Надання зворотнього зв'язку

source: > > We'll start by observing some examples of teaching and providing some feedback. > > Watch this [example teaching video][bad-teaching-video] as a group > and then give feedback on it. Put your feedback in the Etherpad. > Organize your feedback along two axes: > positive vs. negative > and content (what was said) vs. presentation (how it was said). > This exercise should take about 10 minutes.
uk: > > Почнемо з огляду деяких прикладів викладання та надамо певний зворотній зв'язок. > > Перегляньте цей [приклад навчального відео][bad-teaching-video] у групі, > а потім надайте відгук про це. Розмістіть свій відгук в Etherpad. > Організуйте свій відгук за двома осями: > позитивне проти негативного > і зміст (що було сказано) проти презентації (як це було сказано). > Ця вправа займає близько 10 хвилин.

source: Now that you've had some practice observing teaching and giving feedback, let's practice with each other.
uk: Тепер, коли ви трохи потренувалися спостерігати за викладанням і давати відгук, попрактикуйтеся один з одним.

source: > ## Feedback on Yourself
uk: > ## Відгук про себе

source: > > The goal of this exercise is to practice giving and receiving feedback, so don't be > overly concerned about creating a perfectly polished presentation. > We don't give you a lot of time to prep and the teaching time is short, so embrace > the challenge (and improvisation) of the exercise and see what you can learn by > watching other people teach, thinking about how to give them feedback, and how it > feels to get feedback on your own teaching. > > **Trainings where trainees are co-located:** > 1. Split into groups of three. > 2. Individually, spend 5 minutes preparing to teach a 90-second segment of > the lesson episode you chose before the start of the training course. You will not > be live coding; you can use a whiteboard or other visual aids if available (but > this is not required!). We recommend using this 90 second teaching moment > to introduce the topic of your lesson. > 3. Get together with your group and have each person teach their segment to the group, > while one person records this (video and audio) > using a cell phone or some other handheld device. > Keep a strict time limit of 90 seconds per person. > 3. After the first person finishes, > rotate roles > (they become the videographer, > the audience becomes the instructor, > the person who was recording becomes the audience) > and then rotate roles again. > 4. After everyone in the group of three has finished teaching, > watch the videos as a group. > Everyone gives feedback on all three videos, > i.e., people give feedback on themselves as well as on others. > 5. After everyone has given feedback on all of the videos, > return to the main group and put everyone's feedback about you into the Etherpad. > > **Distributed trainings:** > Your Trainer will split the group into virtual break-out rooms. Follow the instructions above > but do not record each other. Instead, give each person feedback immediately after they finish their > turn teaching. > > This exercise should take about 25 minutes.
uk: > > Мета цієї вправи — потренуватися надсилати та отримувати зворотний зв’язок, тож не варто > надмірно опікуватися створенням ідеально відшліфованої презентації. > Ми не даємо вам багато часу на підготовку, до того ж час викладання короткий, тож сприймайтецю вправу як > виклик (та імпровізацію) та подивіться, чому ви можете навчитися, > спостерігати за викладанням інших людей, думати про те, як дати їм зворотний зв’язок і як це відчувається, >коли отримуєш зворотний зв’язок щодо свого власного викладання. > > **Тренінги, де стажери співпрацюють:** > 1. Розділіться на групи по троє. > 2. Індивідуально витратить 5 хвилин на підготовку до викладання 90-секундного сегменту > епізоду уроку, який ви обрали перед початком тренування. Ви не будете зобов'язані > кодувати вживу; ви можете використовувати дошку або інші наочні посібники, якщо вони доступні (але > це не обов'язково!). Ми рекомендуємо використовувати цей навчальний фрагмент тривалістю 90 секунд, > щоб представити тему уроку. > 3. Зберіться зі своєю групою та попросіть кожного викласти групі свій сегмент, > поки одна особа записує це (відео та аудіо) > за допомогою мобільного телефону або іншого портативного пристрою. > Дотримуйтеся суворого обмеження часу в 90 секунд на особу. > 3. Після того, як перша особа закінчить, > поміняйтеся ролями > (вона стає відеооператором, > аудиторія стає інструктором, > людина, яка записувала, стає аудиторією) > а потім знову поміняйте ролі. > 4. Після того, як усі в групі з трьох осіб закінчать викладання, > продивіться відео групою. > Кожен залишає відгуки про всі три відео, > тобто учасники дають відгук як про себе, так і про інших. > 5. Після того, як кожен залишить відгук про всі відео, > поверніться до основної групи та додайте всі відгуки про себе в Etherpad. > > **Розподілені тренінги:** > Ваш тренер розділить групу на віртуальні кімнати. Дотримуйтесь інструкцій вище > але не записуйте один одного. Натомість надсилайте кожному учаснику відгук одразу після того, як він закінчить > викладання. > > Ця вправа займає близько 25 хвилин.

source: ## Feedback Is Hard
uk: ## Зворотній зв'язок - це важко

source: Sometimes it can be hard to receive feedback, especially negative feedback.
uk: Іноді буває важко отримати відгук, особливо негативний.

source: Feedback is most effective when the people involved share ground rules and expectations. In Carpentries teaching, we use the 2x2 paradigm for feedback. Each person giving feedback is expected to provide at least one piece of negative and one piece of positive feedback each for content and delivery. This helps overcome two common tendencies when giving feedback on teaching: to focus on the content (even though delivery is at least as important) and to either provide only negative or only positive feedback.
uk: Зворотний зв’язок є найбільш ефективним, якщо учасники діляться основними правилами та очікуваннями. Викладаючи на семінарах Carpentry, ми використовуємо 2x2 парадигму зворотного зв'язку. Очікується, що кожен учасник надасть принаймні один один негативний і один позитивний відгуки щодо вмісту та форми викладання. Це допомагає подолати дві загальні тенденції під час надання зворотного зв’язку щодо викладання: зосереджуватися тільки на змісті (хоча презентація є принаймні такою ж важливою) і або надавати лише негативні чи тільки позитивні відгуки.

source: Here is a list of different ways that you can set the stage for receiving or providing feedback in a way that facilitates growth.
uk: Ось список різних засобів, за допомогою яких ви можете створити основу для отримання або надання зворотного зв’язку у спосіб, який сприяє зростанню.

source: * Initiate feedback as the instructor. It's better to ask for feedback than to receive it unwillingly.
uk: * Ініціюйте зворотний зв’язок як інструктор. Краще попросити відгук, ніж отримати його проти волі.

source: * Ask for and give specific feedback. See a great example of this from
uk: * Попросіть і надайте конкретний відгук. Дивіться чудовий приклад цього у

source: this Lunar Baboon comic: ![Giving Good Feedback](../fig/feedback-artwork.jpg "Comic from http://www.lunarbaboon.com/comics/feedback.html")
uk: коміксі Lunar Baboon: ![Giving Good Feedback](../fig/feedback-artwork.jpg "Comic from http://www.lunarbaboon.com/comics/feedback.html")

source: As an instructor one way to get specific feedback is to provide questions that focus the responses. Writing your own feedback questions allows you to frame feedback in a way that is helpful to you - the questions below reveal what didn't work in your teaching, but read as professional suggestions rather than personal judgments. For example:
uk: Один із способів отримати конкретні відгуки – це поставити запитання, які задають рамки відповідей з позиції інструктора. Написання власних запитань для зворотного зв’язку дає змогу сформулювати зворотний зв’язок у зручний для вас спосіб – як приклад, запитання нижче показують, що не спрацювало у вашому викладанні, але сприймаються як професійні пропозиції, а не особисті судження. Наприклад:

source: * "What is one thing I could have done as an instructor to make this lesson more effective?"
uk: * "Що я міг би зробити як інструктор, щоб зробити цей урок ефективнішим?"

source: * "If you could pick one thing from the lesson to go over again, what would it be?"
uk: * "Якби ви могли вибрати один фрагмент з уроку, щоб повторити його ще раз, що б це було?"

source: * Balance positive and negative feedback.
uk: * Збалансуйте позитивний і негативний відгук.

source: * Ask for or give "compliment sandwiches" (one positive, one negative, one positive)
uk: * Попросіть або надайте так званий "сендвіч з похвалою" (один позитивний відгук, один негативний відгук, один позитивний відгук)

source: * Ask for both types of feedback, and give both types.
uk: * Попросіть обидва типи відгуків і надайте обидва типи.

source: * When sharing negative feedback, provide a clear next step to follow that will help the recipient improve.
uk: * Надсилаючи негативний відгук, чітко вкажіть наступний крок, який допоможе одержувачу покращитися.

source: * Communicate expectations. If your teaching feedback is taking the form of an
uk: * Комунікуйте очікування. Якщо зворотній зв'язок про ваше викладання набуває форму

source: observation (and you're comfortable enough with the observer), tell that person how they can best communicate their feedback to you.
uk: спостереження (а ви досить комфортно спілкуєтесь із спостерігачем), дайте знати цій людині, як вона може найкраще повідомити вам свої відгуки

source: * When giving feedback, remember that giving and receiving feedback is a skill that requires practice, so don't
uk: * Коли ви надсилаєте зворотній зв’язок, пам’ятайте, що надсилання та отримання зворотного зв’язку – це навичка, яка потребує практики, тому не робіть цього

source: be frustrated if your feedback is rejected but try to think about why the recipient might not have been comfortable with the feedback you gave.
uk: засмучуйтесь, якщо ваш відгук буде відхилено, але спробуйте подумати, чому одержувачу було некомфортно з вашим відгуком.

source: * Use a feedback translator. Have a fellow
uk: * Використовуйте тлумачення зворотнього зв'язку. Нехай

source: instructor (or other trusted person in the room) read over all the feedback and give an executive summary. It can be easier to hear "It sounds like most people are following, so you could speed up" than to read several notes all saying, "this is too slow" or "this is boring".
uk: інструктор (або інша довірена особа в кімнаті) прочитає всі відгуки та надасть резюме. Може бути легше почути: «Схоже, більшість людей встигають слідкувати, тож ви могли б пришвидшитися», ніж прочитати кілька нотаток із словами «це надто повільно» або «це нудно».

source: This is part of the reason for the Carpentries' rule, "Never teach alone." Having another instructor in the classroom saves your voice (it's hard to talk for two days straight), but more importantly, it's a chance for instructors to learn from one another and be a supportive voice in the room.
uk: Важливою частиною правил Carpentries є таке: «Ніколи не навчай сам». Наявність іншого викладача в аудиторії збереже ваш голос (важко говорити два дні поспіль), але важливішою є можливість для інструкторів вчитися один в одного та бути голосом підтримки в аудиторії.

source: Finally, be kind to yourself. If you're a self-critical person, it's OK to remind yourself:
uk: Нарешті, будьте добрими до себе. Якщо ви самокритична людина, можна нагадати собі:

source: * The feedback isn't personal.
uk: * Зворотній зв'язок не про особістість.

source: * There are always positives along with the negatives.
uk: * Поряд з негативом завжди є позитив.

source: > ## Feedback on Feedback (Optional)
uk: > ## Зворотній зв'язок на зворотній зв'язок (опціонально)

source: > > Watch either this [scipy tutorial][scipy-video-1] (8:40) > or this [other tutorial][scipy-video-2] (11:42). > For each, give feedback following the 2x2 > model. Put your feedback in the Etherpad. > > This exercise and discussion should take about 15 minutes.
uk: > > Перегляньте це [scipy tutorial][scipy-video-1] (8:40) > або це відео [other tutorial][scipy-video-2] (11:42). > Для кожного відео надішліть відгук відповідно до 2x2 > моделі. Розмістіть свій відгук в Etherpad. > > Ця вправа та обговорення мають тривати приблизно 15 хвилин.

source: > ## Using Feedback
uk: > ## Використання зворотного зв'язку
