Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/14__11-practice-teaching.md.po
Languages: uk

source: > > Look back at the feedback you received on your teaching in an earlier exercise. > How do you feel about this feedback? Is it fair and reasonable? Do you agree with it? > > Identify at least one specific change you will make to your teaching based on this feedback. > Describe your change in the Etherpad. > > This exercise should take about 5 minutes.
uk: > > Зверніть увагу на відгуки, які ви отримали щодо свого викладання під час попередньої вправи. > Як ви ставитеся до цього відгуку? Чи це справедливо і розумно? Ви згодні з цим? > > Визначте принаймні одну конкретну зміну, яку ви внесете у своє навчання на основі цього відгуку. > Опишіть свою зміну в Etherpad. > > Ця вправа займає близько 5 хвилин.

source: Hopefully you were able to identify at least one helpful comment in the feedback you received and are able to use it to start (or continue) the process of improving your teaching. Remember, teaching is a skill that is learned. If you notice yourself feeling hurt or threatened by the feedback you got, or rejecting it as unfair or wrong, pause and try to consider the feedback from a growth mindset - that through practice and feedback, your skills are going to improve. By strengthening your growth mindset with respect to teaching, you can transform getting feedback from an unpleasant experience to a richly rewarding one. You'll have more opportunities to practice teaching and to get and give feedback tomorrow.
uk: Сподіваємось, ви змогли визначити принаймні один корисний коментар у відгуках, які ви отримали, і можете використати його, щоб розпочати (або продовжити) процес покращення вашого навчання. Пам’ятайте, викладання – це навичка, якій навчаються. Якщо ви помітили, що відчуваєте образу чи загрозу через отриманий відгук або відкидаєте його як несправедливий чи неправильний, зробіть паузу та спробуйте врахувати зворотний зв’язок на основі мислення зростання – саме через практику та зворотний зв’язок ваші навички мають покращитися. Зміцнюючи своє мислення зростання щодо навчання, ви можете перетворити отримання зворотного зв’язку з неприємного досвіду на такий, що буде щедро винагороджений. У вас буде більше можливостей попрактикуватися у викладанні, а завтра отримати і надати зворотній зв'язок.

source: ## Optional Exercises
uk: ## Опціональні вправи

source: > ## Skill Acquisition: What level are your teaching skills?
uk: > ## Набуття навичок: Який рівень ваших навичок викладання?

source: > > As with computational skills, people have a tendency to think of teaching as something you are "just good at" or not. However, teaching is a skill, and expertise develops with attentive practice. > Examine the descriptions of "novice," "competent practitioner," and "expert." Where do you think you fall with regard to teaching? What have you learned about teaching? What are you aware of that you still need to learn? > Discuss with a partner and then write some thoughts in the Etherpad.
uk: > > Як і з навичками програмування, люди схильні думати про викладання як про те, що ви «просто вмієте» чи ні. Проте викладання — це навичка, а досвід розвивається завдяки уважній практиці. > Розгляньте описи «новачок», «компетентний практик» і «експерт». Як ви думаєте, до якої групи ви належите щодо викладання? Що ви дізналися про викладання? Ви знаєте, що вам ще потрібно вивчити? > Обговоріть із партнером, а потім запишіть деякі думки в Etherpad.
