Repository: carpentries-i18n/i18n
Catalog: transifex/instructor-training/*/15__12-homework.md.po
Languages: uk

source: --- title: "Wrap-Up and Homework for Tomorrow" teaching: 5 exercises: 15 questions: - "What have we learned today?" - "What needs to be done to prepare for tomorrow?" objectives: - "Describe overnight homework." - "Produce a paragraph, drawing, or diagram that summarizes what was taught today." keypoints: - "Today we learned about how people learn, how to build a positive classroom environment, and how to give feedback." - "Tomorrow we will cover specifics of Carpentries workshops and teaching practices." ---
uk: --- title: "Підведення підсумків і домашнє завдання на завтра" teaching: 5 exercises: 15 questions: «Що ми сьогодні вивчили?» - «Що потрібно зробити, щоб підготуватися до завтрашнього дня?» цілі: - «Опишить вечірнє домашнє завдання». - «Створіть короткий опис, малюнок або схему, які підсумовують те, що розглядалось сьогодні». Ключові моменти: - «Сьогодні ми дізналися про те, як люди навчаються, як створити позитивне середовище в аудиторії та як давати зворотний зв’язок». – «Завтра ми розглянемо специфіку семінарів Carpentry та навчальних практик». ---

source: Today we have focused on understanding some core findings of pedagogical research about how the learning process works and the importance of creating a positive classroom environment. We also introduced the idea of lesson study and gave some opportunities to practice teaching. Tomorrow we will continue our discussions of how we build teaching skill and will have more chances for practice and feedback. We will also look in some depth at how the Carpentries operate to prepare you for the logistics of teaching a workshop.
uk: Сьогодні ми зосередилися на розумінні деяких основних результатів педагогічних досліджень про те, як відбувається процес навчання та про важливість створення позитивного середовища в аудиторії. Ми також розглянули концепцію навчальних уроків і окреслили певні можливості для практики викладання. Завтра ми продовжимо наше обговорення розвитку навичок викладання та матимемо більше часу для практики та зворотного зв’язку. Ми також подивимось детальніше, як організовані семінари Carpentry, щоб підготувати вас до прийнятої логістики викладання.

source: To prepare for tomorrow, please:
uk: Щоб підготуватися до завтра, будь ласка:

source: 1. Read about the two types of Carpentry workshops: [self-organized][dc-self] and
uk: 1. Прочитайте про два типи семінарів Carpentry: [self-organized][dc-self] та

source: [centrally-organized][dc-central] and the checklists these pages link to. These summarize commonly asked questions about organizing and running workshops. When you arrive tomorrow, we will ask you to add one question about our operations to a list. We will then do our best to answer all of those questions during the day.
uk: [centrally-organized][dc-central] та списки контрольних питань, на які ці сторінки посилаються. Тут узагальнено поширені запитання щодо організації та проведення семінарів. Коли ви приїдете завтра, ми попросимо вас додати одне запитання про форму та зміст семінарів до списку. Потім ми зробимо все можливе, щоб відповісти на всі ці запитання протягом дня.

source: 2. Prepare for the [live coding exercises]({{ page.root }}/14-live/).
uk: 2. Підготуйтеся до [live coding exercises]({{ page.root }}/14-live/).

source: If you haven't already, pick an episode from an existing Software Carpentry, Data Carpentry, or Library Carpentry lesson and read through it carefully. Tomorrow, you will use this to practice live coding for 3 minutes in groups of three. Your group members will comment on the delivery and content. The episodes we recommend were listed in the welcome message sent to you before the start of this course, and are: * Data Carpentry * [Faceting and Clustering in OpenRefine](<{{ site.dc_site }}/OpenRefine-ecology-lesson/01-working-with-openrefine>) * [Basic Queries in SQL](<{{ site.dc_site }}/sql-ecology-lesson/01-sql-basic-queries/>) * [Starting with Data in R](<{{ site.dc_site }}/R-ecology-lesson/02-starting-with-data.html>) * [Starting with Data in Python](<{{ site.dc_site }}/python-ecology-lesson/02-starting-with-data/>)
uk: Якщо ви ще цього не зробили, виберіть епізод із наявних уроків Software Carpentry, Data Carpentry, or Library Carpentry та уважно прочитайте його. Завтра ви використовуватимете це, щоб практикувати програмування в реальному часі протягом 3 хвилин у групах по три людини. Члени вашої групи коментуватимуть форму та вміст програми. Епізоди, які ми рекомендуємо, були перелічені у вітальному повідомленні, надісланому вам перед початком цього курсу та є такими: * Data Carpentry * [Фасетування та кластеризація у OpenRefine](<{{ site.dc_site }}/OpenRefine-ecology-lesson/01-working-with-openrefine>) * [Базові запити SQL](<{{ site.dc_site }}/sql-ecology-lesson/01-sql-basic-queries/>) * [Початок роботи з даними в R](<{{ site.dc_site }}/R-ecology-lesson/02-starting-with-data.html>) * [Початок роботи з даними в Python](<{{ site.dc_site }}/python-ecology-lesson/02-starting-with-data/>)

source: * [Working with Files and Directories in the Unix Shell](https://librarycarpentry.github.io/lc-shell/03-working-with-files-and-folders/index.html)
uk: * [Робота з файлами та каталогами в Unix Shell](https://librarycarpentry.github.io/lc-shell/03-working-with-files-and-folders/index.html)

source: * [Faceting and filtering in Open Refine](https://librarycarpentry.github.io/lc-open-refine/04-faceting-and-filtering/index.html)
uk: * [Фасетування та кластеризація у Open Refine](https://librarycarpentry.github.io/lc-open-refine/04-faceting-and-filtering/index.html)

source: * [For loops in Python](https://librarycarpentry.github.io/lc-python-intro/12-for-loops/index.html)
uk: * [Цикл For у Python](https://librarycarpentry.github.io/lc-python-intro/12-for-loops/index.html)

source: * [Working with Files and Directories in the Unix Shell](<{{ site.swc_pages }}/shell-novice/03-create/>)
uk: * [Робота з файлами та каталогами в Unix Shell](<{{ site.swc_pages }}/shell-novice/03-create/>)

source: * [Tracking Changes in Git](<{{ site.swc_pages }}/git-novice/04-changes/>)
uk: * [Відстеження змін в Git](<{{ site.swc_pages }}/git-novice/04-changes/>)

source: * [Selecting Data in SQL](<{{ site.swc_pages }}/sql-novice-survey/01-select/>)
uk: * [Вибір даних у SQL](<{{ site.swc_pages }}/sql-novice-survey/01-select/>)

source: * [Repeating Actions with Loops in Python](<{{ site.swc_pages }}/python-novice-inflammation/02-loop/>)
uk: * [Повторення дій за допомогою циклів у Python](<{{ site.swc_pages }}/python-novice-inflammation/02-loop/>)

source: * [Exploring Data Frames in R](<{{ site.swc_pages }}/r-novice-gapminder/05-data-structures-part2/>)
uk: * [Дослідження фреймів даних в R](<{{ site.swc_pages }}/r-novice-gapminder/05-data-structures-part2/>)

source: > ## Feedback
uk: > ## Зворотній зв'язок

source: > > The Trainer(s) will ask for feedback on the day in some form. > > This exercise should take 5 minutes.
uk: > >Тренер(и) запитає(ють) відгук про день у певній формі. > > Ця вправа займає 5 хвилин.

source: > ## Reflecting on the Day
uk: > ## Розмірковуючи про день.

source: > > Before we wrap up for the day, take 5 minutes to think over > everything we covered today. On a piece of paper, write > down something that captures what you want to remember about > the day. The Trainers won't look at this - it's just for you. > > If you don't know where to start, consider > the following list for a starting point: > > * draw a concept map, connecting the material > * draw pictures or a comic depicting one of the day's concepts > * write an outline of the topics we covered > * write a paragraph or “journal” entry about your > experience of the training today > * write down one thing that struck you the most > > This exercise should take about 10 minutes.
uk: > > Перш ніж завершити день, виділіть 5 хвилин на роздуми про > все, що ми розглянули сьогодні. На аркуші паперу зафіксуйте > те, що ви хочете запам’ятати > з цього дня. Тренери не дивитимуться на це - це лише для вас. > > Якщо ви не знаєте, з чого почати, розгляньте > наступний список як відправну точку: > > * намалювати концептуальну карту, що узагальнює матеріал > * намалювати рисунки або комікси, що зображують одне з понять дня > * написати план тем, які ми розглядали > * написати абзац або запис у «журналі» про ваш > досвід тренінгу сьогодні > * записати те, що вас найбільше вразило >
