Repository: carpentries-i18n/i18n
Catalog: transifex/r-intro-geospatial/*/04__01-rstudio-intro.po
Languages: uk

source: --- # Please do not edit this file directly; it is auto generated. # Instead, please edit 01-rstudio-intro.md in _episodes_rmd/ title: "Introduction to R and RStudio" teaching: 20 exercises: 5 questions: - "How to find your way around RStudio?" - "How to interact with R?" - "How to install packages?" objectives: - "Describe the purpose and use of each pane in the RStudio IDE" - "Locate buttons and options in the RStudio IDE" - "Define a variable" - "Assign data to a variable" - "Use mathematical and comparison operators" - "Call functions" - "Manage packages" keypoints: - "Use RStudio to write and run R programs." - "R has the usual arithmetic operators." - "Use `<-` to assign values to variables." - "Use `install.packages()` to install packages (libraries)." source: Rmd ---
uk: --- # Будь ласка, не редагуйте цей файл безпосередньо; він згенерований автоматично. # Замість цього, будь ласка, відредагуйте 01-rstudio-intro.md в каталозі _episodes_rmd/ title: "Введення в R та RStudio" teaching: 20 exercises: 5 questions: - "Як зорієнтуватися в RStudio?" - "Як працювати з R?" - "Як встановити пакети?" objectives: - "Описати призначення та використання кожної панелі в RStudio IDE" - "Знайти кнопки та налаштування в RStudio IDE" - "Визначити змінну" - "Присвоїти дані змінній" - "Використати математичні оператори та оператори порівняння" - "Викликати функції" - "Керувати пакетами" keypoints: - "Використовуйте RStudio для написання та запуску програм на R." - "R має звичайні арифметичні оператори." - "Використовуйте `<-` для присвоєння значень змінним." - "Використовуйте `install.packages()` для встановлення пакетів (бібліотек)." source: Rmd ---

source: ## Motivation
uk: ## Мотивація

source: Science is a multi-step process: once you've designed an experiment and collected data, the real fun begins! This lesson will teach you how to start this process using R and RStudio. We will begin with raw data, perform exploratory analyses, and learn how to plot results graphically. This example starts with a dataset from [gapminder.org](https://www.gapminder.org) containing population information for many countries through time. Can you read the data into R? Can you plot the population for Senegal? Can you calculate the average income for countries on the continent of Asia? By the end of these lessons you will be able to do things like plot the populations for all of these countries in under a minute!
uk: Наука - це багатоступеневий процес: як тільки ви розробили експеримент і зібрали дані, починаються справжні веселощі! Цей урок навчить вас, як почати цей процес з використанням R та RStudio. Ми почнемо з необроблених даних, проведемо дослідницький аналіз і вивчимо, як відобразити результати графічним способом. Цей приклад починається з набору даних з [gapminder.org](https://www.gapminder.org), який містить інформацію про населення багатьох країн в різні часи. Чи можете ви прочитати дані в R? Чи можете ви побудувати діаграму для населення Сенегалу? Чи можете ви розрахувати середній дохід для країн, які знаходяться в Азії? До кінця цих уроків ви зможете зробити такі речі, як будувати графіки населення для всіх цих країн менше ніж за хвилину!

source: ## Before Starting The Workshop
uk: ## Перед початком семінару

source: Please ensure you have the latest version of R and RStudio installed on your machine. This is important, as some packages used in the workshop may not install correctly (or at all) if R is not up to date.
uk: Будь ласка, переконайтесь, що на вашому комп'ютері встановлена останні версії R та RStudio. Це важливо, оскільки деякі пакети, які використовуються у семінарі, можуть встановитись неправильно (або взагалі не встановитись), якщо R не останньої версії.

source: - [Download and install the latest version of R here](https://www.r-project.org/)
uk: - [Завантажити та інсталювати найновішу версію R можна тут](https://www.r-project.org/)

source: - [Download and install RStudio here](https://www.rstudio.com/)
uk: - [Завантажити та інсталювати RStudio можна тут](https://www.rstudio.com/)

source: ## Introduction to RStudio
uk: ## Вступ до роботи з RStudio

source: Throughout this lesson, we're going to teach you some of the fundamentals of the R language as well as some best practices for organizing code for scientific projects that will make your life easier.
uk: Протягом цього уроку ми навчимо вас певним основам мови програмування R, а також деяким кращим практикам організації коду для наукових проєктів, які полегшать ваше життя.

source: We'll be using RStudio: a free, open source R integrated development environment (IDE). It provides a built in editor, works on all platforms (including on servers) and provides many advantages such as integration with version control and project management.
uk: Ми будемо використовувати RStudio: безкоштовне інтегроване середовище розробки (IDE, від англ. Integrated Development Environment) з відкритим кодом для мови R. Воно забезпечує вбудований редактор, працює на всіх платформах (у тому числі на серверах) і забезпечує багато переваг, таких як інтеграція з управлінням версіями і управлінням проєктами.

source: **Basic layout**
uk: **Базове розташування**

source: When you first open RStudio, you will be greeted by three panels:
uk: Відкривши RStudio вперше, Ви побачите три панелі:

source: * The interactive R console (entire left)
uk: * Інтерактивна консоль R (вся ліва частина)

source: * Environment/History (tabbed in upper right)
uk: * Середовище (Environment)/Історія команд (History) (вкладки у верньому правому куті вікна)

source: * Files/Plots/Packages/Help/Viewer (tabbed in lower right)
uk: * Файли (Files)/Діаграми (Plots)/Пакети (Packages)/Довідка (Help)/Переглядач (Viewer) (закріплені у нижньому правому куті)

source: Once you open files, such as R scripts, an editor panel will also open in the top left.
uk: Як тільки ви відкриєте файли, такі як скрипти R, відкриється також і панель редактора зверху ліворуч.

source: ![RStudio layout with .R file open](../fig/01-rstudio-script.png)
uk: ![Вигляд RStudio з відкритим .R-файлом](../fig/01-rstudio-script.png)

source: ## Workflow within RStudio
uk: ## Послідовність дій в RStudio

source: There are two main ways one can work within RStudio.
uk: Існує два основних способи роботи в RStudio.

source: 1. Test and play within the interactive R console then copy code into
uk: 1. Перевірте та грайте в інтерактивній консолі R, потім скопіюйте код в

source: a .R file to run later. * This works well when doing small tests and initially starting off. * It quickly becomes laborious 2. Start writing in an .R file and use RStudio's shortcut keys for the Run command to push the current line, selected lines or modified lines to the interactive R console. * This is a great way to start; all your code is saved for later * You will be able to run the file you create from within RStudio or using R's `source()` function.
uk: файл .R, щоб запустити пізніше. * Це добре працює під час виконання невеликих тестів та початкового запуску. * Це швидко стає трудомістким. 2. Почніть писати у файлі .R і використовуйте гарячі клавіші для команди "Виконати" ("Run") щоб перемістити поточний рядок, виділені рядки чи змінені рядки на інтерактивну консоль R. * Це хороший спосіб почати; весь ваш код зберігається пізніше. * Ви будете мати змогу запустити файл, створений в RStudio або з використанням функції R's `source()`.

source: > ## Tip: Running segments of your code
uk: > ## Порада: Запуск сегментів вашого коду

source: > > RStudio offers you great flexibility in running code from within the editor > window. There are buttons, menu choices, and keyboard shortcuts. To run the > current line, you can > > 1. click on the `Run` button above the editor panel, or > 2. select "Run Lines" from the "Code" menu, or > 3. hit <kbd>Ctrl</kbd>+<kbd>Enter</kbd> in Windows, > <kbd>Ctrl</kbd>+<kbd>Return</kbd> in Linux, > or <kbd>&#8984;</kbd>+<kbd>Return</kbd> on OS X. > (This shortcut can also be seen by hovering > the mouse over the button). To run a block of code, select it and then `Run`. > If you have modified a line of code within a block of code you have just run, > there is no need to reselect the section and `Run`, you can use the next > button > along, `Re-run the previous region`. This will run the previous code block > including the modifications you have made.
uk: > > RStudio пропонує вам велику гнучкість у виконанні коду з вікна редактора > вікна редактора. Для цього є кнопки, пункти меню та комбінації клавіш. Для запуску на виконання > поточний рядок, ви можете > > 1. натиснути кнопку `Run`, тобто "Виконати" над панеллю редактора, або > 2. вибрати "Run Lines", тобто "Запустити рядки" у меню "Code" ("Код"), або > 3. натиснути 1Ctrl1+2Enter2 у Windows, > 3Ctrl3+4Return4 у Linux, > або 5&#8984;5+6Return6 в OS X. > (Це поєднання також можна побачити, якщо навести курсор миші на кнопку > мишею на кнопку). Щоб запустити блок коду, виберіть його і натисніть `Run`(`Виконати`). > Якщо ви змінили рядок коду у блоці коду, який щойно було запущено, > немає потреби повторно виділяти ділянку і натискати `Run` (`Виконати`), ви можете скористатися наступною кнопкою > поряд, `Re-run the previous region`(`Повторно виконати попередню ділянку`). У результаті буде виконано попередній блок коду > включно із внесеними вами змінами.

source: ## Introduction to R
uk: ## Вступ в R

source: Much of your time in R will be spent in the R interactive console. This is where you will run all of your code, and can be a useful environment to try out ideas before adding them to an R script file. This console in RStudio is the same as the one you would get if you typed in `R` in your command-line environment.
uk: Більша частина вашого часу буде витрачена в інтерактивній консолі R. Тут ви будете запускати весь свій код, і це може бути корисним середовищем, щоб спробувати свої ідеї, перш ніж додавати їх у файл скрипту R. Ця консоль в RStudio така ж, як і та, яку ви отримаєте, якщо введете `R` у своєму середовищі командного рядка.

source: The first thing you will see in the R interactive session is a bunch of information, followed by a ">" and a blinking cursor. In many ways this is similar to the shell environment you learned about during the shell lessons: it operates on the same idea of a "Read, evaluate, print loop": you type in commands, R tries to execute them, and then returns a result.
uk: Перше, що ви побачите в інтерактивному сеансі R, це купу інформації, за якою слідує знак ">" і миготливий курсор. Багато в чому це схоже на середовище оболонки, про яке ви дізналися під час уроків про саму оболонку : воно працює за тією ж ідеєю "Прочитати, оцінити, цикл читання, обчислення і виведення": ви вводите команди, R намагається їх виконати, а потім повертає результат.

source: ## Using R as a calculator
uk: ## Використання R як калькулятора

source: The simplest thing you could do with R is do arithmetic:
uk: Найпростішим способом використання R є виконання арифметичних операцій:

source: And R will print out the answer, with a preceding "`[1]`". Don't worry about this for now, we'll explain that later. For now think of it as indicating output.
uk: І R виведе відповідь, додавши до неї "`[1]`". Не хвилюйтесь про це зараз, ми пояснимо це пізніше. Наразі уявіть, що це вказує на вихідні дані.

source: Like bash, if you type in an incomplete command, R will wait for you to complete it:
uk: Як і у випадку з ударом, якщо ви введете неповну команду, R чекатиме, доки ви її завершите її:

source: Any time you hit return and the R session shows a "`+`" instead of a "`>`", it means it's waiting for you to complete the command. If you want to cancel a command you can simply hit "<kbd>Esc</kbd>" and RStudio will give you back the "`>`" prompt.
uk: Щоразу, коли ви натискаєте клавішу return і сеанс R показує "`+`" замість "`>`", це означає, що вона чекає на завершення виконання команди. Якщо ви хочете скасувати команду ви можете просто натиснути "<kbd>Esc</kbd>" і RStudio поверне вам запит "`>`".

source: > ## Tip: Cancelling commands
uk: > ## Підсказка: Скасування команд

source: > > If you're using R from the command line instead of from within RStudio, > you need to use <kbd>Ctrl</kbd>+<kbd>C</kbd> instead of <kbd>Esc</kbd> > to cancel the command. This applies to Mac users as well! > > Cancelling a command isn't only useful for killing incomplete commands: > you can also use it to tell R to stop running code (for example if it's > taking much longer than you expect), or to get rid of the code you're > currently writing.
uk: > > Якщо ви використовуєте R з командного рядка, а не з RStudio, > вам слід використовувати <kbd>Ctrl</kbd>+<kbd>C</kbd> замість <kbd>Esc</kbd> щоб скасувати команду. Це стосується і користувачів Mac! > > Скасування команди корисне не лише для знищення незавершених команд: > ви також можете використовувати її для того, щоб сказати R зупинити виконання коду (наприклад, якщо він > виконується набагато довше, ніж ви очікували), або позбутися коду, який ви > ви пишете, або позбутися коду, який ви зараз пишете.

source: When using R as a calculator, the order of operations is the same as you would have learned back in school.
uk: При використанні R як калькулятора порядок дій такий самий, як ви вивчали у школі.

source: From highest to lowest precedence:
uk: Від найвищого до найнижчого пріоритету:

source: * Parentheses: `(`, `)`
uk: * Круглі дужки: `(`, `)`

source: * Exponents: `^` or `**`
uk: * Експоненти: `^` or `**`

source: * Divide: `/`
uk: * Поділити: `/`

source: * Multiply: `*`
uk: * Помножити: `*`

source: * Add: `+`
uk: * Додати: `+`

source: * Subtract: `-`
uk: * Відняти: `-`

source: Use parentheses to group operations in order to force the order of evaluation if it differs from the default, or to make clear what you intend.
uk: Використовуйте круглі дужки для групування операцій, щоб примусово змінити порядок оцінки, якщо він відрізняється від стандартного, або для того, щоб пояснити, що ви маєте на увазі.

source: This can get unwieldy when not needed, but clarifies your intentions. Remember that others may later read your code.
uk: Це може бути громіздко, коли це не потрібно, але це прояснює ваші наміри. Пам'ятайте, що пізніше ваш код можуть прочитати інші.

source: The text after each line of code is called a "comment". Anything that follows after the hash (or octothorpe) symbol `#` is ignored by R when it executes code.
uk: Текст після кожного рядка коду називається "коментарем". Все, що слідує після символу хешування (або октоторпу) `#` R ігнорує під час виконання коду.

source: Really small or large numbers get a scientific notation:
uk: Дійсно малі або великі числа отримують наукові позначення:

source: Which is shorthand for "multiplied by `10^XX`". So `2e-4` is shorthand for `2 * 10^(-4)`.
uk: Це скорочено означає "помножити на `10^XX`". Отже, '2e-4' це скорочення від `2 * 10^(-4)`.

source: You can write numbers in scientific notation too:
uk: Ви можете писати числа і в науковій нотації:

source: Don't worry about trying to remember every function in R. You can look them up on Google, or if you can remember the start of the function's name, use the tab completion in RStudio.
uk: Не турбуйтеся про те, щоб запам'ятати кожну функцію в R. Ви можете шукати їх в Google, або, якщо ви пам'ятаєте початок назви функції, скористайтеся вкладкою завершення в RStudio.

source: This is one advantage that RStudio has over R on its own, it has auto-completion abilities that allow you to more easily look up functions, their arguments, and the values that they take.
uk: Це одна з переваг RStudio над R, яка полягає у тому, що вона має автодоповнення що дозволяє вам легше шукати функції, їхні аргументи та значення, які вони приймають.

source: Typing a `?` before the name of a command will open the help page for that command. As well as providing a detailed description of the command and how it works, scrolling to the bottom of the help page will usually show a collection of code examples which illustrate command usage. We'll go through an example later.
uk: Typing a `?` before the name of a command will open the help page for that command. As well as providing a detailed description of the command and how it works, scrolling to the bottom of the help page will usually show a collection of code examples which illustrate command usage. We'll go through an example later. Введення `?` перед назвою команди відкриє сторінку довідки для цієї команди. Окрім докладного опису команди і принципів її роботи прокручування до кінця сторінки довідки зазвичай показує колекцію прикладів коду, які ілюструють використання команди. Ми розглянемо один з прикладів пізніше.

source: ## Comparing things
uk: ## Порівняння

source: We can also do comparison in R:
uk: Ми також можемо робити порівняння в R:

source: > ## Tip: Comparing Numbers
uk: > ## Підсказка: Порівняння чисел

source: > > A word of warning about comparing numbers: you should > never use `==` to compare two numbers unless they are > integers (a data type which can specifically represent > only whole numbers). > > Computers may only represent decimal numbers with a > certain degree of precision, so two numbers which look > the same when printed out by R, may actually have > different underlying representations and therefore be > different by a small margin of error (called Machine > numeric tolerance). > > Instead you should use the `all.equal` function. > > Further reading: [http://floating-point-gui.de/](http://floating-point-gui.de/)
uk: > Кілька застережень щодо порівняння чисел: вам слід > ніколи не використовувати `==` для порівняння двох чисел, якщо вони не є > цілими числами (тип даних, який може представляти лише цілі числа). > > Комп'ютери можуть представляти десяткові числа лише з > певним ступенем точності, тому два числа, які виглядають > однаковими при виведенні на екран за допомогою R, насправді можуть мати > різне представлення, а отже, відрізнятися > з невеликою похибкою (так званою машинною числовим допуском). > > Замість цього вам слід використовувати функцію `all.equal`. > > Додаткова література: [http://floating-point-gui.de/](http://floating-point-gui.de/)

source: ## Variables and assignment
uk: ## Змінні та присвоєння

source: We can store values in variables using the assignment operator `<-`, like this:
uk: Ми можемо зберігати значення у змінних за допомогою оператора присвоювання `<-`, наприклад, так:

source: Notice that assignment does not print a value. Instead, we stored it for later in something called a **variable**. `x` now contains the **value** `0.025`:
uk: Notice that assignment does not print a value. Instead, we stored it for later in something called a **variable**. `x` now contains the **value** `0.025`: Зверніть увагу, що присвоювання не виводить значення. Натомість, ми зберегли його для подальшого використання у місці, яке називається **змінна**. Тепер `x` містить **значення** `0.025`:

source: More precisely, the stored value is a *decimal approximation* of this fraction called a [floating point number](http://en.wikipedia.org/wiki/Floating_point).
uk: Точніше, збережене значення є *десятковим наближенням* цього дробу, який називається [число з плаваючою комою](http://en.wikipedia.org/wiki/Floating_point).

source: Look for the `Environment` tab in one of the panes of RStudio, and you will see that `x` and its value have appeared. Our variable `x` can be used in place of a number in any calculation that expects a number:
uk: Знайдіть вкладку `Environment`('Середовище') на одній з панелей RStudio, і ви побачите, що з'явився параметр `x` і його значення. Нашу змінну `x` можна використовувати замість числа у будь-яких обчисленнях, де очікується число:

source: Notice also that variables can be reassigned:
uk: Зверніть увагу, що змінні можна перепризначати:

source: `x` used to contain the value 0.025 and and now it has the value 100.
uk: Раніше `x` містив значення 0.025, а тепер має значення 100.

source: Assignment values can contain the variable being assigned to:
uk: Значення присвоювання можуть містити змінну, якій присвоюється:

source: The right hand side of the assignment can be any valid R expression. The right hand side is *fully evaluated* before the assignment occurs.
uk: Правою частиною присвоювання може бути будь-який допустимий вираз у мові R. Права частина *повністю обчислюється* перед присвоюванням.

source: > ## Challenge 1
uk: > ## Завдання 1

source: > > What will be the value of each variable after each > statement in the following program? > > > ~~~ > mass <- 47.5 > age <- 122 > mass <- mass * 2.3 > age <- age - 20 > ~~~ > {: .language-r} > > > ## Solution to challenge 1 > > > > > > ~~~ > > mass <- 47.5 > > ~~~ > > {: .language-r} > > This will give a value of 47.5 for the variable mass > > > > > > ~~~ > > age <- 122 > > ~~~ > > {: .language-r} > > This will give a value of 122 for the variable age > > > > > > ~~~ > > mass <- mass * 2.3 > > ~~~ > > {: .language-r} > > This will multiply the existing value of 47.5 by 2.3 to give a new value of > > 109.25 to the variable mass. > > > > > > ~~~ > > age <- age - 20 > > ~~~ > > {: .language-r} > > This will subtract 20 from the existing value of 122 to give a new value > > of 102 to the variable age.
uk: > > Яким буде значення кожної змінної після кожного > твердження в наступній програмі? > > > ~~~ > mass <- 47.5 > age <- 122 > mass <- mass * 2.3 > age <- age - 20 > ~~~ > {: .language-r} > > > ## Розв'язання до завдання 1 > > > > > > ~~~ > > mass <- 47.5 > > ~~~ > > {: .language-r} > > Це дасть значення 47.5 для змінної маси > > > > > > ~~~ > > age <- 122 > > ~~~ > > {: .language-r} > > Це дасть значення 122 для змінного віку > > > > > > ~~~ > > mass <- mass * 2.3 > > ~~~ > > {: .language-r} > > Це помножить існуюче значення 47.5 на 2.3, щоб дати нове значення > > 109.25 до змінної маси. > > > > > > ~~~ > > age <- age - 20 > > ~~~ > > {: .language-r} > > Це відніме 20 від існуючого значення 122, щоб дати нове значення > > 102 до змінного віку.

source: > ## Challenge 2
uk: > ## Завдання 2

source: > > Run the code from the previous challenge, and write a command to > compare mass to age. Is mass larger than age? > > > ## Solution to challenge 2 > > > > One way of answering this question in R is to use the `>` to set up the following: > > > > ~~~ > > mass > age > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > [1] TRUE > > ~~~ > > {: .output} > > This should yield a boolean value of TRUE since 109.25 is greater than 102.
uk: > > Запустіть код із попереднього завдання і напишіть команду для > порівняння маси з віком. Чи маса більша за вік? > > > ## Розв'язання до завдання 2 > > > > Одним із способів відповіді на це питання в R є використання `>` для налаштування наступного: > > > > ~~~ > > mass > age > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > [1] TRUE > > ~~~ > > {: .output} > > Це повинно дати логічне значення TRUE, оскільки 109.25 більше ніж 102.

source: Variable names can contain letters, numbers, underscores and periods. They cannot start with a number nor contain spaces at all. Different people use different conventions for long variable names, these include
uk: Назви змінних можуть містити літери, цифри, підкреслення та крапки. Вони не можуть починатися з цифри або взагалі містити пробілів. Різні люди використовують різні домовленості щодо довгих імен змінних, зокрема

source: * periods.between.words
uk: * крапки.між.словами

source: * underscores\_between_words
uk: * нижні\_підкреслення_між_словами

source: * camelCaseToSeparateWords
uk: * верблюжийРегістрДляРозділенняСлів

source: What you use is up to you, but **be consistent**.
uk: Те, що ви використовуєте залежить від вас, але **будьте послідовними**.
