Repository: carpentries-i18n/i18n
Catalog: transifex/r-intro-geospatial/*/04__01-rstudio-intro.po
Languages: uk

source: It is also possible to use the `=` operator for assignment:
uk: Для присвоювання також можна використовувати оператор `=`:

source: But this is much less common among R users. The most important thing is to **be consistent** with the operator you use. There are occasionally places where it is less confusing to use `<-` than `=`, and it is the most common symbol used in the community. So the recommendation is to use `<-`.
uk: Але це набагато рідше зустрічається серед користувачів R. Найважливіше - це **бути послідовним** з оператором, який ви використовуєте. Іноді трапляються випадки, де використання `<-` менш заплутане, ніж `=`, і це найпоширеніший символ, який використовується у спільноті. Тому ми рекомендуємо використовувати `<-`.

source: > ## Challenge 3
uk: > ## Завдання 3

source: > > Which of the following are valid R variable names? > > ~~~ > min_height > max.height > _age > .mass > MaxLength > min-length > 2widths > celsius2kelvin > ~~~ > {: .language-r} > > > ## Solution to challenge 3 > > > > The following can be used as R variables: > > > > ~~~ > > min_height > > max.height > > MaxLength > > celsius2kelvin > > ~~~ > > {: .language-r} > > > > The following creates a hidden variable: > > > > ~~~ > > .mass > > ~~~ > > {: .language-r} > > > > We won't be discussing hidden variables in this lesson. We recommend not using a period at the > > beginning of variable names unless you intend your variables to be hidden. > > > > The following will not be able to be used to create a variable > > > > ~~~ > > _age > > min-length > > 2widths > > ~~~ > > {: .language-r}
uk: > > Які з них є дійсними іменами змінних R? > > ~~~ > min_height > max.height > _age > .mass > MaxLength > min-length > 2widths > celsius2kelvin > ~~~ > {: .language-r} > > > ## Solution to challenge 3 > > > > Як змінні R можна використовувати наступні: > > > > ~~~ > > min_height > > max.height > > MaxLength > > celsius2kelvin > > ~~~ > > {: .language-r} > > > > Наступне створює приховану змінну: > > > > ~~~ > > .mass > > ~~~ > > {: .language-r} > > > > Ми не будемо обговорювати приховані змінні в цьому уроці. Ми рекомендуємо не використовувати період > > на початку імен змінних, якщо ви не хочете, щоб ваші змінні були приховані. > > > > Наступні не зможуть бути використані для створення змінної > > > > ~~~ > > _age > > min-length > > 2widths > > ~~~ > > {: .language-r}
