Repository: carpentries-i18n/i18n
Catalog: transifex/r-intro-geospatial/*/05__02-project-intro.po
Languages: uk

source: ## Introduction
uk: ## Вступ

source: The scientific process is naturally incremental, and many projects start life as random notes, some code, then a manuscript, and eventually everything is a bit mixed together. Organising a project involving spatial data is no different from any other data analysis project, although you may require more disk space than usual.
uk: Науковий процес, природно, є поетапним, і багато проектів починаються з випадкових нотаток, трохи коду, потім рукопис і, зрештою, все потроху змішанt разом. Організація проекту із використанням просторових даних нічим не відрізняється від будь-якого іншого проект аналізу даних, хоча вам може знадобитися більше дискового простору, ніж зазвичай.

source: <div class="text-center"> <blockquote class="twitter-tweet"><p>Managing your projects in a reproducible fashion doesn't just make your science reproducible, it makes your life easier.</p>— Vince Buffalo (@vsbuffalo) <a href="https://twitter.com/vsbuffalo/status/323638476153167872">April 15, 2013</a></blockquote> <script async src="//platform.twitter.com/widgets.js" charset="utf-8"></script> </div>
uk: <div class="text-center"> <blockquote class="twitter-tweet"><p>Управління вашими проєктами відтворюваним способом не просто робить вашу науку відтворюваною, це полегшує вам життя.</p>— Vince Buffalo (@vsbuffalo) <a href="https://twitter.com/vsbuffalo/status/323638476153167872">April 15, 2013</a></blockquote> <script async src="//platform.twitter.com/widgets.js" charset="utf-8"></script> </div>

source: Most people tend to organize their projects like this:
uk: Більшість людей намагаються організовувати свої проєкти так:

source: There are many reasons why we should *ALWAYS* avoid this:
uk: Є багато причин чому ми *ЗАВЖДИ* повинні уникати цього:

source: 1. It is really hard to tell which version of your data is
uk: 1. Насправді важко визначити, яка версія ваших даних

source: the original and which is the modified; 2. It gets really messy because it mixes files with various extensions together; 3. It probably takes you a lot of time to actually find things, and relate the correct figures to the exact code that has been used to generate it;
uk: є оригінальною, а яка модифікованою; 2. Він стає дуже брудним, оскільки він змішує файли з різними розширеннями разом; 3. Можливо, вам знадобить багато часу, щоб справді знайти і пов'язати правильні цифри з точним кодом, які було використано для його створення;

source: A good project layout will ultimately make your life easier:
uk: Хороша стуктура проекту зрештою полегшить ваше життя:

source: * It will help ensure the integrity of your data;
uk: * Вона допоможе забезпечити цілісність ваших даних;

source: * It makes it simpler to share your code with someone else
uk: *Вона спрощує можливість поділитися своїм кодом з іншими людьми

source: (a lab-mate, collaborator, or supervisor); * It allows you to easily upload your code with your manuscript submission; * It makes it easier to pick the project back up after a break.
uk: (a lab-mate, collaborator, or supervisor); * Це дозволяє вам легко завантадити ваш код із рукописом; * Це полегшує відновлення проєкту після перерви.

source: ## A possible solution
uk: ## Можливе рішення

source: Fortunately, there are tools and packages which can help you manage your work effectively.
uk: На щастя, існують інструменти та пакети, які допоможуть вам ефекттивно керувати роботою.

source: One of the most powerful and useful aspects of RStudio is its project management functionality. We'll be using this today to create a self-contained, reproducible project.
uk: Одним із найпотужніших і найкорисніших аспектів RStudio є функціональне керування проєктами. Ми будемо використовувати це сьогодні, щоб створити незалежний та відтворюваний проєкт.

source: > ## Challenge: Creating a self-contained project
uk: > ## Виклик: Створення самостійного проєкту

source: > > We're going to create a new project in RStudio: > > 1. Click the "File" menu button, then "New Project". > 2. Click "New Directory". > 3. Click "Empty Project". > 4. Type in "r-geospatial" as the name of the directory. > 5. Click the "Create Project" button.
uk: > > Ми збираємося створити новий проєкт в RStudio: > > 1. Натисніть кнопку меню "File", потім "New Project". > 2. Натисніть "New Directory". > 3. Натисніть "Empty Project". > 4. Введіть "r-geospatial" як назву каталогу. > 5. Натисніть кнопку "Create Project".

source: A key advantage of an RStudio Project is that whenever we open this project in subsequent RStudio sessions our working directory will *always* be set to the folder `r-geospatial`. Let's check our working directory by entering the following into the R console:
uk: Ключовою перевагою проєкту в RStudio є те, що коли б, не відкрили проєкт в наступній сесіїї RStudio наш робочий каталог *завжди* буде встановлено в папці `r-geospatial`. Давайте перевіримо наш робочий каталог ввівши в консоль R наступне:

source: R should return `your/path/r-geospatial` as the working directory.
uk: R має повернути `your/path/r-geospatial` як робочий каталог.

source: ## Best practices for project organization
uk: ## Кращі практики для організації проєкту

source: Although there is no "best" way to lay out a project, there are some general principles to adhere to that will make project management easier:
uk: Хоча немає "кращого" способу викласти проєкт, є декілька загальних принципів, які слід дотримуватись, щоб полегшити управління проєктами:

source: ### Treat data as read only
uk: ### Позначайте дані лише як прочитані

source: This is probably the most important goal of setting up a project. Data is typically time consuming and/or expensive to collect. Working with them interactively (e.g., in Excel) where they can be modified means you are never sure of where the data came from, or how it has been modified since collection. It is therefore a good idea to treat your data as "read-only".
uk: Це ,мабуть, найважливіша мета створення проєкту. Дані як правило трудомісткі та/або дорогі для колекціонування. Робота з ними в інтерактивній формі (e.g., в Excel), де вони можуть бути змінені, означає, що ви ніколи не впевнені, звідки з'явилися дані, або як вони були змінені із моменту збору. Тому, добре розглядати свої дані лише як "read-only".

source: ### Data Cleaning
uk: ### Очищення даних

source: In many cases your data will be "dirty": it will need significant preprocessing to get into a format R (or any other programming language) will find useful. This task is sometimes called "data munging". I find it useful to store these scripts in a separate folder, and create a second "read-only" data folder to hold the "cleaned" data sets.
uk: У багатьох випадках ваші дані будуть "брудними": вони потребуватимуть значної попередньої обробки щоб перетворитись у формат R (або будь-яку іншу мову програмування). Це завдання іноді називають "data munging". Я вважаю, що це корисно, зберігати ці скрипти в окрему папку, і створити другу папку даних "read-only" , щоб отримати "cleaned" набори даних.

source: ### Treat generated output as disposable
uk: ###Трактувати згенерований вихід як одноразовий

source: Anything generated by your scripts should be treated as disposable: it should all be able to be regenerated from your scripts.
uk: Будь-що, що створюється за допомогою ваших скриптів, повинно трактуватися як одноразовий матеріал: все повинно бути згенеровано знову за допомогою ваших скриптів.

source: There are lots of different ways to manage this output. I find it useful to have an output folder with different sub-directories for each separate analysis. This makes it easier later, as many of my analyses are exploratory and don't end up being used in the final project, and some of the analyses get shared between projects.
uk: Існує багато різних способів для керування цим виведенням. Я вважаю, корисно мати папку виведення з різними підкаталогами для кожного аналізу окремо. Це полегшує роботу пізніше, так як багато з моїх аналізів є дослідницькими і не будуть використовуватись у фінальному проєкті, і деякі з аналізів діляться між проєктами.

source: ### Keep related data together
uk: ### Зберігайте пов'язані дані разом

source: Some GIS file formats are really 3-6 files that need to be kept together and have the same name, e.g. shapefiles. It may be tempting to store those components separately, but your spatial data will be unusable if you do that.
uk: Деякі файли формату GIS справді складаються з 3-6 файлів, які потрібно зберігати разом і мають мати однакове ім'я, наприклад shapefiles. Може виникнути спокуса зберегти ці компоненти окремо, але якщо ви це зробите, то ваші просторові дані стануть непридатними для користування.

source: ### Keep a consistent naming scheme
uk: ### Дотримуйтесь послідовної схеми назв

source: It is generally best to avoid renaming downloaded spatial data, so that a clear connection is maintained with the point of truth. You may otherwise find yourself wondering whether `file_A` really is just a copy of `Official_file_on_website` or not.
uk: Як правило, краще уникати перейменування завантажених просторових даних, щоб підтримувався чіткий зв'язок з істиною. Інакше, ви можете подумати, чи `file_A` дійсно є копією `Official_file_on_website` чи ні.

source: For datasets you generate, it's worth taking the time to come up with a naming convention that works for your project, and sticking to it. File names don't have to be long, they just have to be long enough that you can tell what the file is about. Date generated, topic, and whether a product is intermediate or final are good bits of information to keep in a file name. For more tips on naming files, check out [the slides from Jenny Bryan's talk "Naming things" at the 2015 Reproducible Science Workshop](https://speakerdeck.com/jennybc/how-to-name-files).
uk: Для набору даних, які ви генеруєте, краще виділити час, щоб придумати найменування, яке буде працювати у вашому проєкті і дотримуйтесь цього. Назви файлів не мають бути довгими, вони мають достатньо довгими, щоб ви могли зрозуміти який це файл. Дата створення, тема, та чи є цей файл проміжним чи остаточним - це хороші фрагменти, які варто зазначити у назві файлу. Для додаткових порад щодо іменування файлів, перегляньте [the slides from Jenny Bryan's talk "Naming things" at the 2015 Reproducible Science Workshop](https://speakerdeck.com/jennybc/how-to-name-files).

source: > ## Tip: Good Enough Practices for Scientific Computing
uk: > ## Порада: Доволі хороші практики для наукових досліджень

source: > > [Good Enough Practices for Scientific Computing](https://github.com/swcarpentry/good-enough-practices-in-scientific-computing/blob/gh-pages/good-enough-practices-for-scientific-computing.pdf) gives the following recommendations for project organization: > > 1. Put each project in its own directory, which is named after the project. > 2. Put text documents associated with the project in the `doc` directory. > 3. Put raw data and metadata in the `data` directory, and files generated during cleanup and analysis in a `results` directory. > 4. Put source for the project's scripts and programs in the `src` directory, and programs brought in from elsewhere or compiled locally in the `bin` directory. > 5. Name all files to reflect their content or function.
uk: > > [Доволі хороші практики для наукових досліджень](https://github.com/swcarpentry/good-enough-practices-in-scientific-computing/blob/gh-pages/good-enough-practices-for-scientific-computing.pdf) дає наступні рекомендації щодо організації проєкту: > > 1. Розміщуйте кожен проєкт у свій власний каталог, який названий так само як і проєкт. > 2. Розміщуйте текстові документи, які пов'язані з проєктом, у каталог `doc`. > 3. Розміщуйте необроблені дані та метадані в каталозі `data`, а файли згенеровані під час очищення та аналізу у каталог `results`. > 4. Розміщуйте джерела для скриптів та програм проєкту в каталозі `src`, і програми, перенесені з іншого місця або скомпільовані локально в каталоз `bin`. > 5. Назвіть усі файли для відображення їхнього вмісту та функцій.

source: ### Save the data in the data directory
uk: ### Збереження даних у каталозі даних

source: Now we have a good directory structure we will now place/save our data files in the `data/` directory.
uk: Ми маємо хорошу структуру діалогів і тепер ми розмістимо/збережемо наші файли даних у каталозі `data/`.

source: > 1\. Download each of the data files listed below (CTRL + S, right mouse click -> "Save as", or File -> "Save page as")
uk: > 1\. Завантажте кожен із файлів даних, наведених нижче(CTRL + S, клацніть правою кнопкою миші -> "Save as", or File -> "Save page as")

source: > 2\. Make sure the files have the following names:
uk: > 2\. Переконайтесь, що файли мають такі назви:

source: > > 3\. Save the files in the `data/` folder within your project. > > We will load and inspect these data later.
uk: > > 3\. Збережіть файли в папці `data/` всередині вашого проєкту. > > Ми завантажимо і перевіримо ці дані пізніше.

source: > We also want to move the data that we downloaded from the [data page](http://datacarpentry.org/geospatial-workshop/data/) into a subdirectory
uk: > Також ми хочемо перемістити дані, які ми завантажили [data page](http://datacarpentry.org/geospatial-workshop/data/) в підкаталог

source: > inside `r-geospatial`. If you haven't already downloaded the data, you can do so by clicking
uk: > всередині `r-geospatial`. Якщо ви ще не завантажили дані, ви можете зробити це натиснувши

source: > [this download link](https://ndownloader.figshare.com/articles/2009586/versions/10).
uk: > [це посилання для завантаження](https://ndownloader.figshare.com/articles/2009586/versions/10).

source: > 1. Move the downloaded zip file to the `data` directory.
uk: > 1. Перемістіть завантажений zip-файл у каталог `data`.

source: > 2. Once the data have been moved, unzip all files.
uk: > 2. Після переміщення даних розпакуйте всі файли.

source: Once you have completed moving the data across to the new folder, your data directory should look as follows:
uk: Після завершення переміщення даних у нову папку, ваш каталог даних повинен виглядати наступним чином:

source: ### Stage your scripts
uk: ### Розділяйте свої скрипти

source: Creating separate R scripts or Rmarkdown documents for different stages of a project will maximise efficiency. For instance, separating data download commands into their own file means that you won't re-download data unnecessarily.
uk: Створення окремих R scripts або Rmarkdown документів для різних етапів проєкту дозволить підвищити ефективність. Наприклад, розділення команд завантаження даних на власний файл означає, що ви не будете повторно завантажувати дані без необхідності.
