Repository: carpentries-i18n/i18n
Catalog: transifex/r-intro-geospatial/*/11__08-writing-data.po
Languages: uk

source: ## Saving plots
uk: ## Збереження рисунків

source: You can save a plot from within RStudio using the 'Export' button in the 'Plot' window. This will give you the option of saving as a .pdf or as .png, .jpg or other image formats.
uk: Ви можете зберегти рисунок/діаграму/схему за допомогою кнопки 'Export' у вікні 'Plot'. Це дасть вам можливість зберегти як .pdf або як .png, .jpg або в інших форматах зображень.

source: Sometimes you will want to save plots without creating them in the 'Plot' window first. Perhaps you want to make a pdf document with multiple pages: each one a different plot, for example. Or perhaps you're looping through multiple subsets of a file, plotting data from each subset, and you want to save each plot. In this case you can use a more flexible approach. The `pdf()` function creates a new pdf device. You can control the size and resolution using the arguments to this function.
uk: Іноді ви захочете зберегти рисунок, не створюючи їх спочатку в вікні 'Plot'. Можливо ви захочете зробити pdf документ з декількома сторінками: на кожній з яких буде інший рисунок. Або можливо ви циклічно переглядаєте кілька підмножин файлу, будуючи структури даних з кожної підмножини, і ви хочете зберегти кожен малюнок. У ц ьому випадку ви можете використовувати більш гнучкий підхід. Функція `pdf()` створює новий pdf пристрій. Ви можете контролювати розмір і роздільну здатність використовуючи аргументи функції.

source: ~~~ pdf("Distribution-of-gdpPercap.pdf", width=12, height=4) ggplot(data = gapminder, aes(x = gdpPercap)) + geom_histogram() # You then have to make sure to turn off the pdf device! dev.off() ~~~
uk: ~~~ pdf("Distribution-of-gdpPercap.pdf", width=12, height=4) ggplot(data = gapminder, aes(x = gdpPercap)) + geom_histogram() # Потім ви повинні переконатися що вимкнули pdf пристрій! dev.off() ~~~

source: Open up this document and have a look.
uk: Відкрийте цей документ і подивіться.

source: > > Rewrite your 'pdf' command to print a second > page in the pdf, showing the side-by-side bar > plot of gdp per capita in countries in the Americas > in the years 1952 and 2007 that you created in the > previous episode. > > > ## Solution to challenge 1 > > > > > > ~~~ > > pdf("Distribution-of-gdpPercap.pdf", width = 12, height = 4) > > ggplot(data = gapminder, aes(x = gdpPercap)) + > > geom_histogram() > > > > ggplot(data = gapminder_small_2, aes(x = country, y = gdpPercap, fill = as.factor(year))) + > > geom_col(position = "dodge") + coord_flip() > > > > dev.off() > > ~~~ > > {: .language-r}
uk: > > Перепишіть команду 'pdf' для друку другої > сторінки в, показуючи поруч панель > графік ВВП на душу населення в країнах Америки > у 1952-2007 роках, які ви створили в > попередньому епізоді. > > > ## Розв'язок до завдання 1 > > > > > > ~~~ > > pdf("Distribution-of-gdpPercap.pdf", width = 12, height = 4) > > ggplot(data = gapminder, aes(x = gdpPercap)) + > > geom_histogram() > > > > ggplot(data = gapminder_small_2, aes(x = country, y = gdpPercap, fill = as.factor(year))) + > > geom_col(position = "dodge") + coord_flip() > > > > dev.off() > > ~~~ > > {: .language-r}

source: The commands `jpeg`, `png` etc. are used similarly to produce documents in different formats.
uk: Команди `jpeg`, `png` тощо. використовуються аналогічно для створення документів у різних форматах.

source: ## Writing data
uk: ## Написання даних

source: At some point, you'll also want to write out data from R.
uk: У якийсь момент, ви захочете виписати дані з R.

source: We can use the `write.csv` function for this, which is very similar to `read.csv` from before.
uk: Для цього ми можемо використовувати функцію `write.csv`, яка дуже схожа до `read.csv` з попереднього.

source: Let's create a data-cleaning script, for this analysis, we only want to focus on the gapminder data for Australia:
uk: Давайте створимо скрипт очищення даних, для цього аналізу, ми хочемо зосередитись тільки на даних gapminder для Австралії:

source: Let's open the file to make sure it contains the data we expect. Navigate to your `cleaned-data` directory and double-click the file name. It will open using your computer's default for opening files with a `.csv` extension. To open in a specific application, right click and select the application. Using a spreadsheet program (like Excel) to open this file shows us that we do have properly formatted data including only the data points from Australia. However, there are row numbers associated with the data that are not useful to us (they refer to the row numbers from the gapminder data frame).
uk: Давайте відкриємо файл, щоб переконатись, що він містить дані, які ми очікуємо. Перейдіть до вашого `cleaned-data` каталог і двічі клікніть на назву файлу. Він відкриється за допомогою комп'ютера із розширенням `.csv` за замовчуванням. Щоб відкрити у певному додатку, клацніть правою кнопкою миші і оберіть програму. Використання програми електронної таблиці (наприклад Excel), щоб відкрити цей файл показує нам що у нас є правильно відформатовані дані включаючи тільки точки даних з Австралії. Однак, є номери рядків пов'язані з даними, які безкорисні для нас (вони відносяться до номерів рядків з gapminder data frame).

source: Let's look at the help file to work out how to change this behaviour.
uk: Давайте подивимось на файл довідки, щоб з'ясувати, як змінити цю поведінку.

source: By default R will write out the row and column names when writing data to a file. To over write this behavior, we can do the following:
uk: За замовчування, R випише назви рядків і стовпців при записі даних у файл. Щоб записати цю поведінку, ми можемо зробити наступне:

source: > > Subset the gapminder > data to include only data points collected since 1990. Write out the new subset to a file > in the `cleaned-data/` directory. > > > ## Solution to challenge 2 > > > > > > ~~~ > > gapminder_after_1990 <- filter(gapminder, year > 1990) > > > > write.csv(gapminder_after_1990, > > file = "cleaned-data/gapminder-after-1990.csv", > > row.names = FALSE) > > ~~~ > > {: .language-r}
uk: > > Підмножин gapminder > дані, які включають тільки точки даних, зібраних з 1990. Запишіть нову підмножину до файла > у каталозі `cleaned-data/`. > > > ## Розв'язок до завдання 2 > > > > > > ~~~ > > gapminder_after_1990 <- filter(gapminder, year > 1990) > > > > write.csv(gapminder_after_1990, > > file = "cleaned-data/gapminder-after-1990.csv", > > row.names = FALSE) > > ~~~ > > {: .language-r}
