Repository: carpentries-i18n/i18n
Catalog: transifex/r-intro-geospatial/*/15__guide.po
Languages: uk

source: --- layout: page title: "Instructor Notes" ---
uk: --- layout: page title: "Примітки для інструктора" ---

source: relative path root: {{ relative_root_path }}
uk: кореневий каталог: {{ relative_root_path }}

source: ## Instructor notes
uk: ## Примітки для інструктора

source: ## Lesson motivation and learning objectives
uk: ## Мотивація заняття та навчальні цілі

source: This lesson is designed to introduce learners to the core concepts of R that they will need in order to complete the other lessons in this workshop. It is intended for learners who have no prior experience with R. If your workshop learners have all completed another Software or Data Carpentry R workshop, or have taken courses in R, you can skip this lesson and move straight into the [Introduction to Geospatial Raster and Vector Data with R](https://datacarpentry.org/r-raster-vector-geospatial/) lesson.
uk: Цей урок призначений для ознайомлення учнів з основними поняттями R, які їм знадобляться для того, щоб закінчити уроки у цьому семінарі. Він призначений для учнів, які не мають попереднього досвіду роботи з R. Якщо учасники вашого семінару закінчили інший семінар з R від Software Carpentry чи Data Carpentry, або пройшли інші курси з R, ви можете пропустити цей урок і рухатись прямо в урок [Введення до геопросторових растрових та векторних даних з R](https://datacarpentry.org/r-raster-vector-geospatial/).

source: This lesson is a trimmed-down version of the [R for Reproducible Scientific Analysis](http://swcarpentry.github.io/r-novice-gapminder) SWC lesson. It does not cover visualization in detail, as the later lesson in this workshop covers visualization in the context of geospatial data.
uk: Цей урок є скороченою версією уроку SWC [R для відтворюваного наукового аналізу](http://swcarpentry.github.io/r-novice-gapminder). Він не охоплює візуалізацію в деталях, але подальший урок в цьому семінарі охоплює візуалізацію в контексті геопросторових даних.

source: ## Lesson design
uk: ## Дизайн уроку

source: #### [Introduction to R and RStudio]({{ relative_root_path }}/{% link _episodes/01-rstudio-intro.md %})
uk: #### [Вступ до R та RStudio]({{ relative_root_path }}/{% link _episodes/01-rstudio-intro.md %})

source: * If your workshop includes the [Introduction to Geospatial Concepts](https://datacarpentry.org/organization-geospatial/) lesson, learners will have
uk: * Якщо ваш семінар включає урок [Вступ до гепросторових концепцій](https://datacarpentry.org/organization-geospatial/), учням

source: just been introduced to RStudio in the context of the overall Geospatial software landscape. * Have your learners open RStudio and follow along as you explain each pane. Make sure that your RStudio environment is the default so learners can follow along. * Be sure to explain how to execute code from the script window, whether you're using the Run button or the keyboard shortcut. * Learners will be using several libraries in the next lesson, so be sure to introduce what a library is and how it is installed.
uk: тільки представлять RStudio в контексті загального ландшафту геопросторового програмного забезпечення. * Запропонуйте учням відкрити RStudio і спостерігати за тим, як ви пояснюєте кожну панель. Переконайтеся, що середовище RStudio вибрано за замовчуванням, щоб учні могли повторювати за вами. * Обов'язково поясніть, як виконувати код у вікні скрипта незалежно від того, чи використовуєте ви кнопку Run або комбінації клавіш. * Учні будуть використовувати кілька бібліотек в наступному уроці, тому не забудьте ознайомити їх з тим, що таке бібліотека і як її встановити.

source: #### [Project Management With RStudio]({{ relative_root_path }}/{% link _episodes/02-project-intro.md %})
uk: #### [Управління проєктами в RStudio]({{ relative_root_path }}/{% link _episodes/02-project-intro.md %})

source: * Make sure learners download the data files in Challenge 1 and move those files
uk: * Переконайтесь, що учні завантажують файли даних в Завданні 1 і переміщують ці файли

source: to their `data/` directory.
uk: до свого каталогу `data/`.

source: #### [Data Structures]({{ relative_root_path }}/{% link _episodes/03-data-structures-part1.md %})
uk: #### [Структури даних]({{ relative_root_path }}/{% link _episodes/03-data-structures-part1.md %})

source: * Learners will work with factors in the following lesson. Be sure to
uk: * Учні будуть працювати з факторами на наступному уроці. Обов'язково

source: cover this concept. * If needed for time reasons, you can skip the section on lists. The learners don't use lists in the rest of the workshop.
uk: охопіть цей концепт. * Якщо це необіхдно з причин часу, ви можете пропустити розділ про списки. Учні не вискористовують списки в решті семінару.

source: #### [Exploring Data Frames]({{ relative_root_path }}/{% link _episodes/04-data-structures-part2.md %})
uk: #### [Вивчення Data Frames]({{ relative_root_path }}/{% link _episodes/04-data-structures-part2.md %})

source: * Pay attention to and explain the errors and warnings generated from the examples in this episode.
uk: * Зверніть увагу на помилки і попередження, отримані з прикладів у цьому епізоді, та поясніть їх.

source: #### [Subsetting Data]({{ relative_root_path }}/{% link _episodes/05-data-subsetting.md %})
uk: #### [Формування підмножин даних]({{ relative_root_path }}/{% link _episodes/05-data-subsetting.md %})

source: * The episode after this one covers the `dplyr` package, which has an
uk: * Епізод після поточного охоплює пакет `dplyr`, який має

source: alternate subsetting mechanism. Learners do still need to learn the base R subsetting covered here, as `dplyr` won't work in all situations. However, the examples in the rest of the workshop focus on `dplyr` syntax.
uk: альтернативний механізм формування підмножин. Учням все ще потрібно вивчити базове формування підмножин в R, охоплене тут, оскільки `dplyr` буде працювати не у всіх ситуаціях. Однак, приклади в решті семінару зосереджені на синтаксисі `dplyr`.

source: #### [Dataframe Manipulation with dplyr]({{ relative_root_path }}/{% link _episodes/06-dplyr.md %})
uk: #### [Маніпуляція фреймами даних з dplyr]({{ relative_root_path }}/{% link _episodes/06-dplyr.md %})

source: * Introduce the `dplyr` package as a simpler, more intuitive way of doing
uk: * Представте пакет `dplyr` як більш простий, інтуїтивно зрозуміліший спосіб формування

source: subsetting. * Unlike other SWC and DC R lessons, this lesson does **not** include data reshaping with `tidyr` as it isn't used in the rest of the workshop.
uk: підмножин. * На відміну від інших уроків SWC і DC R, цей урок **не** включає в себе зміну даних з `tidyr`, оскільки він не використовується в решті семінару.

source: #### [Introduction to Visualization]({{ relative_root_path }}/{% link _episodes/07-plot-ggplot2.md %})
uk: #### [Вступ до візуалізації]({{ relative_root_path }}/{% link _episodes/07-plot-ggplot2.md %})

source: * This episode introduces `geom_col` and `geom_histogram`. These geoms are used
uk: * Цей епізод представляє `geom_col` і `geom_histogram`. Ці геоми використовуються

source: in the rest of the workshop, along with geoms specifically for geospatial data. * Emphasize that we will go much deeper into visualization and creating publication-quality graphics later in the workshop.
uk: у решті семінару поряд з геомами, специфічними для геопросторових даних. * Підкресліть, що ми будемо йти набагато глибше у візуалізацію і створення якісних графіків пізніше у цьому семінарі.

source: #### [Writing Data]({{ relative_root_path }}/{% link _episodes/08-writing-data.md %})
uk: #### [Написання даних]({{ relative_root_path }}/{% link _episodes/08-writing-data.md %})

source: * Learners will need to have created the directory structure described in
uk: * Слухачі повинні будуть створити структуру каталогів, описану в

source: [Project Management With RStudio]({{ relative_root_path }}{% link _episodes/02-project-intro.md %}) in order for the code in this episode to work.
uk: [Управлінні проектами з RStudio]({{ relative_root_path }}{% link _episodes/02-project-intro.md %}) для того, щоб код в цьому епізоді працював.

source: #### Concluding remarks
uk: #### Підсумкові зауваження

source: * Now that learners know the fundamentals of R, the rest of the workshop
uk: * Тепер, коли учні знають основи R, решту семінару

source: will apply these concepts to working with geospatial data in R. * Packages and functions specific for working with geospatial data will be the focus of the rest of the workshop. * They will have lots of changes to practice applying and expanding these skills in the next lesson.
uk: вони застосовуватимуть ці концепції до роботи з геопросторовими даними в R. * Пакети та функції, специфічні для роботи з геопросторовими даними, будуть в центрі уваги решти семінару. * Вони матимуть багато змін для практики застосування і розширення цих навичок на наступному уроці.

source: ## Technical tips and tricks
uk: ## Технічні поради та рекомендації

source: * Leave about 30 minutes at the start of each workshop and another 15 mins
uk: * Залиште близько 30 хвилин на початку кожного семінару і ще 15 хвилин

source: at the start of each session for technical difficulties like WiFi and installing things (even if you asked students to install in advance, longer if not).
uk: на початку кожного сеансу для технічних труднощів, таких як WiFi і встановлення речей (навіть якщо ви попросили учнів встановити заздалегідь, або ще більше, якщо не просили).

source: * Be sure to actually go through examples of an R help page: help files
uk: * Не забудьте насправді виконати приклади зі сторінки довідки R: файли довідки

source: can be intimidating at first, but knowing how to read them is tremendously useful.
uk: можуть спочатку налякати, але розуміння того, як їх читати, надзвичайно корисно.

source: * Don't worry about being correct or knowing the material back-to-front. Use
uk: * Не турбуйтеся про те, щоб бути правильним або знати матеріал ззаду наперед. Використовуйте

source: mistakes as teaching moments: the most vital skill you can impart is how to debug and recover from unexpected errors.
uk: помилки як навчальні моменти: найважливіша навичка, яку ви можете передати - це як зневадити та виправити несподівані помилки.

source: ## Common problems
uk: ## Поширені проблеми

source: TBA - Instructors please add situations you encounter here.
uk: Підлягає оформленню: Інструктори, будь ласка, додайте ситуації, з якими ви стикаєтеся, тут.
