Repository: carpentries-i18n/i18n
Catalog: transifex/r-intro-geospatial/*/17__index.po
Languages: uk

source: The goal of this lesson is to provide an introduction to R for learners working with geospatial data. It is intended as a pre-requisite for the [R for Raster and Vector Data](https://datacarpentry.org/r-raster-vector-geospatial/) lesson for learners who have no prior experience using R. This lesson can be taught in approximately 4 hours and covers the following topics:
uk: Мета цього уроку - надати вступ до R для учнів, які працюють з геопросторовими даними. Він призначений як передумова для уроку [R для растрових та векторних даних](https://datacarpentry.org/r-raster-vector-geospatial/) для учнів, які не мають попереднього досвіду використання R. Цей урок може бути викладений приблизно за 4 години і він охоплює наступні теми:

source: - Working with R in the RStudio GUI
uk: - Робота з R в графічному інтерфейсі користувача RStudio

source: - Project management and file organization
uk: - Управління проєктами та організація файлів

source: - Importing data into R
uk: - Імпортування даних в R

source: - Introduction to R's core data types and data structures
uk: - Вступ до основних типів даних та структур в R

source: - Manipulation of data frames (tabular data) in R
uk: - Маніпулювання фреймами даних (табличними даними) в R

source: - Introduction to visualization
uk: - Вступ до візуалізації

source: - Writing data to a file
uk: - Запис даних у файл

source: The the [R for Raster and Vector Data](https://datacarpentry.org/r-raster-vector-geospatial/) lesson provides a more in-depth introduction to visualization (focusing on geospatial data), and working with data structures unique to geospatial data.
uk: Урок [R для растрових та векторних даних](https://datacarpentry.org/r-raster-vector-geospatial/) забезпечує більш глибоке введення у візуалізацію (зосередженне на геопрострових даних), і роботу зі структурами даних, унікальних для геопрострових даних.

source: > ## Getting Started
uk: > ## Початок роботи

source: > > Data Carpentry's teaching is hands-on, so participants are encouraged to use > their own computers to insure the proper setup of tools for an efficient > workflow. <br>**This lesson assume no prior knowledge of R.** > > To get started, follow the directions in the "[Setup]({{ relative_root_path }}/{% link setup.md %})" tab to > download data to your computer and follow any installation instructions.
uk: > > Викладання Data Carpentry практичне, тому учасникам рекомендовано використовувати > власні комп'ютери, щоб забезпечити правильне налаштування інструментів для ефективних > операцій. <br>**Цей урок не передбачає попереднього знання R.** > > Для того, щоб розпочати роботу, дотримуйтесь вказівок на вкладці "[Встановлення]({{ relative_root_path }}/{% link setup.md %})" для > завантаження даних на комп'ютер та дотримуйтесь інструкцій з установки.
