Repository: carpentries-i18n/i18n
Catalog: po/gap-lesson.*.po
Languages: uk

source: GAP can read any valid GAP input from the code using `Read`. The contents will be read and evaluated in the main read-evaluate-print loop, but the results will not printed. Sometimes you may want to read the content of the file as a function and return that function - for that purpose you may find `ReadAsFunction` useful. But what to do if you have some a data file coming from other source, and it is not a valid GAP input? Sometimes you may have control over the tool that exports data, and may be able to tweak it to generate GAP input file. But where to look if this option is not possible?
uk: GAP може читати будь-який дійсний ввід GAP із коду за допомогою `Read`. Вміст буде прочитано та оцінено в основному циклі читання-оцінки-друку, але результати не будуть надруковані. Іноді вам може знадобитися прочитати вміст файлу як функцію та повернути цю функцію - для цієї мети вам може знадобитися `ReadAsFunction`. Але що робити, якщо у вас є файл даних, що надходить з іншого джерела, і це недійсний ввід GAP? Іноді ви можете керувати інструментом, який експортує дані, і можете налаштувати його для створення вхідного файлу GAP. Але де шукати, якщо цей варіант неможливий?

source: `ReadCSV( filename[, nohead][, separator] )` reads a file in a CSV (comma separated values) format and returns its entries as a list of records (see [here](http://www.gap-system.org/Manuals/doc/ref/chap10.html#X848DD7DC79363341)). The entries of the first line of the file will be used for the names of the record components (blanks will be translated into underscores). One could also indicate that the first line contains data instead of field names, and also specify a custom separator. Conversely, `PrintCSV` may be used to output CSV files.
uk: `ReadCSV( filename[, nohead][, separator] )` читає файл у форматі CSV (значення, розділені комами) і повертає його записи як список записів (див. [here](http://www.gap-system.org/Manuals/doc/ref/chap10.html#X848DD7DC79363341)). Записи першого рядка файлу будуть використані для імен компонентів запису (прогалини будуть перетворені на підкреслення). Можна також вказати, що перший рядок містить дані замість імен полів, а також вказати спеціальний роздільник. Навпаки, `PrintCSV` може використовуватися для виведення файлів CSV.

source: To read arbitrary (binary or text) files as strings, use the `StringFile` function provided by the GAPDoc package (see [here](http://www.gap-system.org/Manuals/pkg/GAPDoc-1.5.1/doc/chap6.html#X7E14D32181FBC3C3)). It will return the content of the file as a string. After that, you may use various string manipulation tools (see [Strings and Characters](http://www.gap-system.org/Manuals/doc/ref/chap27.htmlGAPDoc) in the GAP reference manual) to process it in the way you need. GAPDoc package also provides the `FileString` function which writes the content of a string into a file.
uk: Щоб читати довільні (бінарні або текстові) файли як рядки, скористайтеся функцією `StringFile`, що надається пакетом GAPDoc (see [тут](http://www.gap-system.org/Manuals/pkg/GAPDoc-1.5.1/doc/chap6.html#X7E14D32181FBC3C3)). Він поверне вміст файлу у вигляді рядка. Після цього ви можете використовувати різні інструменти для роботи з рядками (див. [Рядки та символи](http://www.gap-system.org/Manuals/doc/ref/chap27.htmlGAPDoc) у довідковому посібнику GAP) , щоб обробити його потрібним вам способом. Пакет GAPDoc також надає функцію `FileString`, яка записує вміст рядка у файл.

source: If you need to organise reading/writing line by line, instead of reading or writing the whole file/string at once, we suggest to look at the functionality provided by the IO package (see [here](http://www.gap-system.org/Manuals/pkg/io-4.4.6/doc/chap4.html)), in particular at `IO_ReadLine` and `IO_WriteLine`.
uk: Якщо вам потрібно організувати читання/запис рядок за рядком, замість читання або запису всього файлу/рядка одночасно, ми пропонуємо переглянути функціональні можливості, які надає пакет IO (див. [тут](http://www.gap-system.org/Manuals/pkg/io-4.4.6/doc/chap4.html)), зокрема, в `IO_ReadLine` і `IO_WriteLine`.

source: {% comment %} Create anchor for each one of the episodes. {% endcomment %} {% for episode in site.episodes %} <article id="{{ episode.url }}" class="figures"></article> {% endfor %}
uk: {% comment %} Створіть якір для кожного з епізодів. {% endcomment %} {% for episode in site.episodes %} <article id="{{ episode.url }}" class="figures"></article> {% endfor %}

source: ## Overall
uk: ## Загальний

source: * For the first lesson, good to have access to Windows (VM or remote desktop) to
uk: * Для першого уроку добре мати доступ до Windows (VM або віддаленого робочого столу), щоб

source: demonstrate some Windows-specific aspects of working with GAP.
uk: продемонструвати деякі специфічні для Windows аспекти роботи з GAP.

source: * Before start, check that everyone has installed GAP and knows how to start it.
uk: * Перед початком перевірте, чи всі встановили GAP і знають, як його запустити.

source: Also remind that it's not advised to install in in the path with spaces, e.g. in "My Documents".
uk: Також нагадайте, що не рекомендується встановлювати в шляху з пробілами, напр. в "Мої документи".

source: * It is important that learners will understand how to operate with files
uk: * Важливо, щоб студенти зрозуміли, як працювати з файлами,

source: located in different directories. `ChangeDirectoryCurrent` is the function from the IO package (requires compulation), which should be available if GAP is properly installed (i.e. installed following instructions for the workshop). In case of any problems, the first step of troubleshooting is to check whether `LoadPackage("io");` returns `fail`. If so, the remedy for Windows users is to type full paths to files. Linux and OS X users are less affected as for the, the way how they should start GAP is to navigate to the needed directory in the Terminal and start GAP from there.
uk: розташованими в різних каталогах. `ChangeDirectoryCurrent` — це функція з пакета IO (вимагає обчислення), яка має бути доступною, якщо GAP встановлено належним чином (тобто встановлено згідно з інструкціями для семінару). У разі будь-яких проблем першим кроком усунення несправностей є перевірка того, чи `LoadPackage("io");` повертає `fail`. Якщо так, виправленням для користувачів Windows є введення повних шляхів до файлів. Користувачі Linux і OS X постраждали менше, тому що GAP потрібно запускати шляхом переходу до потрібного каталогу в терміналі та запуску GAP звідти.

source: * Help to adjust terminal settings, especially show to Windows users that they
uk: * Допоможіть налаштувати параметри терміналу, особливо покажіть користувачам Windows, що вони

source: can permanently change colours and fonts in mintty shell (the one started with `gap.bat`).
uk: можуть постійно змінювати кольори та шрифти в м’якій оболонці (той, що починається з `gap.bat`).

source: * Explain how to copy and paste input and output (especially on Windows).
uk: * Поясніть, як копіювати та вставляти введення та виведення (особливо у Windows).

source: * Explain how to read lesson pages: GAP input is types without GAP prompt.
uk: * Поясніть, як читати сторінки уроку: введення GAP – це типи без підказки GAP.

source: GAP output is ion blue colour. Errors are displayed in red. GAP promts is not displayed, unless this is really necessary (e.g. to demonstrate how the multi-line input works).
uk: Вивід GAP має іонно-синій колір. Помилки відображаються червоним кольором. Підказки GAP не відображаються, окрім випадків, коли це справді необхідно (наприклад, щоб продемонструвати, як працює багаторядковий ввід).

source: * It is important that instructor starts GAP with `-r` option to avoid
uk: * Важливо, щоб інструктор починав GAP з параметра `-r`, щоб уникнути

source: interfering with own GAP settings e.g. locally installed packages and other content of `.gap` directory.
uk: втручання у власні налаштування GAP, напр. локально встановлені пакунки та інший вміст каталогу `.gap`.

source: * To use color prompt when GAP is started with `-r` option to ignore all user
uk: * Щоб використовувати колірну підказку, коли GAP запускається з опцією `-r`, щоб ігнорувати всі параметри користувача,

source: preferences, including this (if set), call `ColorPrompt(true);`.
uk: включаючи це (якщо встановлено), викличте `ColorPrompt(true);`.

source: ## [First session with GAP](01-command-line.html)
uk: ## [Перша сесія з GAP](01-command-line.html)

source: * Emphasize that the banner contains version info useful for citing GAP or
uk: * Підкресліть, що банер містить інформацію про версію, корисну для цитування GAP або

source: reporting bugs. Selection of packages may differ, but missing **IO** and **Browse** packages indicate that these and perhaps some other packages that require compilation were not compiled.
uk: повідомлення про помилки. Вибір пакетів може відрізнятися, але відсутність пакетів **IO** і **Browse** означає, що ці та, можливо, деякі інші пакети, які потребують компіляції, не були скомпільовані.

source: * A second call to `LogTo("logfile");` will not open the new file but will report
uk: * Другий виклик `LogTo("logfile");` не відкриє новий файл, але повідомить,

source: that GAP is already logging to another file. In this case, either ignore it if you would like to continue logging to the file already in use, or call `LogTo();` to close the current log file and then call `LogTo` with an argument to start logging to a new file.
uk: що GAP вже веде журнал до іншого файлу. У цьому випадку або проігноруйте його, якщо ви хочете продовжити ведення журналу, який уже використовується, або викличте `LogTo();`, щоб закрити поточний файл журналу, а потім викличте `LogTo` з аргументом, щоб почати запис в новому файлі.

source: * Showing an example of the error with `factorial`, mention that such error
uk: * Показуючи приклад помилки з `факторіалом`, згадайте, що така помилка також

source: also happens if e.g. some file has to be read or some package should be loaded to define the function.
uk: трапляється, якщо, наприклад, для визначення функції потрібно прочитати якийсь файл або завантажити якийсь пакет.

source: * Discuss why it's a bad practice to Google for the GAP manual instead of
uk: Обговоріть, чому використання посібника GAP у Google є поганою практикою замість

source: using the GAP help system.
uk: використання довідкової системи GAP.

source: * Be aware that help selection screen will look differently if **Browse**
uk: * Майте на увазі, що екран вибору довідки виглядатиме інакше, якщо пакет **Огляд**

source: package is not compiled.
uk: не скомпільовано.

source: * Explain how to switch to view HTML version of the Manual with MathJax support.
uk: * Поясніть, як перейти до перегляду HTML-версії посібника з підтримкою MathJax.

source: * Give a hint that the sitemap on the [GAP website](http://www.gap-system.org)
uk: * Дайте підказку, що на карті сайту на [веб-сайті GAP](http://www.gap-system.org)

source: shows the [Search the GAP web site](http://www.gap-system.org/search.html) page which allows some specific search requests.
uk: показано [Пошук на веб-сайті GAP](http://www.gap-system.org/search.html), яка дозволяє виконувати певні пошукові запити.

source: * Draw attention to the difference between `AsList` and `AsSSortedList`.
uk: * Зверніть увагу на різницю між `AsList` і `AsSSortedList`.

source: * Help to call `WriteGapIniFile` and customise GAP e.g. to use browser as a
uk: * Допоможе викликати `WriteGapIniFile` і налаштувати GAP, наприклад, використовуючи браузер як

source: viewer.
uk: засіб перегляду.

source: * Demonstrating how to type `Sum( List( elts, Order ) ) / Length( elts );`
uk: * Демонстрація друку `Sum( List( elts, Order ) ) / Length( elts );`

source: show how to assemble this command using command line editing and moving around the line, perhaps executing partial command to see their results, instead of typing the whole command from first to last character sequentially.
uk: покажіть, як зібрати цю команду за допомогою редагування командного рядка та переміщення по рядку, можливо, виконавши часткову команду, щоб побачити їхні результати, замість того, щоб вводити всю команду послідовно від першого до останнього символу.

source: * Use Etherpad to vote for approaches to calculate the average order of a list.
uk: * Використовуйте Etherpad для голосування за підходи до обчислення середнього порядку списку.

source: After that discuss situations when each of them may be more preferable than others.
uk: Після цього обговоріть ситуації, коли кожен з них може бути кращим за інші.

source: 1. Solution of the challenge: `Filtered( elts, g -> 2^g = 2 );` and
uk: 1. Рішення виклику: `Filtered( elts, g -> 2^g = 2 );` and

source: ## [Some more GAP objects](02-some-objects.html)
uk: ## [Ще декілька об’єктів GAP](02-some-objects.html)

source: * Floats, cyclotomics, finite fields elements are not used further in the
uk: * Число з плаваючою комою, цикломатичні числа, елементи скінченних полів далі

source: lesson, but we mention them briefly to show that they exist.
uk: в уроці не використовуються, але ми згадуємо їх коротко, щоб показати, що вони існують.

source: * Emphasize that organising complex objects into nested records may
uk: * Підкресліть, що організація складних об’єктів у вкладені записи може бути

source: be more efficient than nested lists.
uk: більш ефективною, ніж вкладені списки.

source: * Beware that `w:="supercalifragilisticexpialidocious"; IsSubset(w,'s');`
uk: * Стережіться цього `w:="supercalifragilisticexpialidocious"; IsSubset(w,'s');`

source: results in a no-method-found error. This may be a good moment to introduce this special kind of error messages.
uk: призводить до помилки методу не знайдено. Це може бути вдалим моментом для представлення цього особливого виду повідомлень про помилки.

source: * For extending GAP with new types of objects, refer to
uk: * Щоб розширити GAP за допомогою нових типів об’єктів, зверніться до

source: [Creating New Objects](http://www.gap-system.org/Manuals/doc/ref/chap79.html) and [Examples of Extending the System](http://www.gap-system.org/Manuals/doc/ref/chap80.html) of the GAP Reference Manual. Also, the [Circle package](http://www.gap-system.org/Packages/circle.html) provides an example of extending GAP with new multiplicative objects.
uk: [Створення нових об'єктів](http://www.gap-system.org/Manuals/doc/ref/chap79.html) та [Приклади розширення системи](http://www.gap-system.org/Manuals/doc/ref/chap80.html) з довідкового посібника GAP. Також [пакет Circle](http://www.gap-system.org/Packages/circle.html) надає приклад розширення GAP новими мультиплікативними об’єктами.

source: 1. Solution of the challenge:
uk: 1. Розв'язання завдання:

source: ## [Functions in GAP](03-func.html)
uk: ## [Функції в GAP](03-func.html)

source: * Spend some time on the structure of the GAP function: keywords `function`,
uk: * Приділіть деякий час структурі функції GAP: ключові слова `function`,

source: `local`, `return`, `end`, and other language constructions exposed there.
uk: `local`, `return`, `end` та інші мовні конструкції, представлені там.

source: * Tell how to explore the break loop while showing an example of an error
uk: * Розкажіть, як досліджувати цикл розриву, показуючи приклад повідомлення про

source: message.
uk: помилку.

source: ## [Using regression tests](04-testing.html)
uk: ## [Використання регресійних тестів](04-testing.html)

source: * Learners may need help with formatting the test because of misplaced comments
uk: * Студентам може знадобитися допомога з форматуванням тесту через недоречні коментарі

source: and/or different formatting of the output.
uk: та/або інше форматування вихідних даних.

source: * Cover aspects of making test files reproducible: random vs explicit examples,
uk: * Розглянемо аспекти створення тестових файлів, які можна відтворити: випадкові чи явні приклади,

source: suppressing output with double semicolon, etc.
uk: коментування виводу за допомогою подвійної крапки з комою тощо.

source: * Refer to other options of `Test` such as comparing the output up to
uk: * Зверніться до інших параметрів `Тесту`, таких як порівняння результату з

source: whitespaces, displaying the progress of the test, etc.
uk: пробілами, відображення прогресу тесту тощо.

source: * Mention `TestDirectory` function to run a collection of tests.
uk: * Згадайте функцію `TestDirectory`, щоб запустити колекцію тестів.

source: * Mention profiling and code coverage tools.
uk: * Згадайте інструменти профілювання та покриття коду.

source: ## [Small groups search](05-small-groups.html)
uk: ## [Пошук малими групами](05-small-groups.html)

source: * Give an overview of `SmallGroup`, `AllSmallGroups`, `NrSmallGroups` and
uk: * Дайте огляд `SmallGroup`, `AllSmallGroups`, `NrSmallGroups` та

source: `SmallGroupsInformation` with some examples.
uk: `SmallGroupsInformation` з деякими прикладами.

source: * Discuss, why iterating is better than AllSmallGroups exhausting memory
uk: Обговоріть, чому ітерація краща, ніж AllSmallGroups, що виснажує пам’ять

source: (mention the concept of self-learning objects).
uk: (згадайте концепцію об’єктів, що самонавчаються).

source: * A side question is how to convert a pc group, returned by `SmallGroup`, to
uk: * Побічне питання полягає в тому, як перетворити pc групу, повернуту `SmallGroup`,

source: some other representation, e.g. permutation or fp group.
uk: на інше представлення, наприклад. перестановка або fp група.

source: * Live coding is preferred way to teach how to develop most of the functions
uk: * Програмування на льоту є кращим способом навчання, яке розвиває більшість функцій

source: from this lesson.
uk: з цього уроку.

source: `Sum(List(Filtered([1..2000], n -> not IsPrimePowerInt(n)),NrSmallGroups)); NrSmallGroups(1536); last2-last;`. In addition to `SmallGroup(105,1)` and `SmallGroup(357,1)`, another group is `SmallGroup(1785,1)`.
uk: `Sum(List(Filtered([1..2000], n -> not IsPrimePowerInt(n)),NrSmallGroups)); NrSmallGroups(1536); last2-last;`. In addition to `SmallGroup(105,1)` та `SmallGroup(357,1)`, інша група є `SmallGroup(1785,1)`.

source: ## [Attributes and Methods](06-attributes.html)
uk: ## [Атрибути та методи](06-attributes.html)

source: * Why it is not a good idea to declare `Random` as an attribute?
uk: * Чому не варто оголошувати `Random` як атрибут?

source: 1. Ideas for the challenge: try `k:=1` and then `k:=k+1;n:=2^k;AvgOrdOfCollection(DihedralGroup(n));time;AvgOrdOfGroup(DihedralGroup(n));time;`.
uk: 1. Ідеї для завдання: спробуйте `k:=1`, а потім `k:=k+1;n:=2^k;AvgOrdOfCollection(DihedralGroup(n));time;AvgOrdOfGroup(DihedralGroup(n));time;`.

source: Even for `k=20`, the 1st function takes about 15s and the 2nd - about 115s on a MacBook Pro.
uk: Навіть для `k=20` перша функція займає приблизно 15 секунд, а друга – приблизно 115 секунд на MacBook Pro.

source: {% comment %} As a maintainer, you don't need to edit this file. If you notice that something doesn't work, please open an issue: https://github.com/carpentries/styles/issues/new {% endcomment %}
uk: {% comment %} Як супроводжувачу, Вам не потрібно редагувати цей файл. Якщо Ви помітили, що щось не працює, будь ласка, відкрийте проблему: https://github.com/carpentries/styles/issues/new {% endcomment %}

source: [GAP](http://www.gap-system.org) is a system for discrete computational algebra, with particular emphasis on Computational Group Theory. GAP provides a programming language, a library of thousands of functions implementing algebraic algorithms written in the GAP language as well as large data libraries of algebraic objects, for example the [Small Groups Library](http://www.gap-system.org/Packages/sgl.html) which contains, among others, all 423 164 062 groups of order at most 2000 except 1024.
uk: [GAP](http://www.gap-system.org) — система дискретної обчислювальної алгебри з особливим акцентом на теорії обчислювальних груп. GAP надає мову програмування, бібліотеку тисяч функцій, що реалізують алгебраїчні алгоритми, написані мовою GAP, а також великі бібліотеки даних алгебраїчних об’єктів, наприклад, [Бібліотека малих груп](http://www.gap-system.org). /Packages/sgl.html), яка містить, серед іншого, усі 423 164 062 групи порядку не більше 2000, крім 1024.

source: This lesson gives an introduction to GAP. It is centred around a common task of searching in the Small Groups Library for interesting examples and counterexamples, and a particular research problem in which we will be interested is to **find examples of non-trivial groups such that the average order of their elements is an integer**.
uk: У цьому уроці представлено введення в GAP. Він зосереджений навколо спільного завдання пошуку в бібліотеці малих груп цікавих прикладів і контрприкладів, а конкретна дослідницька проблема, в якій ми будемо зацікавлені, полягає в тому, щоб **знайти приклади нетривіальних груп, таких, що середній порядок їх елементів є цілим числом**.

source: The lesson will lead the learner along the path from working in the GAP command line and exploring algebraic objects interactively to saving the GAP code into files, creating functions and regression tests, and further to performing comprehensive search and extending the system by adding new attributes.
uk: Урок проведе студента по шляху від роботи в командному рядку GAP та вивчення алгебраїчних об’єктів в інтерактивному режимі до збереження коду GAP у файли, створення функцій і регресійних тестів, а також до виконання всебічного пошуку та розширення системи шляхом додавання нових атрибутів.

source: On this path, the learner will become familiar with:
uk: На цьому шляху студент ознайомиться з:

source: * basic constructions of the GAP programming language,
uk: * основні конструкції мови програмування GAP,

source: * ways to find necessary information in the GAP system, and
uk: * способи пошуку необхідної інформації в системі GAP і

source: * good design practices to organise GAP code into complex programs.
uk: * хороші практики проектування для організації коду GAP у складні програми.

source: > ## Prerequisites
uk: > ## Передумови

source: > > The lesson is oriented on learners possessing the minimal theoretical > background (at least at the level of an undergraduate group theory course) > and willing to learn how concepts from abstract algebra may be > explored using computational tools. > No previous experience of working with GAP is required. > > Learners only need to understand the concepts of files and directories > (including home and working directories) and know how to start GAP.
uk: > > Урок орієнтований на студентів, які володіють мінімальною теоретичною підготовкою (принаймні на рівні бакалаврського курсу теорії груп) і бажають дізнатися, як поняття з абстрактної алгебри можна досліджувати за допомогою обчислювальних інструментів. > Попередній досвід роботи з GAP не потрібен. > > Студентам потрібно лише розуміти поняття файлів і каталогів (включаючи домашні та робочі каталоги) і знати, як запустити GAP.

source: > ## Getting ready
uk: > ## Збираючись

source: > 1. In your home directory, create a new directory called `avgord`.
uk: > 1. У Вашому домашньому каталозі створіть новий каталог під назвою `avgord`.

source: > 2. Start GAP:
uk: > 2. Розпочати GAP:

source: > * on Linux and OS X, call `path-to-your-gap-installation/gap-4.X.Y/bin/gap.sh`
uk: > * в Linux і OS X викличте `path-to-your-gap-installation/gap-4.X.Y/bin/gap.sh`

source: > (edit the path as necessary);
uk: > (за потреби відредагуйте шлях);

source: > * on Windows, call it via the appropriate menu or
uk: > * на Windows, викликайте його через відповідне меню або

source: > by double-clicking on the `gap-4.X.Y/bin/gap.bat` file in your GAP installation.
uk: > двічі клацнувши файл `gap-4.X.Y/bin/gap.bat` у вашій інсталяції GAP.
