Repository: carpentries-i18n/i18n
Catalog: po/gap-lesson.*.po
Languages: uk

source: If you need to reuse this value, one option could be to store it in some variable, but then you should be careful about matching such variables with corresponding groups, and the code could become quite convoluted and unreadable. On the other hand, GAP has the notion of an _attribute_ -- a data structure that is used to accumulate information that an object learns about itself during its lifetime. Consider the following example:
uk: Якщо вам потрібно повторно використовувати це значення, одним із варіантів може бути збереження його в деякій змінній, але тоді ви повинні бути обережними щодо зіставлення таких змінних із відповідними групами, і код може стати досить заплутаним і нечитабельним. З іншого боку, GAP має поняття _атрибут_ -- структури даних, яка використовується для накопичення інформації, про яку об’єкт дізнається про себе протягом життя. Розгляньмо наступний приклад:

source: In this case, the group `G` has 10 conjugacy classes, and it took 39 ms to establish that in the first call. The second call has zero cost since the result was stored in `G`, since `NrConjugacyClasses` is an attribute:
uk: У цьому випадку група `G` має 10 класів спряженості, і знадобилося 39 мс, щоб встановити це під час першого виклику. Другий виклик має нульову вартість, оскільки результат було збережено в `G`, і тому, що `NrConjugacyClasses` є атрибутом:

source: Our goal is now to learn how to create own attributes.
uk: Зараз наша мета — навчитися створювати власні атрибути.

source: Since we already have a function `AvgOrdOfCollection` which does the calculation, the simplest way to turn it into an attribute is as follows:
uk: Оскільки у нас вже є функція `AvgOrdOfCollection`, яка виконує обчислення, найпростішим способом перетворити її на атрибут є наступний:

source: In this example, first we declared an attribute `AverageOrder` for objects in the category `IsCollection`, and then installed the function `AvgOrdOfCollection` as a method for this attribute. Instead of calling the function `AvgOrdOfCollection`, we may now call `AverageOrder`.
uk: У цьому прикладі спочатку ми оголосили атрибут `AverageOrder` для об’єктів у категорії `IsCollection`, а потім встановили функцію `AvgOrdOfCollection` як метод для цього атрибута. Instead of calling the function `AvgOrdOfCollection`, we may now call `AverageOrder`.

source: Now we may check that subsequent calls of `AverageOrder` with the same argument are performed at zero cost. In this example the time is reduced from more than 16 seconds to zero:
uk: Тепер ми можемо перевірити, що наступні виклики `AverageOrder` з тим самим аргументом виконуються без витрат часу. У цьому прикладі час скорочено з більш ніж 16 секунд до нуля:

source: You may wonder why we have declared the operation for a collection and not only for a group, and why we have installed the inefficient `AvgOrdOfCollection`. After all, we have already developed the much more efficient `AvgOrdOfGroup`.
uk: Ви можете запитати, чому ми оголосили операцію для колекції, а не лише для групи, і чому ми встановили неефективний `AvgOrdOfCollection`. Зрештою, ми вже розробили набагато ефективнішу функцію `AvgOrdOfGroup`.

source: Imagine that you would like to be able to compute an average order both for a group and for a list which consists of objects having a multiplicative order. You may have a special function for each case, as we have. If it could happen that you don't know in advance the type of the object in question, you may add checks into the code and dispatch to a suitable function. This could quickly become complicated if you have several different functions for various types of objects. Instead of that, attributes are bunches of functions, called _methods_, and GAP's _method selection_ will choose the most efficient method based on the type of all arguments.
uk: Уявіть, що Ви хочете мати можливість обчислити середній порядок як для групи, так і для списку, який складається з об’єктів, що мають мультиплікативний порядок. Ви можете мати спеціальну функцію для кожного випадку, як у нас. Якщо може трапитися так, що Ви не знаєте наперед тип об’єкта, про який йде мова, Ви можете додати перевірки в код і відправити до відповідної функції. Це може швидко стати складним, якщо у вас є кілька різних функцій для різних типів об’єктів. Натомість атрибути — це групи функцій, які називаються __method__, а _вибір методу_ в GAP вибере найефективніший метод на основі типу всіх аргументів.

source: To illustrate this, we will now install a method for `AverageOrder` for a group:
uk: Щоб проілюструвати це, зараз ми встановимо метод для `AverageOrder` для групи:

source: If you apply it to a group whose `AverageOrder` has already been computed, nothing will happen, since GAP will use the stored value. However, for a newly created group, this new method will be called:
uk: Якщо ви застосуєте його до групи, для якої `AverageOrder` вже обчислено, нічого не станеться, оскільки GAP використовуватиме збережене значення. Однак для новоствореної групи цей новий метод буде називатися:

source: > ## Which method is being called
uk: > ## Який метод викликається

source: > > * Try to call `AverageOrder` for a collection which is not a group > (a list of group elements and/or a conjugacy class of group elements). > > * Debugging tools like `TraceMethods` may help you see which method is > being called. > > * `ApplicableMethod` in combination with `PageSource` may point you to > the source code with all the comments.
uk: > > * Спробуйте викликати `AverageOrder` для колекції, яка не є групою > (список елементів групи та/або клас спряжених елементів групи). > > * Інструменти налагодження, такі як `TraceMethods`, можуть допомогти вам побачити, який метод > викликається. > > * `ApplicableMethod` у поєднанні з `PageSource` може вказати вам на > вихідний код із усіма коментарями.

source: A _property_ is a boolean-valued attribute. It can be created using `NewProperty`
uk: A _property_ is атрибут із логічним значенням. Його можна створити, використовуючи `NewProperty`

source: Now we will install a method for `IsIntegerAverageOrder` for a collection. Observe that it is never necessary to create a function first and then install it as a method. The following method installation instead creates a new function as one of its arguments:
uk: Тепер ми встановимо метод для `IsIntegerAverageOrder` для колекції. Зауважте, що ніколи не потрібно спочатку створювати функцію, а потім встановлювати її як метод. Наступне встановлення методу натомість створює нову функцію як один із своїх аргументів:

source: Note that because `AverageOrder` is an attribute it will take care of the selection of the most suitable method.
uk: Зауважте, що оскільки `AverageOrder` є атрибутом, він подбає про вибір найбільш прийнятного методу.

source: > ## Does such a method always exist?
uk: > ## Чи завжди такий метод існує?

source: > > No. "No-method-found" is a special kind of error, and there are tools to > investigate such errors: see `?ShowArguments`, `?ShowDetails`, `?ShowMethods` > and `?ShowOtherMethods`.
uk: > > Ні. "No-method-found" є особливим видом помилки, і існують інструменти для дослідження таких помилок: див. `?ShowArguments`, `?ShowDetails`, `?ShowMethods` > та `?ShowOtherMethods`.

source: The following calculation shows that despite our success with calculating the average order for large permutation groups via conjugacy classes of elements, for pc groups from the Small Groups Library it could be faster to iterate over their elements than to calculate conjugacy classes:
uk: Наступні обчислення показують, що, незважаючи на наш успіх з обчисленням середнього порядку для великих груп перестановок через класи спряженості елементів, для pc груп із бібліотеки Small Groups Library можна було б швидше перебирати їх елементи, ніж обчислювати класи спряженості::

source: > > * Install a method for `IsPcGroup` that iterates over the group elements > instead of calculations its conjugacy classes. > > * Estimate practical boundaries of its feasibility. Can you find an example > of a pc group where iterating is slower than calculating conjugacy classes?
uk: > > * Установіть метод для `IsPcGroup`, який повторює елементи групи > замість обчислень її класів спряженості. > > * Оцініть практичні межі його можливості. Чи можете ви знайти приклад > pc групи, де ітерація повільніша, ніж обчислення класів спряженості?

source: --- layout: page title: About permalink: /about/ ---
uk: --- layout: page title: Про урок permalink: /about/ ---

source: --- layout: page title: Discussion permalink: /discuss/ ---
uk: --- layout: page title: Обговорення permalink: /discuss/ ---

source: ## Ten hints for GAP beginners
uk: ## Десять підказок для початківців GAP

source: 1. **Remember that GAP is case-sensitive!** That means that `ABC`, `Abc` and `abc`
uk: 1. **Пам’ятайте, що GAP чутливий до регістру!** Це означає, що `ABC`, `Abc` і `abc`

source: are three different identifiers. A call to `SymmetricGroup(3)` works, but `Symmetricgroup(3)` will cause an error.
uk: є трьома різними ідентифікаторами. Виклик `SymmetricGroup(3)` працює, але `Symmetricgroup(3)` призведе до помилки.

source: 2. An error message **`“Error, Variable: 'FuncName' must have a value”`** in a
uk: 2. Повідомлення про помилку **`“Error, Variable: 'FuncName' must have a value”`** під час

source: function call usually points to a typo in the function name (see the previous hint), or to some package that must be loaded in advance using [**`LoadPackage`**](http://www.gap-system.org/Manuals/doc/ref/chap76.html#X79B373A77B29D1F5).
uk: виклику функції зазвичай вказує на друкарську помилку в назві функції (див. попередню підказку) або на якийсь пакет, який потрібно завантажити заздалегідь за допомогою [**`LoadPackage`**](http://www.gap-system.org/Manuals/doc/ref/chap76.html#X79B373A77B29D1F5).

source: 3. **Do not hesitate to use longer and more informative variable names where
uk: 3. **Не соромтеся використовувати довші та більш інформативні назви змінних, де це

source: appropriate.** For example, `x` looks perfectly suitable for `List([1..10], x -> x^2)`, while `ConClassesReps` may be more informative than just `x` for a list of representatives of conjugacy classes of a group.
uk: доцільно.** Наприклад, `x` виглядає ідеально придатним для `List([1..10], x -> x^2)`, тоді як `ConClassesReps` може бути більш інформативним, ніж просто `x` для списку представників класів спряженості групи (англ. "Conjugacy Classes Representatives").

source: 4. **Use command line editing:** scroll the history of commands and navigate within
uk: 4. **Використовуйте редагування командного рядка:** прокручуйте історію команд і переміщайтеся в

source: the command line using arrow keys to edit it.
uk: командному рядку за допомогою клавіш зі стрілками, щоб редагувати його.

source: 5. **Use autocompletion instead of typing names of functions and variables in full.**
uk: 5. **Використовуйте автозаповнення замість того, щоб вводити назви функцій і змінних повністю.**

source: Type the initial part of the identifier and then press `<Tab>`. It will be completed if its unique completion is possible. If not, you may press `<Tab>` again to see all possible suggestions.
uk: Введіть початкову частину ідентифікатора, а потім натисніть `<Tab>`. Він буде доповнений, якщо можливе його унікальне завершення. Якщо ні, ви можете знову натиснути `<Tab>` щоб переглянути всі можливі пропозиції.

source: 6. **To view help pages, use `?` and `??` commands**. This will search not only
uk: 6. **Щоб переглянути сторінки довідки, використовуйте команди `?` і `??`**. Це дозволить шукати не тільки

source: in the GAP manuals, but also in the manuals of all GAP packages available in your GAP installation.
uk: у посібниках GAP, але також у посібниках усіх пакетів GAP, доступних у вашій інсталяції GAP.

source: 7. **Set default help format to HTML.** Use
uk: 7. **Встановіть HTML у якості формату довідки за замовчуванням.** Використовуйте

source: [**`SetHelpViewer`**](http://www.gap-system.org/Manuals/doc/ref/chap2.html#X87C1BFB2826488B0) to view it with your preferred browser.
uk: [**`SetHelpViewer`**](http://www.gap-system.org/Manuals/doc/ref/chap2.html#X87C1BFB2826488B0), щоб переглянути його у бажаному браузері.

source: 8. **Use [**`LogTo`**](http://www.gap-system.org/Manuals/doc/ref/chap9.html#X79813A6686894960)
uk: 8. **Використовуйте [**`LogTo`**](http://www.gap-system.org/Manuals/doc/ref/chap9.html#X79813A6686894960)

source: to save all GAP input and output into a text file.** It should be called before calculations, not after!
uk: щоб зберегти всі введення та виведення GAP у текстовий файл.** Його слід викликати перед обчисленнями, а не після!

source: 9. **If the calculation takes too long, press `<Control>-C` to interrupt it**.
uk: 9. **Якщо обчислення триває надто довго, натисніть `<Control>-C`, щоб перервати його**.

source: Then type quit; to leave the break loop.
uk: Потім введіть quit; щоб вийти з перерваного циклу.

source: 10. **Read [A First Session with GAP](http://www.gap-system.org/Manuals/doc/tut/chap2.html)**
uk: 10. **Прочитайте [Перша сесія з GAP](http://www.gap-system.org/Manuals/doc/tut/chap2.html)**

source: from the GAP Tutorial.
uk: з Підручнику з GAP.

source: ## Writing programs in GAP
uk: ## Написання програм на GAP

source: * Use direct calculations in the command line for object exploration and prototyping,
uk: * Використовуйте прямі обчислення в командному рядку для дослідження об’єктів і прототипування,

source: then think how to organise your code to make it reusable.
uk: а потім подумайте, як упорядкувати свій код, щоб зробити його багаторазовим.

source: * Use [**`LogTo`**](http://www.gap-system.org/Manuals/doc/ref/chap9.html#X79813A6686894960)
uk: * Використовуйте [**`LogTo`**](http://www.gap-system.org/Manuals/doc/ref/chap9.html#X79813A6686894960)

source: to save inputs and outputs to a logfile which then you can edit in a text editor.
uk: для збереження вхідних і вихідних даних у файл журналу, який потім можна редагувати в текстовому редакторі.

source: * Save code in text files and use
uk: * Збережіть код у текстових файлах і використовуйте

source: [**`Read`**](http://www.gap-system.org/Manuals/doc/ref/chap9.html#X8373AC6B7D5F9167) to load them. Find some advanced text editor to edit these files.
uk: [**`Прочитайте`**](http://www.gap-system.org/Manuals/doc/ref/chap9.html#X8373AC6B7D5F9167), щоб завантажити їх. Знайдіть розширений текстовий редактор для редагування цих файлів.

source: * Make your code modular and reusable by organising it into functions.
uk: * Зробіть свій код модульним і придатним для багаторазового використання, організувавши функціями.

source: * Write comments in the code – this will help you when you will return to it after a while.
uk: * Пишіть коментарі в коді – це допоможе вам, коли ви повернетеся до нього через деякий час.

source: * Understand [break loops](http://www.gap-system.org/Manuals/doc/ref/chap6.html#X8593B49F8705B486):
uk: * Зрозумійте, [розрив циклів](http://www.gap-system.org/Manuals/doc/ref/chap6.html#X8593B49F8705B486):

source: you may [explore variables](http://www.gap-system.org/Manuals/doc/ref/chap6.html#X7EE5CF2C8419F061) on the current break level and use [**`Where`**](http://www.gap-system.org/Manuals/doc/ref/chap6.html#X7A7FFA2B7C1EF5A3) to show the last commands before the error occurred.
uk: що ви можете [досліджувати змінні](http://www.gap-system.org/Manuals/doc/ref/chap6.html#X7EE5CF2C8419F061) на поточному рівні перерви та використовувати, [**`Where`**](http://www.gap-system.org/Manuals/doc/ref/chap6.html#X7A7FFA2B7C1EF5A3) щоб показати останні команди до того, як сталася помилка.

source: * Use [preferences mechanism](http://www.gap-system.org/Manuals/doc/ref/chap3.html#X7FD66F977A3B02DF)
uk: * Використовуйте [механізм переваг](http://www.gap-system.org/Manuals/doc/ref/chap3.html#X7FD66F977A3B02DF)

source: to customise GAP, for example, to set help viewer to HTML or to make command line history available after quitting GAP in the next GAP session.
uk: для налаштування GAP, наприклад, щоб установити засіб перегляду довідки на HTML або зробити історію командного рядка доступною після виходу з GAP під час наступного сеансу GAP.

source: * Understand the theory behind calculations: theoretical improvements could improve
uk: * Зрозумійте теорію, що лежить в основі обчислень: теоретичні вдосконалення можуть підвищити

source: the performance much more than highly optimised code which still does a brute-force calculation.
uk: продуктивність набагато більше, ніж високооптимізований код, який все ще виконує обчислення грубою силою.

source: * Implementing algorithms, do not forget corner cases. For example, does the implementation
uk: * Реалізуючи алгоритми, не забувайте про наріжні випадки. Наприклад, чи працює

source: work on a trivial group or an identity element?
uk: реалізація на тривіальній групі чи одиничному елементі?

source: * Do not rely that GAP functions return results in a particular order, unless this
uk: * Не покладайтеся на те, що функції GAP повертають результати в певному порядку, якщо це не

source: is documented. For example, dependently on the method, it may be not guaranteed that conjugacy classes or irreducible characters are listed in some particular order, or that the first element in their list is the conjugacy class of an identity element or the trivial character.
uk: задукоментовано. Наприклад, залежно від методу, це може бути не гарантованим, що класи спряженості або незвідні символи перераховані в певному порядку, або що перший елемент у їх списку є класом спряженості одиничного елемента або тривіального символу.

source: * Don't ask for more than you need as this may have performance implications.
uk: * Не вимагайте більше, ніж вам потрібно, оскільки це може вплинути на продуктивність.

source: For example:
uk: Наприклад:

source: * If the property is an invariant of a conjugacy class (of elements or of
uk: * Якщо властивість є інваріантом класу спряженості (елементів або

source: subgroups), you may be interested only at looking at the representatives of conjugacy classes.
uk: підгруп), вам може бути цікаво лише поглянути на представників класів спряженості.

source: * If you are interested in a list of elements of a collection, without a
uk: * Якщо вас цікавить список елементів колекції без

source: particular order, use `AsList` instead of `AsSSortedList`.
uk: певного порядку, використовуйте `AsList` замість `AsSSortedList`.

source: * Do not calculate conjugacy classes of all subgroups, if e.g. you are
uk: * Не обчислюйте класи спряженості всіх підгруп, якщо напр.

source: interested only in normal or maximal subgroups - there are special methods to compute them.
uk: Вас цікавлять лише нормальні або максимальні підгрупи - для їх обчислення існують спеціальні методи.

source: * If you are looking for _p_-subgroups, first you may calculate
uk: * Якщо ви шукаєте _p_-підгрупи, спочатку ви можете обчислити

source: a Sylow _p_-subgroup of a group, and then look at its subgroups and their conjugates.
uk: силовську _p_-підгрупу групи, а потім поглянути на її підгрупи та їх спряжені.

source: * Representation matters: it may be worth to convert a group from fp group
uk: * Представлення має значення: можливо, варто перетворити групу з fp групи

source: to an isomorphic pc group or a permutation group to use faster methods.
uk: на ізоморфну pc групу або групу перестановок, щоб використовувати швидші методи.

source: * See [GAP Frequently Asked Questions](http://www.gap-system.org/Faq/faq.html) for further hints.
uk: * Перегляньте [GAP Frequently Asked Questions](http://www.gap-system.org/Faq/faq.html), щоб отримати додаткові підказки.

source: ## Stay in touch
uk: ## Залишайтеся на зв'язку

source: * Subscribe to the **[GAP Forum](http://mail.gap-system.org/mailman/listinfo/forum)**.
uk: * Підпишіться на **[GAP Forum](http://mail.gap-system.org/mailman/listinfo/forum)**.

source: * If you are on Twitter, follow **[gap_system](https://twitter.com/gap_system)**.
uk: * Якщо ви є на Twitter, підписуйтесь **[gap_system](https://twitter.com/gap_system)**.

source: * If you need help, choose among these three options, dependently on the question:
uk: * Якщо вам потрібна допомога, виберіть один із цих трьох варіантів, залежно від питання:

source: * ask questions in the [GAP Forum](http://www.gap-system.org/Contacts/Forum/forum.html)
uk: * задати запитання в [GAP Forum](http://www.gap-system.org/Contacts/Forum/forum.html)

source: * send them to the [GAP Support](http://www.gap-system.org/Contacts/People/supportgroup.html)
uk: * надішліть їх до [GAP Support](http://www.gap-system.org/Contacts/People/supportgroup.html)

source: * post them at the [Mathematics Q&A site](http://math.stackexchange.com/questions/tagged/gap?sort=frequent&pageSize=50)
uk: * опублікуйте їх на [Mathematics Q&A site](http://math.stackexchange.com/questions/tagged/gap?sort=frequent&pageSize=50)

source: ## Contributing to GAP
uk: ## Внесок у GAP

source: * If you think that you’ve found a bug: please
uk: * Якщо ви вважаєте, що знайшли помилку: будь ласка,

source: [create an issue on GitHub](https://github.com/gap-system/gap/issues) or report it by email to [GAP Support](http://www.gap-system.org/Contacts/People/supportgroup.html).
uk: [створити проблему на GitHub](https://github.com/gap-system/gap/issues) або повідомте про це електронною поштою на адресу [GAP Support](http://www.gap-system.org/Contacts/People/supportgroup.html).

source: * Please cite GAP if you use it. This helps for the community to grow,
uk: * Будь ласка, вкажіть GAP, якщо Ви його використовуєте. Це сприяє зростанню спільноти,

source: and this will help you in return. [This page](http://www.gap-system.org/Contacts/cite.html) suggests how to cite GAP, and the function [**`Cite`**](http://www.gap-system.org/Manuals/doc/ref/chap76.html#X79637D9A7B1AD7F7) will help to generate citation sample for precisely the same version of GAP that is used.
uk: і це допоможе вам у відповідь. [Ця сторінка](http://www.gap-system.org/Contacts/cite.html) підказує, як цитувати GAP і функція [**`Цитувати`**](http://www.gap-system.org/Manuals/doc/ref/chap76.html#X79637D9A7B1AD7F7) допоможе створити зразок цитування для тієї самої версії GAP, яка використовується.

source: * Consider sharing your GAP developments with others, from sharing your code by
uk: * Подумайте про те, щоб поділитися своїми розробками GAP з іншими, від спільного використання вашого коду

source: available means to organising it into a GAP package, submitted for the redistribution with GAP and optionally for the refereeing.
uk: доступними засобами до організації його в пакет GAP, надісланий для повторного розповсюдження через GAP і, за бажанням, для рецензування.

source: * Contribute to the further development of this lesson itself.
uk: * Сприяти подальшому розвитку самого уроку.

source: ## Tips and tricks
uk: ## Поради та підказки

source: * This is a simples approach to call GAP from a shell script. Create the shell
uk: * Це простий підхід для виклику GAP зі сценарію оболонки. Створіть сценарій

source: script called `check-one-order.sh` with the following content:
uk: оболонки під назвою `check-one-order.sh` із таким вмістом:

source: and make it executable using `chmod u+x check-one-order.sh`. Now you may call it as follows:
uk: і зробіть його виконуваним за допомогою `chmod u+x check-one-order.sh`. Тепер ви можете назвати це так:

source: * Reading data files
uk: * Читання файлів із даними
