Repository: carpentries-i18n/i18n
Catalog: po/gap-lesson.*.po
Languages: uk

source: You already know about lists. Another type of composite objects is **records**. While a list contains subobjects indexed by their positions in the list, a record contains subobjects, called _record components_, which are indexed by their names. Elements of a record are accessed with `.`
uk: Ви вже знаєте про списки. Іншим типом складених об’єктів є **записи**. У той час як список містить субоб’єкти, проіндексовані за їх позиціями в списку, запис містить субоб’єкти, які називаються _компонентами запису_, які індексуються за своїми іменами. Elements of a record are accessed with `.`

source: Next, there are **strings** and **characters**. While strings are printed specially by GAP, a string is really just a list of characters, and any function which takes a list will also take a string. In contrast, characters are simple objects like integers.
uk: Далі є **рядки** та **символи**. Хоча GAP спеціально друкує рядки, насправді рядок — це лише список символів, і будь-яка функція, яка приймає список, також прийматиме рядок. Навпаки, символи є простими об’єктами, такими як цілі числа.

source: Strings are denoted by double quotes, and characters by single ones.
uk: Рядки позначаються подвійними лапками, а символи одинарними.

source: Note that
uk: Зауважте, що

source: Be careful! Some operations may create a new list, while others are destructive. For example:
uk: Будьте обережні! Деякі операції можуть створити новий список, тоді як інші є деструктивними. Наприклад:

source: but
uk: але

source: Which letter occurs in "supercalifragilisticexpialidocious" most often?
uk: Яка літера зустрічається у "supercalifragilisticexpialidocious" найчастіше?

source: > ## Finding the most common letter(s) in a list using only one pass
uk: > ## Пошук найпоширеніших букв у списку за допомогою лише одного проходу

source: > > The command > > `k := Maximum( List( c, v -> v[2] ) ); Filtered( c, v -> v[2] = 7 );` > > iterates over the list `c` twice (in `List` and in `Filtered`), and > it also iterates over another list of the same length as `c` in the call > to `Maximum`. If the list is long, this will impose certain performance > and memory penalties. Try to write code that finds the letters that occur most > in `c` without producing an intermediate list.
uk: > > Команда > > `k := Maximum( List( c, v -> v[2] ) ); Filtered( c, v -> v[2] = 7 );` > > двічі перебирає список `c` (у `List` і `Filtered`), а > також перебирає інший список такої ж довжини, що й `c ` у виклику > `Maximum`. Якщо список довгий, це призведе до певного зниження продуктивності та пам’яті. Спробуйте написати код, який знаходить літери, які найчастіше трапляються > в `c`, не створюючи проміжного списку.

source: --- title: "Functions in GAP" teaching: 40 exercises: 15 questions: - "Functions as a way of code re-use" objectives: - "Using command line for prototyping" - "Creating functions" - "Reading GAP code from a file" keypoints: - "Command line is good for prototyping; functions are good for repeated calculations." - "Informative function names and comments will make code more readable to your future self and to others." - "Beware of undeclared local variables!" ---
uk: --- title: "Функції в GAP" teaching: 40 exercises: 15 questions: - "Функції як спосіб повторного використання коду" objectives: - "Використання командного рядка для прототипування" - "Створення функцій" - "Читання GAP-коду з файлу" keypoints: - "Командний рядок добре підходить для прототипування; функції підходять для повторних обчислень." - "Інформативні назви функцій і коментарі зроблять код більш читабельним для вас і інших." - "Остерігайтеся неоголошених локальних змінних!" ---

source: Just to remind us of our task: for a finite group _G_, we would like to calculate the average order of its elements (that is, the sum of the orders of its elements divided by the order of the group).
uk: Просто нагадаємо наше завдання: для скінченної групи _G_ ми хотіли б обчислити середній порядок її елементів (тобто суму порядків її елементів, поділену на порядок групи).

source: We begin with a very straightforward approach, iterating over all elements of the group in question:
uk: Ми починаємо з дуже прямого підходу, повторюючи всі елементи групи, про яку йдеться:

source: Now assume that we would like to save this fragment of GAP code and later repeat this calculation for some other groups. We may even reformat it to fit it into one line and use a double semicolon to suppress the output of `sum`:
uk: Тепер припустімо, що ми хочемо зберегти цей фрагмент коду GAP і пізніше повторити цей розрахунок для деяких інших груп. Ми навіть можемо переформатувати його, щоб помістити його в один рядок, і використати подвійну крапку з комою, щоб закоментувати вивід `sum`:

source: Now we may easily copy and paste it into the GAP session the next time we need it. But here we see the first inconvenience: the code expects that the group in question must be stored in a variable named `S`, so either we have to reset `S` each time, or we need to edit the code:
uk: Тепер ми можемо легко скопіювати та вставити його в сеанс GAP наступного разу, коли він нам знадобиться. Але тут ми бачимо першу незручність: код очікує, що група, про яку йде мова, має бути збережена в змінній з іменем `S`, тому або ми повинні скидати `S` кожного разу, або нам потрібно редагувати код:

source: > ## This works only for rapid prototyping
uk: > ## Це працює лише для швидкого прототипування

source: > > * one could accidentally copy and paste only a part of the code, and > incomplete input may trigger a break loop; > * even more dangerous: one could forget to reset `sum` to zero prior to the new > calculation and obtain incorrect results; > * the group in question may have a different variable name, so the code will > have to be changed; > * **last, but not least:** when GAP code is pasted into the interpreter, it is evaluated line > by line. If you have a long file with many commands, and a syntax error is > in line _N_, this error will be reported only when GAP completes > the evaluation of all preceding lines, and that might be quite time-consuming.
uk: > > * можна випадково скопіювати та вставити лише частину коду, > а неповне введення може викликати цикл розриву; > * ще небезпечніше: можна забути скинути `sum` на нуль перед новим > обчисленням і отримати неправильні результати; > * група, про яку йде мова, може мати іншу назву змінної, тому код > доведеться змінити; > * **останнє, але не менш важливе:** коли код GAP вставляється в інтерпретатор, він оцінюється рядок > за рядком. Якщо у вас є довгий файл із багатьма командами, а синтаксична помилка міститься > в рядку _N_, про цю помилку буде повідомлено лише тоді, коли GAP завершить > оцінку всіх попередніх рядків, а це може зайняти досить багато часу.

source: That is why we need to give our GAP code more structure by organising it into functions:
uk: Ось чому нам потрібно надати нашому коду GAP більше структури, організувавши його у функції:

source: * functions are parsed first and may be called later;
uk: * функції аналізуються спочатку і можуть бути викликані пізніше;

source: * any **syntax** errors will be detected in the parsing stage, and not at the time
uk: * будь-які **синтаксичні** помилки будуть виявлені на етапі аналізу, а не під час

source: of the call; * functions may have local variables, and this prevents them being accidentally overwritten just because of reusing the same name of the variable to store something else.
uk: виклику; *функції можуть мати локальні змінні, і це запобігає їх випадковому перезапису лише через повторне використання того самого імені змінної для зберігання чогось іншого.

source: The following function takes an argument `G` and computes the average order of its elements:
uk: Наступна функція приймає аргумент `G` і обчислює середній порядок його елементів:

source: Now we can apply it to another group, passing the group as an argument:
uk: Тепер ми можемо застосувати це до іншої групи, передавши групу як аргумент:

source: The example above also demonstrates `time` -- this is the variable which stores the CPU time in milliseconds spent by the last command.
uk: Наведений вище приклад також демонструє `time` - це змінна, яка зберігає час процесора в мілісекундах, витрачений на виконання останньої команди.

source: Thus, we may now create new groups and reuse `AvgOrdOfGroup` to calculate the average order of their elements in the same GAP session. Our next goal is to make it reusable for calculations in future sessions.
uk: Таким чином, тепер ми можемо створювати нові групи та повторно використовувати `AvgOrdOfGroup` для обчислення середнього порядку їхніх елементів у тому самому сеансі GAP. Наша наступна мета — зробити цю функцію придатною для повторного використання для обчислень у майбутніх сесіях.

source: Using a text editor (for example, the one that you may have used for previous Software Carpentry lessons), create a text file called `avgord.g` containing the following function code and comments (a good chance to practise using them!):
uk: Використовуючи текстовий редактор (наприклад, той, який ви, можливо, використовували на попередніх уроках Software Carpentry), створіть текстовий файл під назвою `avgord.g`, що містить наступний код функції та коментарі (хороший шанс попрактикуватися в їх використанні!):

source: ~~~ ##################################################################### # # AvgOrdOfGroup(G) # # Calculating the average order of an element of G, where G meant to # be a group but in fact may be any collection of objects having # multiplicative order # AvgOrdOfGroup := function(G) local sum, g; sum := 0; for g in G do sum := sum + Order(g); od; return sum/Size(G); end; ~~~
uk: ~~~ ##################################################################### # # AvgOrdOfGroup(G) # # Обчислення середнього порядку елемента G, де G # означає групу, але насправді може бути будь-якою колекцією об’єктів із # мультиплікативним порядком # AvgOrdOfGroup := function(G) local sum, g; sum := 0; for g in G do sum := sum + Order(g); od; return sum/Size(G); end; ~~~

source: Now start a new GAP session and create another group, for example `MathieuGroup(11)`:
uk: Тепер почніть новий сеанс GAP і створіть іншу групу, наприклад, `MathieuGroup(11)`:

source: Clearly, `AvgOrdOfGroup` is not defined in this session, so an attempt to call this function results in an error:
uk: Очевидно, що `AvgOrdOfGroup` не визначено в цьому сеансі, тому спроба викликати цю функцію призводить до помилки:

source: To be available, it should first be loaded using the function `Read`. Below we assume that the file is in the current directory, so no path is needed.
uk: Щоб бути доступною, її потрібно спочатку завантажити за допомогою функції `Read`. Нижче ми припускаємо, що файл знаходиться в поточному каталозі, тому шлях не потрібен.

source: This loads the file into GAP, and the function `AvgOrdOfGroup` is now available:
uk: Це завантажує файл у GAP, і функція `AvgOrdOfGroup` тепер доступна:

source: In this example of using `Read`, a new GAP session was started to make it clear that `AvgOrdOfGroup` did not exist before the call of `Read` and was loaded from the file. However, a file with a function like this could be read multiple times in the same GAP session (later you will see cases when re-reading a file is more complicated). Calling `Read` again executes all code in the file being read. This means that if the code of the function has been modified, and it has no errors (but possibly has warnings), the function will be overwritten. **Never ignore the warnings!**
uk: У цьому прикладі, використовуючи `Read`, було розпочато новий сеанс GAP, щоб було зрозуміло, що `AvgOrdOfGroup` не існувало до виклику `Read` і було завантажено з файлу. Однак файл із такою функцією можна прочитати кілька разів під час одного сеансу GAP (пізніше ви побачите випадки, коли повторне читання файлу є складнішим). Це означає, що якщо код функції було змінено і в ньому немає помилок (але, можливо, є попередження), функція буде перезаписана. **Ніколи не ігноруйте попередження!**

source: For example, let us edit the file and replace the line
uk: Наприклад, давайте відредагуємо файл і замінимо рядок

source: by the line with a deliberate syntax error:
uk: рядком із навмисною синтаксичною помилкою:

source: Now read this file with
uk: Тепер прочитайте цей файл

source: and you will see an error message:
uk: і Ви побачите повідомлення про помилку:

source: Since there was an error, the `AvgOrdOfGroup` function in our session was not redefined, and remains the same as last time it was successfully read:
uk: Оскільки сталася помилка, функція `AvgOrdOfGroup` у нашому сеансі не була перевизначена та залишається такою ж, як і минулого разу, коли її успішно прочитали:

source: Now correct the error by adding the missing closing bracket, read the file again and recalculate the average order of an element for `M11`:
uk: Тепер виправте помилку, додавши відсутню закриваючу дужку, прочитайте файл ще раз і перерахуйте середній порядок елемента для `M11`:

source: Now let's see an example of a _warning_. Since it is only a warning, it will redefine the function, and this may cause some unexpected result. To see what could happen, first edit the file to roll back the change in the type of the result (so it will return a rational instead of a float), and then comment out two lines as follows:
uk: Тепер давайте розглянемо приклад _попередження_. Оскільки це лише попередження, це призведе до перевизначення функції, і це може призвести до несподіваного результату. Щоб побачити, що може статися, спочатку відредагуйте файл, щоб відкотити зміни в типі результату (тобто він повертатиме раціональне значення замість числа з плаваючою точкою), а потім закоментуйте два рядки наступним чином:

source: Now, when you read the file, you will see warnings:
uk: Тепер, коли ви прочитаєте файл, ви побачите попередження:

source: These warnings mean that because `g` and `sum` are not declared as `local` variables, GAP will expect them to be global variables at the time when the function will be called. Because they did not exist when `Read` was called, a warning was displayed. However, if they happened to exist by that time, there would be no warning, and any call to `AvgOrdOfGroup` would overwrite them! This shows how important it is to declare local variables. Let us investigate what happened in slightly more detail:
uk: Ці попередження означають, що оскільки `g` і `sum` не оголошено як `локальні` змінні, GAP очікує, що вони будуть глобальними змінними під час виклику функції. Оскільки вони не існували під час виклику `Read`, відображалося попередження. Однак, якби вони існували до того моменту, попередження не було б, і будь-який виклик `AvgOrdOfGroup` перезаписав би їх! Це показує, наскільки важливим є оголошення локальних змінних. Давайте розберемося трохи детальніше, що сталося:

source: The function is now redefined, as we can see from its output (or can inspect with `PageSource(AvgOrdOfGroup)` which will also display any comments):
uk: Функцію тепер перевизначено, як ми бачимо з її виводу (або перевіряємо за допомогою `PageSource(AvgOrdOfGroup)`, який також відображатиме будь-які коментарі):

source: but an attempt to run it results in a break loop:
uk: але спроба запустити його призводить до розриву циклу:

source: which you can exit using `quit;`.
uk: з якого можна вийти за допомогою `quit;`.

source: What happens next demonstrates how things may go wrong:
uk: Те, що відбувається далі, демонструє, як все може піти не так:

source: Now, before reading the next part of the lesson, please revert the last change by uncommenting the two commented lines, so that you have initial version of `AvgOrdOfGroup` in the file `avgord.g` again:
uk: Тепер, перш ніж читати наступну частину уроку, будь ласка, скасуйте останню зміну, розкоментувавши два рядки з коментарями, щоб у вас знову була початкова версія `AvgOrdOfGroup` у файлі `avgord.g`:

source: > ## Paths
uk: > ## Шляхи

source: > > * It is important to know how to specify paths to files in all operating > systems and where to find your home and current directory. > > * It is useful to know that path and filename completion is activated by > pressing Esc two or four times.
uk: > > * Важливо знати, як вказувати шляхи до файлів у всіх операційних > системах і де знайти свій домашній і поточний каталог. > > * Корисно знати, що завершення шляху та імені файлу активується > натисканням Esc два або чотири рази.

source: --- title: "Using regression tests" teaching: 40 exercises: 10 questions: - "Test-driven development" objectives: - "Be able to create and run test files" - "Understand how test discrepancies and runtime regressions can be identified and interpreted" - "Understand how to adjust tests to check randomised algorithms" - "Learn the 'Make it right, then make it fast' concept" keypoints: - "It is easy to create a test file by copying and pasting a GAP session." - "Writing a good and comprehensive test suite requires some effort." - "Make it right, then make it fast!" ---
uk: title: "Використання регресійних тестів" teaching: 40 exercises: 10 questions: - "Тестова розробка" objectives: - "Вміти створювати та запускати тестові файли" - "Зрозуміти, як розбіжності тестів і регресії під час виконання можна ідентифікувати та інтерпретувати" - "Зрозуміти, як налаштувати тести для перевірки рандомізованих алгоритмів" - "Вивчити концепцію 'Зробіть спочатку правильно, а потім швидко'" keypoints: - "Легко створити тестовий файл, скопіювавши та вставивши сеанс GAP." - "Написання хорошого та комплексного набору тестів вимагає певних зусиль." - "Зробіть спочатку правильно, а потім швидко!" ---

source: The code of `AvgOrdOfGroup` is very simple, and nothing could possibly go wrong with it. By iterating over the group instead of creating a list of its elements, it avoids running out of memory (calling `AsList(SymmetricGroup(11))` already results in exceeding the permitted memory). That said, the computation still takes time, with several minutes needed to calculate the average order of an element of `SymmetricGroup(11)`. But at least we are confident that it is correct.
uk: Код `AvgOrdOfGroup` дуже простий, і з ним нічого не може піти не так. Перебираючи групу замість створення списку її елементів, це дозволяє уникнути нестачі пам'яті (виклик `AsList(SymmetricGroup(11))` вже призводить до перевищення дозволеної пам'яті). Тим не менш, обчислення все одно займає час, кілька хвилин необхідні для розрахунку середнього порядку елемента `SymmetricGroup(11)`. Але принаймні ми впевнені, що це правильно.

source: Now we would like to write a better version of this function using some theoretical facts we know from Group Theory. We may put `avgord.g` under version control to revert changes if need be; we may create a new function to keep the old one around and compare the results of both; but this could be made even more efficient if we use **regression testing**: this is the term for testing based on rerunning previously completed tests to check that new changes do not impact their correctness or worsen their performance.
uk: Тепер ми хотіли б написати кращу версію цієї функції, використовуючи деякі теоретичні факти, відомі нам із теорії груп. Ми можемо поставити `avgord.g` під контроль версій, щоб скасувати зміни, якщо потрібно; ми можемо створити нову функцію, щоб зберегти стару версію й порівняти результати обох; але це можна зробити ще ефективнішим, якщо ми використаємо **regression testing**: це термін для тестування на основі повторних запусків раніше завершених тестів, щоб переконатися, що нові зміни не вплинуть на їх коректність або не погіршать їх роботу.

source: To start with, we need to create a **test file**. The test file looks exactly like a GAP session, so it is easy to create it by copying and pasting a GAP session with all GAP prompts, inputs and outputs into a text file (a test file could be also created from a log file with a GAP session recorded with the help of `LogTo`). During the test, GAP will run all inputs from the test file, compare the outputs with those in the test file and report any differences.
uk: Для початку нам потрібно створити **тестовий файл**. Тестовий файл виглядає точно так само, як сеанс GAP, тому його легко створити, скопіювавши та вставивши сеанс GAP з усіма підказками, входами та виходами GAP у текстовий файл (тестовий файл також можна створити з файлу журналу із сеансом GAP, записаним за допомогою `LogTo`). Під час тестування GAP виконуватиме всі вхідні дані з тестового файлу, порівнюватиме результати з тими, що містяться в тестовому файлі, і повідомлятиме про будь-які відмінності.

source: GAP test files are just text files, but the common practice is to name them with the extension `.tst`. Now create the file `avgord.tst` in the current directory (to avoid typing the full path) with the following content:
uk: Тестові файли GAP — це просто текстові файли, але загальноприйнятою практикою є назвати їх із розширенням `.tst`. Тепер створіть файл `avgord.tst` у поточному каталозі (щоб вводити повний шлях) з наступним вмістом:

source: ~~~ # tests for average order of a group element # permutation group gap> S:=SymmetricGroup(9); Sym( [ 1 .. 9 ] ) gap> AvgOrdOfGroup(S); 3291487/362880 ~~~
uk: ~~~ # тести на середній порядок елемента групи # група перестановок gap> S:=SymmetricGroup(9); Sym( [ 1 .. 9 ] ) gap> AvgOrdOfGroup(S); 3291487/362880 ~~~

source: As you see, the test file may include comments, with certain rules specifying where they may be placed, because one should be able to distinguish comments in the test file from GAP output started with `#`. For that purpose, lines at the beginning of the test file that start with `#`, and one empty line together with one or more lines starting with `#`, are considered as comments. All other lines are interpreted as GAP output from the preceding GAP input.
uk: Як ви бачите, тестовий файл може включати коментарі з певними правилами, що визначають, де їх можна розміщувати, тому що потрібно мати можливість відрізнити коментарі в тестовому файлі від вихідних даних GAP, які починаються з `#`. З цією метою, рядки на початку тестового файлу, які починаються з `#`, і один порожній рядок разом з одним або декількома рядками, що починаються з `#`, вважаються коментарями. Усі інші рядки інтерпретуються як вихід GAP із попереднього введення GAP.

source: To run the test, one should use the function `Test`, as documented [here](http://www.gap-system.org/Manuals/doc/ref/chap7.html#X87712F9D8732193C). For example (assuming that the function `AvgOrdOfGroup` is already loaded):
uk: Щоб запустити тест, слід використовувати функцію `Test`, як описано в документації [here](http://www.gap-system.org/Manuals/doc/ref/chap7.html#X87712F9D8732193C). Наприклад (за умови, що функція `AvgOrdOfGroup` вже завантажена):

source: In this case, `Test` reported no discrepancies and returned `true`, so we conclude that the test has passed.
uk: У цьому випадку `Test` не повідомив про відсутність розбіжностей і повернув `true`, тому ми робимо висновок, що перевірку пройдено.

source: We will not cover the topic of writing a good and comprehensive test suite here, nor will we cover the various options of the `Test` function, allowing us, for example, to ignore differences in the output formatting, or to display the progress of the test, as these are described in its documentation.
uk: Ми не розглядатимемо тут тему написання гарного та комплексного набору тестів, а також не будемо розглядати різні параметри функції `Test`, що дозволяє нам, наприклад, ігнорувати відмінності у форматуванні виводу або відображати хід виконання тесту, як це описано в його документації.
