Repository: carpentries-i18n/i18n
Catalog: po/gap-lesson.*.po
Languages: uk

source: > 3. Set your current directory to `avgord` calling `ChangeDirectoryCurrent` from
uk: > 3. Установіть поточний каталог на `avgord`, викликаючи `ChangeDirectoryCurrent` з

source: > the IO package (if GAP is installed correctly, by default it should be loaded
uk: > пакет IO (якщо GAP встановлено правильно, за замовчуванням він має завантажуватися

source: > when GAP starts):
uk: > під час запуску GAP):

source: > * on Linux and OS X, call `ChangeDirectoryCurrent("/home/username/avgord");`
uk: > * у Linux і OS X викличте `ChangeDirectoryCurrent("/home/username/avgord");`

source: > (edit the path as necessary; remember to type the full path to your home
uk: > (за потреби відредагуйте шлях; не забудьте ввести повний шлях до вашого домашнього

source: > directory instead of `~`).
uk: > каталогу замість `~`).

source: > * on Windows, call `ChangeDirectoryCurrent("C:/Users/username/avgord");`
uk: > * у Windows викличте `ChangeDirectoryCurrent("C:/Users/username/avgord");`

source: > (edit the path as necessary; remember to use `/` instead of `\`);
uk: > (за потреби відредагуйте шлях; не забудьте використовувати `/` замість `\`);

source: > 4. Verify that your current directory is set up properly: call `DirectoryCurrent();`
uk: > 4. Переконайтеся, що ваш поточний каталог налаштовано належним чином: викличте `DirectoryCurrent();`

source: > on Windows or `Exec("pwd");` on Linux and OS X and check that the path in the
uk: > у Windows або `Exec("pwd");` у Linux і OS X і переконайтеся, що шлях у

source: > output points to the `avgord` directory.
uk: > виведених даних вказує на каталог `avgord`.

source: * [GAP Tutorial: A First session with GAP](http://www.gap-system.org/Manuals/doc/tut/chap2.html)
uk: * [Підручник з GAP: Перше заняття з GAP](http://www.gap-system.org/Manuals/doc/tut/chap2.html)

source: * [GAP Reference Manual: Naming Conventions](https://plus.google.com/events/cfm3tc375c142qtodvlvcfs82l4)
uk: * [Довідковий посібник GAP: Конвенції про найменування](https://plus.google.com/events/cfm3tc375c142qtodvlvcfs82l4)

source: * [GAP Reference Manual: The Help System](http://www.gap-system.org/Manuals/doc/ref/chap2.html)
uk: * [Довідковий посібник GAP: Довідкова система](http://www.gap-system.org/Manuals/doc/ref/chap2.html)

source: * [GAP Tutorial: Lists and Records](http://www.gap-system.org/Manuals/doc/tut/chap3.htm)
uk: * [Підручник з GAP: Списки та записи](http://www.gap-system.org/Manuals/doc/tut/chap3.htm)

source: * [GAP Reference Manual: Strings and Characters](http://www.gap-system.org/Manuals/doc/ref/chap27.html)
uk: * [Довідковий посібник GAP: Рядки та символи](http://www.gap-system.org/Manuals/doc/ref/chap27.html)

source: * [GAP Reference Manual: The Programming Language]( http://www.gap-system.org/Manuals/doc/ref/chap4.html#X7FE7C0C17E1ED118)
uk: * [Довідковий посібник GAP: Мова програмування](http://www.gap-system.org/Manuals/doc/ref/chap4.html#X7FE7C0C17E1ED118)

source: * [Integers](http://www.gap-system.org/Manuals/doc/ref/chap14.html)
uk: * [Цілі числа](http://www.gap-system.org/Manuals/doc/ref/chap14.html)

source: * [Rationals](http://www.gap-system.org/Manuals/doc/ref/chap17.html)
uk: * [Раціональні числа](http://www.gap-system.org/Manuals/doc/ref/chap17.html)

source: * [Cyclotomic numbers](http://www.gap-system.org/Manuals/doc/ref/chap18.html)
uk: * [Циклотомічні числа](http://www.gap-system.org/Manuals/doc/ref/chap18.html)

source: * [Floats](http://www.gap-system.org/Manuals/doc/ref/chap19.html)
uk: * [Числа з рухомою комою](http://www.gap-system.org/Manuals/doc/ref/chap19.html)

source: * [Finite Field Elements](http://www.gap-system.org/Manuals/doc/ref/chap59.html)
uk: * [Елементи скінченного поля](http://www.gap-system.org/Manuals/doc/ref/chap59.html)

source: * [Permutations](http://www.gap-system.org/Manuals/doc/ref/chap42.html)
uk: * [Перестановки](http://www.gap-system.org/Manuals/doc/ref/chap42.html)

source: * [Lists](http://www.gap-system.org/Manuals/doc/ref/chap21.html)
uk: * [Списки](http://www.gap-system.org/Manuals/doc/ref/chap21.html)

source: * [Records](http://www.gap-system.org/Manuals/doc/ref/chap29.html)
uk: * [Записи](http://www.gap-system.org/Manuals/doc/ref/chap29.html)

source: * [Strings and Characters](http://www.gap-system.org/Manuals/doc/ref/chap27.html)
uk: * [Рядки та символи](http://www.gap-system.org/Manuals/doc/ref/chap27.html)

source: * [GAP Tutorial: Functions](http://www.gap-system.org/Manuals/doc/tut/chap4.html)
uk: * [Підручник з GAP: Функції](http://www.gap-system.org/Manuals/doc/tut/chap4.html)

source: * [GAP Reference Manual: Test](http://www.gap-system.org/Manuals/doc/ref/chap7.html#X87712F9D8732193C)
uk: * [Довідковий посібник GAP: Тест](http://www.gap-system.org/Manuals/doc/ref/chap7.html#X87712F9D8732193C)

source: * [GAP Reference Manual: Group Libraries](http://www.gap-system.org/Manuals/doc/ref/chap50.html)
uk: * [Довідковий посібник GAP: Бібліотеки груп](http://www.gap-system.org/Manuals/doc/ref/chap50.html)

source: * [GAP Tutorial: Operations and Methods](http://www.gap-system.org/Manuals/doc/tut/chap8.html)
uk: * [Підручник з GAP: Операції та методи](http://www.gap-system.org/Manuals/doc/tut/chap8.html)

source: * [GAP Reference Manual: Adding a new Attribute](http://www.gap-system.org/Manuals/doc/ref/chap80.html#X874AF11D864AEC1B)
uk: * [Довідковий посібник GAP: Додавання нового атрибута](http://www.gap-system.org/Manuals/doc/ref/chap80.html#X874AF11D864AEC1B)

source: ## Glossary
uk: ## Словник

source: Attribute : Operation (normally, one-argument), the result of which is stored in its argument and cannot be changed any more.
uk: Атрибут : Операція (як правило, одноаргументна), результат якої зберігається в її аргументі і більше не може бути змінений.

source: List : Data structure whose elements are indexed by their _position_ in the list.
uk: Список : Структура даних, елементи якої проіндексовані за їхньою _позицією_ у списку.

source: Method : Function that will be called for an operation for arguments of the specified type.
uk: Метод : Функція, яку буде викликано для операції над аргументами зазначеного типу.

source: Operation : GAP function for which several _methods_ may be available (the particular method that will be used depends on the type of the arguments).
uk: Операція : Функція GAP, для якої може бути доступно кілька _методів_ (конкретний метод, який буде використано, залежить від типу аргументів).

source: Property : Boolean-valued attribute
uk: Властивість : Атрибут з логічним значенням

source: Record : Data structure which is a collection of _components_, each having a unique _name_, which is an _identifier_ that distinguishes this component, and a _value_, which is an object of arbitrary type.
uk: Запис : Структура даних, яка є набором _компонентів_, кожен з яких має унікальні _ім’я_, яке є _ідентифікатором_, що визначає цей компонент, і _значення_, яке є об’єктом довільного типу.

source: Regression testing : Testing based on rerunning previously completed tests to check that new changes do not impact their correctness or worsen their performance.
uk: Регресійне тестування : Тестування, засноване на повторному виконанні раніше завершених тестів, щоб переконатися, що нові зміни не впливають на їх правильність і не погіршують продуктивність.

source: --- layout: page title: Setup permalink: /setup/ ---
uk: --- layout: page title: Налаштування permalink: /setup/ ---

source: From the [GAP Downloads page](http://www.gap-system.org/Releases/), download the `.exe` installer and double click on the file to run it. When you are asked for the installation path, note that it should not contain spaces. For example, you may install GAP 4.X.Y in `C:\gap-4.X.Y` (default), `D:\gap-4.X.Y` or `C:\Math\GAP\gap-4.X.Y`, but you must not install it in a directory such as `C:\Program Files\gap-4.X.Y` or `C:\Users\alice\My Documents\gap-4.X.Y`.
uk: На [сторінці завантажень GAP](http://www.gap-system.org/Releases/), завантажте інсталятор `.exe` і двічі клацніть файл, щоб запустити його. Коли вас запитають про шлях інсталяції, зверніть увагу, що він не повинен містити пробілів. Наприклад, ви можете встановити GAP 4.X.Y у `C:\gap-4.X.Y` (за замовчуванням), `D:\gap-4.X.Y` чи `C:\Math\GAP\gap-4.X.Y`, але ви не повинні інсталювати його в такий каталог, як `C:\Program Files\gap-4.X.Y` чи `C:\Users\alice\My Documents\gap-4.X.Y`.

source: On OS X, you need to install GAP from source as explained at the [GAP Downloads page](http://www.gap-system.org/Releases/). Download one of the archives provided there, unpack it and run `./configure && make` in the unpacked directory. Then change to the `pkg` subdirectory and call `../bin/BuildPackages.sh` to run the script which will build most of the packages that require compilation (provided sufficiently many libraries, headers and tools are available).
uk: В OS X Вам потрібно інсталювати GAP із джерела, як описано на [сторінці завантажень GAP](http://www.gap-system.org/Releases/). Завантажте один із архівів, наданих там, розпакуйте його та запустіть `./configure && make` у розпакованому каталозі. Потім перейдіть до підкаталогу `pkg` і викличте `../bin/BuildPackages.sh`, щоб запустити сценарій, який створить більшість пакетів, які потребують компіляції (за умови наявності достатньої кількості бібліотек, заголовків і інструментів).

source: Alternatively, you may also install GAP using [Homebrew](http://brew.sh/). After installing Homebrew, follow the instructions for the [GAP Homebrew tap](https://github.com/gap-system/homebrew-gap).
uk: Крім того, ви також можете встановити GAP за допомогою [Homebrew](http://brew.sh/). Після встановлення Homebrew дотримуйтесь інструкцій для [GAP Homebrew tap](https://github.com/gap-system/homebrew-gap).

source: On Linux, you need to install GAP from source as explained at the [GAP Downloads page](http://www.gap-system.org/Releases/). Download one of the archives provided there, unpack it and run `./configure && make` in the unpacked directory. Then change to the `pkg` subdirectory and call `../bin/BuildPackages.sh` to run the script which will build most of the packages that require compilation (provided sufficiently many libraries, headers and tools are available).
uk: У Linux вам потрібно встановити GAP із джерела, як описано на [сторінці завантажень GAP](http://www.gap-system.org/Releases/). Завантажте один із наданих там архівів, розпакуйте його та запустіть `./configure && make` у розпакованому каталозі. Потім перейдіть до підкаталогу `pkg` і викличте `../bin/BuildPackages.sh`, щоб запустити сценарій, який створить більшість пакетів, які потребують компіляції (за умови наявності достатньої кількості бібліотек, заголовків і інструментів).
