Repository: carpentries-i18n/i18n
Catalog: po/gap-lesson.*.po
Languages: uk

source: Instead, we will now add more groups to `avgord.tst`, to demonstrate that the code also works with other kinds of groups, and to show various ways of combining commands in the test file:
uk: Замість цього ми додамо більше груп до `avgord.tst`, щоб продемонструвати, що код також працює з іншими типами груп, і показати різні способи поєднання команд у тестовому файлі:

source: ~~~ # tests for average order of a group element # permutation group gap> S:=SymmetricGroup(9); Sym( [ 1 .. 9 ] ) gap> AvgOrdOfGroup(S); 3291487/362880 # pc group gap> D:=DihedralGroup(512); <pc group of size 512 with 9 generators> gap> AvgOrdOfGroup(D); 44203/512 gap> G:=TrivialGroup();; # suppress output gap> AvgOrdOfGroup(G); 1 # fp group gap> F:=FreeGroup("a","b"); <free group on the generators [ a, b ]> gap> G:=F/ParseRelators(GeneratorsOfGroup(F),"a^8=b^2=1, b^-1ab=a^-1"); <fp group on the generators [ a, b ]> gap> IsFinite(G); true gap> AvgOrdOfGroup(G); 59/16 # finite matrix group over integers gap> AvgOrdOfGroup( Group( [[0,-1],[1,0]] ) ); 11/4 # matrix group over a finite field gap> AvgOrdOfGroup(SL(2,5)); 221/40 ~~~
uk: ~~~ # тести на середній порядок елемента групи # група перестановок gap> S:=SymmetricGroup(9); Sym( [ 1 .. 9 ] ) gap> AvgOrdOfGroup(S); 3291487/362880 # pc група gap> D:=DihedralGroup(512); <pc group of size 512 with 9 generators> gap> AvgOrdOfGroup(D); 44203/512 gap> G:=TrivialGroup();; # suppress output gap> AvgOrdOfGroup(G); 1 # fp група gap> F:=FreeGroup("a","b"); <free group on the generators [ a, b ]> gap> G:=F/ParseRelators(GeneratorsOfGroup(F),"a^8=b^2=1, b^-1ab=a^-1"); <fp group on the generators [ a, b ]> gap> IsFinite(G); true gap> AvgOrdOfGroup(G); 59/16 # скінченна група матриць над цілими числами gap> AvgOrdOfGroup( Group( [[0,-1],[1,0]] ) ); 11/4 # група матриць над скінченним полем gap> AvgOrdOfGroup(SL(2,5)); 221/40 ~~~

source: Let us test the extended version of the test again and check that it works:
uk: Давайте ще раз протестуємо розширену версію тесту та перевіримо, чи вона працює:

source: Now we will work on a better implementation. Of course, the order of an element is an invariant of a conjugacy class of elements of a group, so we need only to know the orders of conjugacy classes of elements and their representatives. The following code, which we add into `avgord.g`, reads into GAP and redefines `AvgOrdOfGroup` without any syntax errors:
uk: Зараз ми будемо працювати над кращою реалізацією. Звичайно, порядок елемента є інваріантом класу спряженості елементів групи, тому нам потрібно лише знати порядки класів спряженості елементів та їх представників. Наступний код, який ми додаємо до `avgord.g`, зчитує GAP і перевизначає `AvgOrdOfGroup` без синтаксичних помилок:

source: but when we run the test, here comes a surprise!
uk: але коли ми запускаємо тест, ось сюрприз!

source: ~~~ ########> Diff in avgord.tst, line 6: # Input is: AvgOrdOfGroup(S); # Expected output: 3291487/362880 # But found: 11/672 ######## ########> Diff in avgord.tst, line 12: # Input is: AvgOrdOfGroup(D); # Expected output: 44203/512 # But found: 2862481/512 ######## ########> Diff in avgord.tst, line 23: # Input is: AvgOrdOfGroup(G); # Expected output: 59/16 # But found: 189/16 ######## ########> Diff in avgord.tst, line 29: # Input is: AvgOrdOfGroup(SL(2,5)); # Expected output: 221/40 # But found: 69/20 ######## false ~~~
uk: ~~~ ########> Diff in avgord.tst, line 6: # Ввід: AvgOrdOfGroup(S); # Очікуваний вивід: 3291487/362880 # Але знайдено: 11/672 ######## ########> Diff in avgord.tst, line 12: # Ввід: AvgOrdOfGroup(D); # Очікуваний вивід: 44203/512 # Але знайдено: 2862481/512 ######## ########> Diff in avgord.tst, line 23: # Ввід: AvgOrdOfGroup(G); # Очікуваний вивід: 59/16 # Але знайдено: 189/16 ######## ########> Diff in avgord.tst, line 29: # Ввід: AvgOrdOfGroup(SL(2,5)); # Очікуваний вивід: 221/40 # Але знайдено: 69/20 ######## false ~~~

source: Indeed, we made a typo (deliberately) and replaced `Size(c)` by `Size(cc)`. The correct version of course should look as follows:
uk: Дійсно, ми допустили помилку (навмисно) і замінили `Size(c)` на `Size(cc)`. Правильний варіант курсу має виглядати так:

source: Now we will fix this in `avgord.g`, and read and test it again to check that the tests run correctly.
uk: Тепер ми виправимо це в `avgord.g`, прочитаємо та протестуємо його знову, щоб перевірити, чи тести виконуються правильно.

source: Thus, the approach 'Make it right, then make it fast' helped detect a bug immediately after it has been introduced.
uk: Таким чином, підхід «Зробіть спочатку правильно, а потім швидко» допоміг виявити помилку відразу після її появи.

source: --- title: "Small groups search" teaching: 40 exercises: 15 questions: - "Modular programming: putting functions together" - "How to check some conjecture for all groups of a given order" objectives: - "Using the Small Groups Library" - "Designing a system of functions to fit together" keypoints: - "Organise the code into functions." - "Create small groups one by one instead of producing a huge list of them." - "Using `SmallGroupsInformation` may help to reduce the search space." - "GAP is not a magic tool: theoretical knowledge may help much more than the brute-force approach." ---
uk: --- title: "Пошук малих груп" teaching: 40 exercises: 15 questions: - "Модульне програмування: поєднання функцій разом" - "Як перевірити деяку гіпотезу для всіх груп заданого порядку" objectives: - "Використовуючи Small Groups Library" - "Розробка системи функцій, яка сумісна" keypoints: - "Організуйте код у функції." - "Створюйте малі групи одну за одною замість того, щоб створювати їх величезний список." - "Використання `SmallGroupsInformation` може допомогти зменшити простір пошуку." - "GAP не є чарівним інструментом: теоретичні знання можуть допомогти набагато більше, ніж підхід грубої сили." ---

source: In this section, we wish to discover some non-trivial groups with an interesting property: namely, that the average order of their elements is an integer.
uk: У цьому розділі ми хочемо відкрити деякі нетривіальні групи з цікавою властивістю, а саме, що середній порядок їхніх елементів є цілим числом.

source: The GAP distribution includes a number of data libraries (see an overview [here](http://www.gap-system.org/Datalib/datalib.html)). One of them is the [Small Groups Library](http://www.gap-system.org/Packages/sgl.html) by Hans Ulrich Besche, Bettina Eick and Eamonn O'Brien.
uk: Дистрибутив GAP включає низку бібліотек даних (див. огляд [here](http://www.gap-system.org/Datalib/datalib.html)). Однією з них є [Small Groups Library](http://www.gap-system.org/Packages/sgl.html) Ганса Ульріха Беше, Беттіни Айк та Імона О'Брайена.

source: This library provides various utilities to determine which information is stored there and submit queries to search for groups with desired properties. The key functions are `SmallGroup`, `AllSmallGroups`, `NrSmallGroups`, `SmallGroupsInformation` and `IdGroup`. For example:
uk: Ця бібліотека надає різні утиліти для визначення того, яка інформація там зберігається, і надсилання запитів для пошуку груп із потрібними властивостями. Ключовими функціями є `SmallGroup`, `AllSmallGroups`, `NrSmallGroups`, `SmallGroupsInformation` та `IdGroup`. Наприклад:

source: We would like to use our own testing function, which we will create here, using inline notation (available for one-argument functions):
uk: Ми хотіли б використати нашу власну функцію тестування, яку ми створимо тут, використовуючи вбудовану нотацію (доступну для функцій з одним аргументом):

source: Now try, for example
uk: Тепер спробуйте, наприклад,

source: > ## Modular programming begins here
uk: > ## Тут починається модульне програмування

source: > > Why is returning booleans a good design decision for such functions, > instead of just printing information or returning a string such as `"YES"` ?
uk: > > Чому повернення логічних значень є хорошим проєктним рішенням для таких функцій, > замість того, щоб просто друкувати інформацію чи повертати рядок, наприклад `"YES"`?

source: This is a simple example of a function which tests all groups of a given order. It creates one group at a time, checks the desired property, and returns as soon as an example is discovered. Otherwise it returns `fail` which is a special kind of boolean variable in GAP.
uk: Це простий приклад функції, яка перевіряє всі групи заданого порядку. Він створює одну групу за раз, перевіряє потрібну властивість і повертається, щойно буде виявлено приклад. В іншому випадку він повертає `fail`, який є особливим типом логічної змінної в GAP.

source: For example,
uk: Наприклад,

source: > ## `AllSmallGroups` runs out of memory -- what to do?
uk: `AllSmallGroups` не вистачає пам'яті - що робити?

source: > > * Use iteration over `[1..NrSmallGroups(n)]` as shown in the function above > * Use `IdsOfAllSmallGroups` which accepts same arguments as `AllSmallGroups` > but returns ids instead of groups.
uk: > > *Використовуйте ітерацію над `[1..NrSmallGroups(n)]`, як показано у функції вище > * Використовуйте `IdsOfAllSmallGroups`, яка приймає ті самі аргументи, що й `AllSmallGroups`, > але повертає ідентифікатори замість груп.

source: Iterating over `[1..NrSmallGroups(n)]` gives you more flexibility if you need more control over the progress of calculation. For example, the next version of our testing function prints additional information about the number of the group being tested. It also supplies the testing function as an argument (why do you think this is better?).
uk: Ітерація над `[1..NrSmallGroups(n)]` дає вам більше гнучкості, якщо вам потрібно більше контролювати хід обчислення. Наприклад, наступна версія нашої функції тестування друкує додаткову інформацію про номер групи, що тестується. Він також надає функцію тестування як аргумент (чому ви думаєте, що це краще?)

source: will display a changing counter during calculation and then return `fail`:
uk: відобразить змінний лічильник під час обчислення, а потім поверне `fail`:

source: The next step is to integrate `TestOneOrder` into a function which will test all orders from 2 to `n` and stop as soon as it finds an example of a group with the average order of an element being an integer:
uk: Наступним кроком є інтеграція `TestOneOrder` у функцію, яка перевірить усі порядки від 2 до `n` і зупиниться, щойно знайде приклад групи, середній порядок елемента якого є цілим числом:

source: It reports that there is such a group of order 105:
uk: Ми бачимо, що існує така група порядку 105:

source: To explore it further, we can get its `StructureDescription` (see [here](http://www.gap-system.org/Manuals/doc/ref/chap39.html#X87BF1B887C91CA2E) for the explanation of the notation it uses):
uk: Щоб дослідити її далі, ми можемо отримати її `StructureDescription` (див. [тут](http://www.gap-system.org/Manuals/doc/ref/chap39.html#X87BF1B887C91CA2E) для пояснення нотації, яку використано):

source: and then convert it to a finitely presented group to see its generators and relators:
uk: а потім перетворити її на скінченно представлену групу, щоб побачити її твірні та співвідношення.

source: Now we want to try larger groups, starting from order 106 (we check that the other group of order 105 possesses no such property)
uk: Тепер ми хочемо спробувати більші групи, починаючи з порядку 106 (ми перевіряємо, що інша група порядку 105 не має такої властивості)

source: With a little modification, we add an extra argument specifying the order from which to start:
uk: З невеликими змінами ми додаємо додатковий аргумент, який визначає порядок, з якого потрібно починати:

source: But now we call it with
uk: Але тепер ми викликаємо

source: and discover that testing 2328 groups of order 128 and additionally 56092 groups of order 256 already takes too long.
uk: і виявляємо, що тестування 2328 груп порядку 128 і додатково 56092 груп порядку 256 вже займає занадто багато часу.

source: > ## Don't panic!
uk: > ## Не панікувати!

source: > > You can interrupt GAP by pressing Ctrl-C once. After that, GAP will enter > a break loop, designated by the break prompt `brk>`. You can leave it by > typing `quit;` (beware of pressing Ctrl-C twice within a second -- that will > terminate GAP session completely).
uk: > > Ви можете перервати GAP, натиснувши Ctrl-C один раз. Після цього GAP увійде > в цикл розриву, позначений підказкою розриву `brk>`. Ви можете вийти з нього, > ввівши `quit;` (стережіться натискання Ctrl-C двічі протягом секунди – це > повністю завершить сеанс GAP).

source: This is another situation where theoretical knowledge helps much more than the brute-force approach. If the group is a _p_-group, then the order of each conjugacy class of a non-identity element of the group is divisible by _p_; therefore, the average order of a group element may not be an integer. Therefore, _p_-groups can be excluded from calculation. So, the new version of the code is
uk: Це ще одна ситуація, коли теоретичні знання допомагають набагато більше, ніж підхід грубої сили. Якщо група є _p_-групою, то порядок кожного класу спряженості нетотожного елемента групи ділиться на _p_; отже, середній порядок елемента групи може не бути цілим числом. Тому _p_-групи можна виключити з розрахунку. Отже, нова версія коду є

source: and using it we are able to discover a group of order 357 with the same property:
uk: і використовуючи його, ми можемо виявити групу порядку 357 з тією ж властивістю:

source: The next function shows even further flexibility: it is variadic, i.e. it may accept two or more arguments, the first two of which will be assigned to the variables `f` and `n`, and the rest of which will be available in the list `r` (this is indicated by `...` after `r`). The first argument is the testing function, the second is the order to check, and the third and the fourth are the numbers of the first and last groups of this order that should be checked. By default, the last two are equal to 1 and `NrSmallGroups(n)` respectively. This function also shows how to validate the input and produce user-friendly error messages in case of invalid arguments.
uk: Наступна функція демонструє ще більшу гнучкість: вона є варіативною, тобто вона може приймати два або більше аргументів, перші два з яких будуть призначені змінним `f` і `n`, а решта буде доступна в список `r` (це позначено `...` після `r`). Перший аргумент — функція перевірки, другий — порядок перевірки, третій і четвертий — номери першої та останньої груп цього порядку, які потрібно перевірити. За замовчуванням останні два дорівнюють 1 і `NrSmallGroups(n)` відповідно. Ця функція також показує, як перевірити вхідні дані та створювати зручні повідомлення про помилки у випадку неприпустимих аргументів.

source: In addition, this function demonstrates how to use `Info` messages that may be switched on and off by setting appropriate `Info` level. The need we address here is to be able to switch the levels of verbosity of the output without error-prone approach of walking through the code and commenting `Print` statements in and out. It is achieved by creating an info class:
uk: Крім того, ця функція демонструє, як використовувати повідомлення `Info`, які можна вмикати та вимикати, встановивши відповідний рівень `Info`. Потреба, яку ми тут розглядаємо, полягає в тому, щоб мати можливість перемикати рівні багатослівності виводу без підходу, схильного до помилок, проходження коду та коментування інструкцій `Print`. Це досягається шляхом створення інформаційного класу:

source: Now instead of `Print("something");` one could use `Info( InfoSmallGroupsSearch, infolevel, "something" );` where `infolevel` is a positive integer specifying the level of verbosity. This level could be changed to `n` using the command `SetInfoLevel( InfoSmallGroupsSearch, n);`. See actual calls of `Info` in the code below:
uk: Тепер замість `Print("something");` можна використовувати `Info( InfoSmallGroupsSearch, infolevel, "something");`, де `infolevel` є додатним цілим числом, що визначає рівень докладності. Цей рівень можна змінити на `n` за допомогою команди `SetInfoLevel( InfoSmallGroupsSearch, n);`. Перегляньте фактичні виклики `Info` у коді нижче:

source: The following example demonstrates how the output may now be controlled by switching the info level for `InfoSmallGroupsSearch`:
uk: У наступному прикладі показано, як тепер можна керувати виводом, перемикаючи рівень інформації для `InfoSmallGroupsSearch`:

source: ~~~ gap> TestOneOrderVariadic(IsIntegerAverageOrder,24); fail gap> SetInfoLevel( InfoSmallGroupsSearch, 1 ); gap> TestOneOrderVariadic(IsIntegerAverageOrder,24); #I Checking groups 1 ... 15 of order 24 #I Search completed - no counterexample discovered fail gap> TestOneOrderVariadic(IsIntegerAverageOrder,357); #I Checking groups 1 ... 2 of order 357 #I Discovered counterexample: SmallGroup( 357, 1 ) [ 357, 1 ] gap> SetInfoLevel( InfoSmallGroupsSearch, 0); gap> TestOneOrderVariadic(IsIntegerAverageOrder,357); [ 357, 1 ] ~~~
uk: ~~~ gap> TestOneOrderVariadic(IsIntegerAverageOrder,24); fail gap> SetInfoLevel( InfoSmallGroupsSearch, 1 ); gap> TestOneOrderVariadic(IsIntegerAverageOrder,24); #I Перевірка груп 1 ... 15 порядку 24 #I Пошук завершено - контрприкладів не знайдено fail gap> TestOneOrderVariadic(IsIntegerAverageOrder,357); #I Перевірка груп 1 ... 2 порядку 357 #I Виявлений контрприклад: SmallGroup( 357, 1 ) [ 357, 1 ] gap> SetInfoLevel( InfoSmallGroupsSearch, 0); gap> TestOneOrderVariadic(IsIntegerAverageOrder,357); [ 357, 1 ] ~~~

source: Of course, this now introduces some complication for the test file, which compares the actual output with the reference output. To resolve this problem, we will decide to run the tests at info level 0 to suppress all additional outputs. Because the tests may have been started in the GAP session with a different info level, we will remember that info level to restore it after the test:
uk: Звичайно, тепер це вносить деякі ускладнення для тестового файлу, який порівнює фактичний вихід із еталонним виходом. Щоб вирішити цю проблему, ми вирішимо запустити тести на інформаційному рівні 0, щоб заблокувати всі додаткові виходи. Оскільки тести могли бути запущені в сеансі GAP з іншим рівнем інформації, ми запам’ятаємо цей рівень інформації, щоб відновити його після тесту:

source: ~~~ # Finding groups with integer average order gap> INFO_SSS:=InfoLevel(InfoSmallGroupsSearch);; gap> SetInfoLevel( InfoSmallGroupsSearch, 0); gap> res:=[];; gap> for n in [1..360] do > if not IsPrimePowerInt(n) then > t := TestOneOrderVariadic( IsIntegerAverageOrder,n,1,NrSmallGroups(n) ); > if t <> fail then > Add(res,t); > fi; > fi; > od; gap> res; [ [ 1, 1 ], [ 105, 1 ], [ 357, 1 ] ] gap> SetInfoLevel( InfoSmallGroupsSearch, INFO_SSS); ~~~
uk: ~~~ # Знаходжeння груп із цілим середнім порядком gap> INFO_SSS:=InfoLevel(InfoSmallGroupsSearch);; gap> SetInfoLevel( InfoSmallGroupsSearch, 0); gap> res:=[];; gap> for n in [1..360] do > if not IsPrimePowerInt(n) then > t := TestOneOrderVariadic( IsIntegerAverageOrder,n,1,NrSmallGroups(n) ); > if t <> fail then > Add(res,t); > fi; > fi; > od; gap> res; [ [ 1, 1 ], [ 105, 1 ], [ 357, 1 ] ] gap> SetInfoLevel( InfoSmallGroupsSearch, INFO_SSS); ~~~

source: > ## Does the Small Groups Library contain another group with this property?
uk: > ## Чи містить бібліотека Small Groups Library іншу групу з цією властивістю?

source: > > * What can you say about the order of the groups with this property? > > * Can you estimate how long it may take to check all 408641062 groups of order 1536? > > * How many groups of order not higher than 2000 might you be able to check, > excluding _p_-groups and those of order 1536? > > * Can you find another group with this property in the Small Groups Library > (of order not equal to 1536)?
uk: > > * Що Ви можете сказати про порядок груп із цією властивістю? > > * Чи можете Ви оцінити, скільки часу може зайняти перевірка всіх 408641062 груп порядку 1536? > > * Скільки груп порядку не вище 2000 Ви могли б перевірити, > за винятком _p_-груп і груп порядку 1536? > > * Чи можете Ви знайти іншу групу з цією властивістю в бібліотеці Small Groups Library > (порядок не дорівнює 1536)?

source: --- title: "Attributes and Methods" teaching: 40 exercises: 10 questions: - "How to record information in GAP objects" objectives: - "Declaring an attribute" - "Installing a method" - "Understanding method selection" - "Using debugging tools" keypoints: - "_Positional_ objects may accumulate information about themselves during their lifetime." - "This means that next time the stored information may be retrieved at zero cost." - "_Methods_ are bunches of functions; GAP's _method selection_ will choose the most efficient method based on the type of all arguments." - "'No-method-found' is a special kind of error with useful debugging tools helping to understand it." ---
uk: --- title: "Атрибути та методи" teaching: 40 exercises: 10 questions: - "Як записати інформацію в об’єкти GAP" objectives: - "Оголошення атрибута" - "Встановлення методу" - "Розуміння вибору методу" - "Використання інструментів для налагодження" keypoints: - "_Позиційні_ об'єкти можуть накопичувати інформацію про себе протягом життя." - "Це означає, що наступного разу збережену інформацію можна буде відновити без жодних витрат." - "_Методи_ — це групи функцій; _Вибір методів_ GAP вибере найефективніший метод на основі типу всіх аргументів." - "'Метод не знайдено' — це особливий вид помилки з корисними інструментами налагодження, які допомагають її зрозуміти." ---

source: > ## Which function is faster?
uk: > ## Яка функція швидше?

source: > > Try to repeatedly calculate `AvgOrdOfGroup(M11)` and `AvgOrdOfCollection(M11)` > and compare runtimes. Do this for a new copy of `M11` and for the one for which > this parameter has already been observed. What do you observe?
uk: > > Спробуйте неодноразово обчислити `AvgOrdOfGroup(M11)` та `AvgOrdOfCollection(M11)` > і порівняти час виконання. Зробіть це для нової копії `M11` і для тієї, для якої >цей параметр уже спостерігався. Що ви спостерігаєте?

source: Of course, for any given group the average order of its elements needs to be calculated only once, as the next time it will return the same value. However, as we see from the runtimes below, each new call of `AvgOrdOfGroup` will repeat the same computation again, with slightly varying runtime:
uk: Звичайно, для будь-якої даної групи середній порядок її елементів потрібно обчислити лише один раз, оскільки наступного разу він поверне те саме значення. Однак, як ми бачимо з часу виконання нижче, кожен новий виклик `AvgOrdOfGroup` повторюватиме те саме обчислення знову, дещо змінюючи час виконання:

source: In the last example, the group in question was the same -- we haven't constructed another copy of `AlternatingGroup(10)`; however, the result of the calculation was not stored in `A`.
uk: В останньому прикладі група, про яку йде мова, була такою самою -- ми не створили іншу копію `AlternatingGroup(10)`; однак результат обчислення не було збережено в `A`.
