Repository: carpentries-i18n/i18n
Catalog: po/gap-lesson.*.po
Languages: uk

source: This will create a file file `gap-intro.log` in the current directory which will contain all subsequent input and output that appears on your terminal. To stop logging, you can call `LogTo` without arguments, as in `LogTo();`, or leave GAP. Note that `LogTo` blanks the file before starting, if it already exists!
uk: Це створить файл `gap-intro.log` у поточному каталозі, який міститиме всі подальші вхідні та вихідні дані, які з’являтимуться у вашому терміналі. Щоб припинити ведення журналу, ви можете викликати `LogTo` без аргументів, як у `LogTo();`, або залишити GAP. Зауважте, що `LogTo` очищає файл перед запуском, якщо він уже існує!

source: It can be useful to leave some comments in the log file in case you return to it in the future. A comment in GAP starts with the symbol `#` and continues to the end of the line. You can enter the following after the GAP prompt:
uk: Може бути корисним залишити кілька коментарів у файлі журналу на випадок, якщо ви повернетеся до нього в майбутньому. Коментар у GAP починається з символу `#` і продовжується до кінця рядка. Ви можете ввести наступне після підказки GAP:

source: ~~~ # GAP Software Carpentry Lesson ~~~
uk: ~~~ # Урок Software Carpentry GAP ~~~

source: then after pressing the Return key, GAP will display a new prompt but the comment will be written to the log file.
uk: тоді після натискання клавіші Return GAP відобразить нову підказку, але коментар буде записаний у файл журналу.

source: The log file records all interaction with GAP that happens after the call to `LogTo`, but not before. We can repeat our calculation from above if we want to record it as well. Instead of retyping it, we will use the Up and Down arrow keys to scroll the *command line history*. Repeat this until you see the formula again, then press Return (the location of the cursor in the command line does not matter):
uk: Файл журналу записує всю взаємодію з GAP, яка відбувається після виклику `LogTo`, але не раніше. Ми можемо повторити наші обчислення вище, якщо ми також хочемо їх записати. Замість того, щоб вводити їх повторно, ми будемо використовувати клавіші зі стрілками вгору та вниз для прокручування *історії командного рядка*. Повторюйте це, доки знову не побачите формулу, потім натисніть Return (розташування курсору в командному рядку не має значення):

source: You can also edit existing commands. Press Up once more, and then use the Left and Right arrow keys, Delete or Backspace to edit it and replace 32 by 64 (some other useful shortcuts are Ctrl-A and Ctrl-E to move the cursor to the beginning and end of the line, respectively). Now press the Return key (at any position of the cursor in the command line):
uk: Ви також можете редагувати команди, що вже існують. Натисніть клавішу «Вгору» ще раз, а потім використовуйте клавіші зі стрілками вліво та вправо, Delete або Backspace, щоб відредагувати їх та замінити 32 на 64 (інші корисні комбінації клавіш — Ctrl-A та Ctrl-E, щоб перемістити курсор на початок і кінець рядку, відповідно). Тепер натисніть клавішу Return (у будь-якій позиції курсору в командному рядку):

source: It is useful to know that if the command line history is long, one could perform a partial search by typing the initial part of the command and using Up and Down arrow keys after that, to scroll only the lines that begin with the same string.
uk: Корисно знати, що якщо історія командного рядка велика, можна виконати частковий пошук, ввівши початкову частину команди, а потім використовуючи клавіші зі стрілками вгору та вниз, щоб прокрутити лише ті рядки, які починаються з введених символів.

source: If you want to store a value for later use, you can assign it to a name using `:=`
uk: Якщо ви бажаєте зберегти значення для подальшого використання, ви можете присвоїти йому ім'я за допомогою `:=`

source: > ## `:=`, `=` and `<>`
uk: > ## `:=`, `=` і `<>`

source: > > * In other languages you might be more familiar with using `=`, to assign > variables, but GAP uses `:=`. > > * GAP uses `=` to compare if two things are the same (where other languages might > use `==`). > > * Finally, GAP uses `<>` to check if two things are not equal (rather than the `!=` > you might have seen before).
uk: > > * В інших мовах Ви можете бути більш знайомі з використанням `=`, щоб присвоювати значення > змінним, але GAP використовує `:=`. > > * GAP використовує `=` для порівняння, якщо дві об'єкти однакові (де інші мови можуть > використовувати `==`). > > * Нарешті, GAP використовує `<>`, щоб перевірити, чи два об'єкти не рівні (замість `!=`, що > ви могли бачити раніше).

source: Whitespace characters (i.e. Spaces, Tabs and Returns) are insignificant in GAP, except if they occur inside a string. For example, the previous input could be typed without spaces:
uk: Пробільні символи (тобто пробіли, табуляції та символи переводу рядка) не мають значення в GAP, за винятком випадків, коли вони знаходяться всередині рядка. Наприклад, попереднє введеня можна ввести без пробілів:

source: Whitespace symbols are often used to format more complicated commands for better readability. For example, the following input which creates a 3×3 matrix:
uk: Пробіли часто використовуються для форматування більш складних команд для кращої читабельності. Наприклад, наступне введення, яке створює матрицю 3×3:

source: We can instead write our matrix over 3 lines. In this case, instead of the full prompt `gap>`, a partial prompt `>` will be displayed until the user finishes the input with a semicolon:
uk: Замість цього ми можемо записати нашу матрицю в 3 рядки. У цьому випадку замість повної підказки `gap>` відображатиметься часткова підказка `>`, доки користувач не завершить введення крапкою з комою:

source: You can use `Display` to pretty-print variables, including this matrix:
uk: Ви можете використовувати `Display` для красивого друку змінних, включаючи цю матрицю:

source: In general GAP functions like `LogTo` and `Display` are called using brackets, which contain a (possibly empty) list of arguments.
uk: Загалом функції GAP, як наприклад `LogTo` і `Display`, викликаються за допомогою дужок, які містять (можливо, порожній) список аргументів.

source: > ## Functions are also GAP objects
uk: > ## Функції також є об’єктами GAP

source: > > Check what happens if you forget to add brackets, > e.g. type `LogTo;` and `Factorial;` > We will explain the differences in these outputs later.
uk: > > Перевірте, що станеться, якщо ви забудете додати дужки, > наприклад, введіть `LogTo;` і `Factorial;` > Пізніше ми пояснимо відмінності в цих результатах.

source: Here are some examples of calling other GAP functions:
uk: Нижче наведені декілька прикладів виклику інших функцій GAP:

source: (the exact width of output will depend on your terminal settings),
uk: (точна ширина виводу залежатиме від налаштувань вашого терміналу),

source: and
uk: та

source: Functions may be combined in various ways, and may be used as arguments of other functions, for example, the `Filtered` function takes a list and a function, returning all elements of the list which satisfy the function. `IsEvenInt`, unsurprisingly, checks if an integer is even!
uk: Функції можна комбінувати різними способами та використовувати як аргументи інших функцій, наприклад, функція `Filtered` приймає список і функцію, повертаючи всі елементи списку, які задовольняють функцію. `IsEvenInt` ("Is Even Integer" з англ. "чи є ціле число парним"), як не дивно, перевіряє, чи є ціле число парним!

source: A useful time-saving feature of the GAP command-line interfaces is completion of identifiers when the Tab key is pressed. For example, type `Fib` and then press the Tab key to complete the input to `Fibonacci`:
uk: Корисною функцією інтерфейсу командного рядка GAP, яка економить час, є заповнення ідентифікаторів під час натискання клавіші Tab. Наприклад, введіть `Fib`, а потім натисніть клавішу Tab, щоб завершити введення `Fibonacci`:

source: In the case that a unique completion is not possible, GAP will try to perform partial completion, and pressing the Tab key second time will display all possible completions of the identifier. Try, for example, to enter `GroupHomomorphismByImages` or `NaturalHomomorphismByNormalSubgroup` using completion.
uk: У випадку, якщо унікальне доповнення неможливе, GAP спробує виконати часткове доповнення, а натискання клавіші Tab вдруге відобразить усі можливі доповнення ідентифікатора. Спробуйте, наприклад, ввести `GroupHomomorphismByImages` або `NaturalHomomorphismByNormalSubgroup` за допомогою доповнення.

source: The way functions are named in GAP will hopefully help you to memorise or even guess names of library functions. If a variable name consists of several words then the first letter of each word is capitalised (remember that GAP is case-sensitive!). Further details on naming conventions used in GAP are documented in the GAP manual [here](http://www.gap-system.org/Manuals/doc/ref/chap5.html#X81F732457F7BC851). Functions with names in `ALL_CAPITAL_LETTERS` are internal functions not intended for general use. Use them with extreme care!
uk: Сподіваємось, те, як функції називаються в GAP, допоможе вам запам’ятовувати або навіть вгадувати назви бібліотечних функцій. Якщо назва змінної складається з кількох слів, то перша літера кожного слова пишеться з великої літери (пам’ятайте, що GAP чутливий до регістру!). Подальші відомості про правила іменування, які використовуються в GAP, задокументовані в посібнику GAP [тут](http://www.gap-system.org/Manuals/doc/ref/chap5.html#X81F732457F7BC851). Функції з назвами `У_ВЕРХНЬОМУ_РЕГІСТРІ` є внутрішніми функціями, не призначеними для загального використання. Використовуйте їх з особливою обережністю!

source: It is important to remember that GAP is case-sensitive. For example, the following input causes an error:
uk: Важливо пам’ятати, що GAP чутливий до регістру. Наприклад, наступне введення викликає помилку:

source: because the name of the GAP library function is `Factorial`. Using lowercase instead of uppercase or vice versa also affects name completion.
uk: тому що назва функції бібліотеки GAP – `Factorial`. Використання малих літер замість великих або навпаки також впливає на доповнення назви.

source: Now let's consider the following problem: for a finite group _G_, calculate the average order of its elements (that is, the sum of orders of its elements divided by the order of the group). Where to start?
uk: Тепер давайте розглянемо таку задачу: для скінченної групи _G_ обчислити середній порядок її елементів (тобто суму порядків її елементів, поділену на порядок групи). З чого почати?

source: Enter `?Group`, and you will see all help entries, starting with `Group`:
uk: Введіть `?Group`, і ви побачите всі записи довідкової системи, що починаються з `Group`:

source: You may use arrow keys to move up and down the list, and open help pages by pressing Return key. For this exercise, open `Tutorial: Groups and Homomorphisms` first. Note the navigation instructions at the bottom of the screen. Look at first two pages, then press `q` to return to the selection menu. Next, navigate to `Reference: Groups` and open it. Within two first pages you will find the function `Group` and mentioning of `Order`.
uk: Ви можете використовувати клавіші зі стрілками для переміщення вгору та вниз по списку, а також відкривати сторінки довідки, натискаючи клавішу Return. Для цієї вправи спочатку відкрийте `Tutorial: Groups and Homomorphisms`. Зверніть увагу на навігаційні інструкції внизу екрана. Перегляньте перші дві сторінки, потім натисніть `q`, щоб повернутися до меню вибору. Далі перейдіть до елементу `Reference: Groups` і відкрийте його. На перших двох сторінках ви знайдете функцію `Group` та згадку `Order`.

source: GAP manual comes in several formats: text is good to view in a terminal, PDF is good for printing and HTML (especially with MathJax support) is very efficient for exploring with a browser. If you are running GAP on your own computer, you can set the help viewer to the default browser. If you are running GAP on a remote machine, this (probably) will not work. (see `?WriteGapIniFile` on how to make this setting permanent):
uk: Посібник GAP доступний у кількох форматах: текстовий зручний для перегляду в терміналі, PDF зручний для друку, а HTML (особливо з підтримкою MathJax) дуже ефективний для перегляду за допомогою браузера. Якщо ви використовуєте GAP на віддаленій машині, це (імовірно) не працюватиме. (див. `?WriteGapIniFile` про те, як зробити це налаштування постійним):

source: After that, invoke the help again, and see the difference!
uk: Після цього викличте довідку знову та побачите різницю!

source: Let's now copy the following input from the first example of the GAP Reference manual chapter on groups. It shows how to create permutations, and assign values to variables. This is `Reference: Groups`. You can select it by typing `?11`, where you replace `11` with whatever number appears before `Reference: Groups` on your machine.
uk: Давайте тепер скопіюємо наступні вхідні дані з першого прикладу глави довідкового посібника GAP про групи. У ньому показано, як створювати перестановки та присвоювати значення змінним. Це `Reference: Groups`. Ви можете вибрати його, ввівши `?11`, де ви заміните `11` на те значення, яке з’явиться перед `Reference: Groups` на вашому комп'ютері.

source: If you are viewing the GAP documentation in a terminal, you might find it helpful to open two copies of GAP, one for reading documentation and one for writing code!
uk: Якщо ви переглядаєте документацію GAP у терміналі, вам може бути корисно відкрити дві копії GAP, одну для читання документації та одну для написання коду!

source: This guide shows how permutations in GAP are written in cycle notation, and also shows common functions which are used with groups. Also, in some places two semi-colons are used at the end of a line. This stops GAP from showing the result of a computation.
uk: Цей посібник показує, як перестановки в GAP записуються в циклічній нотації, а також показує загальні функції, які використовуються з групами. Крім того, у деяких місцях використовуються дві крапки з комою в кінці рядка. Це не дозволить GAP показувати результат обчислення.

source: Next, let `G` be a group generated by `a` and `b`:
uk: Далі, нехай `G` - група, утворена за допомогою `a` та `b`:

source: We may explore some properties of `G` and its generators:
uk: Ми можемо дослідити деякі властивості групи `G` та її породжувачів:

source: Our next task is to find out how to obtain a list of `G`'s elements and their orders. Enter `?elements` and explore the list of help topics. After inspection, the entry from the Tutorial does not seem relevant, but the entry from the Reference manual is. It also explains the difference between using `AsSSortedList` and `AsList`. So, this is the list of elements of `G`:
uk: Нашим наступним завданням є з'ясувати, як отримати список елементів `G` та їх порядок. Введіть `?elements` і перегляньте список тем довідки. Після перевірки запис у Tutorial не здається актуальним, але є запис у довідковому посібнику (Reference). Тут також пояснюється різниця між використанням `AsSSortedList` і `AsList`. Отже, це список елементів `G`:

source: The returned object is a _list_. We would like to assign it to a variable to explore and reuse. We forgot to do it when we were calculating it. Of course, we may use the command line history to restore the last command, edit it and call again. But instead, we will use `last` which is a special variable holding the last result returned by GAP:
uk: Повернений об’єкт є _списком_. Ми хотіли б призначити його змінній для дослідження та повторного використання. Ми забули це зробити, коли обчислювали. Звичайно, ми можемо використовувати історію командного рядка, щоб відновити останню команду, відредагувати її та викликати знову. Але замість цього ми будемо використовувати `last`, яка є спеціальною змінною, що містить останній результат, повернутий GAP:

source: This is a list. Lists in GAP are indexed from 1. The following commands are (hopefully!) self-explanatory:
uk: Це список. Списки в GAP індексуються від 1. Наступні команди (сподіваємося!) не потребують пояснень:

source: > ## Lists are more than arrays
uk: > ## Списки — це більше, ніж масиви

source: > > * May contain holes or be empty > > * May dynamically change their length (with `Add`, `Append` or direct assigment) > > * Not required to contain objects of the same type > > > * See more in [GAP Tutorial: Lists and Records](http://www.gap-system.org/Manuals/doc/tut/chap3.html)
uk: > > * Може містити дірки або бути порожнім > > * Може динамічно змінювати їх довжину (за допомогою `Add`, `Append` або прямого призначення) > > * Не обов’язково містить об’єкти одного типу > > > * Дивіться більше в [GAP Tutorial: Lists and Records](http://www.gap-system.org/Manuals/doc/tut/chap3.html)

source: Many functions in GAP refer to `Set`s. A set in GAP is just a list that happens to have no repetitions, no holes, and elements in increasing order. Here are some examples:
uk: Багато функцій у GAP посилаються на `Множини`. Множина у GAP — це лише список, який не має повторень, жодних дірок і елементів у порядку зростання. Ось кілька прикладів:

source: Now let us consider an interesting calculation -- the average order of elements of `G`. There are many different ways to do this, we will consider a few of them here.
uk: Тепер давайте розглянемо цікаве обчислення - середній порядок елементів групи `G`. Існує багато різних способів зробити це, ми розглянемо деякі з них тут.

source: A `for` loop in GAP allows you to do something for every member of a collection. The general form of a `for` loop is:
uk: Цикл `for` у GAP дозволяє щось робити для кожного члена колекції. Загальна форма циклу "for" така:

source: For example, to find the average order of our group `G` we can do.
uk: Наприклад, ми можемо знайти середній порядок нашої групи `G`.

source: Actually, we can just directly loop over the elements of `G` (in general GAP will let you loop over most types of object). We have to switch to using `Size` instead of `Length`, as groups don't have a length!
uk: Насправді, ми можемо просто перебирати елементи `G` (загалом GAP дозволить вам перебирати більшість типів об’єктів). Нам потрібно перейти на використання `Size` замість `Length`, оскільки групи не мають довжини!

source: There are other ways of looping. For example, we can instead loop over a range of integers, and accept `elts` like an array:
uk: Існують і інші способи зациклювання. Наприклад, натомість ми можемо перейти до діапазону цілих чиселі прийняти `elts` як масив:

source: However, often there are more compact ways of doing things. Here is a very short way:
uk: Однак часто існують більш компактні способи виконання завдань. Ось дуже короткий шлях:

source: Let's break this last part down:
uk: Давайте розберемо останню частину:

source: * `Order` finds the order of a single permutation.
uk: * `Order` знаходить порядок однієї перестановки.

source: * `List(L,F)` makes a new list where the function `F` is applied to each
uk: * `List(L,F)` створює новий список, де функція `F` застосовується

source: member of the list `L`. * `Sum(L)` adds up the members of a list `L`.
uk: до кожного члена списку `L`. * `Sum(L)` додає члени списку `L`.

source: > ## Which approach is best?
uk: > ## Який підхід найкращий?

source: > > Compare these approaches. Which one would you prefer to use?
uk: > > Порівняйте ці підходи. Якому із них ви віддасте перевагу?

source: GAP has very helpful list manipulation tools. We will now show a few more examples.
uk: GAP має дуже корисні інструменти для роботи зі списками. Зараз ми покажемо ще кілька прикладів.

source: Sometimes, GAP does not have the exact function we want. For example, `NrMovedPoints` gives the number of moved points of a permutation, but what if we want to find all permutations which move `4` points? This is where GAP's arrow notation comes in. `g -> e` makes a new function which takes one argument `g`, and returns the value of the expression `e`. Here are some examples:
uk: Іноді GAP не має тієї функції, яка нам потрібна. Наприклад, `NrMovedPoints` дає кількість переміщених точок перестановки, але що, якщо ми хочемо знайти всі перестановки, які пересувають 4 точки? Ось тут і з’являється позначення GAP зі стрілками. `g -> e` створює нову функцію, яка отримує один аргумент `g` і повертає значення виразу `e`. Ось деякі приклади:

source: * finding all elements of `G` with no fixed points:
uk: * знаходження всіх елементів `G` без фіксованих точок:

source: * finding a permutation in `G` that conjugates (1,2) to (2,3)
uk: * знаходження перестановки в `G`, яка спрягає (1,2) та (2,3)

source: Let's check this (remember that in GAP permutations are multiplied from left to right!):
uk: Давайте перевіримо це (пам’ятайте, що в GAP перестановки множаться зліва направо!):

source: * checking whether all elements of `G` move the point 1 to 2:
uk: * перевірка, чи всі елементи `G` пересувають точку 1 у 2:

source: * checking whether there is an element in `G` which moves exactly two points:
uk: * перевірка того, чи є елемент у `G`, який переміщує рівно дві точки:

source: > ## Use list operations to select from `elts` the stabiliser of the point 2 and the centraliser of the permutation (1,2)
uk: > ## Використовуйте операції зі списком, щоб вибрати з `elts` стабілізатор точки 2 і централізатор перестановки (1,2)

source: --- title: "Some more GAP objects" teaching: 15 exercises: 5 questions: - "Further examples of objects and operations with them" objectives: - "See examples of types that are built-in in GAP but may be missing in other systems" - "See examples of list arithmetic" keypoints: - "GAP has a plethora of various immediate, positional and component objects." - "List arithmetic is very flexible and powerful." - "Objects like lists and records are good to keep structured and related data." ---
uk: --- title: "Ще декілька об’єктів GAP" teaching: 15 exercises: 5 questions: - "Подальші приклади об'єктів і операцій з ними" objectives: - "Перегляньте приклади типів, які вбудовані в GAP, але можуть бути відсутні в інших системах" - "Подивіться приклади арифметики списку" keypoints: - "GAP має безліч різноманітних безпосередніх, позиційних і складових об'єктів." - "Арифметика списків є дуже гнучкою та потужною." - "Такі об’єкти, як списки та записи, підходять для зберігання структурованих і пов’язаних даних." ---

source: So far we have met three types of GAP types:
uk: Наразі ми познайомилися з трьома типами GAP:

source: * simple objects such as integers, rationals, booleans, permutations;
uk: * такі прості об'єкти, як цілі числа, раціональні числа, булеві значення, перестановки;

source: * composite objects such as _lists_;
uk: * такі складені об'єкти, як _lists_;

source: * objects with more complex internal representation, such as groups.
uk: * такі об’єкти з більш складним внутрішнім представленням, як групи.

source: In this section, we will demonstrate some other examples of basic objects that exist in GAP (the system is extendable, so one can introduce new types of objects, but this is beyond the scope of this lesson!).
uk: У цьому розділі ми продемонструємо деякі інші приклади базових об’єктів, які існують у GAP (система розширювана, тому можна вводити нові типи об’єктів, але це виходить за рамки цього уроку!).

source: Some other simple objects are floats, cyclotomics and finite field elements:
uk: Деякі інші прості об'єкти - це floats, cyclotomics and finite field elements:
