Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: > > However in Python2 (and other languages), the `/` operator between two integer types perform a floor (`//`) division. To perform a float division, we have to convert one of the integers to float. > > ~~~ > print('5 // 3:', 1) > print('5 / 3:', 1 ) > print('5 / float(3):', 1.6666667 ) > print('float(5) / 3:', 1.6666667 ) > print('float(5 / 3):', 1.0 ) > print('5 % 3:', 2) > ~~~ > > If `num_subjects` is the number of subjects taking part in a study, > and `num_per_survey` is the number that can take part in a single survey, > write an expression that calculates the number of surveys needed > to reach everyone once. > > > ## Solution > > We want the minimum number of surveys that reaches everyone once, which is > > the rounded up value of `num_subjects / num_per_survey`. This is > > equivalent to performing an integer division with `//` and adding 1. > > ~~~ > > num_subjects = 600 > > num_per_survey = 42 > > num_surveys = num_subjects // num_per_survey + 1 > > > > print(num_subjects, 'subjects,', num_per_survey, 'per survey:', num_surveys) > > ~~~ > > {: .language-python} > > ~~~ > > 600 subjects, 42 per survey: 15 > > ~~~ > > {: .output}
es: > > Sin embargo, en Python 2 (y otros lenguajes), el operador `/` entre dos enteros realiza una división de piso (`//`). Para realizar una división de punto flotante, tenemos que convertir uno de los enteros a punto flotante. > > ~~~ > print('5 // 3:', 1) > print('5 / 3:', 1 ) > print('5 / float(3):', 1.6666667 ) > print('float(5) / 3:', 1.6666667 ) > print('float(5 / 3):', 1.0 ) > print('5 % 3:', 2) > ~~~ > > Si `num_subjects` es el número de sujetos que participan en un estudio, > y `num_per_survey` es el número sujetos que pueden participar en una sola encuesta, > escriba una expresión que calcule la cantidad de encuestas necesarias > para alcanzar a todos los participantes de una sola vez. > >> ## Solución >> Queremos la cantidad mínima de encuestas que alcance a todos los participantes de una sola vez, que es >> el valor redondeado de `num_subjects / num_per_survey`. Esto es >> equivalente a realizar una división entera con `//` y sumar 1. > > ~~~ > > num_subjects = 600 > > num_per_survey = 42 > > num_surveys = num_subjects // num_per_survey + 1 > > > > print(num_subjects, 'subjects,', num_per_survey, 'per survey:', num_surveys) > > ~~~ > > {: .language-python} > > ~~~ > > 600 subjects, 42 per survey: 15 > > ~~~ > > {: .output}
uk: > > Але у Python 2 (та інших мовах) оператор `/` для двох цілих чисел буде виконувати ціле (`//`) ділення. Щоб виконати ділення з плаваючою крапкою, треба перетворити одне з цілих чисел на дійсне. > > ~~~ > print('5 // 3:', 1) > print('5 / 3:', 1 ) > print('5 / float(3):', 1.6666667 ) > print('float(5) / 3:', 1.6666667 ) > print('float(5 / 3):', 1.0 ) > print('5 % 3:', 2) > ~~~ > > Нехай `num_subjects` - це загальне число людей, які беруть участь у дослідженні, > а `num_per_survey` - це число людей, які можуть взяти участь у одному опитуванні. > Як обчислити кількість досліджень, необхідну, > щоб опитати кожного один раз? > > > ## Рішення > > Нам треба знайти мінімальну кількість опитувань, необхідну, щоб опитати кожного один раз, тобто > > округлити до більшого цілого числа `num_subjects / num_per_survey`. Це > > еквивалентно виконанню цілого ділення за допомогою `//` з додаванням 1. > > ~~~ > > num_subjects = 600 > > num_per_survey = 42 > > num_surveys = num_subjects // num_per_survey + 1 > > > > print(num_subjects, 'subjects,', num_per_survey, 'per survey:', num_surveys) > > ~~~ > > {: .language-python} > > ~~~ > > 600 subjects, 42 per survey: 15 > > ~~~ > > {: .output}

source: > ## Strings to Numbers
es: > ## Secuencia de caracteres a Números
uk: > ## Перетворення рядків у числа

source: > > Where reasonable, `float()` will convert a string to a floating point number, > and `int()` will convert a floating point number to an integer: > > ~~~ > print("string to float:", float("3.4")) > print("float to int:", int(3.4)) > ~~~ > {: .language-python} > > ~~~ > string to float: 3.4 > float to int: 3 > ~~~
es: > > Donde sea razonable, `float()` convertirá una secuencia de caracteres a un número de punto flotante, > y `int()` convertirá un número de punto flotante a un entero: > > ~~~ > print("string to float:", float("3.4")) > print("float to int:", int(3.4)) > ~~~ > {: .language-python} > > ~~~ > string to float: 3.4 > float to int: 3 > ~~~
uk: > > Коли доцільно, `float()` перетворить рядок на число з плаваючою крапкою, > а `int()` перетворить число з плаваючою крапкою на ціле: > > ~~~ > print("string to float:", float("3.4")) > print("float to int:", int(3.4)) > ~~~ > {: .language-python} > > ~~~ > string to float: 3.4 > float to int: 3 > ~~~

source: > > If the conversion doesn't make sense, however, an error message will occur > > ~~~ > print("string to float:", float("Hello world!")) > ~~~ > {: .language-python} > > ~~~ > --------------------------------------------------------------------------- > ValueError Traceback (most recent call last) > <ipython-input-5-df3b790bf0a2> in <module>() > ----> 1 print("string to float:", float("Hello world!")) > > ValueError: could not convert string to float: 'Hello world!' > ~~~
es: > > Sin embargo, si la conversión no tiene sentido, aparecerá un mensaje de error > > ~~~ > print("string to float:", float("Hello world!")) > ~~~ > {: .language-python} > > ~~~ > --------------------------------------------------------------------------- > ValueError Traceback (most recent call last) > <ipython-input-5-df3b790bf0a2> in <module>() > ----> 1 print("string to float:", float("Hello world!")) > > ValueError: could not convert string to float: 'Hello world!' > ~~~
uk: > > Однак якщо перетворення не має сенсу, то зʼявиться повідомлення про помилку > > ~~~ > print("string to float:", float("Hello world!")) > ~~~ > {: .language-python} > > ~~~ > --------------------------------------------------------------------------- > ValueError Traceback (most recent call last) > <ipython-input-5-df3b790bf0a2> in <module>() > ----> 1 print("string to float:", float("Hello world!")) > > ValueError: could not convert string to float: 'Hello world!' > ~~~

source: > > Given this information, what do you expect the following program to do? > > What does it actually do? > > Why do you think it does that? > > ~~~ > print("fractional string to int:", int("3.4")) > ~~~ > {: .language-python} > > > ## Solution > > What do you expect this program to do? It would not be so unreasonable to expect the Python 3 `int` command to > > convert the string "3.4" to 3.4 and an additional type conversion to 3. After all, Python 3 performs a lot of other > > magic - isn't that part of its charm? > > > > However, Python 3 throws an error. Why? To be consistent, possibly. If you ask Python to perform two consecutive > > typecasts, you must convert it explicitly in code. > > > > ~~~ > > int("3.4") > > int(float("3.4")) > > ~~~ > > {: .language-python} > > ~~~ > > In [2]: int("3.4") > > --------------------------------------------------------------------------- > > ValueError Traceback (most recent call last) > > <ipython-input-2-ec6729dfccdc> in <module>() > > ----> 1 int("3.4") > > ValueError: invalid literal for int() with base 10: '3.4' > > 3 > > ~~~ > > {: .output}
es: > > Dada esta información, ¿qué espera que haga el siguiente programa? > > ¿Qué hace realmente? > > ¿Por qué crees que hace eso? > > ~~~ > print("fractional string to int:", int("3.4")) > ~~~ > {: .language-python} > >> ## Solución >> ¿Qué esperas que haga este programa? No sería tan irracional esperar que el comando `int` de Python 3 >> convierta la **string** "3.4" a 3.4 y una conversión de tipo adicional a 3. Después de todo, Python 3 realiza muchas otras >> magia - ¿no es esa parte de su encanto? >> >> Sin embargo, Python 3 arroja un error. ¿Por qué? Para ser consistente, posiblemente. Si le pide a Python que realice dos >> typecasts, debe indicar la conversión explícitamente en el código. > > > > ~~~ > > int("3.4") > > int(float("3.4")) > > ~~~ > > {: .language-python} > > ~~~ > > In [2]: int("3.4") > > --------------------------------------------------------------------------- > > ValueError Traceback (most recent call last) > > <ipython-input-2-ec6729dfccdc> in <module>() > > ----> 1 int("3.4") > > ValueError: invalid literal for int() with base 10: '3.4' > > 3 > > ~~~ > > {: .output}
uk: > > Беручи це до уваги, чого ви чекаєте від наступної програми? > > Що вона робить насправді? > > Як це пояснити? > > ~~~ > print("fractional string to int:", int("3.4")) > ~~~ > {: .language-python} > > > ## Рішення > > Чого можна очікувати від цієї програми? Чому б не очікувати, що у Python 3 команда `int` > > перетворить рядок "3.4" на 3.4 та виконає додаткове перетворення у ціле число 3. Зрештою, Python 3 створює багато іншої > > магії - хіба це не частина його чарівності? > > > > Однак Python 3 видає помилку. Чому? Можливо, щоб бути послідовним. Якщо ви просите Python виконати два послідовних > > перетворення типу, ви маєте явним чином вказати це у коді програми. > > > > ~~~ > > int("3.4") > > int(float("3.4")) > > ~~~ > > {: .language-python} > > ~~~ > > In [2]: int("3.4") > > --------------------------------------------------------------------------- > > ValueError Traceback (most recent call last) > > <ipython-input-2-ec6729dfccdc> in <module>() > > ----> 1 int("3.4") > > ValueError: invalid literal for int() with base 10: '3.4' > > 3 > > ~~~ > > {: .output}

source: > ## Arithmetic with Different Types
es: > ## Aritmética con Diferentes Tipos
uk: > ## Арифметичні дії з різними типами

source: > > Which of the following will return the floating point number `2.0`? > Note: there may be more than one right answer. > > ~~~ > first = 1.0 > second = "1" > third = "1.1" > ~~~ > {: .language-python} > > 1. `first + float(second)` > 2. `float(second) + float(third)` > 3. `first + int(third)` > 4. `first + int(float(third))` > 5. `int(first) + int(float(third))` > 6. `2.0 * second` > > > ## Solution > > > > Answer: 1 and 4
es: > > ¿Cuál de los siguientes devolverá el **float** `2.0`? > Nota: puede haber más de una respuesta correcta. > > ~~~ > first = 1.0 > second = "1" > third = "1.1" > ~~~ > {: .language-python} > > 1. `first + float(second)` > 2. `float(second) + float(third)` > 3. `first + int(third)` > 4. `first + int(float(third))` > 5. `int(first) + int(float(third))` > 6. `2.0 * second` > > > ## Solución > > > > Respuesta: 1 y 4
uk: > > Яка з наступних команд поверне дійсне число `2.0`? > Примітка: це питання може мати декілька коректних відповідей. > > ~~~ > first = 1.0 > second = "1" > third = "1.1" > ~~~ > {: .language-python} > > 1. `first + float(second)` > 2. `float(second) + float(third)` > 3. `first + int(third)` > 4. `first + int(float(third))` > 5. `int(first) + int(float(third))` > 6. `2.0 * second` > > > ## Рішення > > > > Відповідь: 1 та 4

source: > ## Complex Numbers
es: > ## Números Complejos
uk: > ## Комплексні числа

source: > > Python provides complex numbers, > which are written as `1.0+2.0j`. > If `val` is an imaginary number, > its real and imaginary parts can be accessed using *dot notation* > as `val.real` and `val.imag`. > > ~~~ > complex = 6 + 2j > print(complex.real) > print(complex.imag) > ~~~ > {: .language-python} > > ~~~ > 6.0 > 2.0 > ~~~
es: > > Python proporciona números complejos, > que son escritos como `1.0+2.0j`. > Si `val` es un número imaginario, > Se puede acceder a sus partes reales e imaginarias usando *notación de punto* > como `val.real` y` val.imag`. > > ~~~ > complex = 6 + 2j > print(complex.real) > print(complex.imag) > ~~~ > {: .language-python} > > ~~~ > 6.0 > 2.0 > ~~~
uk: > > Python підтримує комплексні числа, > які записуються як `1.0+2.0j`. > Якщо `val` - комплексне число, > то до його дійсної та уявної частин можна отримати доступ за допомогою *крапкової нотації* > як `val.real` та `val.imag`. > > ~~~ > complex = 6 + 2j > print(complex.real) > print(complex.imag) > ~~~ > {: .language-python} > > ~~~ > 6.0 > 2.0 > ~~~

source: > > > 1. Why do you think Python uses `j` instead of `i` for the imaginary part? > 2. What do you expect `1+2j + 3` to produce? > 3. What do you expect `4j` to be? What about `4 j` or `4 + j`? > > > ## Solution > > > > 1. Standard mathematics treatments typically use `i` to denote an imaginary number. However, from media reports it > > was an early convention established from electrical engineering that now presents a technically expensive area to > > change. [Stack Overflow provides additional explanation and > > discussion.](http://stackoverflow.com/questions/24812444/why-are-complex-numbers-in-python-denoted-with-j-instead-of-i) > > 2. `(4+2j)` > > 3. `4j`, `Syntax Error: invalid syntax`, in this case _j_ is considered a variable and this depends on if _j_ is defined and if so, its assigned value
es: > > > 1. ¿Por qué crees que Python usa `j` en lugar de` i` para la parte imaginaria? > 2. ¿Qué esperas que produzca `1+2j + 3` ? > 3. ¿Qué esperas que sea `4j` ? ¿Y qué esperas de `4 j` o` 4 + j` ? > >> ## Solución >> >> 1. Los tratamientos matemáticos estándar suelen usar `i` para denotar un número imaginario. Sin embargo, según informan los medios >> fue una convención temprana establecida a partir de la ingeniería eléctrica que ahora presenta un área técnicamente costosa para >> cambiar. [Stack Overflow proporciona una explicación adicional y >> discusión.] (http://stackoverflow.com/questions/24812444/why-are-complex-numbers-in-python-denoted-with-j-instead-of-i) >> 2. `(4 + 2j)` >> 3. `4j`, `Syntax Error: invalid syntax`, en este caso _j_ se considera una variable y esto depende de si _j_ está definido y, de ser así, su valor asignado
uk: > > > 1. Чому, на вашу думку, Python використовує `j` замість `i` для уявної частини? > 2. Що ви очікуєте отримати від `1+2j + 3`? > 3. Що ви очікуєте від `4j`? А що від `4 j` або `4 + j`? > > > ## Рішення > > > > 1. Стандартні математичні позначення зазвичай використовують `i` для позначення комплексного числа. Однак, судячи з різних джерел, це > > було раннє позначення, яке використовувалось у електротехніці, та зараз було б дуже дорого його > > змінити. [Stack Overflow містить додаткові пояснення та > > обговорення.](http://stackoverflow.com/questions/24812444/why-are-complex-numbers-in-python-denoted-with-j-instead-of-i) > > 2. `(4+2j)` > > 3. `4j`, `Syntax Error: invalid syntax`, у цьому випадку _j_ вважається змінною, і це залежить від того, чи визначене _j_, і якщо так, то його присвоєне значення

source: --- title: "Built-in Functions and Help" teaching: 15 exercises: 10 questions: - "How can I use built-in functions?" - "How can I find out what they do?" - "What kind of errors can occur in programs?" objectives: - "Explain the purpose of functions." - "Correctly call built-in Python functions." - "Correctly nest calls to built-in functions." - "Use help to display documentation for built-in functions." - "Correctly describe situations in which SyntaxError and NameError occur." keypoints: - "Use comments to add documentation to programs." - "A function may take zero or more arguments." - "Commonly-used built-in functions include `max`, `min`, and `round`." - "Functions may only work for certain (combinations of) arguments." - "Functions may have default values for some arguments." - "Use the built-in function `help` to get help for a function." - "The Jupyter Notebook has two ways to get help." - "Every function returns something." - "Python reports a syntax error when it can't understand the source of a program." - "Python reports a runtime error when something goes wrong while a program is executing." - "Fix syntax errors by reading the source code, and runtime errors by tracing the program's execution." ---
es: --- title: " Funciones integradas y ayuda" teaching: 15 exercises: 10 questions: - "¿Cómo puedo usar las funciones integradas?" - " ¿Cómo puedo saber qué hacen?" - "¿Qué tipo de errores pueden ocurrir en los programas?" objectives: - "Explicar el propósito de las funciones." - "Llamar correctamente a las funciones integradas de Python." - "Anidar correctamente las llamadas a las funciones integradas." - "Usar la ayuda para mostrar la documentación de las funciones integradas." - "Describir correctamente las situaciones en las que se producen SyntaxError y NameError." keypoints: - "Usar comentarios para agregar documentación a los programas." - "Una función puede tomar cero o más argumentos." - "Las funciones incorporadas de uso común incluyen `max`, `min` y `round`." - " Las funciones solo pueden funcionar para ciertos (combinaciones de) argumentos." - " Las funciones pueden tener valores predeterminados para algunos argumentos." - " Usa la función incorporada `help` para obtener ayuda para una función." - "La Libreta Jupyter tiene dos formas de obtener ayuda." - "Cada función regresa algo." - " Python reporta un error de sintáxis cuando no puede entender el código fuente de un programa." - "Python reporta un error de tiempo de ejecución cuando algo sale mal mientras se ejecuta un programa." - "Soluciona errores de sintaxis leyendo el código fuente y errores de tiempo de ejecución rastreando la ejecución del programa." ---
uk: --- title: "Вбудовані функції та довідка" teaching: 15 exercises: 10 questions: - "Як я можу використовувати вбудовані функції?" - "Як я можу дізнатися, що вони роблять?" - "Які помилки можуть виникати в програмах?" objectives: - "Пояснення призначення функцій." - "Коректний виклик вбудованих функцій Python." - "Коректний виклик вкладених вбудованих функцій." - "Використання довідки для перегляду документації про вбудовані функції." - "Правильний опис ситуації, в яких виникають SyntaxError і NameError" keypoints: - "Використовуйте коментарі при створенні документації програм." - "Функції можуть сприймати нуль або деяку кількість аргументів." - "Поширені вбудовані функції `max`, `min` та `round`." - "Функції можуть працювати лише з певними аргументами (комбінаціями аргументів)." - "Функції можуть мати значення за замовчуванням для певних аргументів." - "Використання вбудованої функції `help` для отримання довідки про функції". - "Два шляхи отримання допомоги у Jupyter Notebook." - "Кожна функція щось повертає." - "Python повідомляє про синтаксичну помилку, коли джерело програми не зрозуміле." - "Python повідомляє про помилку виконання, коли щось йде не так під час компілювання програми." - "Виправлення синтаксичних помилок у процесі читання вихідного коду, а помилок виконання - у процесі компіляції програми."

source: ## Use comments to add documentation to programs.
es: ## Usa comentarios para agregar documentación a los programas.
uk: ## Використовуйте коментарі при створенні документації програм.

source: ~~~ # This sentence isn't executed by Python. adjustment = 0.5 # Neither is this - anything after '#' is ignored. ~~~
es: ~~~ # Esta oración no es ejecutada por Python. adjustment = 0.5 #Tampoco esto - cualquier cosa despues de '#' es ignorado. ~~~
uk: ~~~ # Цю строку Python не виконує. adjustment = 0.5 # Усе після '#' ігнорується. ~~~

source: ## A function may take zero or more arguments.
es: ## Una función puede tener cero o más argumentos.
uk: ## Функції можуть сприймати нуль або деяку кількість аргументів.

source: * We have seen some functions already --- now let's take a closer look.
es: * Ya hemos visto algunas funciones --- ahora echemos un vistazo más de cerca.
uk: * Ми вже бачили деякі функції --- тепер розглянемо їх ближче.

source: * An *argument* is a value passed into a function.
es: * Un *argumento* es un valor pasado a una función.
uk: * *Аргумент* - це значення, яке передається у функцію.

source: * `len` takes exactly one.
es: * `len` toma exactamente uno.
uk: * `len` потребує тільки один аргумент.

source: * `int`, `str`, and `float` create a new value from an existing one.
es: * `int`, `str`, y `float` crean un nuevo valor a partir de uno existente.
uk: * `int`, `str` та `float` створюють нові значення з існуючих.

source: * `print` takes zero or more.
es: * `print` toma cero o más.
uk: * `print` в якості аргументу може використовувати як нульове, так і ненульове значення.

source: * `print` with no arguments prints a blank line.
es: * `print` sin argumentos imprime una línea en blanco.
uk: * `print` без аргументів повертає порожній рядок.

source: * Must always use parentheses, even if they're empty,
es: * Siempre debe usar paréntesis, incluso si están vacíos,
uk: * Необхідно завжди використовувати дужки, навіть якщо вони порожні,

source: so that Python knows a function is being called.
es: para que Python sepa que se está llamando a una función.
uk: щоб Python розумів, що викликається функція.

source: ## Commonly-used built-in functions include `max`, `min`, and `round`.
es: ## Las funciones incorporadas de uso común incluyen `max`, `min` y `round`.
uk: ## Поширені вбудовані функції `max`, `min` та `round`.

source: * Use `max` to find the largest value of one or more values.
es: * Usa `max` para encontrar el valor más grande de uno o más valores.
uk: * Використовуйте `max`, щоб знайти найбільше з одного або декількох значень.

source: * Use `min` to find the smallest.
es: * Usa `min` para encontrar el más pequeño.
uk: * Використовуйте `min`, щоб знайти найменше значення.

source: * Both work on character strings as well as numbers.
es: * Ambos funcionan tanto en cadenas de caracteres como en números.
uk: * Обидві функції в якості аргументу можуть використовувати як символьний рядок, так і число.

source: * "Larger" and "smaller" use (0-9, A-Z, a-z) to compare letters.
es: * "Más grande" y "más pequeño" usan (0-9, A-Z, a-z) para comparar letras.
uk: * Для порівняння літер використовуйте «Більші» та «менші» (0-9, A-Z, a-z) літери.

source: ## Functions may only work for certain (combinations of) arguments.
es: ## Las funciones pueden funcionar solo para (combinaciones de) ciertos argumentos.
uk: ## Функції можуть працювати лише з певними аргументами (комбінаціями аргументів).

source: * `max` and `min` must be given at least one argument.
es: * `max` y `min` deben recibir al menos un argumento.
uk: * `max` та `min` повинні мати принаймні один аргумент.

source: * "Largest of the empty set" is a meaningless question.
es: * "El más grande del conjunto vacío" es una pregunta sin sentido.
uk: * "Найбільше значення з порожньої множини" - запит, який не має сенсу.

source: * And they must be given things that can meaningfully be compared.
es: * Y deben recibir cosas que puedan compararse con sentido.
uk: * Крім того, аргументи функції повинні бути зіставні, щоб їх можна було порівнювати.

source: ## Functions may have default values for some arguments.
es: ## Las funciones pueden tener valores por defecto para algunos argumentos.
uk: ## Функції можуть мати значення за замовчуванням для певних аргументів.

source: * `round` will round off a floating-point number.
es: * `round` redondeará un número de punto flotante.
uk: * `round` округляє число з плаваючою крапкою.

source: * By default, rounds to zero decimal places.
es: * Por defecto, redondea a cero cifras decimales.
uk: * За замовчуванням округлює до нуля знаків після крапки.

source: * We can specify the number of decimal places we want.
es: * Podemos especificar el número de cifras decimales que queremos.
uk: * Ми можемо вказати потрібну кількість десяткових знаків.

source: ## Use the built-in function `help` to get help for a function.
es: ## Usa la función incorporada `help` para obtener ayuda sobre una función.
uk: ## Використовуйте вбудовану функцію `help`, щоб отримати довідку щодо функції.

source: * Every built-in function has online documentation.
es: * Cada función incorporada tiene documentación en línea.
uk: * Кожна вбудована функція має онлайн-документацію.
