Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: [![Create a Slack Account with us](https://img.shields.io/badge/Create_Slack_Account-The_Carpentries-071159.svg)](https://swc-slack-invite.herokuapp.com/) [![Slack Status](https://img.shields.io/badge/Slack_Channel-swc--py--gapminder-E01563.svg)](https://swcarpentry.slack.com/messages/C9X4W03KL) [![Binder](https://img.shields.io/badge/launch-JupyterLab-579ACA.svg?logo=data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAFkAAABZCAMAAABi1XidAAAB8lBMVEX///9XmsrmZYH1olJXmsr1olJXmsrmZYH1olJXmsr1olJXmsrmZYH1olL1olJXmsr1olJXmsrmZYH1olL1olJXmsrmZYH1olJXmsr1olL1olJXmsrmZYH1olL1olJXmsrmZYH1olL1olL0nFf1olJXmsrmZYH1olJXmsq8dZb1olJXmsrmZYH1olJXmspXmspXmsr1olL1olJXmsrmZYH1olJXmsr1olL1olJXmsrmZYH1olL1olLeaIVXmsrmZYH1olL1olL1olJXmsrmZYH1olLna31Xmsr1olJXmsr1olJXmsrmZYH1olLqoVr1olJXmsr1olJXmsrmZYH1olL1olKkfaPobXvviGabgadXmsqThKuofKHmZ4Dobnr1olJXmsr1olJXmspXmsr1olJXmsrfZ4TuhWn1olL1olJXmsqBi7X1olJXmspZmslbmMhbmsdemsVfl8ZgmsNim8Jpk8F0m7R4m7F5nLB6jbh7jbiDirOEibOGnKaMhq+PnaCVg6qWg6qegKaff6WhnpKofKGtnomxeZy3noG6dZi+n3vCcpPDcpPGn3bLb4/Mb47UbIrVa4rYoGjdaIbeaIXhoWHmZYHobXvpcHjqdHXreHLroVrsfG/uhGnuh2bwj2Hxk17yl1vzmljzm1j0nlX1olL3AJXWAAAAbXRSTlMAEBAQHx8gICAuLjAwMDw9PUBAQEpQUFBXV1hgYGBkcHBwcXl8gICAgoiIkJCQlJicnJ2goKCmqK+wsLC4usDAwMjP0NDQ1NbW3Nzg4ODi5+3v8PDw8/T09PX29vb39/f5+fr7+/z8/Pz9/v7+zczCxgAABC5JREFUeAHN1ul3k0UUBvCb1CTVpmpaitAGSLSpSuKCLWpbTKNJFGlcSMAFF63iUmRccNG6gLbuxkXU66JAUef/9LSpmXnyLr3T5AO/rzl5zj137p136BISy44fKJXuGN/d19PUfYeO67Znqtf2KH33Id1psXoFdW30sPZ1sMvs2D060AHqws4FHeJojLZqnw53cmfvg+XR8mC0OEjuxrXEkX5ydeVJLVIlV0e10PXk5k7dYeHu7Cj1j+49uKg7uLU61tGLw1lq27ugQYlclHC4bgv7VQ+TAyj5Zc/UjsPvs1sd5cWryWObtvWT2EPa4rtnWW3JkpjggEpbOsPr7F7EyNewtpBIslA7p43HCsnwooXTEc3UmPmCNn5lrqTJxy6nRmcavGZVt/3Da2pD5NHvsOHJCrdc1G2r3DITpU7yic7w/7Rxnjc0kt5GC4djiv2Sz3Fb2iEZg41/ddsFDoyuYrIkmFehz0HR2thPgQqMyQYb2OtB0WxsZ3BeG3+wpRb1vzl2UYBog8FfGhttFKjtAclnZYrRo9ryG9uG/FZQU4AEg8ZE9LjGMzTmqKXPLnlWVnIlQQTvxJf8ip7VgjZjyVPrjw1te5otM7RmP7xm+sK2Gv9I8Gi++BRbEkR9EBw8zRUcKxwp73xkaLiqQb+kGduJTNHG72zcW9LoJgqQxpP3/Tj//c3yB0tqzaml05/+orHLksVO+95kX7/7qgJvnjlrfr2Ggsyx0eoy9uPzN5SPd86aXggOsEKW2Prz7du3VID3/tzs/sSRs2w7ovVHKtjrX2pd7ZMlTxAYfBAL9jiDwfLkq55Tm7ifhMlTGPyCAs7RFRhn47JnlcB9RM5T97ASuZXIcVNuUDIndpDbdsfrqsOppeXl5Y+XVKdjFCTh+zGaVuj0d9zy05PPK3QzBamxdwtTCrzyg/2Rvf2EstUjordGwa/kx9mSJLr8mLLtCW8HHGJc2R5hS219IiF6PnTusOqcMl57gm0Z8kanKMAQg0qSyuZfn7zItsbGyO9QlnxY0eCuD1XL2ys/MsrQhltE7Ug0uFOzufJFE2PxBo/YAx8XPPdDwWN0MrDRYIZF0mSMKCNHgaIVFoBbNoLJ7tEQDKxGF0kcLQimojCZopv0OkNOyWCCg9XMVAi7ARJzQdM2QUh0gmBozjc3Skg6dSBRqDGYSUOu66Zg+I2fNZs/M3/f/Grl/XnyF1Gw3VKCez0PN5IUfFLqvgUN4C0qNqYs5YhPL+aVZYDE4IpUk57oSFnJm4FyCqqOE0jhY2SMyLFoo56zyo6becOS5UVDdj7Vih0zp+tcMhwRpBeLyqtIjlJKAIZSbI8SGSF3k0pA3mR5tHuwPFoa7N7reoq2bqCsAk1HqCu5uvI1n6JuRXI+S1Mco54YmYTwcn6Aeic+kssXi8XpXC4V3t7/ADuTNKaQJdScAAAAAElFTkSuQmCC)](https://mybinder.org/v2/gh/swcarpentry/python-novice-gapminder/binder?urlpath=lab)
es: [![Crea una cuenta en Slack con nosotros](https://img.shields.io/badge/Create_Slack_Account-The_Carpentries-071159.svg)](https://swc-slack-invite.herokuapp.com/) [![Slack Status](https://img.shields.io/badge/Slack_Channel-swc--py--gapminder-E01563.svg)](https://swcarpentry.slack.com/messages/C9X4W03KL) [![Binder](https://img.shields.io/badge/launch-JupyterLab-579ACA.svg?logo=data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAFkAAABZCAMAAABi1XidAAAB8lBMVEX///9XmsrmZYH1olJXmsr1olJXmsrmZYH1olJXmsr1olJXmsrmZYH1olL1olJXmsr1olJXmsrmZYH1olL1olJXmsrmZYH1olJXmsr1olL1olJXmsrmZYH1olL1olJXmsrmZYH1olL1olL0nFf1olJXmsrmZYH1olJXmsq8dZb1olJXmsrmZYH1olJXmspXmspXmsr1olL1olJXmsrmZYH1olJXmsr1olL1olJXmsrmZYH1olL1olLeaIVXmsrmZYH1olL1olL1olJXmsrmZYH1olLna31Xmsr1olJXmsr1olJXmsrmZYH1olLqoVr1olJXmsr1olJXmsrmZYH1olL1olKkfaPobXvviGabgadXmsqThKuofKHmZ4Dobnr1olJXmsr1olJXmspXmsr1olJXmsrfZ4TuhWn1olL1olJXmsqBi7X1olJXmspZmslbmMhbmsdemsVfl8ZgmsNim8Jpk8F0m7R4m7F5nLB6jbh7jbiDirOEibOGnKaMhq+PnaCVg6qWg6qegKaff6WhnpKofKGtnomxeZy3noG6dZi+n3vCcpPDcpPGn3bLb4/Mb47UbIrVa4rYoGjdaIbeaIXhoWHmZYHobXvpcHjqdHXreHLroVrsfG/uhGnuh2bwj2Hxk17yl1vzmljzm1j0nlX1olL3AJXWAAAAbXRSTlMAEBAQHx8gICAuLjAwMDw9PUBAQEpQUFBXV1hgYGBkcHBwcXl8gICAgoiIkJCQlJicnJ2goKCmqK+wsLC4usDAwMjP0NDQ1NbW3Nzg4ODi5+3v8PDw8/T09PX29vb39/f5+fr7+/z8/Pz9/v7+zczCxgAABC5JREFUeAHN1ul3k0UUBvCb1CTVpmpaitAGSLSpSuKCLWpbTKNJFGlcSMAFF63iUmRccNG6gLbuxkXU66JAUef/9LSpmXnyLr3T5AO/rzl5zj137p136BISy44fKJXuGN/d19PUfYeO67Znqtf2KH33Id1psXoFdW30sPZ1sMvs2D060AHqws4FHeJojLZqnw53cmfvg+XR8mC0OEjuxrXEkX5ydeVJLVIlV0e10PXk5k7dYeHu7Cj1j+49uKg7uLU61tGLw1lq27ugQYlclHC4bgv7VQ+TAyj5Zc/UjsPvs1sd5cWryWObtvWT2EPa4rtnWW3JkpjggEpbOsPr7F7EyNewtpBIslA7p43HCsnwooXTEc3UmPmCNn5lrqTJxy6nRmcavGZVt/3Da2pD5NHvsOHJCrdc1G2r3DITpU7yic7w/7Rxnjc0kt5GC4djiv2Sz3Fb2iEZg41/ddsFDoyuYrIkmFehz0HR2thPgQqMyQYb2OtB0WxsZ3BeG3+wpRb1vzl2UYBog8FfGhttFKjtAclnZYrRo9ryG9uG/FZQU4AEg8ZE9LjGMzTmqKXPLnlWVnIlQQTvxJf8ip7VgjZjyVPrjw1te5otM7RmP7xm+sK2Gv9I8Gi++BRbEkR9EBw8zRUcKxwp73xkaLiqQb+kGduJTNHG72zcW9LoJgqQxpP3/Tj//c3yB0tqzaml05/+orHLksVO+95kX7/7qgJvnjlrfr2Ggsyx0eoy9uPzN5SPd86aXggOsEKW2Prz7du3VID3/tzs/sSRs2w7ovVHKtjrX2pd7ZMlTxAYfBAL9jiDwfLkq55Tm7ifhMlTGPyCAs7RFRhn47JnlcB9RM5T97ASuZXIcVNuUDIndpDbdsfrqsOppeXl5Y+XVKdjFCTh+zGaVuj0d9zy05PPK3QzBamxdwtTCrzyg/2Rvf2EstUjordGwa/kx9mSJLr8mLLtCW8HHGJc2R5hS219IiF6PnTusOqcMl57gm0Z8kanKMAQg0qSyuZfn7zItsbGyO9QlnxY0eCuD1XL2ys/MsrQhltE7Ug0uFOzufJFE2PxBo/YAx8XPPdDwWN0MrDRYIZF0mSMKCNHgaIVFoBbNoLJ7tEQDKxGF0kcLQimojCZopv0OkNOyWCCg9XMVAi7ARJzQdM2QUh0gmBozjc3Skg6dSBRqDGYSUOu66Zg+I2fNZs/M3/f/Grl/XnyF1Gw3VKCez0PN5IUfFLqvgUN4C0qNqYs5YhPL+aVZYDE4IpUk57oSFnJm4FyCqqOE0jhY2SMyLFoo56zyo6becOS5UVDdj7Vih0zp+tcMhwRpBeLyqtIjlJKAIZSbI8SGSF3k0pA3mR5tHuwPFoa7N7reoq2bqCsAk1HqCu5uvI1n6JuRXI+S1Mco54YmYTwcn6Aeic+kssXi8XpXC4V3t7/ADuTNKaQJdScAAAAAElFTkSuQmCC)](https://mybinder.org/v2/gh/swcarpentry/python-novice-gapminder/binder?urlpath=lab)

source: python-novice-gapminder =======================
es: python-principiante-gapminder ===========================

source: Introduction to Python for non-programmers with a focus on plotting and data analysis. Please see <https://swcarpentry.github.io/python-novice-gapminder/> for a rendered version of this material, [the lesson template documentation][lesson-example] for instructions on formatting, building, and submitting material, or run `make` in this directory for a list of helpful commands.
es: Introducción a Python para no programadores con hincapié en visualización y análisis de datos. Por favor diríjase a <https://carpentries-i18n.github.io/python-novice-gapminder/> para ver una versión de este material con formato, [la documentación de la plantilla de la lección][lesson-example] para instrucciones de formato, compilación y envío de material, o corre `make` en este directorio para obtener una lista de comandos útiles.

source: Maintainer(s):
es: Mantenedores:

source: --- title: "Running and Quitting" teaching: 15 exercises: 0 questions: - "How can I run Python programs?" objectives: - "Launch the JupyterLab server." - "Create a new Python script." - "Create a Jupyter notebook." - "Shutdown the JupyterLab server." - "Understand the difference between a Python script and a Jupyter notebook." - "Create Markdown cells in a notebook." - "Create and run Python cells in a notebook." keypoints: - "Python scripts are plain text files." - "Use the Jupyter Notebook for editing and running Python." - "The Notebook has Command and Edit modes." - "Use the keyboard and mouse to select and edit cells." - "The Notebook will turn Markdown into pretty-printed documentation." - "Markdown does most of what HTML does." ---
es: --- title: "Ejecutar y salir" teaching: 15 exercises: 0 questions: - "¿Cómo puedo ejecutar programas de Python?" objectives: - "Iniciar el servidor JupyterLab." - "Crear un nuevo script de Python." - "Crear un cuaderno de Jupyter." - "Apagar el servidor JupyterLab." - "Entender la diferencia entre un script de Python y un cuaderno de Jupyter." - "Crear celdas Markdown en un cuaderno." - "Crear y ejecutar celdas Python en un Cuaderno." keypoints: - "Los scripts de Python son archivos de texto plano." - "Usar un cuaderno Jypiter para editar y correr Python." - "El Cuaderno tiene modos de Comandos y Edición." - "Usa el teclado y el ratón para seleccionar y editar celdas." - "El Cuaderno convertirá Markdown en texto con formato." - "Markdown hace la mayor parte de lo que hace HTML." ---
uk: --- title: "Запуск та завершення" teaching: 15 exercises: 0 questions: - "Як запустити програми Python?" objectives: - "Запустити сервер JupyterLab." - "Створити новий сценарій Python." - "Створити блокнот Jupyter." - "Зупинити сервер JupyterLab." - "Зрозуміти різницю між сценарієм Python і блокнотом Jupyter." - "Створити клітинки Markdown у блокноті." - "Створити та запустити клітинки Python в блокноті." keypoints: - "Сценарії Python - це звичайні текстові файли." - "Використовуйте Jupyter Notebook для редагування та запуску Python." - "Jupyter Notebook має режими Команд та Редагування." - "Використовуйте клавіатуру та мишу для виділення та редагування клітинок." - "The Notebook перетворює Markdown в якісно оформлену документацію." - "Markdown робить більшість того, що робить HTML." ---

source: ## Getting Started with JupyterLab
es: ## Comenzando con JupyterLab
uk: ## Початок роботи з JupyterLab

source: While many software developers will often use an integrated development environment (IDE) or a text editor to create and edit their Python programs we will be using [JupyterLab][jupyterlab] during this lesson.
es: Mientras que muchos desarrolladores de software a menudo utilizan un entorno de desarrollo integrado (IDE) o un editor de texto para crear y editar sus programas Python, usaremos [JupyterLab][jupyterlab] durante esta lección.
uk: Багато розробників програмного забезпечення для створення та редагування своїх програм мовою Python використовують інтегроване середовище розробника (integrated development environment, або IDE) або текстовий редактор. Це загальний підхід, але протягом цього уроку ми будемо використовувати [JupyterLab][jupyterlab].

source: JupyterLab is an application with a web-based user interface from [Project Jupyter][jupyter] that enables one to work with documents and activities such as Jupyter notebooks, text editors, terminals, and even custom components in a flexible, integrated, and extensible manner. JupyterLab requires a reasonably up-to-date browser (ideally a current version of Chrome, Safari, or Firefox); Internet Explorer versions 9 and below are *not* supported.
es: JupyterLab es una aplicación con una interfaz de usuario basada en web del [Proyecto Jupyter][jupyter] que permite trabajar con documentos y actividades como cuadernos Jupyter, editores de texto, terminales, e incluso componentes personalizados de manera flexible, integrada y extensible. JupyterLab requiere un navegador razonablemente actualizado (idealmente una versión actual de Chrome, Safari o Firefox); Internet Explorer 9 y versiones anteriores *no* son compatibles.
uk: JupyterLab є програмним додатком з веборієнтованим інтерфейсом користувача з [Project Jupyter][jupyter] , який уможливлює опрацювання документів та застосування таких інструментів, як Jupyter notebooks, текстові редактори, термінали і навіть спеціальні компоненти користувача у гнучкий, інтегрований та розширюваний спосіб. JupyterLab потребує досить сучасний браузер (в ідеалі це має бути остання версія Chrome, Safari або Firefox); Internet Explorer версії 9 і нижче *не* підтримується.

source: JupyterLab is included as part of the Anaconda Python distribution. If you have not already installed the Anaconda Python distribution, see [the setup instructions]({{ page.root }}/setup/) for installation instructions.
es: JupyterLab se incluye como parte de la distribución de Python Anaconda. Si aún no tienes instalada la distribución de Python de Anaconda, consulta [las instrucciones de configuración]({{ page.root }}/setup/) para las instrucciones de instalación.
uk: JupyterLab є частиною інсталяційного пакета Anaconda Python. Якщо ви не встановили дистрибутив Anaconda Python, зверніть увагу на [інструкції з налаштування]({{ page.root }}/setup/) , де розміщено інструкції щодо процесу інсталяції.

source: Even though JupyterLab is a web-based application, JupyterLab runs locally on your machine and does not require an internet connection. * The JupyterLab server sends messages to your web browser. * The JupyterLab server does the work and the web browser renders the result. * You will type code into the browser and see the result when the web page talks to the JupyterLab server.
es: Aunque JupyterLab es una aplicación vía web, JupyterLab se ejecuta localmente en tu máquina y no requiere una conexión a internet. * El servidor JupyterLab envía mensajes a tu navegador web. * El servidor JupyterLab hace el trabajo y el navegador web muestra el resultado. * Escribirás el código en el navegador y verás el resultado cuando la página web hable con el servidor JupyterLab.
uk: Незважаючи на те, що JupyterLab є вебдодатком, JupyterLab працює локально на вашому комп'ютері та не потребує зв'язку з інтернетом. * Сервер JupyterLab надсилає повідомлення вашому веббраузеру. * Сервер JupyterLab опрацьовує інформацію, та веббраузер відображає результат. * Ви вводите код в браузер і бачите результат, коли веб сторінка зв'яжеться з сервером JupyterLab.

source: > ## JupyterLab? What about Jupyter notebooks?
es: > ## ¿JupyterLab? ¿Qué pasa con los Cuadernos de Jupyter?
uk: > ## JupyterLab? А чому не Jupyter notebooks?

source: > JupyterLab is the [next stage in the evolution of the Jupyter Notebook](https://jupyterlab.readthedocs.io/en/stable/getting_started/overview.html#overview). If you have prior
es: > JupyterLab es el [siguiente nivel en la evolución de Jupyter Notebook](https://jupyterlab.readthedocs.io/en/stable/getting_started/overview.html#overview). Si tienes
uk: > JupyterLab є [подальшим кроком в еволюції Jupyter Notebook](https://jupyterlab.readthedocs.io/en/stable/getting_started/overview.html#overview). Якщо ви раніше

source: > experience working with Jupyter notebooks, then you will have a a good idea of what to expect
es: > experiencia trabajando con cuadernos de Jupyter, entonces tendrás una buena idea de qué esperar
uk: > використовували Jupyter notebooks, то ви добре зрозумієте діапазон можливостей

source: > from JupyterLab.
es: > de JupyterLab.
uk: > JupyterLab.

source: > Experienced users of Jupyter notebooks interested in a more detailed discussion of the similarities and differences
es: > Usuarios experimentados con cuadernos de Jupyter interesados ​​en una discusión más detallada de las similitudes y diferencias
uk: > Користувачі, що мають досвід застосування Jupyter notebooks та зацікавлені в більш детальному описі подібностей та відмінностей

source: > between the JupyterLab and Jupyter notebook user interfaces can find more information in the
es: > entre las interfaces de usuario de JupyterLab y cuadernos de Jupyter puede encontrar más información en la
uk: > між інтерфейсами користувача JupyterLab та Jupyter notebook, можуть знайти більше інформації в

source: > [JupyterLab user interface documentation][jupyterlab-ui].
es: > [documentación de la interfaz de usuario de JupyterLab][jupyterlab-ui].
uk: > [JupyterLab документації інтерфейсу користувача][jupyterlab-ui].

source: ## Starting JupyterLab
es: ## Iniciando con JupyterLab
uk: ## Початок роботи з JupyterLab

source: To start the JupyterLab server you will need to access the command line through the Terminal. There are two ways to open Terminal on Mac.
es: Para iniciar el servidor JupyterLab, deberás acceder a la línea de comandos a través de la Terminal. Hay dos formas de abrir Terminal en Mac.
uk: Для запуску сервера JupyterLab server ви маєте отримати доступ до командного рядка через Terminal. Terminal — це стандартний застосунок Mac OS, емулятор консолі, так званий command line interface. Є два способи відкрити Terminal на Mac.

source: 1. In your Applications folder, open Utilities and double-click on Terminal
es: 1. En tu carpeta de Aplicaciones, abre Utilidades y haz doble clic en Terminal
uk: 1. У директорії Applications відкрийте теку Utilities і двічі натисніть Terminal

source: 2. Press <kbd>Command</kbd> + <kbd>spacebar</kbd> to launch Spotlight. Type `Terminal` and then
es: 2. Presiona <kbd>Command</kbd> + <kbd>barra espaciadora</kbd> para lanzar Spotlight. Digita `Terminal` y entonces
uk: 2. Натисніть <kbd>Command</kbd> + <kbd>spacebar</kbd>, щоб запустити Spotlight. Введіть `Terminal` і потім

source: double-click the search result or hit <kbd>Enter</kbd>
es: haz doble clic en el resultado de la búsqueda o presiona <kbd>Enter</kbd>
uk: зробіть подвійне натискання на результат пошуку або натисніть <kbd>Enter</kbd>

source: After you have launched Terminal, type the command to launch the JupyterLab server.
es: Después de iniciar Terminal, escriba el comando para iniciar el servidor JupyterLab.
uk: Після запуску Terminal введіть команду для запуску сервера JupyterLab.

source: ### Windows Users
es: ### Usuarios Windows
uk: ### Користувачі Windows

source: To start the JupyterLab server you will need to access the open Anaconda Prompt.
es: Para iniciar el servidor JupyterLab, necesitará acceder al Prompt de Anaconda.
uk: Для запуску JupyterLab server вам потрібен доступ до додатку Anaconda Prompt.

source: Press <kbd>Windows Logo Key</kbd> and search for `Anaconda Prompt`, click the result or press enter.
es: Presiona <kbd>la Tecla del logotipo de Windows</kbd> y busca `Anaconda Prompt`, haz clic en el resultado o presiona enter.
uk: Натисніть <kbd>Windows Logo Key</kbd> і знайдіть `Anaconda Prompt`, натисніть на результат пошуку або на клавішу enter.

source: After you have launched the Anaconda Prompt, type the command:
es: Después de haber accedido al Prompt de Anaconda, escribe el comando:
uk: Після запуску Anaconda Prompt введіть команду:

source: Below is a screenshot of a similar JupyterLab landing page to the one that should open in your default web browser after starting the JupyterLab server on wither Mac OS X or Windows.
es: A continuación se muestra una captura de pantalla de JupyterLab similar a la que se debería abrir en tu navegador web predeterminado después de iniciar el servidor JupyterLab en Mac OS X o Windows.
uk: Нижче наведено скріншот екрана цільової сторінки JupyterLab, схожої на ту, яка має відкритися у вашому веббраузері за замовчуванням після запуску сервера JupyterLab в операційній системі Mac OS X або ОС Windows.

source: <p align='center'> <img alt="JupyterLab landing page" src="../fig/0_jupyterlab_landing_page.png" width="750"/> </p>
es: <p align='center'> <img alt="Página de inicio de JupyterLab" src="{{ site.baseurl }}/fig/0_jupyterlab_landing_page.png" width="750"/> </p>

source: ## The JupyterLab Interface
es: ## La Interfaz de JupyterLab
uk: ## Інтерфейс JupyterLab

source: JupyterLab has many features found in traditional integrated development environments (IDEs) but is focused on providing flexible building blocks for interactive, exploratory computing.
es: JupyterLab tiene muchas características que se encuentran en los entornos de desarrollo integrado (IDE) tradicionales pero se centra en proporcionar bloques de construcción flexibles para la computación interactiva y exploratoria.
uk: JupyterLab має багато можливостей традиційних інтегрованих середовищ розробки (IDE), але його особливістю є забезпечення гнучких будівельних блоків для інтерактивних дослідницьких обчислень.

source: The [JupyterLab Interface](https://jupyterlab.readthedocs.io/en/stable/user/interface.html) consists of the Menu Bar, a collapsable Left Side Bar, and the Main Work Area which contains tabs of documents and activities.
es: La [Interfaz JupyterLab](https://jupyterlab.readthedocs.io/en/stable/user/interface.html) consiste en la barra de menú, una barra lateral izquierda plegable y el área de trabajo principal que contiene pestañas de documentos y actividades.
uk: [Інтерфейс JupyterLab](https://jupyterlab.readthedocs.io/en/stable/user/interface.html) складається з панелі меню, півої бічної панелі, що згортається, і основної робочої області, яка містить вкладки з документами та діями.

source: ### Menu Bar
es: ### Barra de Menu
uk: ### Панель Меню

source: The Menu Bar at the top of JupyterLab has the top-level menus that expose various actions available in JupyterLab along with their keyboard shortcuts (where applicable). The following menus are included by default.
es: La Barra de Menú en la parte superior de JupyterLab tiene menús de nivel superior que exponen varias acciones disponibles en JupyterLab junto con sus atajos de teclado (cuando existen). Los siguientes menús están incluidos por defecto.
uk: Панель меню у верхній частині JupyterLab містить меню верхнього рівня, яке відображає різні дії, доступні в JupyterLab разом із їхніми комбінаціями клавіш (де це можливо). Наступні пункти меню включені за замовчуванням.

source: * **File:** Actions related to files and directories such as *New*, *Open*, *Close*, *Save*, etc. The *File* menu also includes the *Quit* action used to shutdown the JupyterLab server.
es: * **File:** Acciones relacionadas con archivos y directorios tales como: *New* (*Nuevo*), *Open* (*Abrir*), *Close* (*Cerrar*), *Save* (*Guardar*), etc. El menú *File* también incluye la acción *Quit* (*Parar*) usada para apagar el servidor JupyterLab.
uk: * **File:** Дії, пов’язані з упорядкуванням файлів та директорій, такі як *New*, *Open*, *Close*, *Save*, і так далі. Меню *File* також включає дію *Quit*, яка застосовується для завершення роботи сервера JupyterLab.

source: * **Edit:** Actions related to editing documents and other activities such as *Undo*, *Cut*, *Copy*, *Paste*, etc.
es: * **Edit:** Acciones relacionadas con edición de documentos y otras actividades como *Undo* (*Deshacer*), *Cut* (*Cortar*), *Copy* (*Cortar*), *Paste* (*Pegar*), etc.
uk: * **Edit:** Дії, пов’язані з редагуванням документів та іншими видами діяльності, такими, як *Undo*, *Cut*, *Copy*, *Paste* тощо.

source: * **View:** Actions that alter the appearance of JupyterLab.
es: * **View:** Acciones que alteran la apariencia de JupyterLab.
uk: * **View:** Дії, які змінюють зовнішній вигляд JupyterLab.

source: * **Run:** Actions for running code in different activities such as notebooks and code consoles (discussed below).
es: * **Run:** Acciones para ejecutar código en diferentes actividades tales como cuadernos y consolas de código (discutidas abajo).
uk: * **Run:** Дії для запуску коду в різних інструментах, таких як notebooks та кодові консолі (розглянуто нижче).

source: * **Kernel:** Actions for managing kernels which, as mentioned above, are separate processes for running code.
es: * **Kernel:** Acciones para manejo de núcleos los cuales, como mencionamos arriba, son procesos separados para ejecutar código.
uk: * **Kernel:** Дії для керування ядрами, які є окремими процесами для запуску коду.

source: * **Tabs:** A list of the open documents and activities in the dock panel.
es: * **Tabs:** Una lista de los documentos y actividades abiertos en el área de trabajo.
uk: * **Tabs:** Список відкритих документів і дій в dock panel.

source: * **Settings:** Common JupyterLab settings can be configured using this menu. There is also an *Advanced Settings Editor* option in the dropdown menu that provides more fine-grained control of JupyterLab settings and configuration options.
es: * **Settings:** Las configuraciones comunes de JupyterLab se pueden configurar usando este menú. También hay una opción *Advanced Settings Editor* en el menú desplegable que proporciona un control más detallado de la configuración de JupyterLab y las opciones de configuración.
uk: * **Settings:** Загальні параметри JupyterLab можна налаштувати за допомогою цього меню. Крім того, у меню, що випадає, також є опція *Advanced Settings Editor*, яка забезпечує більш детальний контроль параметрів і опцій конфігурації JupyterLab.
