Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: > > 1. Read this short program and try to predict what it does. > 2. Run it: how accurate was your prediction? > 3. Refactor the program to make it more readable. > Remember to run it after each change to ensure its behavior hasn't changed. > 4. Compare your rewrite with your neighbor's. > What did you do the same? > What did you do differently, and why? > > ~~~ > n = 10 > s = 'et cetera' > print(s) > i = 0 > while i < n: > # print('at', j) > new = '' > for j in range(len(s)): > left = j-1 > right = (j+1)%len(s) > if s[left]==s[right]: new += '-' > else: new += '*' > s=''.join(new) > print(s) > i += 1 > ~~~ > {: .language-python} > > > ## Solution > > > > Here's one solution. > > > > ~~~ > > def string_machine(input_string, iterations): > > """ > > Takes input_string and generates a new string with -'s and *'s > > corresponding to characters that have identical adjacent characters > > or not, respectively. Iterates through this procedure with the resultant > > strings for the supplied number of iterations. > > """ > > print(input_string) > > input_string_length = len(input_string) > > old = input_string > > for i in range(iterations): > > new = '' > > # iterate through characters in previous string > > for j in range(input_string_length): > > left = j-1 > > right = (j+1) % input_string_length # ensure right index wraps around > > if old[left] == old[right]: > > new += '-' > > else: > > new += '*' > > print(new) > > # store new string as old > > old = new > > > > string_machine('et cetera', 10) > > ~~~ > > {: .language-python} > > > > ~~~ > > et cetera > > *****-*** > > ----*-*-- > > ---*---*- > > --*-*-*-* > > **------- > > ***-----* > > --**---** > > *****-*** > > ----*-*-- > > ---*---*- > > ~~~ > > {: .output}
es: > > 1. Lee este programa e intenta predecir lo que hace. > 2. Ejecútalo: ¿qué tan acertada fué tu predicción? > 3. Modifica el programa para hacerlo más legible. > Recuerda de ejecutarlo después de cada cambio para asegurarte que su comportamiento no cambie. > 4. Compara tu nueva versión con la de tu vecino. > ¿Qué hicieron igual? > ¿Qué hicieron diferente? y ¿porqué? > > ~~~ > n = 10 > s = 'etcetera' > print(s) > i = 0 > while i < n: > # print('en', j) > nuevo = '' > for j in range(len(s)): > left = j-1 > right = (j+1)%len(s) > if s[left]==s[right]: nuevo += '-' > else: nuevo += '*' > s=''.join(nuevo) > print(s) > i += 1 > ~~~ > {: .language-python} > > > ## Solución > > > > Aquí hay una posible solución. > > > > ~~~ > > def procesa_cadena(cadena_entrada, iteraciones): > > """ > > Toma una cadena_entrada y genera una nueva cadena con - y * > > que corresponde a caracteres que tienen caracteres idénticos > > adyacentes o no, respectivamente. Itera sobre este procedimiento > > con la cadena resultante el número indicado de iteraciones > > """ > > print(cadena_entrada) > > longitud_cadena_entrada = len(cadena_entrada) > > anterior = cadena_entrada > > for i in range(iteraciones): > > nueva = '' > > # itera sobre los caracteres de la cadena anterior > > for j in range(longitud_cadena_entrada): > > izquireda = j-1 > > derecha = (j+1) % longitud_cadena_entrada # la última deberá tomar el primer elemento > > if anterior[izquierda] == anterior[derecha]: > > nueva += '-' > > else: > > nueva += '*' > > print(nueva) > > # guarda la nueva cadena como la anterior > > anterior = nueva > > > > procesa_cadena('et cetera', 10) > > ~~~ > > {: .language-python} > > > > ~~~ > > etcetera > > *****-*** > > ----*-*-- > > ---*---*- > > --*-*-*-* > > **------- > > ***-----* > > --**---** > > *****-*** > > ----*-*-- > > ---*---*- > > ~~~ > > {: .output}
uk: > > 1. Прочитайте цю коротку програму та спробуйте передбачити, що вона робить. > 2. Запустіть програму: наскільки точним був ваш прогноз? > 3. Проведіть рефакторинг програми, щоб зробити її більш читабельною. > Не забувайте запускати програми після кожної зміни, щоб переконатися, що її поведінка не змінилася. > 4. Порівняйте свої перетворення з результатом студента поруч. > Що ви зробили так само? > Що ви зробили інакше і чому? > > ~~~ > n = 10 > s = 'et cetera' > print(s) > i = 0 > while i < n: > # print('at', j) > new = '' > for j in range(len(s)): > left = j-1 > right = (j+1)%len(s) > if s[left]==s[right]: new += '-' > else: new += '*' > s=''.join(new) > print(s) > i += 1 > ~~~ > {: .language-python} > > > ## Рішення > > > > Ось одне рішення. > > > > ~~~ > > def string_machine(input_string, iterations): > > """ > > Бере поточну input_string і генерує новий рядок із символів -'s та *'s, > > - відповідає випадку ідентичних суміжних символів > > в противному випадку генерується символ *. Повторює цю процедуру відповідно > > заданої кількості ітерацій. > > """ > > print(input_string) > > input_string_length = len(input_string) > > old = input_string > > for i in range(iterations): > > new = '' > > # перебір символів у рядку 'old' > > for j in range(input_string_length): > > left = j-1 > > right = (j+1) % input_string_length # забезпечити обтікання правого індексу > > if old[left] == old[right]: > > new += '-' > > else: > > new += '*' > > print(new) > > # зберегти новий рядок як старий > > old = new > > > > string_machine('et cetera', 10) > > ~~~ > > {: .language-python} > > > > ~~~ > > et cetera > > *****-*** > > ----*-*-- > > ---*---*- > > --*-*-*-* > > **------- > > ***-----* > > --**---** > > *****-*** > > ----*-*-- > > ---*---*- > > ~~~ > > {: .output}

source: --- title: "Wrap-Up" teaching: 20 exercises: 0 questions: - "What have we learned?" - "What else is out there and where do I find it?" objectives: - "Name and locate scientific Python community sites for software, workshops, and help." keypoints: - "Python supports a large and diverse community across academia and industry." ---
es: --- title: "Resumiendo" teaching: 20 exercises: 0 questions: - "¿Qué hemos aprendido?" - "¿Qué otros recursos hay y dónde los encuentro?" objectives: - "Nombra y localiza sitios donde la comunidad de Python científico disponibiliza software, talleres y ayuda." keypoints: - "Python apoya a una numerosa y diversa comunidad tanto en la academia como en la industria." ---
uk: --- title: "Підведення підсумків" teaching: 20 exercises: 0 questions: - "Чому ми навчилися??" - "Що там ще є і де це знайти?" objectives: - "Назвіть і знайдіть сайти наукової спільноти Python для програмного забезпечення, семінарів і допомоги." keypoints: - "Python підтримує велику та різноманітну спільноту в академічних і промислових колах." ---

source: Leslie Lamport once said, "Writing is nature's way of showing you how sloppy your thinking is." The same is true of programming: many things that seem obvious when we're thinking about them turn out to be anything but when we have to explain them precisely.
es: Leslie Lamport dijo en un momento, "Escribir es la forma en que la naturaleza te muestra lo poco riguroso que es tu pensamiento." Esto también es cierto para la programación: muchas cosas que parecen obvias cuando estamos pensando en ellas resultan no serlo cuando tenemos que explicarlas con precisión.
uk: Леслі Лемпорт якось сказав: «Письмо — це природний спосіб показати вам, наскільки неохайно ви мислите». Те саме стосується програмування: багато речей, які здаються очевидними, коли ми думаємо про них виявляються чим завгодно, але тільки тоді, коли ми маємо їх точно пояснити.

source: ## Python supports a large and diverse community across academia and industry.
es: ## Python apoya a una numerosa y diversa comunidad tanto en la academia como en la industria.
uk: ## Python підтримує велику та різноманітну спільноту в академічних і промислових колах.

source: * The [Python 3 documentation](https://docs.python.org/3/) covers the core language
es: * La [documentación de Python 3](https://docs.python.org/es/3/) cubre la parte central del lenguaje
uk: * The [Python 3 documentation](https://docs.python.org/3/) охоплює ядро мови

source: and the standard library.
es: y la biblioteca estándar.
uk: і стандартну бібліотеку.

source: * [PyCon](https://pycon.org/) is the largest annual conference for the Python community.
es: * [PyCon](https://pycon.org/) es la conferencia anual más grande de la comunidad de Python.
uk: * [PyCon](https://pycon.org/) є найбільшою щорічною конференцією для спільноти Python.

source: * [SciPy](https://scipy.org) is a rich collection of scientific utilities.
es: * [SciPy](https://scipy.org) es una rica colección de herramientas para ciencia.
uk: * [SciPy](https://scipy.org) є багатою колекцією наукових корисних матеріалів.

source: It is also the name of [a series of annual conferences](https://conference.scipy.org/).
es: También es el nombre de [una serie de conferencias anuales](https://conference.scipy.org/).
uk: Це також назва [серії щорічних конференцій](https://conference.scipy.org/).

source: * [Jupyter](https://jupyter.org) is the home of Project Jupyter.
es: * [Jupyter](https://jupyter.org) es el sitio del Proyecto Jupyter.
uk: * [Jupyter](https://jupyter.org) є домом проекту Jupyter.

source: * [Pandas](https://pandas.pydata.org) is the home of the Pandas data library.
es: * [Pandas](https://pandas.pydata.org) es el sitio de la biblioteca de manejo de datos **pandas**.
uk: * [Pandas](https://pandas.pydata.org) є домом для бібліотеки даних Pandas.

source: * Stack Overflow's [general Python section](https://stackoverflow.com/questions/tagged/python?tab=Votes)
es: * [La sección general de Python ](https://stackoverflow.com/questions/tagged/python?tab=Votes) de Stack Overflow
uk: Переповнення стека: Stack Overflow's [general Python section](https://stackoverflow.com/questions/tagged/python?tab=Votes)

source: can be helpful, as well as the sections on [NumPy](https://stackoverflow.com/questions/tagged/numpy?tab=Votes), [SciPy](https://stackoverflow.com/questions/tagged/scipy?tab=Votes), and [Pandas](https://stackoverflow.com/questions/tagged/pandas?tab=Votes).
es: puede ser de mucha ayuda, así como las secciones de [NumPy](https://stackoverflow.com/questions/tagged/numpy?tab=Votes), [SciPy](https://stackoverflow.com/questions/tagged/scipy?tab=Votes), y [Pandas](https://stackoverflow.com/questions/tagged/pandas?tab=Votes).
uk: може бути корисною, а також розділи на [NumPy](https://stackoverflow.com/questions/tagged/numpy?tab=Votes), [SciPy](https://stackoverflow.com/questions/tagged/scipy?tab=Votes), and [Pandas](https://stackoverflow.com/questions/tagged/pandas?tab=Votes).

source: --- title: "Feedback" teaching: 0 exercises: 15 questions: - "How did the class go?" objectives: - "Gather feedback on the class" keypoints: - "We are constantly seeking to improve this course." ---
es: --- title: "Comentarios" teaching: 0 exercises: 15 questions: - "¿Cómo fue la clase?" objectives: - "Obtener comentarios de la clase" keypoints: - "Estamos buscando siempre maneras de mejorar este curso." ---
uk: --- title: "Зворотній зв'язок" teaching: 0 exercises: 15 questions: - "Як пройшло заняття?" objectives: - "Зібрати відгуки про заняття" keypoints: - "Ми постійно прагнемо покращити цей курс." ---

source: Gather feedback from participants.
es: Obtener comentarios de los participantes.
uk: Зберіть відгуки про заняття

source: --- layout: page title: About permalink: /about/ ---
es: --- layout: page title: Sobre las Carpentries permalink: /es/about/ ---

source: --- layout: page title: "Lesson Design" permalink: /design/ ---
es: --- layout: page title: "Diseño de la lección" permalink: /es/design/ root: /es/_episodes/ ---
uk: --- layout: page title: "Вміст проєкту" permalink: /design/ ---

source: > ## Help Wanted
es: > ## Se busca ayuda
uk: > ## Потрібна допомога

source: > > **We are filling in the exercises [below](#stage-3-learning-plan) > in order to make the lesson plan more concrete. > Contributions (both in the form of pull requests with filled-in exercises, > and comments on specific exercises, ordering, and timings) are greatly appreciated.**
es: > > **Estamos completando los ejercicios [a continuación](#etapa-3-plan-de-aprendizaje) > para hacer que el plan de la lección sea más concreto. > Las contribuciones (tanto en forma de *pull request* con ejercicios completados, > y comentarios sobre ejercicios específicos, orden y horarios) son muy apreciadas.**
uk: > > **Ми додаємо вправи [нижче](#stage-3-learning-plan) > для того, щоб план уроку зробити більш конкретним. > Будемо вдячні за пропозиції (як у вигляді нових готових вправ, > так і вигляді коментарів до вже існуючих).**

source: ## Process Used
es: ## Proceso utilizado
uk: ## Розділи, що використовуються

source: > Michael Pollan's advice if he taught R or Python programming:
es: > El consejo de Michael Pollan si él enseñara programación en R o Python:
uk: > Поради Michael Pollan, якби він навчав програмування на R або Python:

source: > > 1. Write code. > 2. Not too much. > 3. Mostly plots. > > — [Michael Koontz](https://twitter.com/_mikoontz/status/758021742078025728)
es: > > 1. Escribir código. > 2. No demasiado. > 3. Principalmente gráficos. > > - [Michael Koontz](https://twitter.com/_mikoontz/status/758021742078025728)
uk: > > 1. Напишіть код. > 2. Не надто багато. > 3. Переважно сценарії. > > — [Michael Koontz](https://twitter.com/_mikoontz/status/758021742078025728)

source: This lesson was developed using a slimmed-down variant of the "Understanding by Design" process. The main sections are:
es: Esta lección fue desarrollada usando una variante reducida del proceso "Comprensión por diseño". Las secciones principales son:
uk: Цей урок розроблено з використанням скороченого варіанту розділу «Розуміння вмісту». Основні пункти:

source: 1. Assumptions about audience, time, etc.
es: 1. Suposiciones sobre la audiencia, tiempo, etc.
uk: 1. Припущення щодо аудиторії, часу тощо.

source: (The current draft also includes some conclusions and decisions in this section - that should be refactored.)
es: (El borrador actual también incluye algunas conclusiones y decisiones en esta sección, que deben ser consideradas).
uk: (У цьому пункті поточний проект містить деякі висновки і результати - вони повинні бути перероблені.)

source: 2. Desired results:
es: 2. Resultados deseados:
uk: 2. Бажані результати:

source: overall goals, summative assessments at half-day granularity, what learners will be able to do, what learners will know.
es: objetivos generales, evaluaciones sumativas al medio día, lo que las estudiantes podrán hacer, lo que las estudiantes aprenderán.
uk: учні повинні розуміти загальні цілі та вміти робити підсумкові оцінки за півдня деталізація.

source: 3. Learning plan:
es: 3. Plan de aprendizaje:
uk: 3. План уроку:

source: each episode has a heading that summarizes what will be covered, then estimates time that will be spent on teaching and on exercises, while the exercises are given as bullet points.
es: cada episodio tiene un encabezado que resume lo que se cubrirá, luego el tiempo estimado que se dedicará a la enseñanza y a los ejercicios, mientras que los ejercicios se muestran en puntos.
uk: кожен епізод має заголовок, який описує, що буде розглянуто, потім в дужках вказується час, необхідний на вивчення матеріалу та виконання навчальних вправ.

source: ## Stage 1: Assumptions
es: ## Etapa 1: Suposiciones
uk: ## Етап 1: Припущення

source: * Audience
es: * Audiencia
uk: * Аудиторія

source: * Graduate students in numerate disciplines from cosmology to archaeology
es: * Estudiantes de postgrado de varias disciplinas desde astronomía hasta zoología.
uk: * Студенти багатьох спеціальностей від космології до археології

source: * Who have manipulated data in spreadsheets and with interactive tools like SAS
es: * Personas que hayan manejado datos en planillas de cálculo y herramientas interactivas como SAS
uk: * Хто обробляв дані в електронних таблицях, а також за допомогою інтерактивних інструментів, таких як SAS

source: * But have *not* programmed beyond CPD (copy-paste-despair)
es: * Personas que *no* han programado más allá de CPD (copiar-pegar-desesperarse)
uk: * Але не просунулися далі CPD (copy-paste-despair / копіював-вставив-впав в розпач)

source: * Constraints
es: * Restricciones
uk: * Обмеження

source: * One full day 09:00-16:30
es: * Un día completo de 09:00-16:30
uk: * Один повний день 09:00-16:30

source: * 06:15 class time
es: * 06:15 horas de clase
uk: * 06:15 заняття

source: * 0:45 lunch
es: * 0:45 almuerzo
uk: * 0:45 обід

source: * 0:30 total for two coffee breaks
es: * 0:30 tiempo total para dos pausas
uk: * 0:30 разом на дві перерви на каву

source: * Learners use native installs on their own machines
es: * Las estudiantes usan herramientas intaladas en sus propias máquinas
uk: * Учні використовують інстальоване програмне забезпечення на своїх комп'ютерах

source: * May use VMs or cloud resources at instructor's discretion
es: * Pueden usar VMs o recursos en la nube si la instructora lo decide
uk: * Можуть використовувати віртуальні машини або хмарні ресурси на розсуд інструктора

source: * But must keep native local install as an option
es: * Deben tener una instalación local como opción
uk: * Але необхідно опціонально зберегти інстальоване програмне забезпечення

source: * No dependence on other Carpentry modules
es: * No depende de otros módulos de las Carpentries
uk: * Немає залежності від інших модулів Carpentry

source: * In particular, does not require knowledge of shell or version control
es: * Particularmente, no requiere conocimiento de la línea de comandos o sistemas de control de versiones
uk: * Не вимагається знання системи керування версіями

source: * Use the Jupyter Notebook
es: * Usa Jupyter Notebooks
uk: * Використовується Jupyter Notebook

source: * Authentic tool used by many instructors
es: * La herramienta es usada por muchos instructores
uk: * Оригінальний інструмент, який використовують багато інструкторів

source: * There isn't really an alternative
es: * No hay alguna alternativa
uk: * Насправді альтернативи просто немає

source: * And means that even people who have seen a bit of Python before
es: * Y significa que incluso las personas que hayan visto algo de Python con anterioridad
uk: * І це означає, що навіть люди, які вже трохи вивчали Python раніше, ймовірно,

source: will probably learn something * Motivating Example * Creating 2D plots suitable for inclusion in papers * Appeals to almost everyone * Makes lesson usable by both Carpentries * And means that even people who have seen a bit of Python before will probably learn something * Data * Use the gapminder data throughout * But break into multiple files by continent * To make display of output from examples tidier (e.g., use Australia/New Zealand, which is only two lines) * And allow examples showing use of multiple data sets * Focus on Pandas instead of NumPy * Makes lesson usable by both Data Carpentry and Software Carpentry * Genuine novices are likely to want data analysis * And people with some prior experience: * will accept data analysis as an authentic task, * and are unlikely to have encountered Pandas, so they'll still get something useful out of the lesson * Challenges will mostly *not* be "write this code from scratch" * Want lots of short exercises that can reliably be finished in allotted time * So use MCQs, fill-in-the-blanks, Parsons Problems, "tweak this code", etc.
es: probablemente aprenderán algo * Ejemplo motivador * Creación de gráficos en 2D adecuados para su inclusión en publicaciones * Motiva a casi todos * Hace que la lección sea utilizable por ambas Carpentries * Y significa que incluso las personas que han visto un poco de Python antes probablemente aprenderá algo * Datos * Utiliza los datos de gapminder en la lección * Dividido en múltiples archivos por continente * Hacer que la salida de los ejemplos sea más ordenada (por ejemplo, usar Australia/New Zealand, que son sólo dos líneas) * Y permite ejemplos que muestran el uso de múltiples conjuntos de datos * Céntrarse en **Pandas** en lugar de NumPy * Hace que la lección sea utilizable tanto por Software Carpentry y Data Carpentry * Es probable que los principiantes deseen una demostración de análisis de datos * Y personas con alguna experiencia previa: * aceptarán el análisis de datos como una tarea auténtica, * y es poco probable que hayan utilizado Pandas, entonces ellos también tendrán algo útil de la lección * Los desafíos en su mayoría *no* serán "escribir este código desde cero" * Se desea que haya muchos ejercicios cortos que se pueden terminar en el tiempo asignado * Utiliza MCQ (preguntas de selección múltiple), rellenar los espacios en blanco, problemas de Parsons, "modifique este código", etc.
uk: дізнаються щось нове * Мотивуючий приклад * Створення двовимірних графіків, придатних для включення в документи * Приваблює майже всіх * Робить урок придатним для використання і в Data Carpentry, і в Software Carpentry * Це означає, що навіть люди, які вже трохи вивчили Python раніше, ймовірно, дізнаються щось нове * Дані * Завжди використовуйте дані Gapminder * Розділяйте дані на декілька файлів в залежності від континенту * Щоб відображати результати із прикладів якісніше (наприклад, використовуйте Австралію/Нову Зеландію, тобто лише два рядки) * І дозвольте використання декількох наборів даних у прикладах * Сфокусуйтеся на Pandas замість of NumPy * Зробіть урок придатним для використання і в Data Carpentry, і в Software Carpentry * Новачки, швидше за все, захочуть аналізувати дані * А користувачі з певним досвідом: * сприймуть аналіз даних як щось вже відоме, * але навряд вони стикалися з Pandas, тому вони все одно отримають від уроку щось корисне * Завдання переважно *не* полягатимуть у «написати цей код з нуля» * Хочете багато коротких вправ, які можна надійно виконати за відведений час * Тож використовуйте MCQ, заповніть пропуски, проблеми Парсонса, «налаштуйте цей код» тощо.

source: ## Stage 2: Desired Results
es: ## Etapa 2: Resultados deseados
uk: ## Етап 2: Бажані результати

source: ### Questions
es: ### Preguntas
uk: ### Питання

source: How do I...
es: ¿Cómo puedo...
uk: Як мені...

source: * ...read tabular data?
es: * ...leer datos tabulares?
uk: * ...читати табличні дані?

source: * ...plot a single vector of values?
es: * ...graficar un vector de valores?
uk: * ...побудувати вектор значень?

source: * ...create a time series plot?
es: * ...crear una gráfica de series de tiempo?
uk: * ...створити графік часових рядів?

source: * ...create one plot for each of several data sets?
es: * ...crear una gráfica para cada conjunto de datos?
uk: * ...створити свій графік для кожного набору даних?

source: * ...get extra data from a single data set for plotting?
es: * ...extraer datos de un conjunto de datos para graficar?
uk: * ...отримати додаткові дані для побудови графіку з набору даних?

source: * ...write programs I can read and re-use in future?
es: * ...escribir programas que pueda leer y reutilizar en el futuro?
uk: * ...писати програми, які я можу читати та повторно використовувати в майбутньому?

source: ### Skills
es: ### Habilidades
uk: ### Навички

source: I can...
es: Yo puedo...
uk: Я зможу...

source: * ...write short scripts using loops and conditionals.
es: * ...escribir scripts cortos usando bucles y condicionales.
uk: * ...писати короткі сценарії, в яких будуть цикли та умовні оператори.

source: * ...write functions with a fixed number of parameters that return a single result.
es: * ...escribir funciones con un número fijo de parámetros que retornan un resultado.
uk: * ...написати функції з фіксованою кількістю параметрів, які повертають єдиний результат.

source: * ...import libraries using aliases and refer to those libraries' contents.
es: * ...importar bibliotecas usando aliases y refererenciar al contenido de la biblioteca.
uk: * ...імпортувати бібліотеки та звертатися до вмісту цих бібліотек.
