Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: ## Python reports a syntax error when it can't understand the source of a program.
es: ## Python reporta un error de sintaxis cuando no puede entender la fuente de un programa.
uk: ## Python повідомляє про синтаксичну помилку, коли він не може зрозуміти джерело програми.

source: * Won't even try to run the program if it can't be parsed.
es: * Ni siquiera intentará ejecutar el programa si no puede interpretarlo.
uk: * Він навіть не намагатиметься запустити програму, якщо її неможливо коректно прочитати.

source: ~~~ # Forgot to close the quote marks around the string. name = 'Feng ~~~
es: ~~~ # Olvidar cerrar las comillas alrededor de la cadena de caracteres. name = 'Feng ~~~
uk: ~~~ # Рядок не взято в лапки. name = 'Feng ~~~

source: ~~~ # An extra '=' in the assignment. age = = 52 ~~~
es: ~~~ # Un '=' adicional en la asignación. age = = 52 ~~~
uk: ~~~ # Додатковий знак '=' у присвоєнні. age = = 52 ~~~

source: * Look more closely at the error message:
es: * Mira de cerca el mensaje de error:
uk: * Подивіться уважніше на повідомлення про помилку:

source: ~~~ print("hello world" ~~~
es: ~~~ print("hola mundo" ~~~

source: {: .language-python} ~~~ File "<ipython-input-6-d1cc229bf815>", line 1 print ("hello world" ^ SyntaxError: unexpected EOF while parsing ~~~
es: {: .language-python} ~~~ File "<ipython-input-6-d1cc229bf815>", line 1 print ("hola mundo" ^ SyntaxError: unexpected EOF while parsing ~~~

source: * The message indicates a problem on first line of the input ("line 1").
es: * El mensaje indica un problema en la primera línea de la entrada ("line 1").
uk: * Повідомлення вказує на проблему в першому рядку введеної програми ("line 1").

source: * In this case the "ipython-input" section of the file name tells us that
es: * En este caso la sección "ipython-input" del nombre de archivo nos dice que
uk: * У цьому випадку розділ імені файлу «ipython-input» повідомляє нам, що

source: we are working with input into IPython, the Python interpreter used by the Jupyter Notebook. * The `-6-` part of the filename indicates that the error occurred in cell 6 of our Notebook. * Next is the problematic line of code, indicating the problem with a `^` pointer.
es: estamos trabajando con entrada en IPython, el intérprete de Python usado por la Libreta Jupyter. * La parte `-6-` del nombre de archivo indica que el error ocurrió en la celda 6 de nuestra Libreta. * A continuación está la línea de código problemática, indicando el problema con el puntero `^`.
uk: ми працюємо з введенням в IPython, з інтерпретатором Python, який використовується в Jupyter Notebook. * Частина `-6-` в назві файлу вказує на те, що помилка сталася в клітинці 6. * Далі йде проблемний рядок коду, на що вказує символ `^`.

source: ## <a name='runtime-error'></a> Python reports a runtime error when something goes wrong while a program is executing.
es: ## <a name='runtime-error'></a> Python reporta un error de tiempo de ejecución cuando algo anda mal mientras un programa se está ejecutando.
uk: ## <a name='runtime-error'></a> Python повідомляє про помилку "runtime error", коли щось йде не так під час виконання програми.

source: ~~~ age = 53 remaining = 100 - aege # mis-spelled 'age' ~~~
es: ~~~ age = 53 remaining = 100 - aege # mal escrito 'age' ~~~
uk: ~~~ age = 53 remaining = 100 - aege # неправильно написано 'age' ~~~

source: {: .language-python} ~~~ NameError Traceback (most recent call last) <ipython-input-59-1214fb6c55fc> in <module> 1 age = 53 ----> 2 remaining = 100 - aege # mis-spelled 'age'
es: {: .language-python} ~~~ NameError Traceback (most recent call last) <ipython-input-59-1214fb6c55fc> in <module> 1 age = 53 ----> 2 remaining = 100 - aege # mal escrito 'age'
uk: {: .language-python} ~~~ NameError Traceback (most recent call last) <ipython-input-59-1214fb6c55fc> в <module> 1 age = 53 ----> 2 remaining = 100 - aege # неправильно написано 'age'

source: * Fix syntax errors by reading the source and runtime errors by tracing execution.
es: * Arregle errores de sintaxis leyendo el código fuente y errores de tiempo de ejecución rastreando la ejecución.
uk: * Якщо перечитаєте джерело, можна виправити синтаксичні помилки, а якщо відстежите компілювання - помилки виконання.

source: ## The Jupyter Notebook has two ways to get help.
es: ## La Libreta Jupyter ofrece dos formas de obtener ayuda.
uk: ## Два шляхи отримання допомоги у Jupyter Notebook.

source: * Place the cursor anywhere in the function invocation
es: * Ubica el cursor en cualquier lugar en la invocación a la función
uk: * Розмістіть курсор у будь-якому місці виклику функції

source: (i.e., the function name or its parameters), hold down `shift`, and press `tab`. * Or type a function name with a question mark after it.
es: (es decir, el nombre de la función o sus parámetros), mantén apretado `shift`, y presiona `tab`. * O escribe un nombre de función seguido de un signo de pregunta.
uk: (тобто в імені функції або її параметрах), утримуйте `shift` та натисніть `tab`. * Або введіть назву функції зі знаком питання після неї.

source: ## Every function returns something.
es: ## Cada función devuelve algo.
uk: ## Кожна функція щось повертає.

source: * Every function call produces some result.
es: * Cada llamada a una función produce algún resultado.
uk: * Кожен виклик функції дає певний результат.

source: * If the function doesn't have a useful result to return,
es: * Si la función no tiene un resultado útil que devolver,
uk: * Якщо функція не повертає корисного результату,

source: it usually returns the special value `None`.
es: usualmente devuelve el valor especial `None`.
uk: зазвичай вона повертає спеціальне значення `None`.

source: ~~~ result = print('example') print('result of print is', result) ~~~
es: ~~~ result = print('ejemplo') print('el resultado de print es', result) ~~~

source: {: .language-python} ~~~ example result of print is None ~~~
es: {: .language-python} ~~~ ejemplo el resultado de print es None ~~~

source: > ## What Happens When
es: > ## Qué ocurre cuándo
uk: > ## Що відбувається?

source: > > 1. Explain in simple terms the order of operations in the following program: > when does the addition happen, when does the subtraction happen, > when is each function called, etc. > 2. What is the final value of `radiance`? > > ~~~ > radiance = 1.0 > radiance = max(2.1, 2.0 + min(radiance, 1.1 * radiance - 0.5)) > ~~~ > {: .language-python} > > ## Solution > > 1. > > 1. `1.1 * radiance = 1.1` > > 2. `1.1 - 0.5 = 0.6` > > 3. `min(radiance, 0.6) = 0.6` > > 4. `2.0 + 0.6 = 2.6` > > 5. `max(2.1, 2.6) = 2.6` > > 2. At the end, `radiance = 2.6`
es: > > 1. Explica en términos simples el orden de operaciones en el siguiente programa: > cuándo ocurre la adición y cuándo la sustracción, > cuándo es llamada cada función, etc. > 2. ¿Cuál es el valor final de `radiance`? > > ~~~ > radiance = 1.0 > radiance = max(2.1, 2.0 + min(radiance, 1.1 * radiance - 0.5)) > ~~~ > {: .language-python} > > ## Solución > > 1. > > 1. `1.1 * radiance = 1.1` > > 2. `1.1 - 0.5 = 0.6` > > 3. `min(radiance, 0.6) = 0.6` > > 4. `2.0 + 0.6 = 2.6` > > 5. `max(2.1, 2.6) = 2.6` > > 2. Al final, `radiance = 2.6`
uk: > > 1. Поясніть простими словами порядок операцій у наступній програмі: > коли відбувається додавання, коли відбувається віднімання, > коли викликається кожна функція тощо. > 2. Яке кінцеве значення величини `radiance`? > > ~~~ > radiance = 1.0 > radiance = max(2.1, 2.0 + min(radiance, 1.1 * radiance - 0.5)) > ~~~ > {: .language-python} > > ## Рішення > > 1. > > 1. `1.1 * radiance = 1.1` > > 2. `1.1 - 0.5 = 0.6` > > 3. `min(radiance, 0.6) = 0.6` > > 4. `2.0 + 0.6 = 2.6` > > 5. `max(2.1, 2.6) = 2.6` > > 2. В підсумку, `radiance = 2.6`

source: > ## Spot the Difference
es: > ## Encuentra la diferencia
uk: > ## Знайдіть відмінності

source: > > 1. Predict what each of the `print` statements in the program below will print. > 2. Does `max(len(rich), poor)` run or produce an error message? > If it runs, does its result make any sense? > > ~~~ > easy_string = "abc" > print(max(easy_string)) > rich = "gold" > poor = "tin" > print(max(rich, poor)) > print(max(len(rich), len(poor))) > ~~~ > {: .language-python} > > ## Solution > > ~~~ > > print(max(easy_string)) > > ~~~ > > {: .language-python} > > ~~~ > > c > > ~~~ > > {: .output} > > ~~~ > > print(max(rich, poor)) > > ~~~ > > {: .language-python} > > ~~~ > > tin > > ~~~ > > {: .output} > > ~~~ > > print(max(len(rich), len(poor))) > > ~~~ > > {: .language-python} > > ~~~ > > 4 > > ~~~ > > {: .output} > > `max(len(rich), poor)` throws a TypeError. This turns into `max(4, 'tin')` and > > as we discussed earlier a string and integer cannot meaningfully be compared. > > ~~~ > > TypeError Traceback (most recent call last) > > <ipython-input-65-bc82ad05177a> in <module> > > ----> 1 max(len(rich), poor) > > > > TypeError: '>' not supported between instances of 'str' and 'int' > > ~~~ > > {: .error }
es: > > 1. Predice qué imprimirá cada una de las declaraciones `print` en el programa a continuación. > 2. ¿Corre `max(len(rich), poor)` o genera un mensaje de error? > Si corre, ¿tiene sentido su resultado? > > ~~~ > easy_string = "abc" > print(max(easy_string)) > rich = "gold" > poor = "tin" > print(max(rich, poor)) > print(max(len(rich), len(poor))) > ~~~ > {: .language-python} > > ## Solucion > > ~~~ > > print(max(easy_string)) > > ~~~ > > {: .language-python} > > ~~~ > > c > > ~~~ > > {: .output} > > ~~~ > > print(max(rich, poor)) > > ~~~ > > {: .language-python} > > ~~~ > > tin > > ~~~ > > {: .output} > > ~~~ > > print(max(len(rich), len(poor))) > > ~~~ > > {: .language-python} > > ~~~ > > 4 > > ~~~ > > {: .output} > > `max(len(rich), poor)` causa un TypeError. Esto se vuelve `max(4, 'tin')` y > > como discutimos antes un **string** y un **integer** no se pueden comparar significativamente. > > ~~~ > > TypeError Traceback (most recent call last) > > <ipython-input-65-bc82ad05177a> in <module> > > ----> 1 max(len(rich), poor) > > > > TypeError: '>' not supported between instances of 'str' and 'int' > > ~~~ > > {: .error }
uk: > > 1. Подумайте, що виведе кожен з операторів `print` у наведеній нижче програмі. > 2. Функція `max(len(rich), poor)` поверне відповідь або повідомлення про помилку? > Якщо поверне відповідь, чи буде вона мати сенс? > > ~~~ > easy_string = "abc" > print(max(easy_string)) > rich = "gold" > poor = "tin" > print(max(rich, poor)) > print(max(len(rich), len(poor))) > ~~~ > {: .language-python} > > ## Рішення > > ~~~ > > print(max(easy_string)) > > ~~~ > > {: .language-python} > > ~~~ > > c > > ~~~ > > {: .output} > > ~~~ > > print(max(rich, poor)) > > ~~~ > > {: .language-python} > > ~~~ > > tin > > ~~~ > > {: .output} > > ~~~ > > print(max(len(rich), len(poor))) > > ~~~ > > {: .language-python} > > ~~~ > > 4 > > ~~~ > > {: .output} > > `max(len(rich), poor)` поверне TypeError. Це станеться на `max(4, 'tin')` і, > > як ми говорили раніше, порівнювати рядок і ціле число не можна. > > ~~~ > > TypeError Traceback (most recent call last) > > <ipython-input-65-bc82ad05177a> в <module> > > ----> 1 max(len(rich), poor) > > > > TypeError: '>' not supported between instances of 'str' and 'int' > > ~~~ > > {: .error }

source: > ## Why Not?
es: > ## Por qué no?
uk: > ## Чому ні?

source: > > Why don't `max` and `min` return `None` when they are given no arguments? > > > ## Solution > > `max` and `min` return TypeErrors in this case because the correct number of parameters > > was not supplied. If it just returned `None`, the error would be much harder to trace as it > > would likely be stored into a variable and used later in the program, only to likely throw > > a runtime error.
es: > > Por qué `max` y `min` no devuelven `None` cuando no se les pasan argumentos? > > > ## Solución > > `max` y `min` devuelven TypeErrors en este caso porque no se ha proporcionado el número correcto > > de parámetros. Si sólo devolvieran `None`, el error sería mucho más difícil de rastrear ya > > que probablemente estaría almacenado en una variable y usado luego en el programa, would likely be stored into a variable and used later in the program, sólo para causar > > un error de tiempo de ejecución.
uk: > > Чому функції `max` і `min` не повертають `None`, якщо їм не надано аргументів? > > > ## Рішення > > `max` і `min` у цьому випадку повертають TypeErrors, оскільки правильна кількість параметрів > > не була надана. Якби функції повернули тільки `None`, таку помилку було б набагато важче відстежити. > > Швидше за все, значення `None` буде збережено у змінній і використано пізніше в програмі лише для того, щоб повернути > > помилку виконання.

source: > ## Last Character of a String
es: > ## Último Carácter de una Cadena
uk: > ## Останній символ рядка

source: > > If Python starts counting from zero, > and `len` returns the number of characters in a string, > what index expression will get the last character in the string `name`? > (Note: we will see a simpler way to do this in a later episode.) > > > ## Solution > > > > `name[len(name) - 1]`
es: > > Si Python comienza a contar desde cero, > y `len` devuelve el número de caracteres en una cadena, > qué expresión de índice te devuelve el último carácter de la cadena `name`? > (Nota: veremos una forma más simple de hacer esto en un episodio posterior.) > > > ## Solución > > > > `name[len(name) - 1]`
uk: > > Якщо Python починає рахувати з нуля, > та `len` повертає кількість символів у рядку, > то який індекс отримає останній символ у рядку `name`? > (Примітка: ми побачимо простіший спосіб зробити це в наступному епізоді.) > > > ## Рішення > > > > `name[len(name) - 1]`

source: --- layout: break title: "Morning Coffee" teaching: 0 exercises: 0 break: 15 ---
es: --- layout: break title: "Pausa" teaching: 0 exercises: 0 break: 15 ---
uk: --- layout: break title: "Ранкова кава" teaching: 0 exercises: 0 break: 15 ---

source: # Reflection exercise
es: # Ejercicios para reflexionar
uk: # Вправа для рефлексії

source: Over coffee, reflect on and discuss the following: * What are the different kinds of errors Python will report? * Did the code always produce the results you expected? If not, why? * Is there something we can do to prevent errors when we write code?
es: Durante la pausa, reflexiona y discute sobre las siguientes preguntas: * ¿Cuáles son los diferentes tipos de errores que Python reporta? * ¿El código siempre produce los resultados que esperas? ¿y si no, por qué no? * ¿Hay algo que podamos hacer para prevenir errores al escribir código?
uk: За кавою поміркуйте та обговоріть наступне: * Про які різні типи помилок повідомлятиме Python? * Чи завжди код давав очікувані результати? Якщо ні, то чому? * Чи можна щось зробити, щоб запобігти помилкам під час написання коду?

source: --- title: "Libraries" teaching: 10 exercises: 10 questions: - "How can I use software that other people have written?" - "How can I find out what that software does?" objectives: - "Explain what software libraries are and why programmers create and use them." - "Write programs that import and use libraries from Python's standard library." - "Find and read documentation for standard libraries interactively (in the interpreter) and online." keypoints: - "Most of the power of a programming language is in its libraries." - "A program must import a library module in order to use it." - "Use `help` to learn about the contents of a library module." - "Import specific items from a library to shorten programs." - "Create an alias for a library when importing it to shorten programs." ---
es: --- title: "Bibliotecas" teaching: 10 exercises: 10 questions: - "¿Cómo puedo usar el software que otras personas han escrito?" - "¿Cómo puedo saber qué hace dicho software?" objectives: - "Explicar qué son las bibliotecas de software, y por qué los programadores las crean y usan." - "Escribir programas que importen y usen bibliotecas de la biblioteca estándar de Python." - "Encontrar y leer la documentación de las bibliotecas estándar de forma interactiva (en el intérprete) y en línea." keypoints: - "Gran parte del poder que puede tener un lenguaje de programación está en sus bibliotecas." - "Un programa debe importar los módulos de una biblioteca para poder usarlos." - "Usa `help` para aprender sobre los contenidos de un módulo de la biblioteca." - "Importa elementos específicos de una biblioteca para acortar programas." - "Crea un alias para una biblioteca al importarla para acortar programas." ---
uk: --- title: "Бібліотеки" teaching: 10 exercises: 10 questions: - "Як я можу використовувати програмне забезпечення, яке написали інші люди?" - "Як я можу дізнатися, що робить це програмне забезпечення?" цілі: - "Пояснити, що таке програмні бібліотеки і для чого їх створюють і використовують програмісти." - "Написати програми, які імпортують і використовують бібліотеки зі стандартної бібліотеки Python." - "Знайти та прочитати документацію для стандартних бібліотек в інтерактивному режимі (в інтерпретаторі) та онлайн" keypoints: - "Більша частина потужності мови програмування полягає в її бібліотеках." - "Програма має імпортувати бібліотечний модуль, щоб використовувати його." - "Використовуйте `help` , щоб дізнатися про вміст бібліотечного модуля." - "Імпортуйте певні елементи із бібліотеки для скорочення програм." - "Створіть псевдонім для бібліотеки під час її імпорту для скорочення програм." ---

source: ## Most of the power of a programming language is in its libraries.
es: ## Gran parte del poder de un lenguaje de programación está en sus bibliotecas.
uk: ## Більша частина потужності мови програмування полягає в її бібліотеках.

source: * A *library* is a collection of files (called *modules*) that contains
es: * Una *biblioteca* es una colección de archivos (llamados *módulos*) que contienen
uk: * *Бібліотека* — це набір файлів (так званих *модулів*), які містять

source: functions for use by other programs. * May also contain data values (e.g., numerical constants) and other things. * Library's contents are supposed to be related, but there's no way to enforce that. * The Python [standard library][stdlib] is an extensive suite of modules that comes with Python itself. * Many additional libraries are available from [PyPI][pypi] (the Python Package Index). * We will see later how to write new libraries.
es: funciones para ser usadas por otros programas. * Pueden también contener datos (e.g. constantes numéricas) y otras cosas. * Los contenidos de una biblioteca deberían estar relacionados, pero no hay una forma establecida para imponer esto. * La [biblioteca estándar][stdlib] de Python es una colección extensa de módulos que vienen con Python mismo. * Muchas bibliotecas adicionales están disponibles en [PyPI][pypi] (el índice de paquetes de Python). * Más tarde veremos cómo escribir nuevas bibliotecas.
uk: бібліотека функції для використання іншими програмами. * Може також містити значення даних (наприклад, числові константи) та інші дані. * Передбачається, що зміст бібліотеки певним чином пов'язаний, але немає засобів це проконтролювати. * [Standard library][stdlib] Python — це великий набір модулів, що постачається з самим Python. * Багато додаткових бібліотек доступні в [PyPI][pypi] (the Python Package Index). * Пізніше ми побачимо, як писати нові бібліотеки.

source: > ## Libraries and modules
es: > ## Bibliotecas y módulos
uk: > ## Бібліотеки та модулі

source: > > A library is a collection of modules, but the terms are often used > interchangeably, especially since many libraries only consist of a single > module, so don't worry if you mix them.
es: > > Una biblioteca es una colección de módulos, pero los términos a menudo se usan > indistintamente, especialmente porque muchas bibliotecas consisten de un solo > módulo, entonces no te preocupes si las mezclas.
uk: > > Бібліотека — це набір модулів, але ці терміни часто вважаються > взаємозамінними, особливо тому, що багато бібліотек складаються лише з одного > модуля, тому не хвилюйтеся, якщо ви їх плутаєте.

source: ## A program must import a library module before using it.
es: ## Un programa debe importar un módulo de biblioteca antes de usarlo.
uk: ## Програма повинна імпортувати бібліотечний модуль перед його використанням.

source: * Use `import` to load a library module into a program's memory.
es: * Usa `import` para cargar un módulo de una biblioteca en la memoria del programa.
uk: * Використовуйте `import`, щоб завантажити модуль бібліотеки в пам'ять програми.

source: * Then refer to things from the module as `module_name.thing_name`.
es: * Después refiérete a las cosas del módulo como `nombre_del_modulo.nombre_de_la_cosa`.
uk: * Потім посилайтеся на функції модуля як `module_name.function_name`.

source: * Python uses `.` to mean "part of".
es: * Python usa `.` para referirse a "parte de".
uk: * У Python синтакс `a.b` означає що `a` містить `b`, або іншими словами, `b` є частиною `a`.

source: * Using `math`, one of the modules in the standard library:
es: * Usando `math`, uno de los módulos de la biblioteca estándar:
uk: * Використовуючи `math`, один із модулів у стандартній бібліотеці, маємо:

source: ~~~ import math print('pi is', math.pi) print('cos(pi) is', math.cos(math.pi)) ~~~
es: ~~~ import math print('pi es', math.pi) print('cos(pi) es', math.cos(math.pi)) ~~~

source: {: .language-python} ~~~ pi is 3.141592653589793 cos(pi) is -1.0 ~~~
es: {: .language-python} ~~~ pi es 3.141592653589793 cos(pi) es -1.0 ~~~

source: * Have to refer to each item with the module's name.
es: * Debemos referirnos a cada elemento con el nombre del módulo.
uk: * Потрібно посилатися на кожен елемент разом із назвою модуля.

source: * `math.cos(pi)` won't work: the reference to `pi`
es: * `math.cos(pi)` no funcionará: la referencia a `pi`
uk: * `math.cos(pi)` не буде працювати: посилання на `pi`

source: doesn't somehow "inherit" the function's reference to `math`.
es: no "hereda" de alguna forma la referencia que está haciendo la función a `math`
uk: жодним чином не "успадковує" посилання функції на `math`.

source: ## Use `help` to learn about the contents of a library module.
es: ## Usa `help` para aprender sobre los contenidos del módulo de una biblioteca.
uk: ## Використовуйте `help`, щоб дізнатися про вміст бібліотечного модуля.

source: * Works just like help for a function.
es: * Funciona tal y como la ayuda para una función.
uk: * Працює так само, як довідка для функції.

source: The following documentation is automatically generated from the Python source files. It may be incomplete, incorrect or include features that are considered implementation detail and may vary between Python implementations. When in doubt, consult the module reference at the location listed above.
es: La documentación que sigue fue automáticamente generada desde los archivos fuente de Python (los cuales están escritos en inglés). Puede estar incompleta, ser incorrecta o incluir características que son consideradas detalles de la implementación y que pueden variar entre implementaciones de Python. Cuando tengas dudas, consulta la referencia al módulo en la dirección que encuentras arriba.

source: DESCRIPTION This module is always available. It provides access to the mathematical functions defined by the C standard.
es: DESCRIPTION Este módulo siempre está disponible. Proporciona acceso a las funciones matemáticas definidas por el estándar C.

source: FUNCTIONS acos(x, /) Return the arc cosine (measured in radians) of x. ⋮ ⋮ ⋮ ~~~
es: FUNCTIONS acos(x, /) Devuelve el arco coseno (medido en radianes) de x ⋮ ⋮ ⋮ ~~~

source: ## Import specific items from a library module to shorten programs.
es: ## Importa elementos específicos del módulo de una biblioteca para acortar programas
uk: ## Імпортуйте певні елементи з бібліотечного модуля, щоб скоротити програми.
