Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: > > 1. Read the code below and try to identify what the errors are without running it. > 2. Run the code, and read the error message. What type of error is it? > > ~~~ > from math import log > log(0) > ~~~ > {: .language-python} > > > ## Solution > > > > 1. The logarithm of `x` is only defined for `x > 0`, so 0 is outside the > > domain of the function. > > 2. You get an error of type "ValueError", indicating that the function > > received an inappropriate argument value. The additional message > > "math domain error" makes it clearer what the problem is.
es: > > 1. Lee el código acá abajo e intenta identificar cuáles son los errores que tiene sin correrlo. > 2. Corre el código y lee el mensaje de error. ¿Qué tipo de error es? > > ~~~ > from math import log > log(0) > ~~~ > {: .language-python} > > > ## Solución > > > > 1. El logaritmo de `x` solo está definido para `x > 0`, entonces 0 está fuera del > > dominio de la función. > > 2. Obtienes un error de tipo "ValueError", indicando que la función > > recibió un valor inadecuado en el argumento. El mensaje adicional > > "math domain error" (error matemático en el dominio) hace más claro qué tipo de problema es.
uk: > > 1. Прочитайте наведений нижче код і спробуйте визначити помилки перед його виконанням. > 2. Запустіть код і прочитайте повідомлення про помилку. Який тип цієї помилки? > > ~~~ > from math import log > log(0) > ~~~ > {: .language-python} > > > ## Рішення > > > > 1. Логарифм `x` визначено лише для `x > 0`, тому 0 знаходиться за межами > > області визначення функції. > > 2. Ви отримуєте повідомлення про помилку типу "ValueError", яке вказує на те, що функція > > отримала невідповідне значення аргументу. Додаткове повідомлення > > "math domain error" пояснює, в чому полягає проблема.

source: --- title: "Reading Tabular Data into DataFrames" teaching: 10 exercises: 10 questions: - "How can I read tabular data?" objectives: - "Import the Pandas library." - "Use Pandas to load a simple CSV data set." - "Get some basic information about a Pandas DataFrame." keypoints: - "Use the Pandas library to get basic statistics out of tabular data." - "Use `index_col` to specify that a column's values should be used as row headings." - "Use `DataFrame.info` to find out more about a dataframe." - "The `DataFrame.columns` variable stores information about the dataframe's columns." - "Use `DataFrame.T` to transpose a dataframe." - "Use `DataFrame.describe` to get summary statistics about data." ---
es: --- title: "Lectura de Datos Tabulares en DataFrames" teaching: 10 exercises: 10 questions: - "¿Cómo puedo leer datos tabulares?" objectives: - "Importar la biblioteca Pandas." - "Usar Pandas para cargar un conjunto de datos CSV simple." - "Obtener información básica sobre un DataFrame de Pandas." keypoints: - "Utiliza la biblioteca Pandas para obtener estadísticas básicas de los datos tabulares". - "Utiliza `index_col` para especificar los valores de la columna que deben usarse como fila de encabezado." - "Utiliza `DataFrame.info` para obtener más información sobre un dataframe." - "La variable `DataFrame.columns` almacena información sobre las columnas del dataframe." - "Utiliza `DataFrame.T` para transponer un dataframe." - "Utiliza `DataFrame.describe` para obtener estadísticas resumidas sobre los datos." ---
uk: --- title: "Читання табличних даних у DataFrames" teaching: 10 exercises: 10 questions: - "Як я можу читати табличні дані?" objectives: - "Імпортувати бібліотеку Pandas" - "Використати Pandas для завантаження простого набору даних CSV." - "Отримати базову інформацію про Pandas DataFrame." keypoints: - "Використовуйте бібліотеку Pandas, щоб отримати базову статистику з табличних даних." - "Використовуйте `index_col`, щоб вказати, що значення стовпця мають використовуватися як заголовки рядків." - "Використовуйте `DataFrame.info`, щоб дізнатися більше про фрейм даних." - "Змінна `DataFrame.columns` зберігає інформацію про стовпці фрейму даних." - "Використовуйте `DataFrame.T`, щоб транспортувати фрейм даних." - "Використовуйте `DataFrame.describe`, щоб отримати підсумкову статистику даних." ---

source: ## Use the Pandas library to do statistics on tabular data.
es: ## Utiliza la biblioteca Pandas para hacer estadísticas sobre datos tabulares.
uk: ## Використовуйте бібліотеку Pandas, щоб отримати статистику з табличних даних.

source: * Pandas is a widely-used Python library for statistics, particularly on tabular data.
es: * Pandas es una biblioteca de Python ampliamente utilizada para estadísticas, particularmente en datos tabulares.
uk: * Pandas — це бібліотека Python, яка широко використовується для статистики, зокрема на основі табличних даних.

source: * Borrows many features from R's dataframes.
es: * Toma prestadas muchas características de los R's dataframes.
uk: * Ця бібліотека запозичує багато функцій з фреймів даних мови R.

source: * A 2-dimensional table whose columns have names
es: * Una tabla de 2-dimensiones cuyas columnas tienen nombres
uk: * Фрейм — це двовимірна таблиця, стовпці якої мають імена

source: and potentially have different data types. * Load it with `import pandas as pd`. The alias pd is commonly used for Pandas. * Read a Comma Separate Values (CSV) data file with `pd.read_csv`. * Argument is the name of the file to be read. * Assign result to a variable to store the data that was read.
es: y potencialmente tienen diferentes tipos de datos. * Carga con `import pandas as pd`. El alias pd se usa comúnmente para pandas. * Lea un archivo de datos de valores separados por comas (CSV) con `pd.read_csv`. * Argumento es el nombre del archivo para lectura. * Asigna el resultado a una variable para almacenar los datos que se leyeron.
uk: і потенційно мають різні типи даних. * Завантажте цю бібліотеку за допомогою `import pandas as pd`. Псевдонім pd зазвичай використовується для Pandas. * Читайте файл даних із роздільними комами (Comma Separate Values - CSV) за допомогою `pd.read_csv`. * Аргумент — це ім'я файлу, який потрібно прочитати. * Призначте результат змінній для збереження даних, які були прочитані.

source: * The columns in a dataframe are the observed variables, and the rows are the observations.
es: * Las columnas en un dataframe son las variables observadas, y las filas son las observaciones.
uk: * Стовпці у фреймі даних є змінними у спостереженнях, а рядки – спостереженнями

source: * Pandas uses backslash `\` to show wrapped lines when output is too wide to fit the screen.
es: * Pandas usa la barra invertida `\` para mostrar líneas ajustadas cuando la salida es demasiado ancha para caber en la pantalla.
uk: * Pandas використовує зворотну скісну риску `\`, щоб показати перенесення рядку, коли вивід занадто широкий, щоб поміститися на екран.

source: > ## File Not Found
es: > ## Archivo no encontrado
uk: > ## Файл не знайдено

source: > > Our lessons store their data files in a `data` sub-directory, > which is why the path to the file is `data/gapminder_gdp_oceania.csv`. > If you forget to include `data/`, > or if you include it but your copy of the file is somewhere else, > you will get a [runtime error]({{ page.root }}/04-built-in/#runtime-error) > that ends with a line like this: > > ~~~ > OSError: File b'gapminder_gdp_oceania.csv' does not exist > ~~~
es: > > Nuestras lecciones almacenan sus archivos de datos en un subdirectorio `data`, > razón por la cual la ruta al archivo es `data/gapminder_gdp_oceania.csv`. > Si olvida incluir `data/`, > o si lo incluye pero su copia del archivo está en otro lugar, > obtendrá un [runtime error]({{ page.root }}/04-built-in/#runtime-error) > que termina con una línea como esta: > > ~~~ > OSError: File b'gapminder_gdp_oceania.csv' does not exist > ~~~
uk: > > Наші уроки зберігають свої файли даних у підкаталозі `data`, > тому шлях до файлу – `data/gapminder_gdp_oceania.csv`. > Якщо ви забули включити `data/`, > або, якщо ви включите його, але ваша копія файлу знаходиться в іншому місці, > ви отримаєте [runtime error]({{ page.root }}/04-built-in/#runtime-error) > який закінчується таким рядком: > > ~~~ > OSError: File b'gapminder_gdp_oceania.csv' does not exist > ~~~

source: ## Use `index_col` to specify that a column's values should be used as row headings.
es: ## Utiliza `index_col` para especificar los valores de que columna deben usarse como fila de encabezado.
uk: ## Використовуйте `index_col`, щоб вказати, що значення стовпця мають використовуватися як заголовки рядків.

source: * Row headings are numbers (0 and 1 in this case).
es: * Los encabezados de fila son números (0 y 1 en este caso).
uk: * Заголовки рядків є числами (0 і 1 у цьому випадку).

source: * Really want to index by country.
es: * Indexar por país.
uk: * Насправді краще індексувати за назвами країн.

source: * Pass the name of the column to `read_csv` as its `index_col` parameter to do this.
es: * Pase el nombre de la columna a `read_csv` como su parámetro `index_col` para hacer esto.
uk: * Для цього передайте назву стовпця в `read_csv` як його параметр `index_col`.

source: ## Use `DataFrame.info` to find out more about a dataframe.
es: ## Utiliza `DataFrame.info` para obtener más información sobre un dataframe.
uk: ## Використовуйте `DataFrame.info`, щоб дізнатися більше про фрейми даних.

source: * This is a `DataFrame`
es: * Este es un `DataFrame`
uk: * Це `DataFrame`

source: * Two rows named `'Australia'` and `'New Zealand'`
es: * Dos filas llamadas `'Australia'` y `'Nueva Zelanda'`
uk: * Містить два рядки з назвами `'Australia'` та `'New Zealand'`

source: * Twelve columns, each of which has two actual 64-bit floating point values.
es: * Doce columnas, cada una de las cuales tiene dos valores de punto flotante de 64 bits.
uk: * А також дванадцять стовпців, кожен з яких містить два фактичних 64-розрядних значення з плаваючою крапкою.

source: * We will talk later about null values, which are used to represent missing observations.
es: * Más adelante hablaremos de valores nulos, que se utilizan para representar observaciones faltantes.
uk: * Пізніше ми поговоримо про нульові значення, які використовуються для представлення відсутніх спостережень.

source: * Uses 208 bytes of memory.
es: * Utiliza 208 bytes de memoria.
uk: * Використано 208 байтів пам'яті.

source: ## The `DataFrame.columns` variable stores information about the dataframe's columns.
es: ## La variable `DataFrame.columns` almacena información sobre las columnas del dataframe.
uk: ## Змінна `DataFrame.columns` зберігає інформацію про стовпці фрейму даних.

source: * Note that this is data, *not* a method.
es: * Ten en cuenta que se trata de datos, *no* de un método.
uk: * Зверніть увагу, що це дані, а не метод.

source: * Like `math.pi`.
es: * Como `math.pi`.
uk: * Подібно до `math.pi`.

source: * So do not use `()` to try to call it.
es: * Por lo tanto, no uses `()` para intentar llamarlo.
uk: * Тому не використовуйте `()`, щоб спробувати її викликати.

source: * Called a *member variable*, or just *member*.
es: * Se llama *variable miembro*, o simplemente *miembro*.
uk: * Ця змінна називається *змінною-членом* або просто *членом*.

source: ## Use `DataFrame.T` to transpose a dataframe.
es: ## Utiliza `DataFrame.T` para transponer el dataframe.
uk: ## Використовуйте `DataFrame.T`, щоб транспонувати фрейм даних.

source: * Sometimes want to treat columns as rows and vice versa.
es: * A veces se quiere tratar las columnas como filas y viceversa.
uk: * Іноді потрібно розглядати стовпці як рядки і навпаки.

source: * Transpose (written `.T`) doesn't copy the data, just changes the program's view of it.
es: * La transposición (escrita como `.T`) no copia los datos, solo cambia la vista del programa.
uk: * Транспонування (written `.T`) не копіює дані, а лише змінює подання даних.

source: * Like `columns`, it is a member variable.
es: * Al igual que `columns`, es una variable miembro.
uk: * Як і `columns`, це змінна-член.

source: ## Use `DataFrame.describe` to get summary statistics about data.
es: ## Utiliza `DataFrame.describe` para obtener estadísticas resumidas sobre los datos.
uk: ## Використовуйте `DataFrame.describe`, щоб отримати зведену статистику даних.

source: DataFrame.describe() gets the summary statistics of only the columns that have numerical data. All other columns are ignored, unless you use the argument `include='all'`. ~~~ print(data.describe()) ~~~ {: .language-python} ~~~ gdpPercap_1952 gdpPercap_1957 gdpPercap_1962 gdpPercap_1967 \ count 2.000000 2.000000 2.000000 2.000000 mean 10298.085650 11598.522455 12696.452430 14495.021790 std 365.560078 917.644806 677.727301 43.986086 min 10039.595640 10949.649590 12217.226860 14463.918930 25% 10168.840645 11274.086022 12456.839645 14479.470360 50% 10298.085650 11598.522455 12696.452430 14495.021790 75% 10427.330655 11922.958888 12936.065215 14510.573220 max 10556.575660 12247.395320 13175.678000 14526.124650
es: DataFrame.describe() obtiene las estadísticas de resumen de solo las columnas que tienen datos numéricos. Todas las demás columnas se ignoran, a menos que use el argumento `include = 'all'`. ~~~ print(data.describe()) ~~~ {: .language-python} ~~~ gdpPercap_1952 gdpPercap_1957 gdpPercap_1962 gdpPercap_1967 \ count 2.000000 2.000000 2.000000 2.000000 mean 10298.085650 11598.522455 12696.452430 14495.021790 std 365.560078 917.644806 677.727301 43.986086 min 10039.595640 10949.649590 12217.226860 14463.918930 25% 10168.840645 11274.086022 12456.839645 14479.470360 50% 10298.085650 11598.522455 12696.452430 14495.021790 75% 10427.330655 11922.958888 12936.065215 14510.573220 max 10556.575660 12247.395320 13175.678000 14526.124650
uk: DataFrame.describe() отримує зведену статистику лише для стовпців, які містять числові дані. Усі інші стовпці ігноруються, якщо ви не використовуєте аргумент `include='all'`. ~~~ print(data.describe()) ~~~ {: .language-python} ~~~ gdpPercap_1952 gdpPercap_1957 gdpPercap_1962 gdpPercap_1967 \ count 2.000000 2.000000 2.000000 2.000000 mean 10298.085650 11598.522455 12696.452430 14495.021790 std 365.560078 917.644806 677.727301 43.986086 min 10039.595640 10949.649590 12217.226860 14463.918930 25% 10168.840645 11274.086022 12456.839645 14479.470360 50% 10298.085650 11598.522455 12696.452430 14495.021790 75% 10427.330655 11922.958888 12936.065215 14510.573220 max 10556.575660 12247.395320 13175.678000 14526.124650

source: * Not particularly useful with just two records,
es: * No es particularmente útil con solo dos registros,
uk: * Не дуже корисно лише з двома записами,

source: but very helpful when there are thousands.
es: pero muy útil cuando hay miles.
uk: але дуже корисно, коли таких записів тисячі.

source: > ## Reading Other Data
es: > ## Lectura de otros datos
uk: > ## Читання інших даних

source: > > Read the data in `gapminder_gdp_americas.csv` > (which should be in the same directory as `gapminder_gdp_oceania.csv`) > into a variable called `americas` > and display its summary statistics. > > > ## Solution > > To read in a CSV, we use `pd.read_csv` and pass the filename 'data/gapminder_gdp_americas.csv' to it. We also once again pass the > > column name 'country' to the parameter `index_col` in order to index by country: > > ~~~ > > americas = pd.read_csv('data/gapminder_gdp_americas.csv', index_col='country') > > ~~~ > >{: .language-python}
es: > > Lea los datos en `gapminder_gdp_americas.csv` > (que debe estar en el mismo directorio que `gapminder_gdp_oceania.csv`) > en una variable llamada `americas` > y muestra sus estadísticas de resumen. > > > ## Solución > > Para leer en un CSV, usamos `pd.read_csv` y le pasamos el nombre de archivo 'data/gapminder_gdp_americas.csv'. También una vez más pasamos el > > nombre de columna 'country' al parámetro `index_col` para indexar por país: > > ~~~ > > americas = pd.read_csv('data/gapminder_gdp_americas.csv', index_col='country') > > ~~~ > >{: .language-python}
uk: > >Зчитайте дані з файлу `gapminder_gdp_americas.csv` > (який має бути в тому ж каталозі, що й .`gapminder_gdp_oceania.csv`) > у змінну `americas` > і подайте його підсумкову статистику. > > > ## Рішення > > Для зчитування в форматі CSV ми використовуємо функцію `pd.read_csv` і передаємо назву файлу 'data/gapminder_gdp_americas.csv' в якості аргументу. Ми також передаємо > > назву стовпцю 'country' як параметр `index_col`, щоб індексувати за назвами країн: > > ~~~ > > americas = pd.read_csv('data/gapminder_gdp_americas.csv', index_col='country') > > ~~~ > >{: .language-python}

source: > ## Inspecting Data.
es: > ## Inspección de datos.
uk: > ## Перевірка даних
