Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: * Also get the same result printing `data.gdpPercap_1952` (not recommended, because easily confused with `.` notation for methods)
es: * También puede dar el mismo resultado imprimiendo `data.gdpPercap_1952` ( No recomendado, porque es fácil confundir con la notación `.` por los métodos)
uk: * Також можна отримати той самий результат, застосовуючи нотацію `data.gdpPercap_1952` (не рекомендовано, оскільки її легко сплутати з позначенням `.` для методів).

source: ## Select multiple columns or rows using `DataFrame.loc` and a named slice.
es: ## Selecciona multiples columnas o filas usando `DataFrame.loc` y un segmento con nombre.
uk: ## Вибирайте кілька стовпців або рядків за допомогою `DataFrame.loc` та визначеного зрізу.

source: In the above code, we discover that **slicing using `loc` is inclusive at both ends**, which differs from **slicing using `iloc`**, where slicing indicates everything up to but not including the final index.
es: En el código de arriba, descubrimos que **slicing usando `loc` es inclusivo en ambos extremos**, lo cual difiere de **slicing usando `iloc`**, donde el corte indica todo pero sin incluir el índice final.
uk: У наведеному вище коді ми бачимо, що **зріз із застосуванням `loc` включає обидва виміри**, що відрізняється від **зрізу із застосуванням `iloc`**, де зріз включає все, крім кінцевого індексу.

source: ## Result of slicing can be used in further operations.
es: ## El Resultado de los cortes pueden ser usados en otras operaciones.
uk: ## Результат застосування операції зрізу може бути використаний у подальших операціях.

source: * Usually don't just print a slice.
es: * Usualmente no solo imprimimos un corte
uk: * Зазвичай не просто друкують фрагмент.

source: * All the statistical operators that work on entire dataframes
es: * Todos los operadores estadísticos que trabajan sobre DataFrames completos.
uk: * Усі статистичні оператори, які працюють із цілими фреймами даних,

source: work the same way on slices. * E.g., calculate max of a slice.
es: trabajan de igual manera sobre los cortes Por ejemplo, calcular el max de un corte
uk: також працюють на зрізах. * Наприклад, обчислення максимальної кількості за стовпцями зрізу.

source: ## Use comparisons to select data based on value.
es: ## Usa compariciones para seleccionar datos basados en el valor.
uk: ## Використовуйте порівняння для вибору даних на основі певного значення.

source: * Comparison is applied element by element.
es: * La comparación es aplicada elemento por elemento.
uk: * Порівняння здійснюється поелементно.

source: * Returns a similarly-shaped dataframe of `True` and `False`.
es: * Regresa un DataFrame con una forma similar de `True` y `False`.
uk: * Повертає фрейм даних подібної форми, що містить `True` і `False`.

source: ~~~ # Use a subset of data to keep output readable. subset = data.loc['Italy':'Poland', 'gdpPercap_1962':'gdpPercap_1972'] print('Subset of data:\n', subset) # Which values were greater than 10000 ? print('\nWhere are values large?\n', subset > 10000) ~~~
es: ~~~ # Usa un subconjunto de datos para mantener la salida legible. subset = data.loc['Italy':'Poland', 'gdpPercap_1962':'gdpPercap_1972'] print('Subset of data:\n', subset) # Cuales valores son más grandes que 10000 ? print('\nWhere are values large?\n', subset > 10000) ~~~
uk: ~~~ # Використовуйте підмножину даних, щоб результат був читабельним. subset = data.loc['Italy':'Poland', 'gdpPercap_1962':'gdpPercap_1972'] print('Підмножина даних:\n', subset) # Які значення були більшими за 10000? print('\nЯкі значення більші?\n', subset > 10000) ~~~

source: Where are values large? gdpPercap_1962 gdpPercap_1967 gdpPercap_1972 country Italy False True True Montenegro False False False Netherlands True True True Norway True True True Poland False False False ~~~
es: Donde están los valores grandes? gdpPercap_1962 gdpPercap_1967 gdpPercap_1972 country Italy False True True Montenegro False False False Netherlands True True True Norway True True True Poland False False False ~~~
uk: Які значення більші? gdpPercap_1962 gdpPercap_1967 gdpPercap_1972 country Italy False True True Montenegro False False False Netherlands True True True Norway True True True Poland False False False ~~~

source: ## Select values or NaN using a Boolean mask.
es: ## Selecciona valores o NaN usando una máscara Booleana.
uk: ## Виберіть значення або NaN за допомогою булевої маски.

source: * A frame full of Booleans is sometimes called a *mask* because of how it can be used.
es: * Un marco lleno de Booleanos es llamado algunas veces *mask* por cómo se puede usar.
uk: * Фрейм, повний булевих значень, іноді називають *маскою* через спосіб його використання.

source: * Get the value where the mask is true, and NaN (Not a Number) where it is false.
es: * Obtendras el valor donde la máscara es verdadera y NaN (no es un número) donde es falsa
uk: * Отримайте значення, якщо маска є істинною, і NaN (не число), якщо вона хибна.

source: * Useful because NaNs are ignored by operations like max, min, average, etc.
es: * Esto es útil porque los NaNs son ignorados por operadores como max, min, average, etc.
uk: * Корисно, оскільки NaN ігноруються такими операціями, як max, min, average тощо.

source: ## Group By: split-apply-combine
es: ## Group By: cortar-aplicar-combinar
uk: ## Групувати за: розділити-застосувати-комбінувати

source: Pandas vectorizing methods and grouping operations are features that provide users much flexibility to analyse their data.
es: Los métodos de vectorización de pandas y las operaciones de agrupación son características que brindan a los usuarios mucha flexibilidad para analizar sus datos.
uk: Методи векторизації та операції групування Pandas — це функції, які надають користувачам велику гнучкість для аналізу своїх даних.

source: For instance, let's say we want to have a clearer view on how the European countries split themselves according to their GDP.
es: Por ejemplo, supongamos que queremos tener una visión más clara de cómo los países europeos se dividen según su PIB (GDP).
uk: Наприклад, скажімо, ми хочемо мати більш чітке уявлення про те, як європейські країни розподілені відповідно до свого ВВП.

source: 1. We may have a glance by splitting the countries in two groups during the years surveyed,
es: 1. Podemos echar un vistazo dividiendo los países en dos grupos durante los años encuestados,
uk: 1. Ми можемо поглянути, розділивши країни на дві групи протягом досліджуваних років,

source: those who presented a GDP *higher* than the European average and those with a *lower* GDP. 2. We then estimate a *wealthy score* based on the historical (from 1962 to 2007) values, where we account how many times a country has participated in the groups of *lower* or *higher* GDP
es: aquellos que presentaron un PIB *más alto* que el promedio europeo y aquellos con un *PIB* más *bajo*. 2. Luego estimamos un *puntaje de Riqueza* basado en los valores históricos (de 1962 a 2007), donde contamos cuántas veces un país ha participado en los grupos de PIB *más bajo* o *más alto*
uk: на тих, у кого ВВП *вищий* за середній європейський, та тих, у кого ВВП *нижчий*. 2. Потім ми оцінюємо *показник заможності* на основі історичних значень (з 1962 по 2007 рік), де ми враховуємо, скільки разів країна була у групах з *нижчим* або *вищим* ВВП

source: Finally, for each group in the `wealth_score` table, we sum their (financial) contribution across the years surveyed:
es: Finalmente, para cada grupo en la tabla `wealth_score` , nosotros sumamos sus contribuciones (financieras) a través de los años encuestados:
uk: Нарешті, для кожної групи в таблиці `wealth_score` ми підсумовуємо їх (фінансовий) внесок за роки дослідження:

source: > ## Selection of Individual Values
es: > ## Selección de valores individuales
uk: > ## Вибір індивідуальних значень

source: > > Assume Pandas has been imported into your notebook > and the Gapminder GDP data for Europe has been loaded: > > ~~~ > import pandas as pd > > df = pd.read_csv('data/gapminder_gdp_europe.csv', index_col='country') > ~~~ > {: .language-python} > > Write an expression to find the Per Capita GDP of Serbia in 2007.
es: > > Supongamos que se ha importado pandas en tu notebook > y se han cargado los datos del PIB de Gapminder para Europa: > > ~~~ > import pandas como pd > > df = pd.read_csv ('data / gapminder_gdp_europe.csv ', index_col =' country ') > ~~~ > {: .language-python} > > Escribe una expresión para encontrar el PIB per cápita de Serbia en 2007
uk: > > Припустімо, Pandas було імпортовано у ваш блокнот > і дані Gapminder про ВВП Європи завантажено: > > ~~~ > import pandas as pd > > df = pd.read_csv('data/gapminder_gdp_europe.csv', index_col='country') > ~~~ > {: .language-python} > > Напишіть вираз для визначення ВВП на душу населення в Сербії у 2007 році.

source: > > > ## Solution > > The selection can be done by using the labels for both the row ("Serbia") and the column ("gdpPercap_2007"): > > ~~~ > > print(df.loc['Serbia', 'gdpPercap_2007']) > > ~~~ > > {: .language-python} > > The output is > > ~~~ > > 9786.534714 > > ~~~ > >{: .output}
es: > > > ## Solución > > La selección puede ser hecha usando las etiquetas para ambos, la fila ("Serbia") y la columna("gdpPercap_2007"): > > ~~~ > > print(df.loc['Serbia', 'gdpPercap_2007']) > > ~~~ > > {: .language-python} > > The output is > > ~~~ > > 9786.534714 > > ~~~ > >{: .output}
uk: > > > ## Рішення > > Вибір можна зробити за допомогою міток як для рядка ("Serbia"), так і для стовпця ("gdpPercap_2007"): > > ~~~ > > print(df.loc['Serbia', 'gdpPercap_2007']) > > ~~~ > > {: .language-python} > > Результат > > ~~~ > > 9786.534714 > > ~~~ > >{: .output}

source: > ## Extent of Slicing
es: > ## Grado de corte
uk: > ## Ступінь зріза

source: > > 1. Do the two statements below produce the same output? > 2. Based on this, > what rule governs what is included (or not) in numerical slices and named slices in Pandas? > > ~~~ > print(df.iloc[0:2, 0:2]) > print(df.loc['Albania':'Belgium', 'gdpPercap_1952':'gdpPercap_1962']) > ~~~ > {: .language-python}
es: > > 1. ¿Las dos instrucciones a continuación producen el mismo resultado? > 2. Basados en esto, > Que regla gobierna que es incluido (o no) en cortes numéricos y cortes de nombres en Pandas? > > ~~~ > print(df.iloc[0:2, 0:2]) > print(df.loc['Albania':'Belgium', 'gdpPercap_1952':'gdpPercap_1962']) > ~~~ > {: .language-python}
uk: > > 1. Чи дають два наведені нижче твердження однаковий результат? > 2. Виходячи з цього, > яке правило керує тим, що включено (чи ні) до числових і іменованих зрізів у Pandas? > > ~~~ > print(df.iloc[0:2, 0:2]) > print(df.loc['Albania':'Belgium', 'gdpPercap_1952':'gdpPercap_1962']) > ~~~ > {: .language-python}

source: > > No, they do not produce the same output! The output of the first statement is:
es: > > No, ¡ellos no producen la misma salida! La salida de la primera instrucción es:
uk: > > Ні, вони не дають однакові результати! Результатом першого виразу є:

source: > > country
es: > > pais

source: > > The second statement gives:
es: > > La segunda instrucción dá:
uk: > > Друге твердження дає:

source: > > country
es: > > pais

source: > > Clearly, the second statement produces an additional column and an additional row compared to the first statement.
es: > > Claramente, la segunda instrucción produce una columna y una fila adicional comparado a la primera instrucción.
uk: > > Очевидно, що другий оператор створює додатковий стовпець і додатковий рядок порівняно з першим оператором.

source: > > What conclusion can we draw? We see that a numerical slice, 0:2, *omits* the final index (i.e. index 2)
es: > >¿Qué conclusión podemos sacar? Vemos que un corte numérico, 0: 2, *omite* el índice final (es decir, el índice 2)
uk: > > Який висновок ми можемо зробити? Ми бачимо, що числовий зріз 0:2 *опускає* остаточний індекс (тобто індекс 2)

source: > > in the range provided,
es: > > en el rango proporcionado,
uk: > > в наданому діапазоні,

source: > > while a named slice, 'gdpPercap_1952':'gdpPercap_1962', *includes* the final element.
es: > > mientras un corte con nombre, 'gdpPercap_1952':'gdpPercap_1962', *incluye* el elemento final.
uk: > > тоді як іменований зріз, 'gdpPercap_1952':'gdpPercap_1962', *включає* останній елемент.

source: > ## Reconstructing Data
es: > ## Reconstruyendo Datos
uk: > ## Реконструювання даних

source: > > Explain what each line in the following short program does: > what is in `first`, `second`, etc.? > > ~~~ > first = pd.read_csv('data/gapminder_all.csv', index_col='country') > second = first[first['continent'] == 'Americas'] > third = second.drop('Puerto Rico') > fourth = third.drop('continent', axis = 1) > fourth.to_csv('result.csv') > ~~~ > {: .language-python}
es: > > Explica que hace cada linea en el siguiente programa corto: > ¿Que hay en `first`, `second`, etc.? > > ~~~ > first = pd.read_csv('data/gapminder_all.csv', index_col='country') > second = first[first['continent'] == 'Americas'] > third = second.drop('Puerto Rico') > fourth = third.drop('continent', axis = 1) > fourth.to_csv('result.csv') > ~~~ > {: .language-python}
uk: > > Поясніть, що робить кожен рядок у наступній короткій програмі: > що в `first`, `second`, etc.? > > ~~~ > first = pd.read_csv('data/gapminder_all.csv', index_col='country') > second = first[first['continent'] == 'Americas'] > third = second.drop('Puerto Rico') > fourth = third.drop('continent', axis = 1) > fourth.to_csv('result.csv') > ~~~ > {: .language-python}

source: > > > ## Solution > > Let's go through this piece of code line by line. > > ~~~ > > first = pd.read_csv('data/gapminder_all.csv', index_col='country') > > ~~~ > > {: .language-python} > > This line loads the dataset containing the GDP data from all countries into a dataframe called > > `first`. The `index_col='country'` parameter selects which column to use as the > > row labels in the dataframe. > > ~~~ > > second = first[first['continent'] == 'Americas'] > > ~~~ > > {: .language-python} > > This line makes a selection: only those rows of `first` for which the 'continent' column matches > > 'Americas' are extracted. Notice how the Boolean expression inside the brackets, > > `first['continent'] == 'Americas'`, is used to select only those rows where the expression is true. > > Try printing this expression! Can you print also its individual True/False elements? > > (hint: first assign the expression to a variable) > > ~~~ > > third = second.drop('Puerto Rico') > > ~~~ > > {: .language-python} > > As the syntax suggests, this line drops the row from `second` where the label is 'Puerto Rico'. The > > resulting dataframe `third` has one row less than the original dataframe `second`. > > ~~~ > > fourth = third.drop('continent', axis = 1) > > ~~~ > > {: .language-python} > > Again we apply the drop function, but in this case we are dropping not a row but a whole column. > > To accomplish this, we need to specify also the `axis` parameter (we want to drop the second column > > which has index 1). > > ~~~ > > fourth.to_csv('result.csv') > > ~~~ > > {: .language-python} > > The final step is to write the data that we have been working on to a csv file. Pandas makes this easy > > with the `to_csv()` function. The only required argument to the function is the filename. Note that the > > file will be written in the directory from which you started the Jupyter or Python session.
es: > > > ## Solución > > Repasemos este código línea por línea. > > ~~~ > > first = pd.read_csv('data/gapminder_all.csv', index_col='country') > > ~~~ > > {: .language-python} > > Esta linea carga el set de datos conteniendo los datos del PIB (GDP) de todos los países dentro de un DataFrame llamado > > `first`. El parámetro `index_col='country'` selecciona cual columna usar como las > > etiquetas de las filas en el dataframe. > > ~~~ > > second = first[first['continent'] == 'Americas'] > > ~~~ > > {: .language-python} > > Esta linea hace una selección: solo se extraen aquellas filas de `first` para los cuales la columna 'continent' coincide con > > 'Americas'. Nota como la expresión Booleana dentro de los paréntesis, > > `first['continent'] == 'Americas'`, es usada para seleccionar solo aquellas filas donde la expresión es verdadera. > > Intenta imprimir esta expresión! ¿Puedes imprimir también los valores individuales de los elementos True/False? > > (sugerencia: Primero asigna la expresión a una variable) > > ~~~ > > third = second.drop('Puerto Rico') > > ~~~ > > {: .language-python} > > Como sugiere la sintaxis, esta linea remueve la fila de `second` donde la etiqueta es 'Puerto Rico'. El > > resultado DataFrame `third` tiene una fila menos que el DataFrame original `second`. > > ~~~ > > fourth = third.drop('continent', axis = 1) > > ~~~ > > {: .language-python} > > Otra vez aplicamos la función drop, pero en este caso no estamos removiendo una fila sino una columna completa. > > Para lograr esto, necesitamos especificar también el parámetro `axis` (queremos remover la segunda columna > > la cual tiene el indice 1). > > ~~~ > > fourth.to_csv('result.csv') > > ~~~ > > {: .language-python} > > El paso final es escribir los datos que hemos trabajado en un archivo csv. Pandas hace esto muy facil > > con la función `to_csv()`. El único argumento requerido por la función es el nombre del archivo. Nota que el > > archivo será escrito en el directorio en el cual tu hayas iniciado la sesión de Jupyter o Python.
uk: > > > ## Рішення > > Давайте переглянемо цей фрагмент коду рядок за рядком. > > ~~~ > > first = pd.read_csv('data/gapminder_all.csv', index_col='country') > > ~~~ > > {: .language-python} > > Цей рядок завантажує набір даних, що містить дані про ВВП усіх країн, у фрейм даних під назвою > > `first`. Параметр `index_col='country'` вибирає, який стовпець використовувати як > > мітки рядків у фреймі даних. > > ~~~ > > second = first[first['continent'] == 'Americas'] > > ~~~ > > {: .language-python} > > Цей рядок забезпечує вибір: лише ті рядки `first`, для яких стовпець 'continent' > > відповідає значенню 'Americas'. Зверніть увагу, як логічний вираз у дужках, > > `first['continent'] == 'Americas'`, використовується для вибору лише тих рядків, де вираз є істинним. > > Спробуйте надрукувати цей вираз! Чи можете ви також надрукувати його окремі елементи True/False? > > (підказка: спочатку призначте вираз змінній) > > ~~~ > > third = second.drop('Puerto Rico') > > ~~~ > > {: .language-python} > > Як підказує синтаксис, цей вираз вилучає рядок із `second` з міткою 'Пуерто-Ріко'. > > Отриманий фрейм даних `third` має на один рядок менше, ніж вихідний фрейм даних `second`. > > ~~~ > > fourth = third.drop('continent', axis = 1) > > ~~~ > > {: .language-python} > > Ми знову застосовуємо функцію drop, але в цьому випадку ми видаляємо не рядок, а цілий стовпець. > > Щоб виконати це, нам також потрібно вказати параметр `axis` (ми хочемо відкинути другий стовпець > > який має індекс 1). > > ~~~ > > fourth.to_csv('result.csv') > > ~~~ > > {: .language-python} > > Останнім кроком є ​​запис даних, над якими ми працювали, у файл CSV. Panda робить це легко > > за допомогою функції `to_csv()` . Єдиним обов’язковим аргументом для функції є ім’я файлу. Зверніть увагу, що > > файл буде записано в каталозі, з якого ви розпочали сеанс Jupyter або Python.

source: > ## Selecting Indices
es: > ## Seleccionando Indices
uk: > ## Вибір індексів

source: > > Explain in simple terms what `idxmin` and `idxmax` do in the short program below. > When would you use these methods? > > ~~~ > data = pd.read_csv('data/gapminder_gdp_europe.csv', index_col='country') > print(data.idxmin()) > print(data.idxmax()) > ~~~ > {: .language-python}
es: > > Explica en términos simples que hace `idxmin` y `idxmax` en el breve programa a continuación. > ¿Cuándo usarías estos métodos? > > ~~~ > data = pd.read_csv('data/gapminder_gdp_europe.csv', index_col='country') > print(data.idxmin()) > print(data.idxmax()) > ~~~ > {: .language-python}
uk: > > Поясніть простими словами, що роблять `idxmin` і `idxmax` у короткій програмі нижче. > Коли б ви використовували ці методи? > > ~~~ > data = pd.read_csv('data/gapminder_gdp_europe.csv', index_col='country') > print(data.idxmin()) > print(data.idxmax()) > ~~~ > {: .language-python}

source: > > > ## Solution > > For each column in `data`, `idxmin` will return the index value corresponding to each column's minimum; > > `idxmax` will do accordingly the same for each column's maximum value. > > > > You can use these functions whenever you want to get the row index of the minimum/maximum value and not the actual minimum/maximum value.
es: > > > ## Solución > > Por cada columna en `data`, `idxmin` retornará el indice del valor correspondiente al mínimo de cada columna: > > `idxmax` hará lo mismo para el valor máximo de cada columna. > > > > Tu puedes usar estas funciones, siempre que quieras obtener el indice de la fila con el mínimo / máximo valor y no el valor mínimo /máximo actual.
uk: > > > ## Рішення > >Для кожного стовпця в `data` `idxmin` поверне значення індексу, що відповідає мінімуму кожного стовпця; > > `idxmax` зробить те саме для максимального значення кожного стовпця. > > > > Ви можете використовувати ці функції щоразу, коли хочете отримати індекс рядка мінімального/максимального значення, а не фактичне мінімальне/максимальне значення.

source: > ## Practice with Selection
es: > ## Practica con Selección
uk: > ## Практика з вибором

source: > > Assume Pandas has been imported and the Gapminder GDP data for Europe has been loaded. > Write an expression to select each of the following: > > 1. GDP per capita for all countries in 1982. > 2. GDP per capita for Denmark for all years. > 3. GDP per capita for all countries for years *after* 1985. > 4. GDP per capita for each country in 2007 as a multiple of > GDP per capita for that country in 1952.
es: > > Asume que Pandas ha sido importado y los datos de GDP de Gapminder para Europe han sido cargados. > Escribe una expresión para seleccionar cada uno de los siguientes: > > 1. GDP per capita para todos los países en 1982. > 2. GDP per capita para Denmark para todos los años. > 3. GDP per capita para todos los países para los años *después de* 1985. > 4. GDP per capita para cada país en 2007 como un múltiple de > GDP per capita para aquellos países en 1952.
uk: > > Припустімо, що Pandas було імпортовано та дані Gapminder про ВВП для Європи завантажено. > Напишіть вираз, щоб вибрати кожне з наступного: > > 1. ВВП на душу населення для всіх країн у 1982р. > 2. ВВП на душу населення для Данії за всі роки. > 3. ВВП на душу населення для всіх країн за роки *після* 1985. > 4. ВВП на душу населення для кожної країни у 2007 р. як кратне > ВВП на душу населення для цієї країни в 1952 році.
