Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: {: .language-python} ~~~ primes is currently: [2, 3, 5, 7, 9] primes has now become: [2, 3, 5, 7, 9, 11, 13, 17, 19] primes has finally become: [2, 3, 5, 7, 9, 11, 13, 17, 19, [37, 41, 43, 47]] ~~~
es: {: .language-python} ~~~ primes es: [2, 3, 5, 7, 9] primes ahora primes es: [2, 3, 5, 7, 9, 11, 13, 17, 19] finalmente primes es: [2, 3, 5, 7, 9, 11, 13, 17, 19, [37, 41, 43, 47]] ~~~
uk: {: .language-python} ~~~ поточний список primes: [2, 3, 5, 7, 9] розширений список primes: [2, 3, 5, 7, 9, 11, 13, 17, 19] фінальний список primes: [2, 3, 5, 7, 9, 11, 13, 17, 19, [37, 41, 43, 47]] ~~~

source: Note that while `extend` maintains the "flat" structure of the list, appending a list to a list makes the result two-dimensional - the last element in `primes` is a list, not an integer.
es: Ten en cuenta que si bien `extend` mantiene la estructura "plana" de la lista, agregar una lista a una lista produce el resultado bidimensional: el último elemento en 'primes' es una lista, no un entero.
uk: Зауважимо, що хоча `extend` підтримує "плоску" структуру списку, додавання списку до списку дає результат двовимірний - останній елемент у `primes` є списком, а не цілим числом.

source: ## Use `del` to remove items from a list entirely.
es: ## Usa `del` para remover elementos de una lista.
uk: ## Щоб повністю видалити елементи зі списку, використовуйте `del`.

source: * `del list_name[index]` removes an item from a list and shortens the list.
es: * `del list_name[index]` remueve un elemento de una lista y la acorta.
uk: * `del list_name[index]` видаляє елемент зі списку та скорочує список.

source: * Not a function or a method, but a statement in the language.
es: * No es una función o un método, es una sentencia del lenguaje.
uk: * `del` - це оператор мови програмування, а не функція і не метод.

source: ~~~ primes = [2, 3, 5, 7, 9] print('primes before removing last item:', primes) del primes[4] print('primes after removing last item:', primes) ~~~
es: ~~~ primes = [2, 3, 5, 7, 9] print('primes antes de remover el último elemento:', primes) del primes[4] print('primes después de remover el último elemento:', primes) ~~~
uk: ~~~ primes = [2, 3, 5, 7, 9] print('список primes перед видаленням останнього елемента:', primes) del primes[4] print('список primes після видалення останнього елемента:', primes) ~~~

source: {: .language-python} ~~~ primes before removing last item: [2, 3, 5, 7, 9] primes after removing last item: [2, 3, 5, 7] ~~~
es: {: .language-python} ~~~ primes antes de remover el último elemento: [2, 3, 5, 7, 9] primes después de remover el último elemento: [2, 3, 5, 7] ~~~
uk: {: .language-python} ~~~ список primes перед видаленням останнього елемента: [2, 3, 5, 7, 9] список primes після видалення останнього елемента: [2, 3, 5, 7] ~~~

source: ## The empty list contains no values.
es: ## La lista vacía no contiene valores.
uk: ## Порожній список не містить жодних значень.

source: * Use `[]` on its own to represent a list that doesn't contain any values.
es: * Usa `[ ]` para representar una lista que no contiene ningún valor.
uk: * Щоб створити список, який не містить жодних значень, використовуйте `[]`.

source: * "The zero of lists."
es: * "El cero de las listas."
uk: * Порожній список - це "нуль списків."

source: * Helpful as a starting point for collecting values
es: * Útil como punto de partida para recolectar valores.
uk: * Він є корисним як початкова точка для збору значень

source: (which we will see in the [next episode]({% link _episodes/12-for-loops.md %}).
es: (que veremos en el [próximo episodio]({% link _episodes/12-for-loops.md %}).
uk: (ми це побачимо в [наступному епізоді]({% link _episodes/12-for-loops.md %}).

source: ## Lists may contain values of different types.
es: ## Las listas pueden contener valores de diferentes tipos.
uk: ## Списки можуть містити значення різних типів.

source: * A single list may contain numbers, strings, and anything else.
es: * Una única lista puede contener números, cadenas y cualquier otra cosa.
uk: * Один список може містити числа, рядки та будь-що інше.

source: ## Character strings can be indexed like lists.
es: ## Las secuencias de caracteres pueden indexarse de la misma manera que las listas.
uk: ## Рядки символів можна індексувати як списки.

source: * Get single characters from a character string using indexes in square brackets.
es: * Obtén caracteres individuales de una secuencia de caracteres utilizando índices entre corchetes.
uk: * Отримати окремі символи з рядка символів можна за допомогою індексів у квадратних дужках.

source: ~~~ element = 'carbon' print('zeroth character:', element[0]) print('third character:', element[3]) ~~~
es: ~~~ element = 'carbon' print('carácter cero:', element[0]) print('tercer carácter:', element[3]) ~~~
uk: ~~~ element = 'carbon' print('нульовий символ:', element[0]) print('третій символ:', element[3]) ~~~

source: {: .language-python} ~~~ zeroth character: c third character: b ~~~
es: {: .language-python} ~~~ carácter cero: c tercer carácter: b ~~~
uk: {: .language-python} ~~~ нульовий символ: c третій символ: b ~~~

source: ## Character strings are immutable.
es: ## Las secuencias de caracteres son inmutables.
uk: ## Рядки символів незмінні.

source: * Cannot change the characters in a string after it has been created.
es: * No se pueden cambiar los caracteres de una secuencia de caracteres después de que se haya creado.
uk: * Неможливо змінити символи в рядку після його створення.

source: * *Immutable*: can't be changed after creation.
es: * *Inmutable*: no se puede cambiar luego de su creación.
uk: * *Незмінний* - тобто який не можна змінити після створення.

source: * In contrast, lists are *mutable*: they can be modified in place.
es: * Por el contrario, las listas son *mutables*: se pueden modificar.
uk: * На відміну від рядків, списки є *змінними*: їх можна змінювати на місці.

source: * Python considers the string to be a single value with parts,
es: * Python considera la secuencia de caracteres como un único valor con partes,
uk: * Python розглядає рядок як одне значення з частинами,

source: not a collection of values.
es: no una colección de valores.
uk: а не як сукупність значень.

source: * Lists and character strings are both *collections*.
es: * Las listas y las secuencias de caracteres son *colecciones*.
uk: * Списки та рядки символів є *колекціями*.

source: ## Indexing beyond the end of the collection is an error.
es: ## Indexar más allá del final de una colección es un error.
uk: ## Індексація після кінця колекції є помилкою.

source: * Python reports an `IndexError` if we attempt to access a value that doesn't exist.
es: * Python reporta un `IndexError` si intentamos acceder a un valor que no existe.
uk: * Python повідомляє про помилку `IndexError`, якщо ми намагаємося отримати доступ до значення, якого не існує.

source: * This is a kind of [runtime error]({{ page.root }}/04-built-in/#runtime-error).
es: * Este es un tipo de [error de ejecución]({{ page.root }}/04-built-in/#runtime-error).
uk: * Це свого роду [помилка виконання]({{ page.root }}/04-built-in/#runtime-error).

source: * Cannot be detected as the code is parsed
es: * No se puede detectar mientras se analiza el código
uk: * Цю помилку неможливо виявити під час аналізу коду,

source: because the index might be calculated based on data.
es: porque el índice podría calcularse en función de los datos.
uk: оскільки індекс може бути розрахований на основі даних.

source: ~~~ print('99th element of element is:', element[99]) ~~~
es: ~~~ print('El elemento número 99 es:', element[99]) ~~~
uk: ~~~ print('99м елементом списку element є:', element[99]) ~~~

source: > ## Fill in the Blanks
es: > ## Rellena los espacios en blanco
uk: > ## Заповнити пропущені місця

source: > > Fill in the blanks so that the program below produces the output shown. > > ~~~ > values = ____ > values.____(1) > values.____(3) > values.____(5) > print('first time:', values) > values = values[____] > print('second time:', values) > ~~~ > {: .language-python} > > ~~~ > first time: [1, 3, 5] > second time: [3, 5] > ~~~
es: > > Rellena los espacios en blanco para que el programa produzca el resultado mostrado. > > ~~~ > values = ____ > values.____(1) > values.____(3) > values.____(5) > print('primera vez:', values) > values = values[____] > print('segunda vez:', values) > ~~~ > {: .language-python} > > ~~~ > primera vez: [1, 3, 5] > segunda vez: [3, 5] > ~~~
uk: > > Заповніть порожні поля, щоб програма, наведена нижче, видала показаний результат. > > ~~~ > values = ____ > values.____(1) > values.____(3) > values.____(5) > print('перший раз:', values) > values = values[____] > print('другий раз:', values)> ~~~ > {: .language-python} > > ~~~ > перший раз: [1, 3, 5] > другий раз: [3, 5] > ~~~

source: > > > ## Solution > > ~~~ > > values = [] > > values.append(1) > > values.append(3) > > values.append(5) > > print('first time:', values) > > values = values[1:] > > print('second time:', values) > > ~~~ > > {: .language-python}
es: > > > ## Solución > > ~~~ > > values = [] > > values.append(1) > > values.append(3) > > values.append(5) > > print('primera vez:', values) > > values = values[1:] > > print('segunda vez:', values) > > ~~~ > > {: .language-python}
uk: > > > ## Рішення > > ~~~ > > values = [] > > values.append(1) > > values.append(3) > > values.append(5) > > print('перший раз:', values) > > values = values[1:] > > print('другий раз:', values) > > ~~~ > > {: .language-python}

source: > ## How Large is a Slice?
es: > ## ¿Qué tan grande es un corte?
uk: > ## Наскільки є великим зріз?

source: > > If 'low' and 'high' are both non-negative integers, > how long is the list `values[low:high]`? > > > ## Solution > > The list `values[low:high]` has `high - low` elements. For example, > > `values[1:4]` has the 3 elements `values[1]`, `values[2]`, and `values[3]`. > > Note that the expression will only work if `high` is less than the total > > length of the list `values`.
es: > > Si 'low' y 'high' son dos enteros no-negativos, > ¿qué tan grande es la lista `values[low:high]`? > > > ## Solución > > La lista `values[low:high]` tiene `high - low` elementos. Por ejemplo, > > `values[1:4]` tiene 3 elementos `values[1]`, `values[2]`, y `values[3]`. > > Nota que la expresión sólo funciona si `high` es menor que la longitud > > total de `valores` de la lista.
uk: > > Якщо «low» і «high» є невід’ємними цілими числами, > яка довжина списку `values[low:high]`?> > > ## Рішення > > Список `values[low:high]` має `high - low` elements. Наприклад, > > `values[1:4]` має 3 елементи `values[1]`, `values[2]`, and `values[3]`. > >Зауважимо, що зріз працюватиме, лише якщо `high` менше загальної > > довжини списку `значень`.

source: > ## From Strings to Lists and Back
es: > ## De Secuencias de caracteres a Listas y Viceversa
uk: > ## Від рядків до списків і назад.

source: > > Given this: > > ~~~ > print('string to list:', list('tin')) > print('list to string:', ''.join(['g', 'o', 'l', 'd'])) > ~~~ > {: .language-python} > ~~~ > ['t', 'i', 'n'] > 'gold' > ~~~
es: > > Dado esto: > > ~~~ > print('cadena a lista:', list('tin')) > print('lista a cadena:', ''.join(['g', 'o', 'l', 'd'])) > ~~~ > {: .language-python} > ~~~ > ['t', 'i', 'n'] > 'gold' > ~~~
uk: > > Дано: > > ~~~ > print('рядок у список:', list('tin')) > print('список у рядок:', ''.join(['g', 'o', 'l', 'd'])) > ~~~ > {: .language-python} > ~~~ > ['t', 'i', 'n'] > 'gold' > ~~~

source: > > 1. What does `list('some string')` do? > 2. What does `'-'.join(['x', 'y', 'z'])` generate? > > > ## Solution > > 1. [`list('some string')`](https://docs.python.org/3/library/stdtypes.html#list) converts a string into a list containing all of its characters. > > 2. [`join`](https://docs.python.org/3/library/stdtypes.html#str.join) returns a string that is the _concatenation_ > > of each string element in the list and adds the separator between each element in the list. This results in > > `x-y-z`. The separator between the elements is the string that provides this method.
es: > > 1. ¿Qué hace `list('cadena')`? > 2. ¿Qué genera `'-'.join(['x', 'y', 'z'])`? > > > ## Solución > > 1. [`list('cadena')`](https://docs.python.org/3/library/stdtypes.html#list) convierte una secuencia de caracteres en una lista que contiene todos los caracteres. > > 2. [`join`](https://docs.python.org/3/library/stdtypes.html#str.join) devuelve una secuencia de caracteres que es una _concatenación_ > > de cada elemento de la secuencia en la lista y añade un separador entre elementos en la lista. Esto resulta > > `x-y-z`. El separador entre los elementos es el que provee el método.
uk: > > 1. Що робить `list('якийсь рядок')`? > 2. Що генерує `'-'.join(['x', 'y', 'z'])`?> > > ## Рішення > > 1. [`list('якийсь рядок')`](https://docs.python.org/3/library/stdtypes.html#list) перетворює рядок на список, що містить усі його символи. > > 2. [`join`](https://docs.python.org/3/library/stdtypes.html#str.join) повертає рядок, який є _конкатенацією_ > > кожного елемента рядка у списку та додає роздільник між кожним елементом у списку. Це призводить до > > `x-y-z`. Роздільником між елементами є рядок, який забезпечує цей метод.

source: > ## Working With the End
es: > ## Trabajando con el Final
uk: > ## Початок з кінця

source: > > What does the following program print? > > ~~~ > element = 'helium' > print(element[-1]) > ~~~ > {: .language-python} > > 1. How does Python interpret a negative index? > 2. If a list or string has N elements, > what is the most negative index that can safely be used with it, > and what location does that index represent? > 3. If `values` is a list, what does `del values[-1]` do? > 4. How can you display all elements but the last one without changing `values`? > (Hint: you will need to combine slicing and negative indexing.) > > > ## Solution > > The program prints `m`. > > 1. Python interprets a negative index as starting from the end (as opposed to > > starting from the beginning). The last element is `-1`. > > 2. The last index that can safely be used with a list of N elements is element > > `-N`, which represents the first element. > > 3. `del values[-1]` removes the last element from the list. > > 4. `values[:-1]`
es: > > ¿Qué muestra el siguiente programa? > > ~~~ > element = 'helium' > print(element[-1]) > ~~~ > {: .language-python} > > 1. ¿Cómo interpreta Python un índice negativo? > 2. Si una lista o secuencia de caracteres de N elementos, > ¿cuál es el índice más negativo que se puede usar, > y qué posición representa este índice? > 3. Si `values` es una lista, ¿qué hace `del values[-1]`? > 4. ¿Cómo se puede mostrar todos los elementos sin cambiar `values`? > (Consejo: necesitas combinar cortes e índices negativos.) > > > ## Solución > > El programa muestra `m`. > > 1. Python interpreta un índice negativo como empezar desde el final (en lugar de > > empezar desde el inicio). El último elemento es `-1`. > > 2. El último índice que se puede usar con seguridad en una lista de N elementos es el elemento > > `-N`, que representa el primer elemento. > > 3. `del values[-1]` remueve el último elemento de la lista. > > 4. `values[:-1]`
uk: > > Що друкує наступна програма? > > ~~~ > element = 'helium' > print(element[-1]) > ~~~ > {: .language-python} > > 1. Як Python інтерпретує від'ємний індекс? > 2. Якщо список або рядок містить N елементів, > який найбільший за модулем від'ємний індекс можна безпечно використовувати, > і яку локацію визначає цей індекс? > 3. Якщо `values` є списком, що робить `del values[-1]` > 4. Як ви можете відобразити всі елементи, крім останнього, не змінюючи `values`? > (Підказка: вам потрібно буде поєднати зрізи та від'ємну індексацію.) > > > ## Рішення > > Програма надрукує `m`. > > 1. Python інтерпретує від'ємний індекс як початок з кінця (на відміну від > > початку). Останній елемент – `-1`. > > 2. Останнім індексом, який можна безпечно використовувати зі списком із N елементів, є елемент > > `-N`, який представляє перший елемент. > > 3. `del values[-1]` видаляє останній елемент зі списку. > > 4. `values[:-1]`

source: > ## Stepping Through a List
es: > ## Recorriendo una Lista
uk: > ## Перехід по списку

source: > > What does the following program print? > > ~~~ > element = 'fluorine' > print(element[::2]) > print(element[::-1]) > ~~~ > {: .language-python} > > 1. If we write a slice as `low:high:stride`, what does `stride` do? > 2. What expression would select all of the even-numbered items from a collection? > > > ## Solution > > The program prints > > ~~~ > > furn > > eniroulf > > ~~~ > > {: .language-python} > > 1. `stride` is the step size of the slice > > 2. The slice `1::2` selects all even-numbered items from a collection: it starts > > with element `1` (which is the second element, since indexing starts at `0`), > > goes on until the end (since no `end` is given), and uses a step size of `2` > > (i.e., selects every second element).
es: > > ¿Qué muestra el siguiente programa? > > ~~~ > element = 'fluorine' > print(element[::2]) > print(element[::-1]) > ~~~ > {: .language-python} > > 1. Si escribimos un corte como `low:high:stride`, ¿qué hace `stride`? > 2. ¿Qué expresión seleccionaría todos los elementos pares de una colección? > > > ## Solución > > El programa muestra > > ~~~ > > furn > > eniroulf > > ~~~ > > {: .language-python} > > 1. `stride` es el tamaño del paso del corte > > 2. El corte `1::2` selecciona todos los elementos pares de una colección: empieza > > con el elemento `1` (que es el segundo elemento, ya que la indexación empieza en `0`), > > va hasta el final (ya que no se usó `end`), y usa un paso de `2` > > (es decir, selecciona cada dos elementos).
uk: > > Що друкує наступна програма? > > ~~~ > element = 'fluorine' > print(element[::2]) > print(element[::-1]) > ~~~ > {: .language-python} > > 1. Якщо ми пишемо фрагмент як `low:high:stride`, що робить `stride`? > 2. Яка команда дозволить вибрати всі елементи з парними номерами з колекції? > > > ## Рішення > > Програма надрукує > > ~~~ > > furn > > eniroulf > > ~~~ > > {: .language-python} > > 1. `stride` є розміром кроку зріза > > 2. Зріз `1::2` вибирає всі елементи з парними номерами з колекції: він починається > > з елементу `1` (який є другим елементом, оскільки індексація починається з `0`), > > продовжується до кінця (оскільки `end` не задано) і використовує розмір кроку `2` > > (таким чином обираючи кожний другий елемент).

source: > ## Slice Bounds
es: > ## Límites de los Cortes
uk: > ## Границі зрізу

source: > > What does the following program print? > > ~~~ > element = 'lithium' > print(element[0:20]) > print(element[-1:3]) > ~~~ > {: .language-python} > > > ## Solution > > ~~~ > > lithium > > > > ~~~ > > {: .language-python}
es: > > ¿Qué muestra el siguiente programa? > > ~~~ > element = 'lithium' > print(element[0:20]) > print(element[-1:3]) > ~~~ > {: .language-python} > > > ## Solución > > ~~~ > > lithium > > > > ~~~ > > {: .language-python}
uk: > > Що друкує наступна програма? > > ~~~ > element = 'lithium' > print(element[0:20]) > print(element[-1:3]) > ~~~ > {: .language-python} > > > ## Рішення > > ~~~ > > lithium > > > > ~~~ > > {: .language-python}

source: > ## Sort and Sorted
es: > ## Sort y Sorted
uk: > ## Сортування на місці чи у новий список

source: > > What do these two programs print? > In simple terms, explain the difference between `sorted(letters)` and `letters.sort()`. > > ~~~ > # Program A > letters = list('gold') > result = sorted(letters) > print('letters is', letters, 'and result is', result) > ~~~ > {: .language-python} > > ~~~ > # Program B > letters = list('gold') > result = letters.sort() > print('letters is', letters, 'and result is', result) > ~~~ > {: .language-python} > > > ## Solution > > Program A prints > > ~~~ > > letters is ['g', 'o', 'l', 'd'] and result is ['d', 'g', 'l', 'o'] > > ~~~ > > {: .language-python} > > Program B prints > > ~~~ > > letters is ['d', 'g', 'l', 'o'] and result is None > > ~~~ > > {: .language-python} > > `sorted(letters)` returns a sorted copy of the list `letters` (the original > > list `letters` remains unchanged), while `letters.sort()` sorts the list > > `letters` in-place and does not return anything.
es: > > ¿Qué muestran estos dos programas? > Explica la diferencia entre `sorted(letters)` y `letters.sort()` en términos simples. > > ~~~ > # Programa A > letters = list('gold') > result = sorted(letters) > print('letters es', letters, 'y result es', result) > ~~~ > {: .language-python} > > ~~~ > # Programa B > letters = list('gold') > result = letters.sort() > print('letters es', letters, 'y result es', result) > ~~~ > {: .language-python} > > > ## Solución > > El programa A muestra > > ~~~ > > letters es ['g', 'o', 'l', 'd'] y result es ['d', 'g', 'l', 'o'] > > ~~~ > > {: .language-python} > > El program B muestra > > ~~~ > > letters es ['d', 'g', 'l', 'o'] y result es None > > ~~~ > > {: .language-python} > > `sorted(letters)` devuelve una copia ordenada de la lista `letters` (la lista > > original `letters` permanece sin cambios), mientras que `letters.sort()` ordena la lista > > `letters` en si misma y no devuelve nada.
uk: > > Що друкують ці дві програми? > Простими словами поясніть різницю між `sorted(letters)` and `letters.sort()`. > > ~~~ > # Програма A > letters = list('gold') > result = sorted(letters) > print('letters is', letters, 'and result is', result) > ~~~ > {: .language-python} > > ~~~ > # Програма B > letters = list('gold') > result = letters.sort() > print('letters is', letters, 'and result is', result) > ~~~ > {: .language-python} > > > ## Рішення > > Програма A друкує > > ~~~ > > літери ['g', 'o', 'l', 'd'] і результат є таким: ['d', 'g', 'l', 'o'] > > ~~~ > > {: .language-python} > > Програма В друкує > > ~~~ > > літери ['d', 'g', 'l', 'o'] і результат є None > > ~~~ > > {: .language-python} > > `sorted(letters)` повертає відсортовану копію списку `letters` (оригінал > > списку `letters` залишається без змін), тоді як `letters.sort()` сортує список > > `letters` на місці та нічого не повертає.

source: > ## Copying (or Not)
es: > ## Copiar (o no copiar)
uk: > ## Копіювання (чи ні)
