Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: > > Modify this program so that it finds the largest and smallest values in the list > no matter what the range of values originally is. > > ~~~ > values = [...some test data...] > smallest, largest = None, None > for v in values: > if ____: > smallest, largest = v, v > ____: > smallest = min(____, v) > largest = max(____, v) > print(smallest, largest) > ~~~ > {: .language-python} > > What are the advantages and disadvantages of using this method > to find the range of the data? > > ## Solution > > > > ~~~ > > values = [-2,1,65,78,-54,-24,100] > > smallest, largest = None, None > > for v in values: > > if smallest==None and largest==None: > > smallest, largest = v, v > > else: > > smallest = min(smallest, v) > > largest = max(largest, v) > > print(smallest, largest) > > ~~~ > > {: .language-python}
es: > Modifique este programa para que encuentre los valores más altos y más bajos en la lista > sin importar cuál sea el rango de valores originalmente. > > ~~~ > values = [...some test data...] > smallest, largest = None, None > for v in values: > if ____: > smallest, largest = v, v > ____: > smallest = min(____, v) > largest = max(____, v) > print(smallest, largest) > ~~~ > {: .language-python} > > ¿Cuáles son las ventajas y desventajas de usar este método > para encontrar el rango de los datos? > > ## Solución > > > > ~~~ > > values = [-2,1,65,78,-54,-24,100] > > smallest, largest = None, None > > for v in values: > > if smallest==None and largest==None: > > smallest, largest = v, v > > else: > > smallest = min(smallest, v) > > largest = max(largest, v) > > print(smallest, largest) > > ~~~ > > {: .language-python}
uk: > > Змініть цю програму так, щоб вона знаходила найбільше та найменше значення у списку > незалежно від початкового діапазону значень. > > ~~~ > values = [...деякі тестові дані...] > smallest, largest = None, None > for v in values: > if ____: > smallest, largest = v, v > ____: > smallest = min(____, v) > largest = max(____, v) > print(smallest, largest) > ~~~ > {: .language-python} > > Які переваги та недоліки використання цього методу > для визначення діапазону даних? > > ## Рішення > > > > ~~~ > > values = [-2,1,65,78,-54,-24,100] > > smallest, largest = None, None > > for v in values: > > if smallest==None and largest==None: > > smallest, largest = v, v > > else: > > smallest = min(smallest, v) > > largest = max(largest, v) > > print(smallest, largest) > > ~~~ > > {: .language-python}

source: > ## Using Functions With Conditionals in Pandas
es: > ## Uso de Funciones con Condicionales en Pandas
uk: > ## Використання функцій з умовними операторами в Pandas

source: > > Functions will often contain conditionals. Here is a short example that > will indicate which quartile the argument is in based on hand-coded values > for the quartile cut points. > > ~~~ > def calculate_life_quartile(exp): > if exp < 58.41: > # This observation is in the first quartile > return 1 > elif exp >= 58.41 and exp < 67.05: > # This observation is in the second quartile > return 2 > elif exp >= 67.05 and exp < 71.70: > # This observation is in the third quartile > return 3 > elif exp >= 71.70: > # This observation is in the fourth quartile > return 4 > else: > # This observation has bad data > return None > > calculate_life_quartile(62.5) > ~~~ > {: .language-python} > > ~~~ > 2 > ~~~
es: > > Las funciones a menudo contienen condicionales. Aquí hay un breve ejemplo que > indicará en qué cuartil se encuentra el argumento basado en valores codificados a mano > para los puntos de corte del cuartil. > > ~~~ > def calculate_life_quartile(exp): > if exp < 58.41: > # This observation is in the first quartile > return 1 > elif exp >= 58.41 and exp < 67.05: > # This observation is in the second quartile > return 2 > elif exp >= 67.05 and exp < 71.70: > # This observation is in the third quartile > return 3 > elif exp >= 71.70: > # This observation is in the fourth quartile > return 4 > else: > # This observation has bad data > return None > > calculate_life_quartile(62.5) > ~~~ > {: .language-python} > > ~~~ > 2 > ~~~
uk: > > Функції часто містять умови. Ось короткий приклад, в якому > на основі закодованих вручну значень визначається, у якому квартилі знаходиться аргумент, > з урахуванням квартильних точок розрізу. > > ~~~ > def calculate_life_quartile(exp): > if exp < 58.41: > # Це спостереження належить першому квартилю > return 1 > elif exp >= 58.41 and exp < 67.05: > # Це спостереження належить другому квартилю > return 2 > elif exp >= 67.05 and exp < 71.70: > # Це спостереження належить третьому квартилю > return 3 > elif exp >= 71.70: > # Це спостереження належить четвертому квартилю > return 4 > else: > # Це спостереження має погані дані > return None > > calculate_life_quartile(62.5) > ~~~ > {: .language-python} > > ~~~ > 2 > ~~~

source: > > That function would typically be used within a `for` loop, but Pandas has > a different, more efficient way of doing the same thing, and that is by > *applying* a function to a dataframe or a portion of a dataframe. Here > is an example, using the definition above. > > ~~~ > data = pd.read_csv('Americas-data.csv') > data['life_qrtl'] = data['lifeExp'].apply(calculate_life_quartile) > ~~~ > {: .language-python} > > There is a lot in that second line, so let's take it piece by piece. > On the right side of the `=` we start with `data['lifeExp']`, which is the > column in the dataframe called `data` labeled `lifExp`. We use the > `apply()` to do what it says, apply the `calculate_life_quartile` to the > value of this column for every row in the dataframe.
es: > > Esa función normalmente se usaría dentro de un bucle `for`, pero Pandas tiene > una forma diferente y más eficiente de hacer lo mismo, y eso es mediante > *aplicando* una función a un **dataframe** o una parte de ello. El siguiente > ejemplo, usa la definición anterior. > ~~~ > data = pd.read_csv('Americas-data.csv') > data['life_qrtl'] = data['lifeExp'].apply(calculate_life_quartile) > ~~~ > {: .language-python} > > Hay mucho en esa segunda línea, así que vamos a tomarlo pieza por pieza. > En el lado derecho de `=` comenzamos con `data ['lifeExp']`, que es la > columna en el **dataframe** llamado `data` con la etiqueta` lifExp`. Usamos el > `apply()` para hacer lo que dice, aplique el 'calculate_life_quartile` al > valor de esta columna para cada fila en el **dataframe**.
uk: > > Ця функція зазвичай використовується в циклі for, але Pandas має > інший, більш ефективний спосіб робити те саме шляхом > *застосування* функції до фрейму даних або частини фрейму даних. Розглянемо > приклад, використовуючи наведене вище визначення функції. > > ~~~ > data = pd.read_csv('Americas-data.csv') > data['life_qrtl'] = data['lifeExp'].apply(calculate_life_quartile) > ~~~ > {: .language-python} > > У другому рядку є багато цікавого, тому давайте розглянемо це по частинах. > Праворуч від `=` ми починаємо з `data['lifeExp']`, який є > стовпцем з позначкою `lifExp` у фреймі даних `data` . Ми використовуємо засіб > `apply()`, щоб виконати функцію `calculate_life_quartile` для > визначення значень стовпця 'life_qrtl' для кожного рядку фрему даних `data`

source: --- title: "Looping Over Data Sets" teaching: 5 exercises: 10 questions: - "How can I process many data sets with a single command?" objectives: - "Be able to read and write globbing expressions that match sets of files." - "Use glob to create lists of files." - "Write for loops to perform operations on files given their names in a list." keypoints: - "Use a `for` loop to process files given a list of their names." - "Use `glob.glob` to find sets of files whose names match a pattern." - "Use `glob` and `for` to process batches of files." ---
es: --- title: "Iterando Sobre Datos" teaching: 5 exercises: 10 questions: - "¿Cómo puedo procesar muchos data sets con un solo comando?" objectives: - "Ser capaz de leer y escribir expresiones globales que coincidan con conjuntos de archivos." - "Uso de 'glob' para crear listas de archivos." - "Escribir bucles para realizar operaciones en archivos dando sus nombres en una lista." keypoints: - "Usar un bucle `for` para procesar el archivos dando una lista de sus nombres." - "Usar `glob.glob` para encontrar conjuntos de archivos cuyos nombres coinciden con un patrón." - "Usar `glob` y `for` para procesar un grupo de archivos." ---
uk: --- title: "Перегляд наборів даних в циклі" teaching: 5 exercises: 10 questions: - "Як я можу обробити багато наборів даних за допомогою однієї команди?" objectives: - "Вміти читати та писати вирази глоббінгу, які відповідають наборам файлів" - "Використовувати glob для створення списків файлів." - "Писати цикли for для виконання операцій над файлами, названими у списку." keypoints: - "Використовуйте цикл `for` для обробки файлів із списком їх імен." - "Використовуйте `glob.glob`, щоб знайти набори файлів, імена яких відповідають шаблону." - "Використовуйте `glob` і `for` для обробки пакетів файлів." ---

source: ## Use a `for` loop to process files given a list of their names.
es: ## Usa un bucle `for` para procesar archivos dando una lista de sus nombres.
uk: ## Використовуйте цикл `for` для обробки файлів, заданих списком їхніх імен.

source: * A filename is a character string.
es: * Un nombre de archivo es una cadena de caracteres.
uk: * Ім'я файлу - це рядок символів.

source: * And lists can contain character strings.
es: * Y las listas pueden contener cadenas de caracteres.
uk: * І списки можуть містити рядки символів.

source: ## Use [`glob.glob`](https://docs.python.org/3/library/glob.html#glob.glob) to find sets of files whose names match a pattern.
es: ## Usa [`glob.glob`](https://docs.python.org/3/library/glob.html#glob.glob) para encontrar conjuntos de archivos cuyos nombres coinciden con un patrón.
uk: ## Використовуйте [`glob.glob`](https://docs.python.org/3/library/glob.html#glob.glob), щоб знайти набори файлів, імена яких відповідають шаблону.

source: * In Unix, the term "globbing" means "matching a set of files with a pattern".
es: * En Unix, el término "globbing" significa "coincidir un conjunto de archivos con un patrón".
uk: * В Unix термін "globbing" означає "відповідність набору файлів шаблону".

source: * The most common patterns are:
es: * Los patrones más comunes son:
uk: * Найпоширеніші моделі:

source: * `*` meaning "match zero or more characters"
es: * `*` significa "coincide con cero o más caracteres"
uk: * `*` означає "відповідати нулю або більшій кількості символів"

source: * `?` meaning "match exactly one character"
es: * `?` significa "coincide exactamente con un carácter"
uk: * `?` означає "відповідати в точності одному символу"

source: * Python contains the [`glob`](https://docs.python.org/3/library/glob.html) library to provide pattern matching functionality
es: * Python contiene la biblioteca [`glob`] (https://docs.python.org/3/library/glob.html) para proporcionar la funcionalidad de los patrones de coincidencia
uk: * Python містить бібліотеку [`glob`](https://docs.python.org/3/library/glob.html) для забезпечення функції зіставлення шаблонів

source: * The [`glob`](https://docs.python.org/3/library/glob.html) library contains a function also called `glob` to match file patterns
es: * La biblioteca [`glob`] (https://docs.python.org/3/library/glob.html) contiene una función también llamada` glob` para encontrar coincidencias con patrones de archivo
uk: * Бібліотека [`glob`](https://docs.python.org/3/library/glob.html) містить функцію, яка також називається `glob` для відповідності шаблонам файлів.

source: * E.g., `glob.glob('*.txt')` matches all files in the current directory
es: * Por ejemplo, `glob.glob('*.txt')` coincide con todos los archivos en el directorio actual
uk: * Наприклад, `glob.glob('*.txt')` відповідає всім файлам у поточному каталозі,

source: whose names end with `.txt`. * Result is a (possibly empty) list of character strings.
es: cuyos nombres terminan con `.txt`. * El resultado es una lista (posiblemente vacía) de cadenas de caracteres.
uk: імена яких закінчуються на `.txt`. * Результатом є (можливо, порожній) список рядків символів.

source: ## Use `glob` and `for` to process batches of files.
es: ## Usa `glob` y` for` para procesar grupos de archivos.
uk: ## Використовуйте `glob` і `for` для обробки пакетів файлів.

source: * Helps a lot if the files are named and stored systematically and consistently
es: * Ayuda mucho si los archivos se nombran y almacenan de manera sistemática y consistente
uk: * Дуже допомагає, якщо файли мають імена та зберігаються систематично та послідовно,

source: so that simple patterns will find the right data.
es: de forma que patrones simples encuentren los datos correctos.
uk: так що прості шаблони знайдуть потрібні дані.

source: * This includes all data, as well as per-region data.
es: * Esto incluye todos los datos, así como datos por región.
uk: * Це включає всі дані, а також дані по регіонах.

source: * Use a more specific pattern in the exercises to exclude the whole data set.
es: * Usa un patrón más específico en los ejercicios para excluir todo el conjunto de datos.
uk: * Використовуйте більш конкретний шаблон у вправах, щоб виключити весь набір даних.

source: * But note that the minimum of the entire data set is also the minimum of one of the data sets,
es: * Pero nota que el mínimo de todo el conjunto de datos también es el mínimo de uno de los conjuntos de datos,
uk: * Але зауважте, що мінімум усього набору даних також є мінімумом одного з наборів даних,

source: which is a nice check on correctness.
es: lo cual es un buen control sobre la corrección.
uk: що є хорошою перевіркою правильності.

source: > ## Determining Matches
es: > ## Determinación de Coincidencias
uk: > ## Визначення збігів

source: > > Which of these files is *not* matched by the expression `glob.glob('data/*as*.csv')`? > > 1. `data/gapminder_gdp_africa.csv` > 2. `data/gapminder_gdp_americas.csv` > 3. `data/gapminder_gdp_asia.csv` > 4. 1 and 2 are not matched. > > > ## Solution > > > > 1 is not matched by the glob.
es: > > ¿Cuál de estos archivos * no * coincide con la expresión`glob.glob('data/*as*.csv')`? > > 1. `data/gapminder_gdp_africa.csv` > 2. `data/gapminder_gdp_americas.csv` > 3. `data/gapminder_gdp_asia.csv` > 4. 1 and 2 are not matched. > > > ## Solución > > > > 1 no coincide por el glob.
uk: > > Який із цих файлів *не* відповідає виразу `glob.glob('data/*as*.csv')`? > > 1. `data/gapminder_gdp_africa.csv` > 2. `data/gapminder_gdp_americas.csv` > 3. `data/gapminder_gdp_asia.csv` > 4. 1 and 2 are not matched. > > > ## Рішення > > > > 1 не відповідає glob.

source: > ## Minimum File Size
es: > ## Tamaño mínimo del archivo
uk: > ## Мінімальний розмір файлу

source: > > Modify this program so that it prints the number of records in > the file that has the fewest records. > > ~~~ > import glob > import pandas as pd > fewest = ____ > for filename in glob.glob('data/*.csv'): > dataframe = pd.____(filename) > fewest = min(____, dataframe.shape[0]) > print('smallest file has', fewest, 'records') > ~~~ > {: .language-python} > Note that the [shape method](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.shape.html) > returns a tuple with the number of rows and columns of the data frame. > > > ## Solution > > ~~~ > > import glob > > import pandas as pd > > fewest = float('Inf') > > for filename in glob.glob('data/*.csv'): > > dataframe = pd.read_csv(filename) > > fewest = min(fewest, dataframe.shape[0]) > > print('smallest file has', fewest, 'records') > > ~~~ > > {: .language-python}
es: > > Modifique este programa para que imprima el número de registros en > el archivo que tiene la menor cantidad de registros. > > ~~~ > import glob > import pandas as pd > fewest = ____ > for filename in glob.glob('data/*.csv'): > dataframe = pd.____(filename) > fewest = min(____, dataframe.shape[0]) > print('smallest file has', fewest, 'records') > ~~~ > {: .language-python} > Nota que el [método shape] (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.shape.html) > regresa una tupla con el número de filas y columnas del dataframe. > > > ## Solución > > ~~~ > > import glob > > import pandas as pd > > fewest = float('Inf') > > for filename in glob.glob('data/*.csv'): > > dataframe = pd.read_csv(filename) > > fewest = min(fewest, dataframe.shape[0]) > > print('smallest file has', fewest, 'records') > > ~~~ > > {: .language-python}
uk: > > Змініть цю програму так, щоб вона друкувала кількість записів > файлі, який містить найменшу кількість записів > > ~~~ > import glob > import pandas as pd > fewest = ____ > for filename in glob.glob('data/*.csv'): > dataframe = pd.____(filename) > fewest = min(____, dataframe.shape[0]) > print('smallest file has', fewest, 'records') > ~~~ > {: .language-python} > Зауважте, що [shape method](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.shape.html) > повертає кортеж із кількістю рядків і стовпців фрейму даних. > > > ## Рішення > > ~~~ > > import glob > > import pandas as pd > > fewest = float('Inf') > > for filename in glob.glob('data/*.csv'): > > dataframe = pd.read_csv(filename) > > fewest = min(fewest, dataframe.shape[0]) > > print('smallest file has', fewest, 'records') > > ~~~ > > {: .language-python}

source: > ## Comparing Data
es: > ## Comparando Datos
uk: > ## Порівняння даних

source: > > Write a program that reads in the regional data sets > and plots the average GDP per capita for each region over time > in a single chart. > > ## Solution > > This solution builds a useful legend by using the string [`split`](https://docs.python.org/3/library/stdtypes.html#str.split) method to > > extract the `region` from the path 'data/gapminder_gdp_a_specific_region.csv'. The [`pathlib module`] > > also provides useful abstractions for file and path manipulation like returning the name of a file > > without the file extension. > > ~~~ > > import glob > > import pandas as pd > > import matplotlib.pyplot as plt > > fig, ax = plt.subplots(1,1) > > for filename in glob.glob('data/gapminder_gdp*.csv'): > > dataframe = pd.read_csv(filename) > > # extract <region> from the filename, expected to be in the format 'data/gapminder_gdp_<region>.csv'. > > # we will split the string using the split method and `_` as our separator, > > # retrieve the last string in the list that split returns (`<region>.csv`), > > # and then remove the `.csv` extension from that string. > > region = filename.split('_')[-1][:-4] > > dataframe.mean().plot(ax=ax, label=region) > > plt.legend() > > plt.show() > > ~~~ > > {: .language-python}
es: > > Escribe un programa que lea en los datasets regionales. > y grafica el PIB promedio per cápita para cada región a lo largo del tiempo > en una simple gráfica. > > ## Solución > > Esta solución crea una útil leyenda usando el método de cadena [`split`](https://docs.python.org/3/library/stdtypes.html#str.split) método para > > extraer la `region` de el path 'data/gapminder_gdp_a_specific_region.csv'. El [`pathlib module`] > > también proporciona abstracciones útiles para la manipulación de archivos y rutas, como regresar el nombre de un archivo > > sin la extensión del archivo. > > ~~~ > > import glob > > import pandas as pd > > import matplotlib.pyplot as plt > > fig, ax = plt.subplots(1,1) > > for filename in glob.glob('data/gapminder_gdp*.csv'): > > dataframe = pd.read_csv(filename) > > # extract <region> from the filename, expected to be in the format 'data/gapminder_gdp_<region>.csv'. > > # we will split the string using the split method and `_` as our separator, > > # retrieve the last string in the list that split returns (`<region>.csv`), > > # and then remove the `.csv` extension from that string. > > region = filename.split('_')[-1][:-4] > > dataframe.mean().plot(ax=ax, label=region) > > plt.legend() > > plt.show() > > ~~~ > > {: .language-python}
uk: > > Напишіть програму, яка читає регіональні набори даних > і будує графік середнього ВВП на душу населення для кожного регіону в часі > в одній діаграмі. > > ## Рішення > > Це рішення створює корисну легенду за допомогою методу string [`split`](https://docs.python.org/3/library/stdtypes.html#str.split) для > > вилучення `region` зі шляху 'data/gapminder_gdp_a_specific_region.csv'. [`pathlib module`] > > також забезпечує корисні абстракції для маніпулювання файлами та шляхами, такі як повернення назви файлу > > без розширення файлу. > > ~~~ > > import glob > > import pandas as pd > > import matplotlib.pyplot as plt > > fig, ax = plt.subplots(1,1) > > for filename in glob.glob('data/gapminder_gdp*.csv'): > > dataframe = pd.read_csv(filename) > > # вилучіть <region> з імені файла, який має бути у форматі 'data/gapminder_gdp_<region>.csv'. > > # ми розділимо рядок за допомогою методу split та з викоританням `_` як роздільника, > > # отримаємо останній рядок у списку, який повертає розділений (`<region>.csv`), > > # та потім видалимо розширення `.csv` з того рядка. > > region = filename.split('_')[-1][:-4] > > dataframe.mean().plot(ax=ax, label=region) > > plt.legend() > > plt.show() > > ~~~ > > {: .language-python}

source: --- layout: break title: "Afternoon Coffee" teaching: 0 exercises: 0 break: 15 ---
es: --- layout: break title: "Pausa vespertina" teaching: 0 exercises: 0 break: 15 ---
uk: --- layout: break title: "Післяобідня кава" teaching: 0 exercises: 0 break: 15 ---

source: Over break, reflect on and discuss the following: * A common refrain in software engineering is "Don't Repeat Yourself". How do the techniques we've learned in the last lessons help us avoid repeating ourselves? _note that in practice there is some nuance to this and should be balanced with doing the simplest thing that could possibly work_ * What are the pros / cons of making a variable global or local to a function? * When would you consider turning a block of code into a function definition?
es: Durante la pausa, reflexiona y discute lo siguiente: * Un refrán común en la ingeniería de software es "No te repitas". ¿Cómo funcionan las técnicas que hemos aprendido en los últimos episodios que nos ayudan a evitar repetirnos? _nota que en la práctica hay algo de matiz en esto y debe ser equilibrado haciendo lo más simple que podría funcionar_ * ¿Cuáles son las ventajas y desventajas de hacer que una variable sea global o local para una función? * ¿Cuándo considerarías convertir un bloque de código en una definición de función?
uk: Під час перерви поміркуйте та обговоріть наступне: * Загальний приспів у розробці програмного забезпечення: «Не повторюйся". Як техніки, які ми вивчали на попередньому занятті, допомагають нам не повторюватися? _зауважте, що на практиці в цьому є певний нюанс, який слід збалансувати роблячи найпростішу річ, яка може спрацювати_ * Які плюси/мінуси створення глобальної чи локальної змінної для функції? * В якому випадку є сенс перетворення блокк коду на визначення функції?
