Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: > > Modify the example in the notes to create a scatter plot showing > the relationship between the minimum and maximum GDP per capita > among the countries in Asia for each year in the data set. > What relationship do you see (if any)? > > ~~~ > data_asia = pd.read_csv('data/gapminder_gdp_asia.csv', index_col='country') > data_asia.describe().T.plot(kind='scatter', x='min', y='max') > ~~~ > {: .language-python} > > > ## Solution > > > > ![Correlations Solution 1](../fig/9_correlations_solution1.svg) > > > > No particular correlations can be seen between the minimum and maximum gdp values > > year on year. It seems the fortunes of asian countries do not rise and fall together.
es: > > Modifica el ejemplo en las notas para crear un diagrama de dispersión que muestre > la relación entre el PIB mínimo y máximo per cápita > entre los países de Asia por cada año en el conjunto de datos. > ¿Qué relación se ve (si es que existe)? > > ~~~ > data_asia = pd.read_csv('data/gapminder_gdp_asia.csv', index_col='country') > data_asia.describe().T.plot(kind='scatter', x='min', y='max') > ~~~ > {: .language-python} > > > ## Solución > > > > ![Correlaciones Solución 1]({{ site.baseurl }}/fig/9_correlations_solution1.svg) > > > > No se pueden ver correlaciones particulares entre los valores mínimos y máximos de PIB > > año a año. Parece que las fortunas de los países asiáticos no suben ni bajan juntas.

source: > > You might note that the variability in the maximum is much higher than > that of the minimum. Take a look at the maximum and the max indexes: > > ~~~ > data_asia = pd.read_csv('data/gapminder_gdp_asia.csv', index_col='country') > data_asia.max().plot() > print(data_asia.idxmax()) > print(data_asia.idxmin()) > ~~~ > {: .language-python} > > ## Solution > > ![Correlations Solution 2](../fig/9_correlations_solution2.png) > > > > Seems the variability in this value is due to a sharp drop after 1972. > > Some geopolitics at play perhaps? Given the dominance of oil producing countries, > > maybe the Brent crude index would make an interesting comparison? > > Whilst Myanmar consistently has the lowest gdp, the highest gdb nation has varied > > more notably.
es: > > Puedes notar que la variabilidad en el máximo es mucho mayor que > la del mínimo. Dale una mirada a los índices maximos y max: > > ~~~ > data_asia = pd.read_csv('data/gapminder_gdp_asia.csv', index_col='country') > data_asia.max().plot() > print(data_asia.idxmax()) > print(data_asia.idxmin()) > ~~~ > {: .language-python} > > ## Solución > > ![Correlaciones Solución 2]({{ site.baseurl }}/fig/9_correlations_solution2.png) > > > > Parece que la variabilidad en este valor se debe a una fuerte caída después de 1972. > > ¿Alguna geopolítica en juego quizás? Dado el dominio de los países productores de petróleo, > > tal vez el índice de crudo Brent haría una comparación interesante? > > Mientras que Myanmar tiene consistentemente el pib más bajo, la nación con el pib más alto ha variado > > más notablemente.

source: > ## More Correlations
es: > ## Más Correlaciones
uk: > ## Більше кореляцій

source: > > This short program creates a plot showing > the correlation between GDP and life expectancy for 2007, > normalizing marker size by population: > > ~~~ > data_all = pd.read_csv('data/gapminder_all.csv', index_col='country') > data_all.plot(kind='scatter', x='gdpPercap_2007', y='lifeExp_2007', > s=data_all['pop_2007']/1e6) > ~~~ > {: .language-python} > > Using online help and other resources, > explain what each argument to `plot` does. > > > ## Solution > > ![More Correlations Solution](../fig/9_more_correlations_solution.svg) > > > > A good place to look is the documentation for the plot function - > > help(data_all.plot). > > > > kind - As seen already this determines the kind of plot to be drawn. > > > > x and y - A column name or index that determines what data will be > > placed on the x and y axes of the plot > > > > s - Details for this can be found in the documentation of plt.scatter. > > A single number or one value for each data point. Determines the size > > of the plotted points.
es: >set > Este breve programa crea un grsetáfico que muestra > la correlación entre el PIB y la esperanza de vida para 2007, > normalizando el tamaño del marcador por población: > > ~~~ > data_all = pd.read_csv('data/gapminder_all.csv', index_col='country') > data_all.plot(kind='scatter', x='gdpPercap_2007', y='lifeExp_2007', > s=data_all['pop_2007']/1e6) > ~~~ > {: .language-python} > > Usando ayuda en línea y otros recursos, > explica lo que hace cada argumento para `plot`. > > > ## Solución > > ![Solución de Más Correlaciones]({{ site.baseurl }}/fig/9_more_correlations_solution.svg) > > > > Un buen lugar para buscar es la documentación para la función plot - > > help(data_all.plot). > > > > kind - Como ya se ha visto, esto determina el tipo de gráfico que se dibujará. > > > > "x" e "y" - Un nombre de columna o índice que determina qué datos serán > > colocado en los ejes x e y del gráfico > > > > s - Los detalles para esto se pueden encontrar en la documentación de plt.scatter. > > Un solo número o un valor para cada punto de datos. Determina el tamaño > > de los puntos graficados.

source: > ## Saving your plot to a file
es: > ## Guardando tu gráfico en un archivo
uk: > ## Збереження вашого графіка в файл

source: > If you are satisfied with the plot you see you may want to save it to a file,
es: > Si estás satisfecho con el gráfico que se ve, es posible que desees guardarlo en un archivo,
uk: > Якщо вас задовольняє графік, який ви бачите, ви можете зберегти його у файл,

source: > perhaps to include it in a publication. There is a function in the
es: > quizás para incluirlo en una publicación. Hay una función en el
uk: > можливо, щоб включити його у публікацію. Існує функція в

source: > matplotlib.pyplot module that accomplishes this:
es: > módulo matplotlib.pyplot que cumple con esto:
uk: > модулі matplotlib.pyplot , яка виконує це:

source: > Calling this function, e.g. with
es: > Llamando a esta función, por ejemplo con
uk: > Виклик цієї функції, наприклад, наступним чином:

source: > will save the current figure to the file `my_figure.png`. The file format
es: > guardará la figura actual en el archivo `my_figure.png`. El formato de archivo
uk: > збереже поточний графік у файл `my_figure.png`. Формат файла

source: > will automatically be deduced from the file name extension (other formats
es: > se deducirá automáticamente de la extensión del nombre del archivo (otros formatos
uk: > буде автоматично визначений з розширення файлу у його назві (інші формати

source: > are pdf, ps, eps and svg).
es: > son pdf, ps, eps y svg).
uk: > - це pdf, ps, eps and svg).

source: > > Note that functions in `plt` refer to a global figure variable > and after a figure has been displayed to the screen (e.g. with `plt.show`) > matplotlib will make this variable refer to a new empty figure. > Therefore, make sure you call `plt.savefig` before the plot is displayed to > the screen, otherwise you may find a file with an empty plot. > > When using dataframes, data is often generated and plotted to screen in one line, > and `plt.savefig` seems not to be a possible approach. > One possibility to save the figure to file is then to > > * save a reference to the current figure in a local variable (with `plt.gcf`) > * call the `savefig` class method from that variable. > > ~~~ > fig = plt.gcf() # get current figure > data.plot(kind='bar') > fig.savefig('my_figure.png') > ~~~ > {: .language-python}
es: > > Ten en cuenta que las funciones en `plt` se refieren a una variable de figura global > y después de que se haya mostrado una figura en la pantalla (por ejemplo, con `plt.show`) > matplotlib hará que esta variable se referencie a una nueva figura vacía. > Por lo tanto, asegúrate de llamar a `plt.savefig` antes de mostrar el grafico por > pantalla, de lo contrario, puedes encontrar un archivo con un gráfico vacío. > > Cuando se usan marcos de datos, los datos a menudo se generan y se grafican en la pantalla en una línea, > y `plt.savefig` no parece ser una método posible. > Una posibilidad para guardar la figura en el archivo es entonces > > * guardar una referencia a la figura actual en una variable local (con `plt.gcf`) > * llamar al método de la clase `savefig` desde esa variable > > ~~~ > fig = plt.gcf() # Obten la figura actual > data.plot(kind='bar') > fig.savefig('my_figure.png') > ~~~ > {: .language-python}
uk: > > Зауважимо, що функції в `plt` посилаються на глобальну змінну графіка > і після того, як графік виведено на екран (наприклад, за допомогою `plt.show`) > matplotlib змусить цю змінну посилатися на новий порожній графік. > Тому переконайтеся, що ви викликаєте `plt.savefig` перед тим, як графік буде відображено > на екрані, інакше ви можете створити файл із порожнім графіком. > > При використанні dataframes дані часто генеруються та відображаються на екрані в один рядок, > тому `plt.savefig` вважається не найкращім рішенням. > Однією з можливостей зберегти графік у файл є > > * зберегти посилання на поточний графік у локальну змінну (з `plt.gcf`) , > * та викликати метод `savefig` з класу тієї змінної. > > ~~~ > fig = plt.gcf() # посилання на поточний графік у локальній змінній > data.plot(kind='bar') > fig.savefig('my_figure.png') > ~~~ > {: .language-python}

source: > ## Making your plots accessible
es: > ## Hacer tus gráficas accesibles
uk: > ## Зробіть ваш графік доступним

source: > > Whenever you are generating plots to go into a paper or a presentation, there are a few things you can do to make sure that everyone can understand your plots. > * Always make sure your text is large enough to read. Use the `fontsize` parameter in `xlabel`, `ylabel`, `title`, and `legend`, and [`tick_params` with `labelsize`](https://matplotlib.org/2.1.1/api/_as_gen/matplotlib.pyplot.tick_params.html) to increase the text size of the numbers on your axes. > * Similarly, you should make your graph elements easy to see. Use `s` to increase the size of your scatterplot markers and `linewidth` to increase the sizes of your plot lines. > * Using color (and nothing else) to distinguish between different plot elements will make your plots unreadable to anyone who is colorblind, or who happens to have a black-and-white office printer. For lines, the `linestyle` parameter lets you use different types of lines. For scatterplots, `marker` lets you change the shape of your points. If you're unsure about your colors, you can use [Coblis](https://www.color-blindness.com/coblis-color-blindness-simulator/) or [Color Oracle](https://colororacle.org/) to simulate what your plots would look like to those with colorblindness.
es: > > Siempre que estes generando gráficos que van en un documento o una presentación, hay algunas cosas que puedes hacer para asegurarte de que todos puedan entender tus diagramas > * Siempre asegúrate de que tu texto es lo suficientemente grande para leerlo. Usa el parámetro `fontsize` en `xlabel`, `ylabel`, `title`, y `legend`, y [`tick_params` con `labelsize`](https://matplotlib.org/2.1.1/api/_as_gen/matplotlib.pyplot.tick_params.html) para aumentar el tamaño del texto de los números en sus ejes. > * Del mismo modo, debes hacer que los elementos de tus gráficos sean fáciles de ver. Usa `s` para aumentar el tamaño de los marcadores de tu diagrama de dispersión y `linewidth` para aumentar el tamaño de las líneas del trazado. > * Usar colores (y nada más) para distinguir entre diferentes elementos del gráfico hará que los trazados sean ilegibles para cualquier persona daltónica o que tenga una impresora en blanco y negro. Para líneas, el parámetro `linestyle` permite utilizar diferentes tipos de líneas. Para diagramas de dispersión, `marker` permite cambiar la forma de los puntos. Si no estás seguro acerca de tus colores, puede usar [Coblis](https://www.color-blindness.com/coblis-color-blindness-simulator/) o [Color Oracle](https://colororacle.org/) para simular cómo se verían tus gráficos para aquellos con daltonismo.
uk: > > Щоразу, коли ви створюєте графіки для статті чи презентації, ви можете зробити кілька речей, щоб переконатися, що всі зрозуміють ваші графіки. > * Завжди переконайтеся, що ваш текст достатньо великий для читання. Використовуйте параметр `fontsize` в `xlabel`, `ylabel`, `title`, та `legend`, and [`tick_params` with `labelsize`](https://matplotlib.org/2.1.1/api/_as_gen/matplotlib.pyplot.tick_params.html) щоб збільшити розмір тексту чисел на ваших осях. > * Подібним чином, ви маєте зробити елементи графіка легкими для перегляду. Використовуйте `s` щоб збільшити розмір маркерів діаграми розсіювання, і `linewidth` щоб збільшити розміри ліній вашого графіка. > * Використання кольору (і нічого іншого) для розрізнення різних елементів графіку зробить ваші графіки нечитабельними для будь-кого, хто є дальтоніком або має чорно-білий офісний принтер. Для ліній параметр `linestyle` дозволяє використовувати різні типи ліній. Для діаграм розсіювання `marker` дозволяє змінювати форму ваших точок. Якщо ви не впевнені щодо своїх кольорів, ви можете скористатися [Coblis](https://www.color-blindness.com/coblis-color-blindness-simulator/) or [Color Oracle](https://colororacle.org/) щоб імітувати, як виглядатимуть ваші графіки для людей з дальтонізмом

source: --- layout: break title: "Lunch" teaching: 0 exercises: 0 break: 45 ---
es: --- layout: break title: "Almuerzo" teaching: 0 exercises: 0 break: 45 ---
uk: --- layout: break title: "Ланч" teaching: 0 exercises: 0 break: 45 ---

source: Over lunch, reflect on and discuss the following: * What sort of packages might you use in Python and why would you use them? * How would data need to be formatted to be used in Pandas data frames? Would the data you have meet these requirements? * What limitations or problems might you run into when thinking about how to apply what we've learned to your own projects or data?
es: Durante el almuerzo, reflexiona y discute lo siguiente: * ¿Qué tipo de paquetes podrías usar en Python y por qué los usarías? * ¿Cómo tendrían que formatearse los datos para ser utilizados en los DataFrames de Pandas? ¿Los datos que tienes cumplen con estos requisitos? * ¿Qué limitaciones o problemas podrías encontrar al pensar en cómo aplicar lo que hemos aprendido a tus propios proyectos o datos?
uk: Під час обіду поміркуйте та обговоріть наступне: * Які типи пакетів ви можете використовувати в Python і чому ви їх використовуєте? * Як мають бути відформатовані дані, щоб використовувати їх у фреймах даних Pandas? Чи відповідатимуть ваші дані цим вимогам? * З якими обмеженнями або проблемами ви можете зіткнутися, коли думаєте про те, як застосувати те, що ми дізналися, до ваших власних проектів або даних?

source: --- title: "Lists" teaching: 10 exercises: 10 questions: - "How can I store multiple values?" objectives: - "Explain why programs need collections of values." - "Write programs that create flat lists, index them, slice them, and modify them through assignment and method calls." keypoints: - "A list stores many values in a single structure." - "Use an item's index to fetch it from a list." - "Lists' values can be replaced by assigning to them." - "Appending items to a list lengthens it." - "Use `del` to remove items from a list entirely." - "The empty list contains no values." - "Lists may contain values of different types." - "Character strings can be indexed like lists." - "Character strings are immutable." - "Indexing beyond the end of the collection is an error." ---
es: --- title: "Listas" teaching: 10 exercises: 10 questions: - "¿Cómo puedo almacenar múltipes valores?" objectives: - "Explicar por qué los programas necesitan colecciones de valores." - "Escribir programa para crear listas, ordenarlas, dividirlas y modificarlas a través de asignaciones y métodos. keypoints: - "Una lista almacena muchos valores en una única estructura." - "Usa el índice de un elemento para buscarlo en una lista." - "Los valores de las listas se pueden reemplazar asignando nuevos valores." - "Agregar elementos a una lista la alarga." - "Usa `del` para eliminar elementos de una lista." - "La lista vacía no contiene valores." - "Las listas pueden contener valores de diferentes tipos." - "Las cadenas de caracteres se pueden indexar como listas." - "Las cadenas de caracteres son inmutables." - "La indexación más allá del final de la colección es un error." ---
uk: --- title: "Списки" teaching: 10 exercises: 10 questions: - "Як я можу зберігати набори значень?" objectives: - "Пояснити, навіщо програмам потрібні колекції значень" - "Писати програми, які створюють плоскі списки, індексують їх, розрізають і змінюють через призначення та виклики методів." keypoints: - "Список зберігає багато значень в одній структурі." - "Використовуйте індекс елемента, щоб отримати його зі списку." - "Значення списків можна замінити шляхом присвоєння." - "Додавання елементів до списку подовжує його" - "Використовуйте `del`, щоб повністю видалити елементи зі списку." - "Порожній список не містить значень." - "Списки можуть містити значення різних типів." - "Рядки символів можна індексувати як списки." - "Рядки символів є незмінними." - "Індексація за межами колекції є помилкою.." ---

source: ## A list stores many values in a single structure.
es: ## Una lista almacena muchos valores en una única estructura.
uk: ## Список є структурою даних, яка містить в собі багато значень.

source: * Doing calculations with a hundred variables called `pressure_001`, `pressure_002`, etc.,
es: * Hacer cálculos con 100 variables llamadas `pressure_001`, `pressure_002`, etc.,
uk: * Виконання обчислень із сотнею змінних під назвою `pressure_001`, `pressure_002` тощо,

source: would be at least as slow as doing them by hand. * Use a *list* to store many values together. * Contained within square brackets `[...]`. * Values separated by commas `,`. * Use `len` to find out how many values are in a list.
es: sería al menos tan lento como hacerlo a mano. * Usa una *lista* para almacenar muchos valores juntos. * Contenidos entre corchetes `[...]`. * Valores separados por comas `,`. * Usa `len` para averiguar cuántos valores hay en una lista.
uk: було б принаймні так само повільно, як робити їх вручну. * Використовуйте *список* для зберігання багатьох значень разом. * Список позначається квадратними дужками `[...]`. * Значення розділяються комами `,`. * Використовуйте `len`, щоб дізнатися, скільки значень у списку.

source: ## Use an item's index to fetch it from a list.
es: ## Usa el índice de un elemento para buscarlo en una lista.
uk: ## Щоб отримати елемент списку, використовуйте його індекс.

source: * Just like strings.
es: * Como en las secuencias de caracteres.
uk: * Це робиться так само, як і при роботі з рядками.

source: ~~~ print('zeroth item of pressures:', pressures[0]) print('fourth item of pressures:', pressures[4]) ~~~
es: ~~~ print('elemento cero de pressures:', pressures[0]) print('cuarto elemento de pressures:', pressures[4]) ~~~

source: {: .language-python} ~~~ zeroth item of pressures: 0.273 fourth item of pressures: 0.276 ~~~
es: {: .language-python} ~~~ elemento cero de pressures: 0.273 cuarto elemento de pressures: 0.276 ~~~

source: ## Lists' values can be replaced by assigning to them.
es: ## Los valores de las listas se pueden reemplazar asignándole un nuevo valor.
uk: ## Значення елементів списків можна замінити шляхом присвоєння.

source: * Use an index expression on the left of assignment to replace a value.
es: * Usa un índice a la izquierda de la asignación para reemplazar un valor.
uk: * Використовуйте індексний вираз ліворуч від знаку присвоєння, щоб замінити значення.

source: ~~~ pressures[0] = 0.265 print('pressures is now:', pressures) ~~~
es: ~~~ pressures[0] = 0.265 print('pressures es ahora:', pressures) ~~~
uk: ~~~ pressures[0] = 0.265 print('нові значення pressures:', pressures) ~~~

source: {: .language-python} ~~~ pressures is now: [0.265, 0.275, 0.277, 0.275, 0.276] ~~~
es: {: .language-python} ~~~ pressures es ahora: [0.265, 0.275, 0.277, 0.275, 0.276] ~~~
uk: {: .language-python} ~~~ Нові значення pressures: [0.265, 0.275, 0.277, 0.275, 0.276] ~~~

source: ## Appending items to a list lengthens it.
es: ## Agregar elementos a una lista la alarga.
uk: ## Додавання елементів до списку подовжує його.

source: * Use `list_name.append` to add items to the end of a list.
es: * Usa `list_name.append` para agregar elementos al final de una lista.
uk: * Щоб додати елементи в кінець списку, використовуйте `list_name.append`.

source: ~~~ primes = [2, 3, 5] print('primes is initially:', primes) primes.append(7) primes.append(9) print('primes has become:', primes) ~~~
es: ~~~ primes = [2, 3, 5] print('primes inicialmente es:', primes) primes.append(7) primes.append(9) print('primes ahora es :', primes) ~~~
uk: ~~~ primes = [2, 3, 5] print('початкові значення списку primes:', primes) primes.append(7) primes.append(9) print('список primes змінився:', primes) ~~~

source: {: .language-python} ~~~ primes is initially: [2, 3, 5] primes has become: [2, 3, 5, 7, 9] ~~~
es: {: .language-python} ~~~ primes inicialmente es: [2, 3, 5] primes ahora es : [2, 3, 5, 7, 9] ~~~
uk: {: .language-python} ~~~ початкові значення primes: [2, 3, 5] список primes змінився: [2, 3, 5, 7, 9] ~~~

source: * `append` is a *method* of lists.
es: * `append` es un *método* de las listas.
uk: * `append` є *методом*, який належить до списків.

source: * Like a function, but tied to a particular object.
es: * Como una función, pero vinculada a un objeto particular.
uk: * Методи подібні функціям, але вони прив’язані до певних об’єктів.

source: * Use `object_name.method_name` to call methods.
es: * Usa `object_name.method_name` para llamar métodos.
uk: * Для виклику методів використовується синтаксис `object_name.method_name` .

source: * Deliberately resembles the way we refer to things in a library.
es: * Deliberadamente se asemeja a la forma en que nos referimos a las cosas en una biblioteca.
uk: * Такий запис навмисно нагадує те, як ми посилаємось на щось визначене у будь-якій бібліотеці.

source: * We will meet other methods of lists as we go along.
es: * Encontraremos otros métodos de las listas a medida que avancemos.
uk: * По ходу роботи ми познайомимося з іншими методами, визначеними для списків.

source: * Use `help(list)` for a preview.
es: * Usa `help(list)` para ver un avance.
uk: * Якщо бажаєте подивитись на них зараз, використовуйте `help(list)`.

source: * `extend` is similar to `append`, but it allows you to combine two lists. For example:
es: * `extend` es similar a `append`, pero permite combinar dos listas. Por ejemplo:
uk: * `extend` - це метод, схожий на `append`, але він дозволяє об’єднувати два списки. Наприклад:

source: ~~~ teen_primes = [11, 13, 17, 19] middle_aged_primes = [37, 41, 43, 47] print('primes is currently:', primes) primes.extend(teen_primes) print('primes has now become:', primes) primes.append(middle_aged_primes) print('primes has finally become:', primes) ~~~
es: ~~~ teen_primes = [11, 13, 17, 19] middle_aged_primes = [37, 41, 43, 47] print('primes es:', primes) primes.extend(teen_primes) print('ahora primes es:', primes) primes.append(middle_aged_primes) print('finalmente primes es:', primes) ~~~
uk: ~~~ teen_primes = [11, 13, 17, 19] middle_aged_primes = [37, 41, 43, 47] print('поточний список primes:', primes) primes.extend(teen_primes) print('розширений список primes:', primes) primes.append(middle_aged_primes) print('фінальний список primes:', primes) ~~~
