Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: > > Reorder and properly indent the lines of code below > so that they print a list with the cumulative sum of data. > The result should be `[1, 3, 5, 10]`. > > ~~~ > cumulative.append(sum) > for number in data: > cumulative = [] > sum += number > sum = 0 > print(cumulative) > data = [1,2,2,5] > ~~~ > {: .language-python} > > ## Solution > > ~~~ > > sum = 0 > > data = [1,2,2,5] > > cumulative = [] > > for number in data: > > sum += number > > cumulative.append(sum) > > print(cumulative) > > ~~~ > > {: .language-python}
es: > > Reordena e indenta correctamente las líneas de código a continuación > para que se imprima una lista con la suma acumulativa de datos. > El resultado debería ser `[1, 3, 5, 10]`. > > ~~~ > cumulative.append(sum) > for number in data: > cumulative = [] > sum += number > sum = 0 > print(cumulative) > data = [1,2,2,5] > ~~~ > {: .language-python} > > ## Solución > > ~~~ > > sum = 0 > > data = [1,2,2,5] > > cumulative = [] > > for number in data: > > sum += number > > cumulative.append(sum) > > print(cumulative) > > ~~~ > > {: .language-python}
uk: > > Змініть порядок і належним чином розставте рядки коду нижче > щоб в результаті отримати список із сукупною сумою даних. > Результатом має бути `[1, 3, 5, 10]`. > > ~~~ > cumulative.append(sum) > for number in data: > cumulative = [] > sum += number > sum = 0 > print(cumulative) > data = [1,2,2,5] > ~~~ > {: .language-python} > > ## Рішення > > ~~~ > > sum = 0 > > data = [1,2,2,5] > > cumulative = [] > > for number in data: > > sum += number > > cumulative.append(sum) > > print(cumulative) > > ~~~ > > {: .language-python}

source: > ## Identifying Variable Name Errors
es: > ## Identificación de errores en el nombre de la variable
uk: > ## Виявлення помилок імен змінних

source: > > 1. Read the code below and try to identify what the errors are > *without* running it. > 2. Run the code and read the error message. > What type of `NameError` do you think this is? > Is it a string with no quotes, a misspelled variable, or a > variable that should have been defined but was not? > 3. Fix the error. > 4. Repeat steps 2 and 3, until you have fixed all the errors. > > ~~~ > for number in range(10): > # use a if the number is a multiple of 3, otherwise use b > if (Number % 3) == 0: > message = message + a > else: > message = message + "b" > print(message) > ~~~ > {: .language-python} > > ## Solution > > The variable `message` needs to be initialized and Python variable names are case sensitive: `number` and `Number` > > refer to different variables. > > ~~~ > > message = "" > > for number in range(10): > > # use a if the number is a multiple of 3, otherwise use b > > if (number % 3) == 0: > > message = message + "a" > > else: > > message = message + "b" > > print(message) > > ~~~ > > {: .language-python}
es: > > 1. Lee el siguiente código e intenta identificar cuáles son los errores > *sin* ejecutarlos. > 2. Ejecuta el código y lee el mensaje de error. > ¿Qué tipo de `NameError` crees que es? > ¿Es una secuencia de caracteres sin comillas, una variable mal escrita o una > variable que debería haber sido definida pero no lo fue? > 3. Corrige el error. > 4. Repite los pasos 2 y 3, hasta que haya solucionado todos los errores. > > ~~~ > for number in range(10): > # usa a si el número es un múltiplo de 3, usa b en los otros casos > if (Number % 3) == 0: > message = message + a > else: > message = message + "b" > print(message) > ~~~ > {: .language-python} > > ## Solución > > la variable `message` necesita ser inicializada y los nombres de las variables en Python son sensibles a las mayúsculas y minúsculas: `number` y `Number` > > se refieren a diferentes variables. > > ~~~ > > message = "" > > for number in range(10): > > # usa a si el número es un múltiplo de 3, usa b en los otros casos > > if (number % 3) == 0: > > message = message + "a" > > else: > > message = message + "b" > > print(message) > > ~~~ > > {: .language-python}
uk: > > 1. Прочитайте наведений нижче код і спробуйте визначити, у чому полягають помилки > *без* запуску програми. > 2. Запустіть код і прочитайте повідомлення про помилку. > Як ви думаєте, який це тип `NameError`? > Це рядок без лапок, змінна з орфографічною помилкою чи > змінна, яка мала бути визначена, але не була визначена? > 3. Виправте помилку. > 4. Повторюйте кроки 2 і 3, доки не виправите всі помилки. > > ~~~ > for number in range(10): > # use a if the number is a multiple of 3, otherwise use b > if (Number % 3) == 0: > message = message + a > else: > message = message + "b" > print(message) > ~~~ > {: .language-python} > > ## Рішення > > TЗмінну `message` потрібно ініціалізувати, а назви змінних Python чутливі до регістру: `number` і `Number` > > посилаються на різні змінні. > > ~~~ > > message = "" > > for number in range(10): > > # use a if the number is a multiple of 3, otherwise use b > > if (number % 3) == 0: > > message = message + "a" > > else: > > message = message + "b" > > print(message) > > ~~~ > > {: .language-python}

source: > ## Identifying Item Errors
es: > ## Identificación de errores en los elementos
uk: > ## Виявлення помилок програми

source: > > 1. Read the code below and try to identify what the errors are > *without* running it. > 2. Run the code, and read the error message. What type of error is it? > 3. Fix the error. > > ~~~ > seasons = ['Spring', 'Summer', 'Fall', 'Winter'] > print('My favorite season is ', seasons[4]) > ~~~ > {: .language-python} > > ## Solution > > This list has 4 elements and the index to access the last element in the list is `3`. > > ~~~ > > seasons = ['Spring', 'Summer', 'Fall', 'Winter'] > > print('My favorite season is ', seasons[3]) > > ~~~ > > {: .language-python}
es: > > 1. Lee el código que aparece a continuación e intenta identificar cuáles son los errores > *sin* ejecutarlo. > 2. Ejecuta el código y lee el mensaje de error. ¿Qué tipo de error es? > 3. Arregla el error. > > ~~~ > seasons = ['Spring', 'Summer', 'Fall', 'Winter'] > print('Mi temporada favorita es ', seasons[4]) > ~~~ > {: .language-python} > > ## Solución > > Esta lista tiene 4 elementos y el índice para acceder al último elemento de la lista es `3`. > > ~~~ > > seasons = ['Spring', 'Summer', 'Fall', 'Winter'] > > print('Mi temporada favorita es ', seasons[3]) > > ~~~ > > {: .language-python}
uk: > > 1. Прочитайте наведений нижче код і спробуйте визначити, у чому полягають помилки > *без* запуску програми. > 2. Запустіть код і прочитайте повідомлення про помилку. Який тип помилки? > 3. Виправте помилку. > > ~~~ > seasons = ['Spring', 'Summer', 'Fall', 'Winter'] > print('My favorite season is ', seasons[4]) > ~~~ > {: .language-python} > > ## Рішення > > Цей список складається з 4 елементів, а індекс для доступу до останнього елемента в списку – «3». > > ~~~ > > seasons = ['Spring', 'Summer', 'Fall', 'Winter'] > > print('My favorite season is ', seasons[3]) > > ~~~ > > {: .language-python}

source: --- title: "Conditionals" teaching: 10 exercises: 15 questions: - "How can programs do different things for different data?" objectives: - "Correctly write programs that use if and else statements and simple Boolean expressions (without logical operators)." - "Trace the execution of unnested conditionals and conditionals inside loops." keypoints: - "Use `if` statements to control whether or not a block of code is executed." - "Conditionals are often used inside loops." - "Use `else` to execute a block of code when an `if` condition is *not* true." - "Use `elif` to specify additional tests." - "Conditions are tested once, in order." - "Create a table showing variables' values to trace a program's execution." ---
es: --- title: "Condicionales" teaching: 10 exercises: 15 questions: - "¿Cómo pueden los programas hacer cosas diferentes para datos diferentes?" objectives: - "Escribir correctamente los programas que usan declaraciones `if` y `else` y expresiones booleanas simples (sin operadores lógicos)." - "Rastrear la ejecución de sentencias condicionales no anidados y sentencias condicionales dentro de bucles." keypoints: - "Utiliza las declaraciones `if` para controlar si se ejecuta o no un bloque de código." - "Las sentencias condicionales a menudo se usan dentro de bucles." - "Usa `else` para ejecutar un bloque de código cuando una condición` if` *no* es verdadera." - "Usa `elif` para especificar verificaciones adicionales." - "Las condiciones se verifican una vez, en orden." - "Crea una tabla que muestre los valores de las variables para rastrear la ejecución de un programa." ---
uk: --- title: "Умовні оператори" teaching: 10 exercises: 15 questions: - "Як програми можуть робити різні речі для різних даних?" objectives: - "Правильно писати програми, які використовують оператори if та else та прості логічні вирази (без логічних операторів)." - "Відстежувати виконання невкладених умовних операторів і умовних операторів усередині циклів." keypoints: - "Використовуйте оператори if, щоб контролювати виконання блоку коду." - "Умовні оператори часто використовуються всередині циклів." - "Використовуйте `else` для виконання блоку коду, коли умова `if` є *не* істинною." - "Використовуйте `elif` для визначення додаткових перевірок." - "Умови перевіряються один раз, по порядку." - "Створіть таблицю зі значеннями змінних для відстеження виконання програми" ---

source: ## Use `if` statements to control whether or not a block of code is executed.
es: ## Utiliza las declaraciones `if` para controlar si se ejecuta o no un bloque de código.
uk: ## Використовуйте оператори if, щоб контролювати виконання блоку коду..

source: * An `if` statement (more properly called a *conditional* statement)
es: Una declaración `if` (más propiamente llamada declaración *condicional*)
uk: * Оператор if (точніше його називають *умовним* оператором)

source: controls whether some block of code is executed or not. * Structure is similar to a `for` statement: * First line opens with `if` and ends with a colon * Body containing one or more statements is indented (usually by 4 spaces)
es: controla si algún bloque de código se ejecuta o no. * La estructura es similar a una declaración `for`: * La primera línea se abre con `if` y termina con dos puntos * El cuerpo que contiene una o más declaraciones es indentado (generalmente por 4 espacios)
uk: контролює виконання певного блоку коду. * Структура подібна до оператора `for`: * Перший рядок починається з `if` і закінчується двокрапкою * Тіло оператору, що містить одне або кілька тверджень, має відступ (зазвичай на 4 пробіли)

source: ## Conditionals are often used inside loops.
es: ## Las sentencias condicionales a menudo se usan dentro de bucles.
uk: ## Умовні оператори часто використовуються всередині циклів.

source: * Not much point using a conditional when we know the value (as above).
es: * No tiene mucho sentido usar una sentencia condicional cuando conocemos el valor (como arriba).
uk: * Немає особливого сенсу використовувати умовний оператор, коли ми знаємо значення (як вище).

source: * But useful when we have a collection to process.
es: * Pero es útil cuando tenemos una colección de datos para procesar.
uk: * Але корисно, коли у нас є колекція для обробки.

source: ## Use `else` to execute a block of code when an `if` condition is *not* true.
es: ## Utiliza `else` para ejecutar un bloque de código cuando una condición` if` *no* es verdadera.
uk: ## Використовуйте `else` для виконання блоку коду, коли умова `if` є *не* істинною.

source: * `else` can be used following an `if`.
es: * `else` se puede usar después de un` if`.
uk: * `else` можна використовувати після `if`.

source: * Allows us to specify an alternative to execute when the `if` *branch* isn't taken.
es: * Nos permite especificar una alternativa para ejecutar cuando no se entra en la *rama* `if`.
uk: * Дозволяє нам вказати альтернативу для виконання, коли умова *гілки* `if` не виконується.

source: ## Use `elif` to specify additional tests.
es: ## Usa `elif` para especificar verificaciones adicionales.
uk: ## Використовуйте `elif` для визначення додаткових перевірок.

source: * May want to provide several alternative choices, each with its own test.
es: * Tal vez desees proporcionar varias opciones alternativas, cada una con su propia verificación.
uk: * Може знадобитися надати кілька альтернативних варіантів, кожен з яких має своєю перевірку.

source: * Use `elif` (short for "else if") and a condition to specify these.
es: * Usa `elif` (abreviatura de" else if ") y una condición para especificarlos.
uk: * Використовуйте `elif` (скорочення від "else if") та умову, перевірки.

source: * Always associated with an `if`.
es: * Siempre asociado con un `if`.
uk: * Завжди асоціюється з `if`.

source: * Must come before the `else` (which is the "catch all").
es: * Debe venir antes de `else` (que "trata todo lo demás").
uk: * Має бути перед `else` (що слугує для того, щоб "підібрати все інше").

source: ## Conditions are tested once, in order.
es: ## Las condiciones se verifican una vez, en orden.
uk: ## Умови перевіряються один раз, по порядку.

source: * Python steps through the branches of the conditional in order, testing each in turn.
es: * Python recorre las ramas de las sentencias condicionales en orden, verificando cada una por turno.
uk: * Python послідовно проходить гілки умовного оператора, перевіряючи кожну по черзі.

source: * So ordering matters.
es: * Por lo que el orden es importante.
uk: * Отже, порядок має значення.

source: * Does *not* automatically go back and re-evaluate if values change.
es: * *No* retrocede automáticamente y vuelve a evaluar si los valores cambian.
uk: * Автоматично *не* повертається назад і не оцінює повторно, якщо значення змінюються.

source: * Often use conditionals in a loop to "evolve" the values of variables.
es: * A menudo se usa condicionales en un bucle para "evolucionar" los valores de las variables.
uk: * Умовні оператори часто використовуються в циклі, щоб «розвинути» значення змінних.

source: ## Create a table showing variables' values to trace a program's execution.
es: ## Crea una tabla que muestre los valores de las variables para rastrear la ejecución de un programa.
uk: ## Створіть таблицю зі значеннями змінних для відстеження виконання програми.

source: * The program must have a `print` statement *outside* the body of the loop
es: El programa debe tener una declaración `print` *fuera* del cuerpo del bucle.
uk: * Програма повинна мати оператор `print` *поза* тілом циклу,

source: to show the final value of `velocity`, since its value is updated by the last iteration of the loop.
es: para mostrar el valor final de 'velocity', ya que su valor se actualiza hasta la última iteración del bucle
uk: щоб показати остаточне значення змінної `velocity`, оскільки її значення оновлюється останньою ітерацією циклу.

source: > ## Compound Relations Using `and`, `or`, and Parentheses
es: > ## Relaciones Compuestas Usando `and`,` or`, y Paréntesis
uk: > ## Комбінація відношень з використанням «і», «або» та круглих дужок

source: > > Often, you want some combination of things to be true. You can combine > relations within a conditional using `and` and `or`. Continuing the example > above, suppose you have > > ~~~ > mass = [ 3.54, 2.07, 9.22, 1.86, 1.71] > velocity = [10.00, 20.00, 30.00, 25.00, 20.00] > > i = 0 > for i in range(5): > if mass[i] > 5 and velocity[i] > 20: > print("Fast heavy object. Duck!") > elif mass[i] > 2 and mass[i] <= 5 and velocity[i] <= 20: > print("Normal traffic") > elif mass[i] <= 2 and velocity[i] <= 20: > print("Slow light object. Ignore it") > else: > print("Whoa! Something is up with the data. Check it") > ~~~ > {: .language-python} > > Just like with arithmetic, you can and should use parentheses whenever there > is possible ambiguity. A good general rule is to *always* use parentheses > when mixing `and` and `or` in the same condition. That is, instead of: > > ~~~ > if mass[i] <= 2 or mass[i] >= 5 and velocity[i] > 20: > ~~~ > {: .language-python} > > write one of these: > > ~~~ > if (mass[i] <= 2 or mass[i] >= 5) and velocity[i] > 20: > if mass[i] <= 2 or (mass[i] >= 5 and velocity[i] > 20): > ~~~ > {: .language-python} > > so it is perfectly clear to a reader (and to Python) what you really mean.
es: > > A menudo, quieres alguna combinación de cosas para que la condición sea verdadera. Puedes combinar > relaciones dentro de un condicional usando `and` y `or`. Continuando con el ejemplo > arriba, suponga que tienes > > ~~~ > mass = [ 3.54, 2.07, 9.22, 1.86, 1.71] > velocity = [10.00, 20.00, 30.00, 25.00, 20.00] > > i = 0 > for i in range(5): > if mass[i] > 5 and velocity[i] > 20: > print("Fast heavy object. Duck!") > elif mass[i] > 2 and mass[i] <= 5 and velocity[i] <= 20: > print("Normal traffic") > elif mass[i] <= 2 and velocity[i] <= 20: > print("Slow light object. Ignore it") > else: > print("Whoa! Something is up with the data. Check it") > ~~~ > {: .language-python} > > Al igual que con la aritmética, debes usar paréntesis siempre que > se presente una posible ambigüedad. Una buena regla general es *siempre* usar paréntesis > al mezclar `and` y` or` en la misma condición. Es decir, en lugar de: > > ~~~ > if mass[i] <= 2 or mass[i] >= 5 and velocity[i] > 20: > ~~~ > {: .language-python} > > escribe uno de estos: > > ~~~ > if (mass[i] <= 2 or mass[i] >= 5) and velocity[i] > 20: > if mass[i] <= 2 or (mass[i] >= 5 and velocity[i] > 20): > ~~~ > {: .language-python} > > así que es perfectamente claro para un lector (y para Python) lo que realmente quieres decir.
uk: > > Часто потрібно, щоб певна комбінація речей була правдою. Можна комбінувати > відносини в умовному операторі з використанням «і» та «або». Продовжуючи приклад, > наведений вище, припустімо, що у вас є> > ~~~ > mass = [ 3.54, 2.07, 9.22, 1.86, 1.71] > velocity = [10.00, 20.00, 30.00, 25.00, 20.00] > > i = 0 > for i in range(5): > if mass[i] > 5 and velocity[i] > 20: > print("Швидкий важкий предмет. Качка!") > elif mass[i] > 2 and mass[i] <= 5 and velocity[i] <= 20: > print("Нормальний трафік") > elif mass[i] <= 2 and velocity[i] <= 20: > print("Повільний, легкий предмет. Ігноруйте це") > else: > print("ой! Щось сталося з даними. Перевірте це") > ~~~ > {: .language-python} > > Так само, як і в арифметиці, ви можете і маєте використовувати круглі дужки, > якщо у виразі можлива двозначність. Хорошим загальним правилом є використання круглих дужок *завжди* > при одночасному використанні `і` та `або` в однакових умовах. Тобто замість: > > ~~~ > if mass[i] <= 2 or mass[i] >= 5 and velocity[i] > 20: > ~~~ > {: .language-python} > > напишіть одну умов нижче: > > ~~~ > if (mass[i] <= 2 or mass[i] >= 5) and velocity[i] > 20: > if mass[i] <= 2 or (mass[i] >= 5 and velocity[i] > 20): > ~~~ > {: .language-python} > > і тоді читачеві (і Python) цілком зрозуміло, що ви насправді маєте на увазі.

source: > > What does this program print? > > ~~~ > pressure = 71.9 > if pressure > 50.0: > pressure = 25.0 > elif pressure <= 50.0: > pressure = 0.0 > print(pressure) > ~~~ > {: .language-python} > > > ## Solution > > > > ~~~ > > 25.0 > > ~~~ > > {: .output}
es: > > ¿Qué imprime este programa? > > ~~~ > pressure = 71.9 > if pressure > 50.0: > pressure = 25.0 > elif pressure <= 50.0: > pressure = 0.0 > print(pressure) > ~~~ > {: .language-python} > > > ## Solución > > > > ~~~ > > 25.0 > > ~~~ > > {: .output}
uk: > > Що надрукує ця програма? > > ~~~ > pressure = 71.9 > if pressure > 50.0: > pressure = 25.0 > elif pressure <= 50.0: > pressure = 0.0 > print(pressure) > ~~~ > {: .language-python} > > > ## Рішення > > > > ~~~ > > 25.0 > > ~~~ > > {: .output}

source: > ## Trimming Values
es: > ## Recorte de valores
uk: > ## Обрізання значень

source: > > Fill in the blanks so that this program creates a new list > containing zeroes where the original list's values were negative > and ones where the original list's values were positive. > > ~~~ > original = [-1.5, 0.2, 0.4, 0.0, -1.3, 0.4] > result = ____ > for value in original: > if ____: > result.append(0) > else: > ____ > print(result) > ~~~ > {: .language-python} > > ~~~ > [0, 1, 1, 1, 0, 1] > ~~~
es: > > Complete los espacios en blanco para que este programa cree una nueva lista > que contenga ceros (0) donde los valores de la lista original eran negativos > y unos (1) donde los valores de la lista original eran positivos > ~~~ > original = [-1.5, 0.2, 0.4, 0.0, -1.3, 0.4] > result = ____ > for value in original: > if ____: > result.append(0) > else: > ____ > print(result) > ~~~ > {: .language-python} > > ~~~ > [0, 1, 1, 1, 0, 1] > ~~~
uk: > > Заповніть порожні поля, щоб програма створила новий список, > що містить нулі, якщо початкові значення списку були від’ємними > та одиниці, де початкові значення списку були додатними. > > ~~~ > original = [-1.5, 0.2, 0.4, 0.0, -1.3, 0.4] > result = ____ > for value in original: > if ____: > result.append(0) > else: > ____ > print(result) > ~~~ > {: .language-python} > > ~~~ > [0, 1, 1, 1, 0, 1] > ~~~

source: > ## Processing Small Files
es: > ## Procesando archivos pequeños
uk: > ## Обробка малих файлів

source: > > Modify this program so that it only processes files with fewer than 50 records. > > ~~~ > import glob > import pandas as pd > for filename in glob.glob('data/*.csv'): > contents = pd.read_csv(filename) > ____: > print(filename, len(contents)) > ~~~ > {: .language-python} > > ## Solution > > > > ~~~ > > import glob > > import pandas as pd > > for filename in glob.glob('data/*.csv'): > > contents = pd.read_csv(filename) > > if len(contents)<50: > > print(filename, len(contents)) > > ~~~ > > {: .language-python}
es: > > Modifica este programa de manera que solo procese archivos con menos de 50 registros. > > ~~~ > import glob > import pandas as pd > for filename in glob.glob('data/*.csv'): > contents = pd.read_csv(filename) > ____: > print(filename, len(contents)) > ~~~ > {: .language-python} > > ## Solución > > > > ~~~ > > import glob > > import pandas as pd > > for filename in glob.glob('data/*.csv'): > > contents = pd.read_csv(filename) > > if len(contents)<50: > > print(filename, len(contents)) > > ~~~ > > {: .language-python}
uk: > > Змініть цю програму так, щоб вона обробляла лише файли з менш ніж 50 записами. > > ~~~ > import glob > import pandas as pd > for filename in glob.glob('data/*.csv'): > contents = pd.read_csv(filename) > ____: > print(filename, len(contents)) > ~~~ > {: .language-python} > > ## Рішення > > > > ~~~ > > import glob > > import pandas as pd > > for filename in glob.glob('data/*.csv'): > > contents = pd.read_csv(filename) > > if len(contents)<50: > > print(filename, len(contents)) > > ~~~ > > {: .language-python}

source: > ## Initializing
es: > ## Iniciando
uk: > ## Ініціалізація
