Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: * Provide values to the function (i.e., the things to print) in parentheses.
es: * Proporciona valores a la función (es decir, algo que quieres mostrar) entre paréntesis.
uk: * Щоб передати функції значення (тобто, те що треба надрукувати), їх треба помістити у дужки.

source: * To add a string to the printout, wrap the string in single or double quotes.
es: * Para agregar una secuencia de caracteres a la salida, se debe escribir el mismo entre comillas simples o dobles.
uk: * Щоб направити до друку рядок тексту, його треба помістити у одинарні або подвійні лапки.

source: * The values passed to the function are called **arguments**
es: * Los valores pasados a la función se denominan **argumentos**
uk: * Значення, які передаються до функції, називаються **аргументами**

source: * `print` automatically puts a single space between items to separate them.
es: * `print` pone automáticamente un espacio simple entre los ítems para separarlos.
uk: * `print` автоматично додає пропуск проміж надрукованими аргументами, щоб розділити їх.

source: * And wraps around to a new line at the end.
es: * Y se hace a una nueva línea al final.
uk: * Також `print` переходить на новий рядок після друку.

source: ## Variables must be created before they are used.
es: ## Las variables deben ser creadas antes de ser utilizadas.
uk: ## Змінні мають бути створені перед їх використанням.

source: * If a variable doesn't exist yet, or if the name has been mis-spelled,
es: * Si una variable aún no existe, o si el nombre ha sido mal escrito,
uk: * Якщо змінна не їснує, або її назва написана з помилкою,

source: Python reports an error. (Unlike some languages, which "guess" a default value.)
es: Python informa un error. (A diferencia de otros lenguajes, que "suponen" un valor predeterminado).
uk: Python видасть помилку. (На відміну від деяких іншіх мов, які можуть "вгадати" якесь значення за замовчуванням.)

source: * The last line of an error message is usually the most informative.
es: * La última línea de un mensaje de error suele ser la más informativa.
uk: * Останній рядок у повідомленні про помилку є найбільш інформативним.

source: * We will look at error messages in detail [later]({{ page.root }}/15-scope/#reading-error-messages).
es: * Examinaremos los mensajes de error en detalle [later]({{ page.root }}/15-scope/#reading-error-messages).
uk: * Ми більш детально подивимось на повідомлення про помилки [пізніше]({{ page.root }}/15-scope/#reading-error-messages).

source: > ## Variables Persist Between Cells
es: > ## Las variables persisten entre celdas
uk: > ## Змінні зберігаються між клітинками

source: > > Be aware that it is the *order* of execution of cells that is important in a Jupyter notebook, not the order > in which they appear. Python will remember *all* the code that was run previously, including any variables you have > defined, irrespective of the order in the notebook. Therefore if you define variables lower down the notebook and then > (re)run cells further up, those defined further down will still be present. As an example, create two cells with the > following content, in this order: > > ~~~ > print(myval) > ~~~ > {: .language-python} > > ~~~ > myval = 1 > ~~~ > {: .language-python} > > If you execute this in order, the first cell will give an error. However, if you run the first cell *after* the second > cell it will print out `1`. To prevent confusion, it can be helpful to use the `Kernel` -> `Restart & Run All` option which > clears the interpreter and runs everything from a clean slate going top to bottom.
es: > > Tenga en cuenta que el orden de ejecución en las celdas es importante en un cuaderno (**notebook**) de Jupyter, no el orden > en que aparecen. Python recordará *todo* el código que se ejecutó anteriormente, incluidas las variables que hayas > definido, independientemente del orden en el cuaderno. Por lo tanto, si defines variables más abajo en el cuaderno y luego > (re) ejecutas las celdas más arriba, estas definidas más abajo aún estarán presentes. Como ejemplo, crea dos celdas con el > siguiente contenido, en este orden: > > ~~~ > print(myval) > ~~~ > {: .language-python} > > ~~~ > myval = 1 > ~~~ > {: .language-python} > > Si lo ejecutas en este orden, la primera celda dará un error. Sin embargo, si ejecutas la primera celda *después* de la segunda celda, > se mostrará `1`. Para evitar confusiones, puede ser de ayuda usar la opción del `Kernel` -> `Restart & Run All` que > borra el intérprete y ejecuta todo desde una pantalla limpia, yendo de arriba a abajo.
uk: > > Майте на увазі, що в блокноті Jupyter важливий *порядок* виконання клітинок, а не порядок > їх появи. Python запам’ятає *весь* код, який було запущено раніше, включно з будь-якими змінними, > які ви визначили, незалежно від порядку в блокноті. Тому, якщо ви визначите змінні нижче в блокноті, а потім > (повторно) запустите комірки вище, то ті клітинки, що визначені нижче, все одно будуть присутні. Для прикладу створіть дві клітинки з таким вмістом у такому порядку: > > ~~~ > print(myval) > ~~~ > {: .language-python} > > ~~~ > myval = 1 > ~~~ > {: .language-python} > >Якщо ви виконуєте це послідовно, перша клітинка дасть помилку. Однак,якщо ви запустите першу клітинку *після* другої, > то буде надруковано `1`. Щоб уникнути плутанини, може бути корисним скористатися опцією `Kernel` -> `Restart & Run All`, яка > очищує інтерпретатор і запускає все з чистого листа зверху вниз.

source: ## Variables can be used in calculations.
es: ## Las variables pueden ser usadas en cálculos.
uk: ## Змінні можна використовувати для обчислень.

source: * We can use variables in calculations just as if they were values.
es: * Podemos usar variables en los cálculos así como si fueran valores.
uk: * Ми можемо використовувати змінні в обчисленнях так само, як би вони були значеннями.

source: * Remember, we assigned the value `42` to `age` a few lines ago.
es: * Recuerda, hemos asignado el valor `42` a la variable `age` unas líneas arriba.
uk: * Пам’ятайте, ми присвоїли значення `42` змінній `age` кількома рядками вище.

source: ## Use an index to get a single character from a string.
es: ## Usa un índice para obtener un solo carácter de una secuencia de caracteres.
uk: ## Використовуйте індекс, щоб отримати один символ із рядка.

source: * The characters (individual letters, numbers, and so on) in a string are
es: * Los caracteres (letras individuales, números, etc.) en una secuencia de caracteres están
uk: * Символи (окремі літери, цифри тощо) у рядку є

source: ordered. For example, the string `'AB'` is not the same as `'BA'`. Because of this ordering, we can treat the string as a list of characters. * Each position in the string (first, second, etc.) is given a number. This number is called an **index** or sometimes a subscript. * Indices are numbered from 0. * Use the position's index in square brackets to get the character at that position.
es: ordenados. Por ejemplo, la secuencia de caracteres `'AB'` no es lo mismo que `'BA'`. Porque en este orden, podemos tratar la secuencia de caracteres como una lista de caracteres. * Cada posición en la secuencia de caracteres (primero, segundo, etc.) recibe un número. A este número se le llama **índice** o, a veces, subíndice. * Los índices están numerados a partir del 0. * Usa el índice de la posición entre corchetes para obtener el carácter en esa posición.
uk: упорядкованими. Наприклад, рядок `'AB'` не те саме, що `'BA'`. Завдяки такому упорядкуванню ми можемо розглядати рядок як список символів. * Кожна позиція в рядку (перша, друга тощо) має номер. Це число називається **індексом** або іноді нижнім індексом. * Індекси нумеруються від 0. * Використовуйте індекс позиції в квадратних дужках, щоб отримати символ з тієї позиції.

source: ![an illustration of indexing](../fig/2_indexing.svg)
es: ![representación gráfica de como funciona el indexado]({{ site.baseurl }}/fig/2_indexing.svg)

source: ## Use a slice to get a substring.
es: ## Usa un corte para obtener una parte de una secuencia de caracteres.
uk: ## Використовуйте зріз, щоб отримати підрядок.

source: * A part of a string is called a **substring**. A substring can be as short as a
es: * Una parte de una secuencia de caracteres también es llamada **fragmento de secuencia de caracteres**. Un fragmento de secuencia de caracteres puede ser tan corto como
uk: * Частина рядка має назву **підрядок**. Підрядок може бути дуже коротким -

source: single character. * An item in a list is called an element. Whenever we treat a string as if it were a list, the string's elements are its individual characters. * A slice is a part of a string (or, more generally, any list-like thing). * We take a slice by using `[start:stop]`, where `start` is replaced with the index of the first element we want and `stop` is replaced with the index of the element just after the last element we want. * Mathematically, you might say that a slice selects `[start:stop)`. * The difference between `stop` and `start` is the slice's length. * Taking a slice does not change the contents of the original string. Instead, the slice is a copy of part of the original string.
es: un único carácter. * Un ítem en una lista es llamado elemento. Cada vez que tratamos una secuencia de caracteres como si fuese una lista, los elementos de una secuencia de caracteres son sus caracteres individuales. * Un corte es una parte de una secuencia de caracteres (o, de manera general, cualquier objecto similar a una lista). * Tomamos un corte usando `[inicio:fin]`, donde `inicio` es reemplazado por el índice del primer elemento que queremos y `fin` es reemplazado por el índice del elemento justo después del último elemento que queremos. * Matemáticamente, podría decirse que se selecciona el corte `[inicio:fin)`. * La diferencia entre `fin` e `inicio` es la longitud del corte. * Tomar un corte no cambia el contenido de la secuencia de caracteres original. En cambio, el corte es una copia de una parte de la secuencia de caracteres original.
uk: лише один символ. * Список складається з елементів. У випадку, коли рядок розглядається як список, його елементами є окремі символи. * Фрагмент - це частина рядка (в загальному випадку, будь-який вираз). * Фрагмент вилучається за допомогою `[start:stop]`, де `start` замінюється на індекс елемента, який повинен бути першим, а `stop` - на індекс елемента, який розташований відразу після останнього потрібного елемента. * З математичної точки зору, фрагмент вибирає `[start:stop)`. * Проміжок між `stop` and `start` - це довжина фрагмента. * Вилучення фрагмента не змінює вміст вихідного рядка. Навпаки, фрагмент буде копією частини вихідного рядка.

source: ## Use the built-in function `len` to find the length of a string.
es: ## Usa la función incorporada `len` para encontrar la longitud de una secuencia de caracteres.
uk: ## Використовуйте вбудовану функцію `len`, щоб знайти довжину рядка.

source: * Nested functions are evaluated from the inside out,
es: * Las funciones anidadas se evalúan de adentro hacia afuera,
uk: * Вкладені функції опрацьовуються, починаючи з середини,

source: like in mathematics.
es: como en matemática.
uk: як в математиці.

source: ## Python is case-sensitive.
es: ## Python distingue mayúsculas de minúsculas
uk: ## Python чутливий до регістру.

source: * Python thinks that upper- and lower-case letters are different,
es: * Python piensa que las letras mayúsculas y minúsculas son diferentes,
uk: * Python вважає, що великі та малі літери різні,

source: so `Name` and `name` are different variables. * There are conventions for using upper-case letters at the start of variable names so we will use lower-case letters for now.
es: así que `Nombre` y `nombre` son variables diferentes. * Existen convenciones para usar letras mayúsculas al comienzo de los nombres de las variables, por ahora nosotros usaremos letras minúsculas.
uk: таким чинoм, `Name` та `name` є різними змінними. * Існують домовленості про використання великих літер на початку імен змінних, тому ми будемо використовувати малі літери.

source: ## Use meaningful variable names.
es: ## Usa nombres de variables significativos.
uk: ## Використовуйте осмислені назви змінних.

source: * Python doesn't care what you call variables as long as they obey the rules
es: * A Python no le importa cómo nombras las variables siempre que obedezcan las reglas
uk: * Python байдуже, як ви називаєте змінні, якщо вони відповідають правилам

source: (alphanumeric characters and the underscore).
es: (caracteres alfanuméricos y guiones bajos).
uk: (букви, цифри та підкреслення).

source: ~~~ flabadab = 42 ewr_422_yY = 'Ahmed' print(ewr_422_yY, 'is', flabadab, 'years old') ~~~
es: ~~~ flabadab = 42 ewr_422_yY = 'Ahmed' print(ewr_422_yY, 'tiene', flabadab, 'años') ~~~

source: * Use meaningful variable names to help other people understand what the program does.
es: * Usa nombres de variables significativas para ayudar a otras personas a comprender lo que hace el programa.
uk: * Використовуйте змістовні назви змінних, щоб допомогти іншим зрозуміти, що робить програма.

source: * The most important "other person" is your future self.
es: * La "otra persona" más importante es tu futuro yo.
uk: * Найважливіша «інша людина» — це ваше майбутнє.

source: > ## Swapping Values
es: > ## Intercambiar valores
uk: > ## Заміна значень

source: > > Fill the table showing the values of the variables in this program > *after* each statement is executed. > > ~~~ > # Command # Value of x # Value of y # Value of swap # > x = 1.0 # # # # > y = 3.0 # # # # > swap = x # # # # > x = y # # # # > y = swap # # # # > ~~~ > {: .language-python} > > ## Solution > > > > ~~~ > > # Command # Value of x # Value of y # Value of swap # > > x = 1.0 # 1.0 # not defined # not defined # > > y = 3.0 # 1.0 # 3.0 # not defined # > > swap = x # 1.0 # 3.0 # 1.0 # > > x = y # 3.0 # 3.0 # 1.0 # > > y = swap # 3.0 # 1.0 # 1.0 # > > ~~~ > > {: .output} > > > > These three lines exchange the values in `x` and `y` using the `swap` > > variable for temporary storage. This is a fairly common programming idiom.
es: > > Rellene la tabla que muestra los valores de las variables en este programa > *después* de ejecutar cada instrucción. > > ~~~ > # Command # Value of x # Value of y # Value of swap # > x = 1.0 # # # # > y = 3.0 # # # # > swap = x # # # # > x = y # # # # > y = swap # # # # > ~~~ > {: .language-python} > > ## Solución > > > > ~~~ > > # Command # Value of x # Value of y # Value of swap # > > x = 1.0 # 1.0 # not defined # not defined # > > y = 3.0 # 1.0 # 3.0 # not defined # > > swap = x # 1.0 # 3.0 # 1.0 # > > x = y # 3.0 # 3.0 # 1.0 # > > y = swap # 3.0 # 1.0 # 1.0 # > > ~~~ > > {: .output} > > > > Estas tres líneas intercambian los valores en `x` e` y` usando la variable `swap` > > como almacenamiento temporario. Esto es bastante común en lenguajes de programación.
uk: > > Заповніть таблицю, вказавши значення змінних у цій програмі > *після* виконання кожного оператора. > > ~~~ > # Оператор # Значення x # Значення y # Значення swap # > x = 1.0 # # # # > y = 3.0 # # # # > swap = x # # # # > x = y # # # # > y = swap # # # # > ~~~ > {: .language-python} > > ## Рішення > > > > ~~~ > > # Оператор # Значення x # Значення y # Значення swap # > > x = 1.0 # 1.0 # не визначено # не визначено # > > y = 3.0 # 1.0 # 3.0 # не визначено # > > swap = x # 1.0 # 3.0 # 1.0 # > > x = y # 3.0 # 3.0 # 1.0 # > > y = swap # 3.0 # 1.0 # 1.0 # > > ~~~ > > {: .output} > > > > Ці три рядки обмінюються значеннями в `x` та `y` за допомогою `swap` - > > змінною для тимчасового зберігання. Це досить поширена ідіома програмування.

source: > ## Predicting Values
es: > ## Predicción de Valores
uk: > ## Прогнозування значень

source: > > What is the final value of `position` in the program below? > (Try to predict the value without running the program, > then check your prediction.) > > ~~~ > initial = 'left' > position = initial > initial = 'right' > ~~~ > {: .language-python} > > ## Solution > > > > ~~~ > > 'left' > > ~~~ > > {: .output} > > >> The `initial` variable is assigned the value `'left'`. > > In the second line, the `position` variable also receives >> the string value `'left'`. In third line, the `initial` variable is given the >> value `'right'`, but the `position` variable retains its string value >> of `'left'`.
es: > > ¿Cuál es el valor final de 'position' en el programa a continuación? > (Intenta predecir el valor sin ejecutar el programa, > luego comprueba tu predicción) > > ~~~ > initial = 'left' > position = initial > initial = 'right' > ~~~ > {: .language-python} > > ## Solución > > > > ~~~ > > 'left' > > ~~~ > > {: .output} > > >> A la variable `initial` se le asigna el valor `'left'`. > > en la segunda línea, la variable `position` también recibe >> como valor la secuencia de caracteres `'left'`. En la tercera línea, la variable `initial` toma el valor >> `'right'`, y la variable `position` conserva su valor de secuencia de caracteres >> `'left'`.
uk: > > Яке кінцеве значення `position` у наведеній нижче програмі? > (Спробуйте передбачити значення без запуску програми, > а потім перевірте свій прогноз). > > ~~~ > initial = 'left' > position = initial > initial = 'right' > ~~~ > {: .language-python} > > ## Рішення > > > > ~~~ > > 'left' > > ~~~ > > {: .output} > > >> Змінній `initial` присвоюється значення `'left'`. > > У другому рядку змінна `position` також отримує >> значення рядка `'left'`. У третьому рядку змінній `initial` надається >> значення `'right'`, але змінна `position` зберігає своє рядкове значення >> `'left'`.

source: > ## Challenge
es: > ## Desafío
uk: > ## Випробування

source: > > If you assign `a = 123`, > what happens if you try to get the second digit of `a` via `a[1]`? > > > ## Solution > > Numbers are not strings or sequences and Python will raise an error if you try to perform an index operation on a > > number. In the [next lesson on types and type conversion]({{ page.root }}/03-types-conversion/#convert-numbers-and-strings) > > we will learn more about types and how to convert between different types. If you want the Nth digit of a number you > > can convert it into a string using the `str` built-in function and then perform an index operation on that string. > > > > ~~~ > > a = 123 > > print(a[1]) > > ~~~ > > {: .language-python} > > ~~~ > > TypeError: 'int' object is not subscriptable > > ~~~ > > {: .error} > > > > > > ~~~ > > a = str(123) > > print(a[1]) > > ~~~ > > {: .language-python} > > ~~~ > > 2 > > ~~~ > > {: .output}
es: > > Si asignas `a = 123`, > ¿Qué sucede si intenta obtener el segundo dígito de 'a' a través de 'a [1] `? > > > ## Solución > > Los números no son secuencia de caracteres, por lo cual Python generará un error si intenta realizar una operación de índice en un > > número. En la [próxima lección de tipos de datos y conversión de tipos]({{ page.root }}/03-types-conversion/#convert-numbers-and-strings) > > aprenderemos más sobre los tipos de datos y cómo convertir entre los diferentes tipos. Si quieres el enésimo dígito de un número > > puedes convertirlo en una secuencia de caracteres usando la función incorporada `str` y luego realizar una operación de índice en esa secuencia de caracteres. > > > > ~~~ > > a = 123 > > print(a[1]) > > ~~~ > > {: .language-python} > > ~~~ > > TypeError: 'int' object is not subscriptable > > ~~~ > > {: .error} > > > > > > ~~~ > > a = str(123) > > print(a[1]) > > ~~~ > > {: .language-python} > > ~~~ > > 2 > > ~~~ > > {: .output}
uk: > > Якщо ви призначите `a = 123`, > що станеться, якщо ви спробуєте отримати другу цифру `a` через `a[1]` > > > ## Рішення > > Числа не є рядками чи послідовностями, і Python поверне помилку, якщо ви спробуєте виконати операцію індексування на > > числі. У [наступному уроці про типи та перетворення типів]({{ page.root }}/03-types-conversion/#convert-numbers-and-strings) > > ми дізнаємося більше про типи та про правила конвертації різних типів. Якщо вам потрібна N-та цифра числа, ви > > можете перетворити число на рядок за допомогою вбудованої функції `str`, а потім виконати операцію індексування цього рядка. > > > > ~~~ > > a = 123 > > print(a[1]) > > ~~~ > > {: .language-python} > > ~~~ > > TypeError: 'int' object is not subscriptable > > ~~~ > > {: .error} > > > > > > ~~~ > > a = str(123) > > print(a[1]) > > ~~~ > > {: .language-python} > > ~~~ > > 2 > > ~~~ > > {: .output}

source: > ## Choosing a Name
es: > ## Eligiendo un nombre
uk: > ## Вибір імені

source: > > Which is a better variable name, `m`, `min`, or `minutes`? > Why? > Hint: think about which code you would rather inherit > from someone who is leaving the lab: > > 1. `ts = m * 60 + s` > 2. `tot_sec = min * 60 + sec` > 3. `total_seconds = minutes * 60 + seconds` > > > ## Solution > > > > `minutes` is better because `min` might mean something like "minimum" > > (and actually is an existing built-in function in Python that we will cover later).
es: > > ¿Cuál es el mejor nombre de variable `m`,` min` o `minutes`? > Porqué? > Sugerencia: piensa qué código preferiría heredar > de alguien que abandona el laboratorio: > > 1. `ts = m * 60 + s` > 2. `tot_sec = min * 60 + sec` > 3. `total_seconds = minutes * 60 + seconds` > > > ## Solución > > > > `minutes` es mejor que porque `min` podría significar algo como "mínimo" > > (actualmente min es una función existente en Python que veremos más adelante).
uk: > > Яка назва змінної є кращою: `m`, `min` або `minutes`? > Чому? > Підказка: подумайте, який код ви б хотіли успадкувати > від когось, хто виходить з лабораторії: > > 1. `ts = m * 60 + s` > 2. `tot_sec = min * 60 + sec` > 3. `total_seconds = minutes * 60 + seconds` > > > ## Рішення > > > > `minutes` краще, тому що `min` може означати щось на зразок "мінімум" > > (і фактично це вбудована функція в Python, яку ми розглянемо пізніше).

source: > ## Slicing practice
es: > ## Práctica de corte
uk: > ## Практика застосування зрізів

source: > > What does the following program print? > > ~~~ > atom_name = 'carbon' > print('atom_name[1:3] is:', atom_name[1:3]) > ~~~ > {: .language-python} > > > ## Solution > > > > ~~~ > > atom_name[1:3] is: ar > > ~~~ > > {: .output}
es: > > ¿Qué muestra el siguiente programa? > > ~~~ > atom_name = 'carbon' > print('atom_name[1:3] is:', atom_name[1:3]) > ~~~ > {: .language-python} > > > ## Solución > > > > ~~~ > > atom_name[1:3] is: ar > > ~~~ > > {: .output}
uk: > > Що надрукує наступна программа? > > ~~~ > atom_name = 'carbon' > print('atom_name[1:3] is:', atom_name[1:3]) > ~~~ > {: .language-python} > > > ## Рішення > > > > ~~~ > > atom_name[1:3] is: ar > > ~~~ > > {: .output}

source: > ## Slicing concepts
es: > ## Conceptos de corte
uk: > ## Визначення зрізів
