Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: - Strings are defined in quotations `'...'`.
es: - Las cadenas de texto se definen con comillas `'...'`.
uk: - Рядки визначаються в лапках `'...'`.

source: - Integers and floating point numbers are defined without quotations.
es: - Los números enteros y de punto flotante se definen sin comillas.
uk: - Цілі числа та числа з плаваючою комою визначаються без лапок.

source: - Variables can contain letters, digits, and underscores `_`.
es: - Las variables pueden contener letras, números y guiones bajos `_`.
uk: - Змінні можуть містити літери, цифри та символ підкреслення "_".

source: - Cannot start with a digit.
es: - No pueden empezar con un número.
uk: - Не можуть починатися з цифри.

source: - Variables that start with underscores should be avoided.
es: - Las variables que empiezan con un guion bajo deben evitarse.
uk: - Слід уникати змінних, які починаються з підкреслення.

source: - Use `print(...)` to display values as text.
es: - Usa `print(...)` para ver los valores como texto.
uk: - Використовуйте `print(...)`, щоб відобразити значення як текст.

source: - Can use indexing on strings.
es: - Puedes usar indexación en cadenas de texto.
uk: - Можна використовувати індексацію рядків.

source: - Indexing starts at 0.
es: - La indexación empieza en 0.
uk: - Індексація починається з 0.

source: - Position is given in square brackets `[position]` following the variable name.
es: - Las posiciones se definen entre corchetes `[posición]` después del nombre de la variable.
uk: - Позиція вказується в квадратних дужках `[position]` після імені змінної.

source: - Take a slice using `[start:stop]`. This makes a copy of part of the original string.
es: - Toma un corte usando `[inicio:hasta]`. Esto genera una copia de dicha parte de la cadena de texto original.
uk: - Зріз створюється за допомогою `[start:stop]`. Це робить копію частини вихідного рядка)

source: - `start` is the index of the first element.
es: - `inicio` es el índice del primer elemento.
uk: - `start` є індексом першого елемента.

source: - `stop` is the index of the element after the last desired element.
es: - `hasta` es el índice del elemento posterior al último deseado.
uk: - `stop` є індексом елемента після останнього потрібного елемента.

source: - Use `len(...)` to find the length of a variable or string.
es: - Usa `len(...)` para encontrar la longitud de una variable o cadena de texto.
uk: - Використовуйте `len(...)` для визначення довжини змінної або рядка.

source: ## [Data Types and Type Conversion]({{ page.root }}/03-types-conversion/)
es: ## [Tipos de datos y conversión de tipos]({{ page.root }}/03-types-conversion/)
uk: ## [Типи даних та їх перетворення]({{ page.root }}/03-types-conversion/)

source: - Each value has a type. This controls what can be done with it.
es: - Cada valor es de un tipo. Esto controla qué se puede hacer con ello.
uk: - Кожна величина має тип. Це контролює дії, які можна з нею робити.

source: - `int` represents an integer
es: - `int` representa un entero
uk: - `int` є цілим числом

source: - `float` represents a floating point number.
es: - `float` representa un número de punto flotante.
uk: - `float` представляє число з плаваючою комою.

source: - `str` represents a string.
es: - `str` representa una cadena de texto.
uk: - `str` є рядком.

source: - To determine a variables type, use the built-in function `type(...)`, including the variable name in the parenthesis.
es: - Para determinar el tipo de una variable, usa la función de Python `type(...)`, incluyendo el nombre de la variable entre los paréntesis.
uk: Щоб визначити тип змінної, скористайтеся вбудованою функцією `type(...)`, вказавши назву змінної в дужках.

source: - Modifying strings:
es: - Cambiando cadenas de texto:
uk: - Модифікація рядків:

source: - Use `+` to concatenate strings.
es: - Usa `+` para concatenar cadenas.
uk: - Використовуйте `+` для об'єднання (конкатенації) рядків.

source: - Use `*` to repeat a string.
es: - Usa `*` para repetir una cadena.
uk: - Використовуйте `*`, щоб повторити рядок.

source: - Numbers and strings cannot be added to on another.
es: - Números y cadenas no pueden añadirse entre ellos.
uk: - Числа та рядки не можна додавати один до іншого.

source: - Convert string to integer: `int(...)`.
es: - Convertir una cadena a un entero: `int(...)`.
uk: - Перетворити рядок на ціле: `int(...)`.

source: - Convert integer to string: `str(...)`.
es: - Convertir un entero a una cadena: `str(...)`.
uk: - Перетворити ціле на рядок : `str(...)`.

source: ## [Built-in Functions and Help]({{ page.root }}/04-built-in/)
es: ## [Funciones integradas y Ayuda]({{ page.root }}/04-built-in/)
uk: ## [Вбудовані функції та довідка]({{ page.root }}/04-built-in/)

source: - To add a comment, place `#` before the thing you do not with to be executed.
es: - Para añadir un comentario, situa una `#` antes de la cosa que no quieres que se ejecute.
uk: - Щоб додати коментар, поставте `#` перед тим, що ви не хочете виконувати.

source: - Commonly used built-in functions:
es: - Funciones incorporadas de uso común:
uk: - Вбудовані функції, які часто використовуються:

source: - `min()` finds the smallest value.
es: - `min()` encuentra el valor más pequeño.
uk: - `min()` визначає найменшу величину.

source: - `max()` finds the largest value.
es: - `max()` encuentra el valor más grande.
uk: - `max()` визначає найбільшу величину.

source: - `round()` rounds off a floating point number.
es: - `round()` redondea un número de punto flotante.
uk: - `round()` округлює число з плаваючою комою.

source: - `help()` displays documentation for the function in the parenthesis.
es: - `help()` muestra la documentación de la función entre los paréntesis.
uk: - `help()` відображає документацію для функції в дужках.

source: - Other ways to get help include holding down `shift` and pressing `tab` in Jupyter Notebooks.
es: - Otra manera de obtener ayuda es manteniendo la tecla `shift` y pulsando `tab` en una libreta de Jupyter.
uk: - Інші способи отримати допомогу включають одночасне натискання `shift` і `tab` у Jupyter Notebooks.

source: ## [Libraries]({{ page.root }}/06-libraries/)
es: ## [Bibliotecas]({{ page.root }}/06-libraries/)
uk: ## [Бібліотеки]({{ page.root }}/06-libraries/)

source: - Importing a library:
es: - Importando una biblioteca:
uk: - Імпорт бібліотеки:

source: - Use `import ...` to load a library.
es: - Usa `import ...` para cargar una bibiloteca.
uk: - Використовуйте `import ...` для підключення бібліотеки.

source: - Refer to this library by using `module_name.thing_name`.
es: - Refierete a esta biblioteca usando `nombre_modulo.nombre_cosa`.
uk: - Звертайтеся до цієї бібліотеки у форматі `module_name.thing_name`.

source: - `.` indicates 'part of'.
es: - `.` significa 'parte de'.
uk: - `.` вказує на 'частину'.

source: - To import a specific item from a library: `from ... import ...`
es: - Para importar un elemento específico de una biblioteca: `from ... import ...` (de la biblioteca importa elemento)
uk: - Щоб імпортувати певний елемент із бібліотеки, використовуйте команду `from ... import ...`

source: - To import a library using an alias: `import ... as ...`
es: - Para importar una biblioteca con un alias: `import ... as ...` (importa ... como ...)
uk: - Щоб імпортувати бібліотеку та створити її псевдонім, використовуйте команду `import ... as ...`

source: - Importing the math library: `import math`
es: - Importando la biblioteca de matemáticas: `import math`
uk: - Імпорт математичної бібліотеки: `import math`

source: - Example of referring to an item with the module's name: `math.cos(math.pi)`.
es: - Ejemplo de referencia a un elemento con el nombre del módulo: `math.cos(math.pi)`.
uk: - Приклад посилання на елемент із назвою модуля: `math.cos(math.pi)`.

source: - Importing the plotting library as an alias: `import matplotlib as mpl`
es: - Importando la biblioteca de visualización con un alias: `import matplotlib as mpl`
uk: - Імпорт графічної бібліотеки та позначення її за допомогою псевдоніма: `import matplotlib as mpl`

source: ## [Reading Tabular Data into DataFrames]({{ page.root }}/07-reading-tabular/)
es: ## [Lectura de datos tabulados en DataFrames]({{ page.root }}/07-reading-tabular/)
uk: ## [Читання табличних даних у фреймах даних]({{ page.root }}/07-reading-tabular/)

source: - Use the pandas library to do statistics on tabular data. Load with `import pandas as pd`.
es: - Usa la biblioteca pandas para hacer estadística de datos tabulados. Cárgala con `import pandas as pd`.
uk: - Використовуйте бібліотеку pandas для статистичної обробки табличних даних. Завантажуйте її за допомогою `import pandas as pd`.

source: - To read in a csv: `pd.read_csv()`, including the path name in the parenthesis.
es: - Para leer de un csv: `pd.read_csv()`, incluyendo el camino al fichero entre los paréntesis.
uk: - Щоб прочитати дані у файлі csv, використовуйте команду: `pd.read_csv()`, включаючи шлях до файлу в дужках.

source: - To specify a column's values should be used as row headings: `pd.read_csv('path',index_col='column name')`, where path and column name should be replaced with the relevant values.
es: - Para especificar qué valores de columna deben usarse como cabecera de las filas: `pd.read_csv('camino', index_col='nombre de columna')`, donde camino y nombre de columna debe cambiarse por los valores correspondientes.
uk: - Щоб указати значення стовпця, слід використовувати наступний формат заголовків рядків: `pd.read_csv('path',index_col='column name')`, де `path` і `column name` замінюються відповідними значеннями.

source: - To get more information about a DataFrame, use `DataFrame.info`, replacing `DataFrame` with the variable name of your DataFrame.
es: - Para obtener más información sobre un DataFrame, usa `DataFrame.info`, cambiando `DataFrame` con el nombre de la variable de tu DataFrame.
uk: - Щоб отримати більше інформації про фрейм даних, використовуйте `DataFrame.info`, замінивши `DataFrame` назвою вашого файлу даних.

source: - Use `DataFrame.columns` to view the column names.
es: - Usa `DataFrame.columns` para ver los nombres de las columnas.
uk: - Використовуйте команду `DataFrame.columns` щоб переглянути назви стовпців.

source: - Use `DataFrame.T` to transpose a DataFrame.
es: - Usa `DataFrame.T` para transponer un DataFrame.
uk: - Використовуйте `DataFrame.T` щоб транспонувати фрейм даних.

source: - Use `DataFrame.describe` to get summary statistics about your data.
es: - Usa `DataFrame.describe` para obtener un resumen estadístico de tus datos.
uk: - Використовуйте `DataFrame.describe`, щоб отримати підсумкову статистику ваших даних.

source: ## [Pandas DataFrames]({{ page.root }}/08-data-frames/)
es: ## [DataFrames de Pandas]({{ page.root }}/08-data-frames/)

source: - Select data using `[i,j]`
es: - Selecciona datos usando `[i,j]`
uk: - Вибір даних за допомогою `[i,j]`

source: - To select by entry position: `DataFrame.iloc[..., ...]`
es: - Para seleccionar por la posición de entrada: `DataFrame.iloc[..., ...]`
uk: - Вибір за місцезнаходженням: `DataFrame.iloc[..., ...]`

source: - This is inclusive of everything except the final index.
es: - Esto incluye todo excepto el índice final.
uk: - Це включає весь діапазон, крім останнього індексу.

source: - To select by entry label: `DataFrame.loc[..., ...]`
es: - Para seleccionar por la etiqueta de entrada: `DataFrame.loc[..., ...]`
uk: - Для вибору за міткою запису використовуйте: `DataFrame.loc[..., ...]`

source: - Can select multiple rows or columns by listing labels.
es: - Puedes seleccionar múltiple filas o columnas a través de una lista de etiquetas.
uk: - Можна вибрати кілька рядків або стовпців визначенням діапазону міток.

source: - This is inclusive to both ends.
es: - Esto incluye ambos límites.
uk: - Кінцеві індекси включно з обох боків.

source: - Use `:` to select all rows or columns.
es: - Usa `:` para selecionar toda las filas o columnas.
uk: - Використовуйте `:`, щоб обрати всі рядки або стовпці.

source: - Can also select data based on values using `true` and `false`. This is a Boolean mask.
es: - Puedes seleccionar también datos basados en valores usando `True` y `False`. Esto es una máscara Booleana.
uk: - Також можна вибирати дані на основі значень за допомогою `true` і `false`. Це Булева маска.

source: - `mask = subset > 10000`
es: - `mask = subconjunto > 10000`
uk: - Наприклад, `mask = subset > 10000`

source: - We can then use this to select values.
es: - Podemos usar esto para seleccionar valores.
uk: - Ми можемо потім використовувати вище визначену маску для вибору значень.

source: - To use a select-apply-combine operation we use `data.apply(lambda x: x>x.mean())` where `mean()` can be any operation the user would like to be applied to x.
es: - Para usar una operación selecciona-usa-combina lo hacemos con `data.apply(lambda x: x > x.mean())` donde `mean()` puede ser cualquier operación que quisiéramos aplicar a `x`.
uk: - Формат комбінованої операції select-apply є таким: `data.apply(lambda x: x>x.mean())`, де `mean()` може бути будь-якою операцією, яку користувач хоче застосувати до набору даних x.

source: ## [Plotting]({{ page.root }}/09-plotting/)
es: ## [Visualizando]({{ page.root }}/09-plotting/)
uk: ## [Пoбудова графіків]({{ page.root }}/09-plotting/)

source: - The most widely used plotting library is `matplotlib`.
es: - La biblioteca de visualización más usada es `matplotlib`.
uk: - `matplotlib` є найбільш широко використовуваною бібліотекою побудови графіків.

source: - Usually imported using `import matplotlib.pyplot as plt`.
es: - Normalmente se importa usando `import matplotlib.pyplot as plt`.
uk: - Зазвичай імпортується за допомогою `import matplotlib.pyplot as plt`.

source: - To plot we use the command `plt.plot(time, position)`.
es: - Para graficar usamos el comando `plt.plot(time, position)`.
uk: - Для побудови графіків використовується команда `plt.plot(time, position)`.

source: - To create a legend use `plt.legend(['label1','label2', loc='upper left'])`
es: - Para crear una leyenda usa `plt.legend(['label1', 'label2'], loc='upper left')`
uk: - Для створення легенди використовується команда `plt.legend(['label1','label2', loc='upper left'])`

source: - Can also define labels within the plot statements by using `plt.plot(time, position, label='label')`. To make the legend show up, use `plt.legend()`
es: - Puedes también definir las etiquetas dentro del comando `plot` usando `plt.plot(time, position, label='label')`. Para mostrar la leyenda, usa `plt.legend()`
uk: - Можна також визначати мітки в операторах plot за допомогою команди `plt.plot(time, position, label='label')`. Щоб відобразити легенду, використовуйте `plt.legend()`

source: - To label x and y axis `plt.xlabel('label')` and `plt.ylabel('label')` are used.
es: - Para etiquetar los ejes x e y usa `plt.xlabel('label')` y `plt.ylabel('label')`.
uk: - Для позначення осей x і y використовуються команди `plt.xlabel('label')` і `plt.ylabel('label')`.

source: - Pandas DataFrames can be used to plot by using `DataFrame.plot()`. Any operations that can be used on a DataFrame can be applied while plotting.
es: - Los DataFrames de Pandas se pueden visualizar usando `DataFrame.plot()`. Cualquier operación que se puede usar sobre un DataFrame se le puede aplicar mientras se grafica.
uk: - Pandas DataFrames можна використовувати для побудови графіків, застосовуючи команду `DataFrame.plot()`. Будь-які операції, які можна використовувати на DataFrame, можна застосовувати для побудови графіків.

source: - To plot a bar plot `data.plot(kind='bar')`
es: - Para crear una gráfica de barras `data.plot(kind='bar')`
uk: - Для побудови гістограми застосовуйте команду `data.plot(kind='bar')`

source: ## [Lists]({{ page.root }}/11-lists/)
es: ## [Listas]({{ page.root }}/11-lists/)
uk: ## [Списки]({{ page.root }}/11-lists/)

source: - Defined within `[...]` and separated by `,`.
es: - Definidas entre `[...]` y separadas por `,`.
uk: - Містяться у `[...]` і розділяються за допомогою `,`.

source: - An empty list can be created by using `[]`.
es: - Una lista vacía se puede crear usando `[]`.
uk: - Порожній список можна створити за допомогою `[]`.

source: - Can use `len(...)` to determine how many values are in a list.
es: - Puedes usar `len(...)` para obtener cuántos valores hay en una lista.
uk: - Можна використовувати `len(...)`, щоб визначити кількість значень у списку.

source: - Can index just as done in previous lessons.
es: - Puedes indexar como se ha hecho en las lecciones previas.
uk: - Можна індексувати так само, як це виконувалось в попередніх уроках.

source: - Indexing can be used to reassign values `list_name[0] = newvalue`.
es: - Indexar se puede usar para reasignar valores `nombre_lista[0] = valor_nuevo`.
uk: - Індексацію можна використовувати для перепризначення значень: `назва_списку[0] = нове значення`

source: - To add an item to a list use `list_name.append()`, with the item to append in the parenthesis.
es: - Para añadir un elemento a una lista usa `nombre_lista.append()`, con el elemento a añadir entre paréntesis.
uk: - Щоб додати елемент до списку, використовуйте `list_name.append()`, указавши у дужках елемент, який потрібно додати.

source: - To combine two lists use `list_name_1.extend(list_name_2)`.
es: - Para combinar dos listas usa `nombre_lista_1.extend(nombre_lista_2)`.
uk: - Щоб об’єднати два списки, використовуйте `list_name_1.extend(list_name_2)`.

source: - To remove an item from a list use `del list_name[index]`.
es: - Para eliminar un elemento de una lista usa `del nombre_lista[index]`.
uk: - Щоб видалити елемент зі списку, використовуйте `del list_name[index]`.

source: ## [For Loops]({{ page.root }}/12-for-loops/)
es: ## [Bucles For]({{ page.root }}/12-for-loops/)
uk: ## [Цикли for]({{ page.root }}/12-for-loops/)

source: - Start a for loop with `for number in [1,2,3]:`, with the following lines indented.
es: - Empieza un bucle for con `for numero in [1,2,3]:`, con las líneas a continuación indentadas.
uk: - Почніть цикл for з `for number in [1,2,3]:` з відступом у наступних рядках.

source: - `[1, 2, 3]` is considered the collection.
es: - `[1, 2, 3]` se considera la colección.
uk: - `[1, 2, 3]` розглядається як колекція.

source: - `number` is the loop variable.
es: - `numero` es la variable del bucle.
uk: - `number` є змінною цикла.

source: - The action following the collection is the body.
es: - La acción que sigue la colección es el cuerpo.
uk: - Дія, наступна за колекцією, є тілом циклу.

source: - To iterate over a sequence of numbers use `range(start, end)`
es: - Para iterar sobre una secuencia de números usa `range(inicio, end)`
uk: - Для повторення послідовності дій зі змінною циклу використовуйте `range(start, end)`

source: ~~~ for number in range(0,5): print(number) ~~~
es: ~~~ for numero in range(0,5): print(numero) ~~~

source: ## [Conditionals]({{ page.root }}/13-conditionals/)
es: ## [Condicionales]({{ page.root }}/13-conditionals/)
uk: ## [Умовні оператори]({{ page.root }}/13-conditionals/)

source: - Defined similarly to a loop, using `if variable conditional value:`.
es: - Se definen similarmente a los bucles, usando `if variable condicional valor:`.
uk: - Визначаються подібно до циклу з використанням формату `if variable умовне значення:`

source: - For example, `if variable > 5:`.
es: - Por ejemplo, `if variable > 5:`.
uk: - Наприклад, `if variable > 5:`.

source: - Use `elif:` for additional tests.
es: - Usa `elif:` para condiciones adicionales.
uk: - Використовуйте `elif:` для додаткових тестів.

source: - Use `else:` for when if statement is not true.
es: - Usa `else:` para cuando la condición `if` no es verdad.
uk: - Використовуйте `else:`, якщо твердження if є невірним.

source: - Can Combine more than one conditional by using `and` or `or`.
es: - Puedes combinar más de una condición usando `and` (y) u `or` (o).
uk: - Можна об’єднати більше ніж одну умову за допомогою `and` або `or`.

source: - Often used in combination with for loops.
es: - A menudo se usan en combinación con los bucles for.
uk: - Часто використовується в поєднанні з циклами for.

source: - Conditions that can be used:
es: - Condiciones que se pueden usar:
uk: - Умови, які можна використовувати:

source: - `==` equal to.
es: - `==` igual a.
uk: - `==` дорівнює.

source: - `>=` greater than or equal to.
es: - `>=` mayor o igual a.
uk: - `>=` більше або дорівнює.

source: - `<=` less than or equal to.
es: - `<=` menor o igual a.
uk: - `<=` менше або дорівнює.

source: - `>` greater than.
es: - `>` mayor que.
uk: - `>` більше за.

source: - `<` less than.
es: - `<` menor que.
uk: - `<` менше за.

source: ~~~ for m in [3, 6, 7, 2, 8]: if m > 5: print(m, 'is large') elif m == 5: print(m, 'is 5') else: print(m, 'is small') ~~~
es: ~~~ for m in [3, 6, 7, 2, 8]: if m > 5: print(m, 'es mayor') elif m == 5: print(m, 'is 5') else: print(m, 'es menor') ~~~

source: ## [Looping Over Data Sets]({{ page.root }}/14-looping-data-sets/)
es: ## [Iterando Sobre Conjunto de Datos]({{ page.root }}/14-looping-data-sets/)
uk: ## [Перегляд наборів даних в циклі]({{ page.root }}/14-looping-data-sets/)

source: - Use a for loop: `for filename in [file1, file2]:`
es: - Usa un bucle for: `for archivo in [archivo1, archivo2]:`
uk: - Використовуйте цикл for: `for filename in [file1, file2]:`

source: - To find a set of files using a pattern use `glob.glob`
es: - Para encontrar un conjunto de archivos usando un patrón usa `glob.glob`
uk: - Щоб знайти набір файлів за шаблоном, використовуйте `glob.glob`

source: - Must import first using `import glob`.
es: - Debes de importarlo primero usando `import glob`.
uk: - Спочатку потрібно імпортувати відповідну бібліотеку за допомогою `import glob`.

source: - `*` indicates "match zero or more characters"
es: - `*` indica que "coincida con cero o más caracteres"
uk: - `*` вказує, що "нуль або більше символів збігаються"

source: - `?` indicates "match exactly one character"
es: - `?` indica que "coincida con exactamente un caracter"
uk: - `?` вказує, що "тільки один символ збігається"

source: - For example: `glob.glob(*.txt)` will find all files that end with .txt in the current directory.
es: - Por ejemplo: `glob.glob(*.txt)` encontrará todos los archivos que terminen con `.txt` en el directorio actual.
uk: - Наприклад: `glob.glob(*.txt)` знайде всі файли з розширенням .txt у поточному каталозі.

source: - Combine these by writing a loop using: `for filename in glob.glob(*.txt):`
es: - Combina ambos escribiendo un bucle usando: `for archivo in glob.glob(*.txt):`
uk: - Поєднайте це, написавши цикл за допомогою: `for filename in glob.glob(*.txt):`

source: ~~~ for filename in glob.glob(*.txt): data = pd.read_csv(filename) ~~~
es: ~~~ for archivo in glob.glob(*.txt): data = pd.read_csv(archivo) ~~~

source: ## [Writing Functions]({{ page.root }}/16-writing-functions/)
es: ## [Escribiendo funciones]({{ page.root }}/16-writing-functions/)
uk: ## [Написання функцій]({{ page.root }}/16-writing-functions/)

source: - Define a function using `def function_name(parameters):`. Replace `parameters` with the variables to use when the function is executed.
es: - Define una función usando `def nombre_funcion(parametros):`. Cambia `parametros` con las variables a usar cuando la función se ejecute.
uk: - Визначайте функцію за допомогою `def function_name(parameters):`. Змініть `parameters` на змінні, які використовуватимуться під час виконання функції.

source: - Run by using `function_name(parameters)`.
es: - Ejecútala usando `nombre_funcion(parametros)`.
uk: - Запустіть функцію за допомогою `function_name(parameters)`.

source: - To return a result to the caller use `return ...` in the function.
es: - Para devolver un resultado al que la llama, usa `return ...` dentro de la función.
uk: - Щоб повернути результат у місце виклику, використовуйте `return ...` в тілі функції.
