Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: > > Earlier we saw this function: > > ~~~ > def print_date(year, month, day): > joined = str(year) + '/' + str(month) + '/' + str(day) > print(joined) > ~~~ > We saw that we can call the function using *named arguments*, like this: > ~~~ > print_date(day=1, month=2, year=2003) > ~~~ > {: .language-python} > > 1. What does `print_date(day=1, month=2, year=2003)` print? > 2. When have you seen a function call like this before? > 3. When and why is it useful to call functions this way? > {: .language-python} > > ## Solution > > > > 1. `2003/2/1` > > 2. We saw examples of using *named arguments* when working with the pandas library. For example, when reading in a dataset > > using `data = pd.read_csv('data/gapminder_gdp_europe.csv', index_col='country')`, the last argument `index_col` is a > > named argument. > > 3. Using named arguments can make code more readable since one can see from the function call what name the different arguments > > have inside the function. It can also reduce the chances of passing arguments in the wrong order, since by using named arguments > > the order doesn't matter.
es: > > Anteriormente vimos esta función: > > ~~~ > def print_date(year, mes, dia): > joined = str(year) + '/' + str(mes) + '/' + str(dia) > print(joined) > ~~~ > Vimos que podemos llamar a la función usando *argumentos con nombres*, así: > ~~~ > print_date(dia=1, mes=2, year=2003) > ~~~ > {: .language-python} > > 1. ¿Qué muestra`print_date (dia = 1, mes = 2, year = 2003)`? > 2. ¿Cuándo has visto una llamada a una función como esta antes? > 3. ¿Cuándo y por qué es útil llamar a las funciones de esta manera? > {: .language-python} > > ## Solution > > > > 1. `2003/2/1` > > 2. Vimos ejemplos de uso de *argumentos con nombre* al trabajar con la biblioteca de Pandas. Por ejemplo, al leer en un conjunto de datos > > using `data = pd.read_csv('data/gapminder_gdp_europe.csv', index_col='country')`, el último argumento `index_col` es un > > nombre de argumento. > > 3. El uso de argumentos con nombre puede hacer que el código sea más legible ya que uno puede ver desde la llamada de función qué nombre tienen los diferentes argumentos > > dentro de la función. También puede reducir las posibilidades de pasar argumentos en el orden incorrecto, ya que al usar argumentos con nombre > > el orden no importa.
uk: > > Раніше ми розглядали таку функцію: > > ~~~ > def print_date(year, month, day): > joined = str(year) + '/' + str(month) + '/' + str(day) > print(joined) > ~~~ > Ми побачили, що можна викликати функцію за допомогою *іменованих аргументів*, наприклад: > ~~~ > print_date(day=1, month=2, year=2003) > ~~~ > {: .language-python} > > 1. Що друкує `print_date(day=1, month=2, year=2003)`? > 2. Коли ви раніше бачили подібний виклик функції? > 3. Коли і чому корисно викликати функції таким чином? > {: .language-python} > > ## Рішення > > > > 1. `2003/2/1` > > 2. Ми бачили приклади використання *іменованих аргументів* під час роботи з бібліотекою pandas. Наприклад, під час читання в наборі даних > > using `data = pd.read_csv('data/gapminder_gdp_europe.csv', index_col='country')`, останній аргумент `index_col` є > > іменованим аргументом. > > 3. Використання іменованих аргументів може зробити код більш читабельним, оскільки з виклику функції можна побачити, які імена мають різні аргументи > > всередині функції. Це також може зменшити ймовірність передачі аргументів у неправильному порядку, оскільки за допомогою іменованих аргументів > > порядок не має значення.

source: > ## Encapsulate of If/Print Block
es: > ## Encapsular un bloque de If/Print
uk: > ## Інкапсуляція блоку If/Print

source: > > The code below will run on a label-printer for chicken eggs. A digital scale will report a chicken egg mass (in grams) to the computer and then the computer will print a label. > > Please re-write the code so that the if-block is folded into a function. > > ~~~ > import random > for i in range(10): > > # simulating the mass of a chicken egg > # the (random) mass will be 70 +/- 20 grams > mass=70+20.0*(2.0*random.random()-1.0) > > print(mass) > > #egg sizing machinery prints a label > if(mass>=85): > print("jumbo") > elif(mass>=70): > print("large") > elif(mass<70 and mass>=55): > print("medium") > else: > print("small") > ~~~ > {: .language-python} > > > The simplified program follows. What function definition will make it functional? > > ~~~ > # revised version > import random > for i in range(10): > > # simulating the mass of a chicken egg > # the (random) mass will be 70 +/- 20 grams > mass=70+20.0*(2.0*random.random()-1.0) > > print(mass,print_egg_label(mass)) > > ~~~ > {: .language-python} > > > 1. Create a function definition for `print_egg_label()` that will work with the revised program above. Note, the function's return value will be significant. Sample output might be `71.23 large`. > 2. A dirty egg might have a mass of more than 90 grams, and a spoiled or broken egg will probably have a mass that's less than 50 grams. Modify your `print_egg_label()` function to account for these error conditions. Sample output could be `25 too light, probably spoiled`. > > > ## Solution > > > > ~~~ > > def print_egg_label(mass): > > #egg sizing machinery prints a label > > if(mass>=90): > > return("warning: egg might be dirty") > > elif(mass>=85): > > return("jumbo") > > elif(mass>=70): > > return("large") > > elif(mass<70 and mass>=55): > > return("medium") > > elif(mass<50): > > return("too light, probably spoiled") > > else: > > return("small") > > ~~~ > > {: .language-python}
es: > > El siguiente código se ejecutará en una impresora de etiquetas para huevos de gallina. Una balanza digital informará una masa de huevo de gallina (en gramos) a la computadora y luego la computadora imprimirá una etiqueta. > > Vuelve a escribir el código para que el bloque if se despliegue en una función. > > ~~~ > import random > for i in range(10): > > # simulando la masa de un huevo de gallina > # la masa (random) será 70 +/- 20 gramos > masa=70+20.0*(2.0*random.random()-1.0) > > print(masa) > > #la maquinaria de dimensionamiento de huevos imprime una etiqueta > if(masa>=85): > print("super") > elif(masa>=70): > print("grande") > elif(masa<70 and mass>=55): > print("medio") > else: > print("pequeño") > ~~~ > {: .language-python} > > > El programa sigue. ¿Qué definición de función lo hará funcional? > > ~~~ > # versión revisada > import random > for i in range(10): > > # simulando la masa de un huevo de gallina > # la masa (random) será 70 +/- 20 gramos > masa=70+20.0*(2.0*random.random()-1.0) > > print(masa,print_egg_label(masa)) > > ~~~ > {: .language-python} > > > 1. Crea una definición de función para `print_egg_label ()` que funcionará con el programa anterior. Ten en cuenta que el valor de retorno de la función sea significativo. La salida puede ser '71.23 grande'. > 2. Un huevo sucio puede tener una masa de más de 90 gramos, y un huevo estropeado o roto probablemente tendrá una masa de menos de 50 gramos. Modifica tu función `print_egg_label ()` para tener en cuenta estas condiciones de error. La salida podría ser '25 demasiado ligera, probablemente estropeada'. > > > ## Solución > > > > ~~~ > > def print_egg_label(masa): > > #la maquinaria de dimensionamiento de huevos imprime una etiqueta > > if(masa>=90): > > return("cuidado: el huevo debe estar sucio") > > elif(masa>=85): > > return("super") > > elif(masa>=70): > > return("grande") > > elif(masa<70 and mass>=55): > > return("mediano") > > elif(masa<50): > > return("Demasiado ligero, probablemente roto") > > else: > > return("pequenio") > > ~~~ > > {: .language-python}
uk: > > Наведений нижче код запускатиметься на принтері етикеток для курячих яєць. Цифрові ваги повідомлять комп’ютеру про масу курячого яйця (у грамах), а потім комп’ютер друкує етикетку. > > Будь ласка, перепишіть код так, щоб if-блок був вкладений у функцію. > > ~~~ > import random > for i in range(10): > > # імітація маси курячого яйця > # (випадкова) маса становитиме 70 +/- 20 грамів > mass=70+20.0*(2.0*random.random()-1.0) > > print(mass) > > #машини для сортування яєць друкують етикетку > if(mass>=85): > print("джамбо") > elif(mass>=70): > print("велике") > elif(mass<70 and mass>=55): > print("середнє") > else: > print("мале") > ~~~ > {: .language-python} > > > Далі спрощена програма. Яке визначення функції зробить його функціональним? > > ~~~ > # Адаптована версія > import random > for i in range(10): > > # імітація маси курячого яйця > # (випадкова) маса становитиме 70 +/- 20 грамів > mass=70+20.0*(2.0*random.random()-1.0) > > print(mass,print_egg_label(mass)) > > ~~~ > {: .language-python} > > > 1. Створіть визначення функції для `print_egg_label()`, яка працюватиме з адаптованою програмою вище. Зверніть увагу, що чисельне значення, яке повертає функція, буде важливим. Зразок оформлення результату може мати вигляд `71.23 large`. > 2. Брудне яйце може мати масу понад 90 грамів, а зіпсоване чи розбите яйце, ймовірно, матиме масу менше 50 грамів. Змініть свою функцію `print_egg_label()` для врахування цих умов помилки. Вихідний зразок може бути `25 занадто легке, можливо, зіпсоване`. > > > ## Рішення > > > > ~~~ > > def print_egg_label(mass): > > #egg sizing machinery prints a label > > if(mass>=90): > > return("попередження: яйце може бути брудним") > > elif(mass>=85): > > return("джамбо") > > elif(mass>=70): > > return("велике") > > elif(mass<70 and mass>=55): > > return("середнє") > > elif(mass<50): > > return("занадто легке, можливо, зіпсоване") > > else: > > return("мале") > > ~~~ > > {: .language-python}

source: > ## Encapsulating Data Analysis
es: > ## Encapsulando Análisis de Datos
uk: > ## Інкапсуляція аналізу даних

source: > > Assume that the following code has been executed: > > ~~~ > import pandas as pd > > df = pd.read_csv('data/gapminder_gdp_asia.csv', index_col=0) > japan = df.loc['Japan'] > ~~~ > {: .language-python} > > 1.Complete the statements below to obtain the average GDP for Japan > across the years reported for the 1980s. > > ~~~ > year = 1983 > gdp_decade = 'gdpPercap_' + str(year // ____) > avg = (japan.loc[gdp_decade + ___] + japan.loc[gdp_decade + ___]) / 2 > ~~~ > {: .language-python} > > 2.Abstract the code above into a single function. > > ~~~ > def avg_gdp_in_decade(country, continent, year): > df = pd.read_csv('data/gapminder_gdp_'+___+'.csv',delimiter=',',index_col=0) > ____ > ____ > ____ > return avg > ~~~ > {: .language-python} > > 3.How would you generalize this function > if you did not know beforehand which specific years occurred as columns in the data? > For instance, what if we also had data from years ending in 1 and 9 for each decade? > (Hint: use the columns to filter out the ones that correspond to the decade, > instead of enumerating them in the code.) > > > ## Solution > > > > 1. > > > > ~~~ > > year = 1983 > > gdp_decade = 'gdpPercap_' + str(year // 10) > > avg = (japan.loc[gdp_decade + '2'] + japan.loc[gdp_decade + '7']) / 2 > > ~~~ > > {: .language-python} > > > > 2. > > > > ~~~ > > def avg_gdp_in_decade(country, continent, year): > > df = pd.read_csv('data/gapminder_gdp_' + continent + '.csv', index_col=0) > > c = df.loc[country] > > gdp_decade = 'gdpPercap_' + str(year // 10) > > avg = (c.loc[gdp_decade + '2'] + c.loc[gdp_decade + '7'])/2 > > return avg > > ~~~ > > {: .language-python} > > > > 3. > > > > We need to loop over the reported years > > to obtain the average for the relevant ones in the data. > > > > ~~~ > > def avg_gdp_in_decade(country, continent, year): > > df = pd.read_csv('data/gapminder_gdp_' + continent + '.csv', index_col=0) > > c = df.loc[country] > > gdp_decade = 'gdpPercap_' + str(year // 10) > > total = 0.0 > > num_years = 0 > > for yr_header in c.index: # c's index contains reported years > > if yr_header.startswith(gdp_decade): > > total = total + c.loc[yr_header] > > num_years = num_years + 1 > > return total/num_years > > ~~~ > > {: .language-python} > > The function can now be called by: > > ~~~ > > avg_gdp_in_decade('Japan','asia',1983) > > ~~~ > > {: .language-python} > > > > ~~~ > > 20880.023800000003 > > ~~~ > > {: .output}
es: > > Suponga que se ha ejecutado el siguiente código: > > ~~~ > import pandas as pd > > df = pd.read_csv('data/gapminder_gdp_asia.csv', index_col=0) > japan = df.loc['Japan'] > ~~~ > {: .language-python} > > 1. Complete las siguientes declaraciones para obtener el PIB promedio de Japón > a través de los años reportados para la década de 1980. > > ~~~ > year= 1983 > gdp_decada = 'gdpPercap_' + str(year // ____) > prom = (japan.loc[gdp_decada + ___] + japan.loc[gdp_decada + ___]) / 2 > ~~~ > {: .language-python} > > 2.Resuma el código anterior en una sola función. > > ~~~ > def prom_gdp_in_decada(pais, continente, year): > df = pd.read_csv('data/gapminder_gdp_'+___+'.csv',delimiter=',',index_col=0) > ____ > ____ > ____ > return prom > ~~~ > {: .language-python} > > 3.¿Cómo generalizarías esta función > si no sabes de antemano qué años específicos ocurrieron como columnas de datos? > Por ejemplo, ¿qué pasaría si también tuviéramos datos de años que terminan en 1 y 9 para cada década? > (Sugerencia: use las columnas para filtrar las que corresponden a la década, > en lugar de enumerarlos en el código). > > > ## Solución > > > > 1. > > > > ~~~ > > year= 1983 > > gdp_decada = 'gdpPercap_' + str(year// 10) > > prom = (japan.loc[gdp_decada + '2'] + japan.loc[gdp_decada + '7']) / 2 > > ~~~ > > {: .language-python} > > > > 2. > > > > ~~~ > > def prom_gdp_in_decada(pais, continente, year): > > df = pd.read_csv('data/gapminder_gdp_' + continente + '.csv', index_col=0) > > c = df.loc[pais] > > gdp_decada = 'gdpPercap_' + str(year// 10) > > prom = (c.loc[gdp_decada + '2'] + c.loc[gdp_decada + '7'])/2 > > return prom > > ~~~ > > {: .language-python} > > > > 3. > > > > Necesitamos recorrer los años reportados > > para obtener el promedio de los relevantes en los datos. > > > > ~~~ > > def prom_gdp_in_decada(pais, continente, year): > > df = pd.read_csv('data/gapminder_gdp_' + continente+ '.csv', index_col=0) > > c = df.loc[pais] > > gdp_decada = 'gdpPercap_' + str(year// 10) > > total = 0.0 > > num_anios = 0 > > for yr_header in c.index: # el índice de c contiene años reportados > > if yr_header.startswith(gdp_decada): > > total = total + c.loc[yr_header] > > num_anios = num_year + 1 > > return total/num_year > > ~~~ > > {: .language-python} > > La función puede ahora llamarse asi: > > ~~~ > > prom_gdp_in_decada('Japan','Asia',1983) > > ~~~ > > {: .language-python} > > > > ~~~ > > 20880.023800000003 > > ~~~ > > {: .output}
uk: > > Припустімо, що наступний код було виконано: > > ~~~ > import pandas as pd > > df = pd.read_csv('data/gapminder_gdp_asia.csv', index_col=0) > japan = df.loc['Japan'] > ~~~ > {: .language-python} > > 1.Заповніть наведені нижче твердження, щоб отримати середній ВВП Японії > за роками, зазначеними у 1980-х роках. > > ~~~ > year = 1983 > gdp_decade = 'gdpPercap_' + str(year // ____) > avg = (japan.loc[gdp_decade + ___] + japan.loc[gdp_decade + ___]) / 2 > ~~~ > {: .language-python} > > 2.Абстрагуйте код вище в одну функцію. > > ~~~ > def avg_gdp_in_decade(country, continent, year): > df = pd.read_csv('data/gapminder_gdp_'+___+'.csv',delimiter=',',index_col=0) > ____ > ____ > ____ > return avg > ~~~ > {: .language-python} > > 3.Як би ви узагальнили цю функцію > якщо ви не знали заздалегідь, які конкретні роки зустрічаються як стовпці в даних? > Наприклад, що, якби ми також мали дані за роки, що закінчуються на 1 і 9 для кожного десятиліття? > (Підказка: використовуйте стовпці, щоб відфільтрувати ті, що відповідають десятиліттям, > замість того, щоб перелічувати їх у коді.) > > > ## Рішення > > > > 1. > > > > ~~~ > > year = 1983 > > gdp_decade = 'gdpPercap_' + str(year // 10) > > avg = (japan.loc[gdp_decade + '2'] + japan.loc[gdp_decade + '7']) / 2 > > ~~~ > > {: .language-python} > > > > 2. > > > > ~~~ > > def avg_gdp_in_decade(country, continent, year): > > df = pd.read_csv('data/gapminder_gdp_' + continent + '.csv', index_col=0) > > c = df.loc[country] > > gdp_decade = 'gdpPercap_' + str(year // 10) > > avg = (c.loc[gdp_decade + '2'] + c.loc[gdp_decade + '7'])/2 > > return avg > > ~~~ > > {: .language-python} > > > > 3. > > > > Нам потрібно переглянути звітні роки > > для отримання середнього значення для відповідних у даних. > > > > ~~~ > > def avg_gdp_in_decade(country, continent, year): > > df = pd.read_csv('data/gapminder_gdp_' + continent + '.csv', index_col=0) > > c = df.loc[country] > > gdp_decade = 'gdpPercap_' + str(year // 10) > > total = 0.0 > > num_years = 0 > > for yr_header in c.index: # c's index contains reported years > > if yr_header.startswith(gdp_decade): > > total = total + c.loc[yr_header] > > num_years = num_years + 1 > > return total/num_years > > ~~~ > > {: .language-python} > > Функцію тепер можна викликати: > > ~~~ > > avg_gdp_in_decade('Japan','asia',1983) > > ~~~ > > {: .language-python} > > > > ~~~ > > 20880.023800000003 > > ~~~ > > {: .output}

source: > ## Simulating a dynamical system
es: > ## Simulando un sistema dinámico
uk: > ## Моделювання динамічної системи

source: > > In mathematics, a [dynamical system](https://en.wikipedia.org/wiki/Dynamical_system) is a system in which a function describes the time dependence of a point in a geometrical space. A canonical example of a dynamical system is a system called the [logistic map](https://en.wikipedia.org/wiki/Logistic_map). > > > 1. Define a function called `logistic_map` that takes two inputs: `x`, representing the state of the system at time _t_, and a parameter `r`. This function should return a value representing the state of the system at time _t+1_. > > 2. Using a `for` loop, iterate the `logistic_map` function defined in part 1 starting from an initial condition of 0.5 for `t_final=10`, `100`, and `1000` periods. Store the intermediate results in a list so that after the `for` loop terminates you have accumulated a sequence of values representing the state of the logistic map at time _t=0,1,...,t_final_. > > 3. Encapsulate the logic of your `for` loop into a function called `iterate` that takes the initial condition as its first input, the parameter `t_final` as its second input and the parameter `r` as its third input. The function should return the list of values representing the state of the logistic map at time _t=0,1,...,t_final_. > > > > ## Solution > > > > 1. > > > > ~~~ > > def logistic_map(x, r): > > return r * x * (1 - x) > > ~~~ > > {: .language-python} > > > > 2. > > > > ~~~ > > initial_condition = 0.5 > > t_final = 10 > > r = 1.0 > > trajectory = [initial_condition] > > for t in range(1, t_final): > > trajectory.append( logistic_map(trajectory[t-1], r) ) > > ~~~ > > {: .language-python} > > > > 3. > > ~~~ > > def iterate(initial_condition, t_final, r): > > trajectory = [initial_condition] > > for t in range(1, t_final): > > trajectory.append( logistic_map(trajectory[t-1], r) ) > > return trajectory > > ~~~ > > {: .language-python}
es: > > En Matemática, un [sistema dinámico](https://en.wikipedia.org/wiki/Dynamical_system) es el sistema en el que una función describe la dependencia del tiempo de un punto en un espacio geométrico. Un ejemplo canónico de un sistema dinámico es un sistema llamado [mapa logístico](https://en.wikipedia.org/wiki/Logistic_map). > > > 1. Define una función llamada `logistic_map` que tome dos entradas:` x`, que representa el estado del sistema en el tiempo _t_, y un parámetro `r`. Esta función deberá devolver un valor que represente el estado del sistema en el momento _t + 1_. > > 2. Usa un bucle `for`, itera la función `logistic_map` definida en la parte 1 a partir de una condición inicial de 0.5 para los períodos `t_final = 10`,` 100` y `1000`. Almacena los resultados intermedios en una lista para que, después de que finalice el ciclo `for`, haya acumulado una secuencia de valores que representan el estado del mapa logístico en el tiempo _t = 0,1, ..., t_final_. > > 3. Encapsula la lógica de tu bucle `for` en una función llamada `iterar` que toma la condición inicial como su primera entrada, el parámetro `t_final` como su segunda entrada y el parámetro` r` como su tercera entrada. La función debe devolver la lista de valores que representan el estado del mapa logístico en el tiempo _t = 0,1, ..., t_final_. > > > > ## Solución > > > > 1. > > > > ~~~ > > def logistic_map(x, r): > > return r * x * (1 - x) > > ~~~ > > {: .language-python} > > > > 2. > > > > ~~~ > > initial_condition = 0.5 > > t_final = 10 > > r = 1.0 > > trayectoria= [initial_condition] > > for t in range(1, t_final): > > trayectoria.append( logistic_map(trayectoria[t-1], r) ) > > ~~~ > > {: .language-python} > > > > 3. > > ~~~ > > def iterar(initial_condition, t_final, r): > > trayectoria = [initial_condition] > > for t in range(1, t_final): > > trayectoria.append( logistic_map(trajectory[t-1], r) ) > > return trayectoria > > ~~~ > > {: .language-python}
uk: > > У математиці [динамічна система](https://en.wikipedia.org/wiki/Dynamical_system) це система, у якій функція описує залежність точки в геометричному просторі від часу. Канонічним прикладом динамічної системи є система під назвою [логістичне відображення] (https://en.wikipedia.org/wiki/Logistic_map). > > > 1. Визначте функцію під назвою `logistic_map`, яка приймає два входи: `x`, що представляє стан системи в момент часу _t_, і параметр `r`. Ця функція має повертати значення, що представляє стан системи в момент часу _t+1_. > > 2. Використовуючи цикл `for`, повторіть функцію `logistic_map`, визначену в частині 1, починаючи з початкової умови 0,5 для періодів`t_final=10`, `100`, і `1000`. Зберігайте проміжні результати в списку, щоб після завершення циклу `for` ви накопичили послідовність значень, що представляють стан `logistic_map` в моменти часу _t=0,1,...,t_final_. > > 3. Інкапсулюйте логіку вашого циклу `for` у функцію під назвою `iterate`, яка приймає початкову умову як перший вхід, параметр `t_final` як другий вхід і параметр `r` як третій вхід. Функція має повертати список значень, що представляють стан логістичної карти в момент часу _t=0,1,...,t_final_. > > > > ## Рішення > > > > 1. > > > > ~~~ > > def logistic_map(x, r): > > return r * x * (1 - x) > > ~~~ > > {: .language-python} > > > > 2. > > > > ~~~ > > initial_condition = 0.5 > > t_final = 10 > > r = 1.0 > > trajectory = [initial_condition] > > for t in range(1, t_final): > > trajectory.append( logistic_map(trajectory[t-1], r) ) > > ~~~ > > {: .language-python} > > > > 3. > > ~~~ > > def iterate(initial_condition, t_final, r): > > trajectory = [initial_condition] > > for t in range(1, t_final): > > trajectory.append( logistic_map(trajectory[t-1], r) ) > > return trajectory > > ~~~ > > {: .language-python}
