Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: --- title: "Variable Scope" teaching: 10 exercises: 10 questions: - "How do function calls actually work?" - "How can I determine where errors occurred?" objectives: - "Identify local and global variables." - "Identify parameters as local variables." - "Read a traceback and determine the file, function, and line number on which the error occurred, the type of error, and the error message." keypoints: - "The scope of a variable is the part of a program that can 'see' that variable." ---
es: --- title: "Alcance de una Variable" teaching: 10 exercises: 10 questions: - "¿Cómo trabajan realmente las llamadas a funciones?" - "Cómo puedo determinar donde ocurrieron los errores?" objectives: - "Identificar variables locales y globales." - "Identificar parámetros como variables locales." - "Lea un registro de rastreo y determine el archivo, la función y el número de línea en que ocurrió el error, el tipo de error y el mensaje de error." keypoints: - "El alcance de una variable es la parte de un programa que puede 'ver' esa variable." ---
uk: --- title: "Область видимості змінної" teaching: 10 exercises: 10 questions: - "Як насправді працюють виклики функцій?" - "Як я можу визначити місце виникнення помилок?" objectives: - "Ідентифікація локальних і глобальних змінних." - "Ідентифікація параметрів як локальних змінних." - "Аналіз звіту системної діагностики (Traceback) та визначення файлу, функції та номеру рядка, що містять збій, тип помилки та повідомлення про помилку" keypoints: - "Область змінної - це частина програми, яка може 'бачити' цю зміну." ---

source: ## The scope of a variable is the part of a program that can 'see' that variable.
es: ## El alcance de una variable es la parte de un programa que puede "ver" esa variable.
uk: ## Область змінної - це частина програми, яка може "бачити" цю зміну.

source: * There are only so many sensible names for variables.
es: * Hay contados nombres sensibles para las variables.
uk: * Є дуже багато розумних імен для змінних.

source: * People using functions shouldn't have to worry about
es: * Las personas que usan funciones no se deberían preocupar
uk: * Людям, які використовують функції, не варто хвилюватися,

source: what variable names the author of the function used. * People writing functions shouldn't have to worry about what variable names the function's caller uses. * The part of a program in which a variable is visible is called its *scope*.
es: qué variable nombra al autor de la función utilizada. * Las personas que escriben funciones no deberian tener que preocuparse sobre los nombres de las variables que usa el llamador de la función. * La parte de un programa en el que una variable es visible se llama *scope*/alcanse.
uk: яке ім'я змінної використав автор функції. * Людям, які пишуть функції, не варто хвилюватися, які імена змінних використовує виклик функції. * Частина програми, в якій змінна є видимою, називається її *областю*.

source: * `pressure` is a *global variable*.
es: * `pressure` es una *variable global*.
uk: * `pressure` є *глобальною змінною*.

source: * Defined outside any particular function.
es: * Definida fuera de cualquier función particular.
uk: * Визначається поза будь-якою конкретною функцією.

source: * Visible everywhere.
es: * Visible en todas partes.
uk: * Є видимою у будь-якому місці програми.

source: * `t` and `temperature` are *local variables* in `adjust`.
es: * `t` y `temperature` son *variables locales* en `adjust`.
uk: * `t` та `temperature` є *локальними змінними* в `adjust`.

source: * Defined in the function.
es: * Definida en la función.
uk: * Визначені у функції.

source: * Not visible in the main program.
es: * No visible en el programa principal.
uk: * Не є видимими у головній програмі.

source: * Remember: a function parameter is a variable
es: * Recuerda: un parámetro de función es una variable
uk: * Пам'ятайте: параметр функції є змінною,

source: that is automatically assigned a value when the function is called.
es: que se le asigna automáticamente un valor cuando se llama a la función.
uk: якій автоматично присвоюється значення під час виклику функції.

source: > ## Local and Global Variable Use
es: > ## Uso de Variable Local y Global
uk: > ## Використання локальних і глобальних змінних

source: > > Trace the values of all variables in this program as it is executed. > (Use '---' as the value of variables before and after they exist.) > > ~~~ > limit = 100 > > def clip(value): > return min(max(0.0, value), limit) > > value = -22.5 > print(clip(value)) > ~~~ > {: .language-python}
es: > > Rastree los valores de todas las variables en este programa a medida que se ejecuta. > (Usa '---' como el valor de las variables antes y después de que existan.) > > ~~~ > limit = 100 > > def clip(value): > return min(max(0.0, value), limit) > > value = -22.5 > print(clip(value)) > ~~~ > {: .language-python}
uk: > > Відстежте значення всіх змінних у цій програмі під час її виконання. > (Використовуйте '---' як значення змінних до і після їх існування.) > > ~~~ > limit = 100 > > def clip(value): > return min(max(0.0, value), limit) > > value = -22.5 > print(clip(value)) > ~~~ > {: .language-python}

source: > > Read the traceback below, and identify the following: > > 1. How many levels does the traceback have? > 2. What is the file name where the error occurred? > 3. What is the function name where the error occurred? > 4. On which line number in this function did the error occur? > 5. What is the type of error? > 6. What is the error message? > > ~~~ > --------------------------------------------------------------------------- > KeyError Traceback (most recent call last) > <ipython-input-2-e4c4cbafeeb5> in <module>() > 1 import errors_02 > ----> 2 errors_02.print_friday_message() > > /Users/ghopper/thesis/code/errors_02.py in print_friday_message() > 13 > 14 def print_friday_message(): > ---> 15 print_message("Friday") > > /Users/ghopper/thesis/code/errors_02.py in print_message(day) > 9 "sunday": "Aw, the weekend is almost over." > 10 } > ---> 11 print(messages[day]) > 12 > 13 > > KeyError: 'Friday' > ~~~
es: > > Lea el registro de rastreo abajo, e identifique lo siguiente: > > 1. ¿Cuántos niveles tiene el registro de rastreo? > 2. ¿Cuál es el nombre del archivo donde ocurrió el error? > 3. ¿Cuál es el nombre de la función donde ocurrió el error? > 4. ¿En qué número de línea en esta función se produjo el error? > 5. ¿Cuál es el tipo de error? > 6. ¿Cuál es el mensaje de error? > > ~~~ > --------------------------------------------------------------------------- > KeyError Traceback (most recent call last) > <ipython-input-2-e4c4cbafeeb5> in <module>() > 1 import errors_02 > ----> 2 errors_02.print_friday_message() > > /Users/ghopper/thesis/code/errors_02.py in print_friday_message() > 13 > 14 def print_friday_message(): > ---> 15 print_message("Friday") > > /Users/ghopper/thesis/code/errors_02.py in print_message(day) > 9 "sunday": "Aw, the weekend is almost over." > 10 } > ---> 11 print(messages[day]) > 12 > 13 > > KeyError: 'Friday' > ~~~
uk: > > Прочитайте системну діагностику нижче та визначте наступне: > > 1. Скільки рівнів має трасування помилок? > 2. Як називається файл, у якому сталася помилка? > 3. Як називається функція, у якій сталася помилка? > 4. Який номер рядка цієї функції, де виникла помилка? > 5. Який тип помилки? > 6. Яке повідомлення про помилку? > > ~~~ > --------------------------------------------------------------------------- > KeyError Traceback (most recent call last) > <ipython-input-2-e4c4cbafeeb5> in <module>() > 1 import errors_02 > ----> 2 errors_02.print_friday_message() > > /Users/ghopper/thesis/code/errors_02.py in print_friday_message() > 13 > 14 def print_friday_message(): > ---> 15 print_message("Friday") > > /Users/ghopper/thesis/code/errors_02.py in print_message(day) > 9 "sunday": "Aw, the weekend is almost over." > 10 } > ---> 11 print(messages[day]) > 12 > 13 > > KeyError: 'Friday' > ~~~

source: --- title: "Programming Style" teaching: 15 exercises: 15 questions: - "How can I make my programs more readable?" - "How do most programmers format their code?" - "How can programs check their own operation?" objectives: - "Provide sound justifications for basic rules of coding style." - "Refactor one-page programs to make them more readable and justify the changes." - "Use Python community coding standards (PEP-8)." keypoints: - "Follow standard Python style in your code." - "Use docstrings to provide builtin help." ---
es: --- title: "Estilo de Programación" teaching: 15 exercises: 15 questions: - "¿Cómo puedo hacer para que mis programas sean fáciles de leer?" - "¿Qué formato le dan la mayoría de los programadores a su código?" - "¿De qué forma los programas pueden verificar su propio funcionamiento?" objetives: - "Dar argumentos para las reglas básicas de estilo de programación." - "Re-formatear programas de una página para hacerlos más fáciles de leer y justificar los cambios." - "Seguir los estándares comunitarios de estilo de Python (PEP-8)." keypoints: - "Sigue el formato estándar de Python en tu código." - "Utiliza docstrings para proveer ayuda integrada." ---
uk: --- title: "Стиль програмування" teaching: 15 exercises: 15 questions: - "Як я можу зробити мої програми більш читабельними?" - "Як більшість програмістів форматують свій код?" - "Як програми можуть перевірити свою роботу?" objectives: - "Визначення основних правил стилю кодування" - "Рефакторинг односторінкових програм, щоб зробити їх більш читабельними та обґрунтувати зміни" - "Використовання стандартів кодування спільноти Python (PEP-8)." keypoints: - "Дотримуйтеся стандартного стилю Python у своєму коді." - "Використовуйте рядки документів для надання вбудованої довідки" ---

source: ## Coding style
es: ## Estilo de programación
uk: ## Стиль кодування

source: Coding style helps us to understand the code better. It helps to maintain and change the code. Python relies strongly on coding style, as we may notice by the indentation we apply to lines to define different blocks of code. Python proposes a standard style through one of its first Python Enhancement Proposals (PEP), [PEP8](https://www.python.org/dev/peps/pep-0008), and highlight the importance of readability in the [Zen of Python](https://www.python.org/dev/peps/pep-0020).
es: El estilo del código nos ayuda a entender mejor el código. También ayuda a darle mantenimiento y hacer modificaciones en el código. Python se apoya mucho en el estilo del código como se puede ver en el sangrado que aplicamos en las líneas para definir los distintos bloques de código. Python propone un estilo estándar en una de las primeras Propuestas de Mejora de Python (PEP, por sus siglas en inglés), [PEP8](https://www.python.org/dev/peps/pep-0008), y resalta la importancia de la lectura de código en [Zen de Python](https://www.python.org/dev/peps/pep-0020).
uk: Стиль кодування допомагає нам краще зрозуміти код. Це допомагає підтримувати та змінювати код. Python значним чином покладається на стиль кодування, як ми можемо помітити за відступами, які ми застосовуємо до рядків для визначення різних блоків коду. Python пропонує стандартний стиль в одній із своїх перших пропозицій щодо вдосконалення Python (Python Enhancement Proposals - PEP), [PEP8](https://www.python.org/dev/peps/pep-0008), і підкреслює важливість читабельності в [Zen of Python](https://www.python.org/dev/peps/pep-0020).

source: We may highlight some points: * document your code * use clear, meaningful variable names * use white-space, *not* tabs, to indent lines
es: Podemos subrayar algunos puntos: * documenta tu código * usa nombres de variables claros y significativos * usa espacios en blanco, *no* tabuladores, para sangrar lineas
uk: Виділимо такі важливі моменти: * документуйте свій код * використовуйте чіткі, зрозумілі назви змінних * використовуйте пробіли, *не* табуляцію, для відступу рядків

source: ## Follow standard Python style in your code.
es: ## Sigue el estilo estándar de Python en tu código.
uk: ## Дотримуйтеся стандартного стилю Python у своєму коді.

source: a style guide for Python that discusses topics such as how you should name variables, how you should use indentation in your code, how you should structure your `import` statements, etc. Adhering to PEP8 makes it easier for other Python developers to read and understand your code, and to understand what their contributions should look like. The [PEP8 application and Python library](https://pypi.python.org/pypi/pep8) can check your code for compliance with PEP8. * [Google style guide on Python](https://google.github.io/styleguide/pyguide.html) supports the use of PEP8 and extend the coding style to more specific structure of a Python code, which may be interesting also to follow. Google's [formatting application is called "yapf"](https://github.com/google/yapf/).
es: una guía de estilo para Python que discute cómo se deben nombrar las variables, cómo se debe usar la el sangrado en tu código, cómo se deben estructural las declaraciones `import`, etc. Seguir las recomendaciones de PEP8 hace más fácil para otros desarrolladores de Python leer y entender tu código, y entender como deberán de ser sus contribuciones. La [aplicación y biblioteca de Python PEP8](https://pypi.python.org/pypi/pep8) puede revisar si tu código cumple con las recomendaciones de PEP8. * [La guía de estilo de código de Python de Google](https://google.github.io/styleguide/pyguide.html) da soporte al uso de PEP8 y extiende el estilo de código a una estructura más específica de código en Python, que puede ser también interesante de seguir. ["yapf" es el nombre de la herramienta de formato de código](https://github.com/google/yapf/) de Google.
uk: посібник зі стилю для Python, який обговорює такі теми, як імена змінних, як ви повинні використовувати відступи у своєму коді, як ви повинні структурувати ваші `import` оператори імпорту, тощо. Дотримання PEP8 полегшує іншим розробникам Python читання та розуміння вашого коду, і зрозуміти, як мають виглядати їхні внески. Документація [Застосування PEP8 і бібліотека Python](https://pypi.python.org/pypi/pep8) допоможе перевірити ваш код на відповідність PEP8. * Посібник [Google style guide on Python](https://google.github.io/styleguide/pyguide.html) підтримує використання PEP8 та імплементує стиль кодування до більш специфічної структури коду Python, теж може бути цікавим для застосування. Рекомендації Google [щодо форматування програмного коду, називаються "yapf"](https://github.com/google/yapf/).

source: ## Use assertions to check for internal errors.
es: ## Usa aserciones para verificar errores internos.
uk: ##Використовуйте твердження для перевірки внутрішніх помилок.

source: Assertions are a simple, but powerful method for making sure that the context in which your code is executing is as you expect.
es: Las aserciones son un método simple pero poderoso para asegurarnos de que el contexto en el que tu código se ejecuta coincida con lo que esperas.
uk: Твердження (Assert) — це простий, але потужний спосіб переконатися, що контекст, у якому виконується ваш код, відповідає вашим очікуванням.

source: ~~~ def calc_bulk_density(mass, volume): '''Return dry bulk density = powder mass / powder volume.''' assert volume > 0 return mass / volume ~~~
es: ~~~ def calc_densidad(masa, volumen): '''Regresa la densidad media = masa / volumen.''' assert volumen > 0 return masa / volumen ~~~

source: If the assertion is `False`, the Python interpreter raises an `AssertionError` runtime exception. The source code for the expression that failed will be displayed as part of the error message. To ignore assertions in your code run the interpreter with the '-O' (optimize) switch. Assertions should contain only simple checks and never change the state of the program. For example, an assertion should never contain an assignment.
es: Si la aserción es 'False', el interprete de Python llamará una excepción `AssertionError`. El código de la expresión que falló sera mostrada como parte del mensaje de error. Para ignorar todas las aserciones en tu código debes de ejecutar el interprete con la bandera '-O' (optimize). Las aserciones sólo deben contener pruebas simples y nunca cambiar el estado del programa. Por ejemplo, una aserción nunca debe contener una asignación.
uk: Якщо твердження має значення `False`, інтерпретатор Python викликає виключення `AssertionError` під час виконання програми. Вихідний код виразу, який не вдалося виконати, буде відображено як частину повідомлення про помилку. Щоб ігнорувати твердження у вашому коді, запустіть інтерпретатор із перемикачем «-O» (оптимізація). Твердження повинні містити лише прості перевірки і ніколи не змінювати стан програми. Наприклад, твердження ніколи не повинно містити присвоєння.

source: ## Use docstrings to provide builtin help.
es: ## Utiliza docstrings para proporcionar ayuda.
uk: ## Використовуйте рядки документів для надання вбудованої довідки.

source: * If the first thing in a function is a character string
es: * Si la primera cosa en una función es una sequencia de caracteres
uk: * Якщо першим у функції є рядок символів,

source: that is not assigned directly to a variable, Python attaches it to the function as the builtin help variable. * Called a *docstring* (short for "documentation string").
es: que no está asignada directamente a una variable, Python la agrega a la función como una variable de ayuda integrada. * Se le conoce como *docstring* (abreviatura de "cadena de documentación")
uk: який не присвоюється безпосередньо змінній, Python приєднує його до функції як вбудовану змінну довідки. * Ця змінна називається *docstring* (скорочення від «documentation string»).

source: ~~~ def average(values): "Return average of values, or None if no values are supplied." if len(values) == 0: return None return sum(values) / len(values) help(average) ~~~
es: ~~~ def average(valores): "Regresa el promedio de valores, o None si no se proporcionan valores." if len(valores) == 0: return None return sum(valores) / len(valores) help(average) ~~~
uk: ~~~ def average(values): "Повертає середнє значення для набору величин або None, якщо набір величин не наданий." if len(values) == 0: return None return sum(values) / len(values) help(average) ~~~

source: {: .language-python} ~~~ Help on function average in module __main__:
es: {: .language-python} ~~~ Ayuda de la función `average` en el módulo __main__:

source: average(values) Return average of values, or None if no values are supplied. ~~~
es: average(valores) Regresa el promedio de valores, o None si no se proporcionan valores. ~~~
uk: average(values) Повертає середнє зачення для набору величин або None, якщо набір величин не наданий. ~~~

source: > ## Multiline Strings
es: ## Cadenas con múltiples líneas
uk: > ## Багаторядкові рядки

source: > > Often use *multiline strings* for documentation. > These start and end with three quote characters (either single or double) > and end with three matching characters. > > ~~~ > """This string spans > multiple lines. > > Blank lines are allowed.""" > ~~~ > {: .language-python}
es: > > Utiliza *sequencias multilínea* para documentar tu código. > Estas inician y terminan con tres comillas (ya sean sencillas o dobles). > >~~~ > """Esta cadena se extiende > varias líneas. > > Son permitidas líneas en blanco.""" > ~~~ > {: .language-python}
uk: > > Часто для документації використовуються *багаторядкові рядки* . > Вони починаються і закінчуються трьома символами лапок (одинарними або подвійними) > і закінчується трьома відповідними символами. > > ~~~ > """Цей рядок охоплює > кілька рядків. > > Допускаються порожні рядки.""" > ~~~ > {: .language-python}

source: > ## What Will Be Shown?
es: > ## ¿Qué será mostrado?
uk: > ## Що буде показано?

source: > > Highlight the lines in the code below that will be available as online help. > Are there lines that should be made available, but won't be? > Will any lines produce a syntax error or a runtime error? > > ~~~ > "Find maximum edit distance between multiple sequences." > # This finds the maximum distance between all sequences. > > def overall_max(sequences): > '''Determine overall maximum edit distance.''' > > highest = 0 > for left in sequences: > for right in sequences: > '''Avoid checking sequence against itself.''' > if left != right: > this = edit_distance(left, right) > highest = max(highest, this) > > # Report. > return highest > ~~~ > {: .language-python}
es: > > Subraya las líneas del código de abajo que estarán disponibles como ayuda en línea. > ¿Hay alguna línea que debería estar disponible pero no está? > ¿Alguna línea producirá un error de sintaxis o un runtime error? > > ~~~ > "Encuentra la máxima distancia entre varias secuencias" > # Este código encuentra la máxima distancia entre todas las secuencias. > > def maximo_general(sequencias): > '''Determina la distancia máxima.''' > > mas_alta = 0 > for izquierda in sequencias: > for derecha in sequencias: > '''Evita revisar una secuencia con ella misma.''' > if izquierda != derecha: > actual = edit_distance(izquierda, derecha) > mas_alta = max(mas_alta, actual) > > # Reporta. > return mas_alta > ~~~ > {: .language-python}
uk: > > Виділіть рядки в коді нижче, які будуть доступні як онлайн-довідка.. > Чи є лінії, які мають бути доступні, але не будуть? > Чи буде якийсь рядок видавати синтаксичну помилку або помилку виконання? > > ~~~ > "Знайти максимальну відстань редагування між кількома послідовностями." > # Знаходить максимальну відстань між усіма послідовностями. > > def overall_max(sequences): > '''Визначає загальну максимальну відстань редагування.''' > > highest = 0 > for left in sequences: > for right in sequences: > '''Уникнути перевірки послідовності на саму себе.''' > if left != right: > this = edit_distance(left, right) > highest = max(highest, this) > > # Звіт. > return highest > ~~~ > {: .language-python}

source: > ## Document This
es: > ## Documenta Este Código
uk: > ## Задокументуйте це

source: > > Turn the comment on the following function into a docstring > and check that `help` displays it properly. > > ~~~ > def middle(a, b, c): > # Return the middle value of three. > # Assumes the values can actually be compared. > values = [a, b, c] > values.sort() > return values[1] > ~~~ > {: .language-python} > > ## Solution > > > > ~~~ > > def middle(a, b, c): > > '''Return the middle value of three. > > Assumes the values can actually be compared.''' > > values = [a, b, c] > > values.sort() > > return values[1] > > ~~~ > > {: .language-python}
es: > > Convierte el comentario de la siguiente función a un docstring > y verifica que `help` lo muestre correctamente. > > ~~~ > def medio(a, b, c): > # Regresa el valor que se encuentre en medio de los tres. > # Asume que los valores pueden ser comparados. > valores = [a, b, c] > valores.sort() > return valores[1] > ~~~ > {: .language-python} > > ## Solución > > > > ~~~ > > def medio(a, b, c): > > '''Regresa el valor que se encuentre en medio de los tres. > > Asume que los valores pueden ser comparados.''' > > valores = [a, b, c] > > valores.sort() > > return valores[1] > > ~~~ > > {: .language-python}
uk: > > Перетворіть коментар до наступної функції на рядок документації > і перевірте правильність подання командою `help`. > > ~~~ > def middle(a, b, c): > # Повертає середнє значення трьох величин. > # У припущенні, що значення можна порівняти. > values = [a, b, c] > values.sort() > return values[1] > ~~~ > {: .language-python} > > ## Рішення > > > > ~~~ > > def middle(a, b, c): > > '''Повертає середнє значення трьох величин. > > У припущенні, що значення можна порівняти.''' > > values = [a, b, c] > > values.sort() > > return values[1] > > ~~~ > > {: .language-python}

source: > ## Clean Up This Code
es: > ## Limpia Este Código
uk: > ## Очистіть цей код
