Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: * Use `from ... import ...` to load only specific items from a library module.
es: * Usa `from ... import ...` para cargar solamente elementos específicos del módulo de una biblioteca.
uk: * Використовуйте `from ... import ...`, щоб завантажити лише певні елементи з бібліотечного модуля.

source: * Then refer to them directly without library name as prefix.
es: * Después refiérete a ellos directamente sin escribir el nombre de la biblioteca como prefijo.
uk: * Потім звертайтеся до них безпосередньо без назви бібліотеки як префікса.

source: ~~~ from math import cos, pi print('cos(pi) is', cos(pi)) ~~~
es: ~~~ from math import cos, pi print('cos(pi) es', cos(pi)) ~~~

source: {: .language-python} ~~~ cos(pi) is -1.0 ~~~
es: {: .language-python} ~~~ cos(pi) es -1.0 ~~~

source: ## Create an alias for a library module when importing it to shorten programs.
es: ## Crea un alias para el módulo de una biblioteca al importarlo para acortar programas.
uk: ## Створіть псевдонім для бібліотечного модуля під час його імпорту для скорочення програм.

source: * Use `import ... as ...` to give a library a short *alias* while importing it.
es: * Usa `import ... as ...` para asignarle a una biblioteca un *alias* más corto al importarla.
uk: * Використовуйте `import ... as ...`, щоб надати бібліотеці короткий *псевдонім* під час її імпорту.

source: * Then refer to items in the library using that shortened name.
es: * Después refiérete a los elementos de la biblioteca usando el nombre corto.
uk: * Потім звертайтеся до елементів у бібліотеці, використовуючи цю скорочену назву.

source: ~~~ import math as m print('cos(pi) is', m.cos(m.pi)) ~~~
es: ~~~ import math as m print('cos(pi) es', m.cos(m.pi)) ~~~

source: * Commonly used for libraries that are frequently used or have long names.
es: * Esto se suele hacer con las librerías que se usan frecuentemente o que tienen nombres largos.
uk: * Зазвичай цей прийом використовується для бібліотек, які часто використовуються або мають довгі імена.

source: * E.g., `matplotlib` plotting library is often aliased as `mpl`.
es: * Por ejemplo, para la biblioteca de graficación `matplotlib` se suele usar el alias `mpl`.
uk: * Наприклад, бібліотека для побудови графіків `matplotlib` часто має псевдонім `mpl`.

source: * But can make programs harder to understand,
es: * Pero esto puede hacer que los programas sean más difíciles de entender,
uk: * Але це може ускладнювати розуміння програм,

source: since readers must learn your program's aliases.
es: porque los lectores deberán aprender los alias de tu programa.
uk: оскільки у цьому разі читачі повинні знати псевдоніми вашої програми.

source: > ## Exploring the Math Module
es: > ## Explorando el módulo Math
uk: > ## Знайомство з модулем math

source: > > 1. What function from the `math` module can you use to calculate a square root > *without* using `sqrt`? > 2. Since the library contains this function, why does `sqrt` exist? > > > ## Solution > > 1. Using `help(math)` we see that we've got `pow(x,y)` in addition to `sqrt(x)`, > > so we could use `pow(x, 0.5)` to find a square root. > > 2. The `sqrt(x)` function is arguably more readable than `pow(x, 0.5)` when > > implementing equations. Readability is a cornerstone of good programming, so it > > makes sense to provide a special function for this specific common case. > > > > Also, the design of Python's `math` library has its origin in the C standard, > > which includes both `sqrt(x)` and `pow(x,y)`, so a little bit of the history > > of programming is showing in Python's function names.
es: > > 1. ¿Qué función del módulo `math` se puede usar para calcular la raíz cuadrada > *sin usar* `sqrt`? > 2. Si la biblioteca contiene esta otra función, ¿por qué existe `sqrt`? > > > ## Solución > > 1. Usando `help(math)` podemos ver que tenemos `pow(x,y)` además de `sqrt(x)`, > > entonces podemos usar `pow(x, 0.5)` para hallar una raíz cuadrada. > > 2. Podríamos argumentar que la función `sqrt(x)` es más legible que `pow(x, 0.5)` cuando > > implementamos ecuaciones. La legibilidad es la piedra angular de la buena programación, entonces > > tiene sentido proveer una función especial para este caso específico y común. > > > > También, el diseño de la biblioteca `math` de Python tiene sus raíces en el estándar de C, > > el cual incluye ambos `sqrt(x)` y `pow(x,y)`, entonces un poco de la historia de > > la programación está mostrándose en los nombres de las funciones de Python.
uk: > > 1. За допомогою якої функції з модуля `math` можна обчислити квадратний корінь > *без* використання `sqrt`? > 2. Оскільки бібліотека містить цю функцію, чому існує `sqrt`? > > > ## Рішення > > 1. Використовуючи `help(math)` ми бачимо, що у нас є `pow(x,y)` на додаток до `sqrt(x)`, > > отже ми можемо застосувати `pow(x, 0.5)` для визначення квадратного кореня. > > 2. Функція `sqrt(x)`, можливо, легша для читання, ніж `pow(x, 0.5)`, коли > > реалізуються рівняння. Читабельність є наріжним каменем хорошого стилю програмування, отже > > має сенс надати спеціальну функцію для цього конкретного звичайного випадку. > > > > Крім того, дизайн бібліотеки `math` Python бере свій початок у стандарті C, > > який включає як `sqrt(x)`, так і `pow(x,y)`, тож трохи історії > > програмування відображається в назвах функцій Python.

source: > ## Locating the Right Module
es: > ## Localizando el módulo correcto
uk: > ## Пошук правильного модуля

source: > > You want to select a random character from a string: > > ~~~ > bases = 'ACTTGCTTGAC' > ~~~ > {: .language-python} > > 1. Which [standard library][stdlib] module could help you? > 2. Which function would you select from that module? Are there alternatives? > 3. Try to write a program that uses the function. > > > ## Solution > > > > The [random module][randommod] seems like it could help you. > > > > The string has 11 characters, each having a positional index from 0 to 10. > > You could use `random.randrange` function (or the alias `random.randint` > > if you find that easier to remember) to get a random integer between 0 and > > 10, and then pick out the character at that position: > > > > ~~~ > > from random import randrange > > > > random_index = randrange(len(bases)) > > print(bases[random_index]) > > ~~~ > > {: .language-python} > > > > or more compactly: > > > > ~~~ > > from random import randrange > > > > print(bases[randrange(len(bases))]) > > ~~~ > > {: .language-python} > > > > Perhaps you found the `random.sample` function? It allows for slightly > > less typing: > > > > ~~~ > > from random import sample > > > > print(sample(bases, 1)[0]) > > ~~~ > > {: .language-python} > > > > Note that this function returns a list of values. We will learn about > > lists in [episode 11]({% link _episodes/11-lists.md %}). > > > > There's also other functions you could use, but with more convoluted > > code as a result.
es: > > Tú quieres seleccionar un caracter de una secuencia de caracteres al azar: > > ~~~ > bases = 'ACTTGCTTGAC' > ~~~ > {: .language-python} > > 1. ¿Cuál módulo de la [biblioteca estándar][stdlib] podría ayudarte? > 2. ¿Qué función seleccionarías de ese módulo?, ¿tienes otras alternativas? > 3. Intenta escribir un programa que use esa función. > > > ## Solución > > > > El [módulo aleatorio][randommod] parece que podría ayudarte. > > > > La cadena tiene 11 caracteres, cada uno con un índice posicional de 0 a 10. > > Podrías usar la función `random.randrange` (o el alias `random.randint` > > si te parece más fácil de recordar) para obtener un número entero al azar entre 0 y > > 10, y después seleccionar el caracter en esa posición: > > > > ~~~ > > from random import randrange > > > > random_index = randrange(len(bases)) > > print(bases[random_index]) > > ~~~ > > {: .language-python} > > > > o, más compacto: > > > > ~~~ > > from random import randrange > > > > print(bases[randrange(len(bases))]) > > ~~~ > > {: .language-python} > > > > ¿Tal vez encontraste la función `random.sample`? Ésta te permite escribir > > un poco menos: > > > > ~~~ > > from random import sample > > > > print(sample(bases, 1)[0]) > > ~~~ > > {: .language-python} > > > > Nota que esta función regresa una lista de valores. Aprenderemos sobre > > listas en el [episodio 11]({% link _episodes/11-lists.md %}). > > > > Hay también otras funciones que podrías usar, pero resultarías con un > > código más complejo.
uk: > > Ви хочете вибрати випадковий символ із рядка: > > ~~~ > bases = 'ACTTGCTTGAC' > ~~~ > {: .language-python} > > 1. Який модуль зі [standard library][stdlib] може допомогти? > 2. Яку функцію ви б вибрали з цього модуля? Чи є альтернативи? > 3. Спробуйте написати програму, яка використовує функцію. > > > ## Рішення > > > > Здається, модуль [random][randommod] може допомогти. > > > > Рядок містить 11 символів, кожен з яких має позиційний індекс від 0 до 10. > > Ви можете використати функцію `random.randrange` (або псевдонім `random.randint` > > якщо вам легше запам’ятати), щоб отримати випадкове ціле число від 0 до > > 10, а потім вибрати символ у цій позиції: > > > > ~~~ > > from random import randrange > > > > random_index = randrange(len(bases)) > > print(bases[random_index]) > > ~~~ > > {: .language-python} > > > > або більш компактно: > > > > ~~~ > > from random import randrange > > > > print(bases[randrange(len(bases))]) > > ~~~ > > {: .language-python} > > > > Можливо, ви знайшли функцію `random.sample`? Це дозволяє набирати > > трохи менше коду: > > > > ~~~ > > from random import sample > > > > print(sample(bases, 1)[0]) > > ~~~ > > {: .language-python} > > > > Зауважте, що ця функція повертає список значень. Ми дізнаємось про > > списки в [episode 11]({% link _episodes/11-lists.md %}). > > > > Існують також інші функції, які ви можете використовувати, але з більш складним > > результуючим кодом.

source: > ## Jigsaw Puzzle (Parson's Problem) Programming Example
es: > ## Ejemplo de programación con el rompecabezas (problema de Parson)
uk: > ## Головоломка (задача Парсона). Приклад програмування

source: > > Rearrange the following statements so that a random > DNA base is printed and its index in the string. Not all statements may be needed. Feel free to use/add > intermediate variables. > > ~~~ > bases="ACTTGCTTGAC" > import math > import random > ___ = random.randrange(n_bases) > ___ = len(bases) > print("random base ", bases[___], "base index", ___) > ~~~ > {: .language-python} > > > ## Solution > > > > ~~~ > > import math > > import random > > bases = "ACTTGCTTGAC" > > n_bases = len(bases) > > idx = random.randrange(n_bases) > > print("random base", bases[idx], "base index", idx) > > ~~~ > > {: .language-python}
es: > > Reorganiza las siguientes declaraciones para imprimir una > base de ADN al azar junto con su índice en la cadena. Puede que no todas las declaraciones sean necesarias. Puedes usar/añadir variables intermedias. > > ~~~ > bases="ACTTGCTTGAC" > import math > import random > ___ = random.randrange(n_bases) > ___ = len(bases) > print("base aleatoria", bases[___], "índice de la base", ___) > ~~~ > {: .language-python} > > > ## Solución > > > > ~~~ > > import math > > import random > > bases = "ACTTGCTTGAC" > > n_bases = len(bases) > > idx = random.randrange(n_bases) > > print("base aleatoria", bases[idx], "índice de la base", idx) > > ~~~ > > {: .language-python}
uk: > > Упорядкуйте наступні оператори таким чином, щоб друкувалась > випадкова ДНК база та її індекс в рядку. Не всі оператори можуть бути потрібні. За необхідності додавайте > проміжні змінні. > > ~~~ > bases="ACTTGCTTGAC" > import math > import random > ___ = random.randrange(n_bases) > ___ = len(bases) > print("random base ", bases[___], "base index", ___) > ~~~ > {: .language-python} > > > ## Рішення > > > > ~~~ > > import math > > import random > > bases = "ACTTGCTTGAC" > > n_bases = len(bases) > > idx = random.randrange(n_bases) > > print("random base", bases[idx], "base index", idx) > > ~~~ > > {: .language-python}

source: > ## When Is Help Available?
es: > ## ¿Cuándo está disponible la ayuda?
uk: > ## Коли доступна допомога?

source: > > When a colleague of yours types `help(math)`, > Python reports an error: > > ~~~ > NameError: name 'math' is not defined > ~~~
es: > > Cuando un colega tuyo escribe `help(math)`, > Python reporta un error: > > ~~~ > NameError: name 'math' is not defined > ~~~
uk: > > Коли ваш колега набирає `help(math)`, > Python повідомляє про помилку: > > ~~~ > NameError: name 'math' is not defined > ~~~

source: > > What has your colleague forgotten to do? > > > ## Solution > > > > Importing the math module (`import math`)
es: > > ¿Qué se le olvidó hacer a tu colega? > > > ## Solución > > > > importar el módulo `math` (`import math`)
uk: > > Що забув зробити ваш колега? > > > ## Рішення > > > > Імпортувати модуль math (`import math`)

source: > ## Importing With Aliases
es: > ## Importando con los alias.
uk: > ## Імпорт із псевдонімами

source: > > 1. Fill in the blanks so that the program below prints `90.0`. > 2. Rewrite the program so that it uses `import` *without* `as`. > 3. Which form do you find easier to read? > > ~~~ > import math as m > angle = ____.degrees(____.pi / 2) > print(____) > ~~~ > {: .language-python} > > > ## Solution > > > > ~~~ > > import math as m > > angle = m.degrees(m.pi / 2) > > print(angle) > > ~~~ > > {: .language-python} > > > > can be written as > > > > ~~~ > > import math > > angle = math.degrees(math.pi / 2) > > print(angle) > > ~~~ > > {: .language-python} > > > > Since you just wrote the code and are familiar with it, you might actually > > find the first version easier to read. But when trying to read a huge piece > > of code written by someone else, or when getting back to your own huge piece > > of code after several months, non-abbreviated names are often easier, except > > where there are clear abbreviation conventions.
es: > > 1. Rellena los espacios en blanco para que el programa que está abajo imprima `90.0` > 2. Reescribe el programar para que use `import` *sin* el `as`. > 3. ¿Cuál de las dos formas te parece más fácil de leer? > > ~~~ > import math as m > angle = ____.degrees(____.pi / 2) > print(____) > ~~~ > {: .language-python} > > > ## Solución > > > > ~~~ > > import math as m > > angle = m.degrees(m.pi / 2) > > print(angle) > > ~~~ > > {: .language-python} > > > > el cual puede ser escrito como > > > > ~~~ > > import math > > angle = math.degrees(math.pi / 2) > > print(angle) > > ~~~ > > {: .language-python} > > > > Como acabas de escribir el código y estás familiarizado con él, podría > > parecerte más legible la primera versión. Pero cuando estés intentando leer un código enorme > > escrito por alguien más, o cuando estés regresando a un código enorme tuyo > > después de meses de no verlo, los nombres no-abreviados suelen ser más legibles, excepto > > cuando las convenciones de abreviación son claras.
uk: > > 1. Заповніть порожні поля так, щоб програма, наведена нижче, надрукувала `90.0`. > 2. Перепишіть програму так, щоб вона використовувала `import` *без* `as`. > 3. Яку форму вам легше читати? > > ~~~ > import math as m > angle = ____.degrees(____.pi / 2) > print(____) > ~~~ > {: .language-python} > > > ## Рішення > > > > ~~~ > > import math as m > > angle = m.degrees(m.pi / 2) > > print(angle) > > ~~~ > > {: .language-python} > > > > можна записати як > > > > ~~~ > > import math > > angle = math.degrees(math.pi / 2) > > print(angle) > > ~~~ > > {: .language-python} > > > > Оскільки ви щойно написали код і знайомі з ним, ви можете насправді > > вважати, що першу версію легше читати. Але при спробі прочитати величезну купу > > коду, написаного кимось іншим, або коли повертаєтесь до свого власного величезного фрагменту > > коду через кілька місяців, нескорочені імена часто легші, за винятком > > випадку, де є чіткі умовні позначення скорочень.

source: > ## There Are Many Ways To Import Libraries!
es: > ## Hay muchas formas de importar bibliotecas!
uk: > ## Існує багато способів імпорту бібліотек!

source: > > Match the following print statements with the appropriate library calls. > > Print commands: > > 1. `print("sin(pi/2) =", sin(pi/2))` > 2. `print("sin(pi/2) =", m.sin(m.pi/2))` > 3. `print("sin(pi/2) =", math.sin(math.pi/2))` > > Library calls: > > 1. `from math import sin, pi` > 2. `import math` > 3. `import math as m` > 4. `from math import *` > > > ## Solution > > > > 1. Library calls 1 and 4. In order to directly refer to `sin` and `pi` without > > the library name as prefix, you need to use the `from ... import ...` > > statement. Whereas library call 1 specifically imports the two functions > > `sin` and `pi`, library call 4 imports all functions in the `math` module. > > 2. Library call 3. Here `sin` and `pi` are referred to with a shortened library > > name `m` instead of `math`. Library call 3 does exactly that using the > > `import ... as ...` syntax - it creates an alias for `math` in the form of > > the shortened name `m`. > > 3. Library call 2. Here `sin` and `pi` are referred to with the regular library > > name `math`, so the regular `import ...` call suffices.
es: > > Haz coincidir las siguientes declaraciones de impresión con las llamadas adecuadas a la biblioteca. > > Comandos de print: > > 1. `print("sin(pi/2) =", sin(pi/2))` > 2. `print("sin(pi/2) =", m.sin(m.pi/2))` > 3. `print("sin(pi/2) =", math.sin(math.pi/2))` > > Llamadas a la biblioteca: > > 1. `from math import sin, pi` > 2. `import math` > 3. `import math as m` > 4. `from math import *` > > > ## Solución > > > > 1. Las llamadas 1 y 4 a la biblioteca. Para podernos referir directamente a `sin` y `pi` sin usar el > > nombre de la biblioteca como prefijo, tienes que usar la declaración > > `from ... import ...`. Mientras la llamada 1 a la biblioteca importa específicamente las dos funciones > > `sin` y `pi`, la llamada 4 a la biblioteca importa todas las funciones del módulo `math`. > > 2. La llamada 3 a la biblioteca. Aquí se hace referencia a `sin` y `pi` usando > > el nombre corto `m` en vez de `math`. La llamada 3 a la biblioteca hace > > exactamente eso usando la sintaxis `import ... as ...` - crea un alias para `math` en forma de > > el nombre abreviado `m`. > > 3. La llamada 2 a la biblioteca. Aquí nos referimos a `sin` y `pi` con el nombre > > regular de la biblioteca `math`, entonces la llamada regular `import ...` basta.
uk: > > Зіставте наступні оператори друку з відповідними викликами бібліотеки. > > Оператори друку: > > 1. `print("sin(pi/2) =", sin(pi/2))` > 2. `print("sin(pi/2) =", m.sin(m.pi/2))` > 3. `print("sin(pi/2) =", math.sin(math.pi/2))` > > Виклики бібліотеки: > > 1. `from math import sin, pi` > 2. `import math` > 3. `import math as m` > 4. `from math import *` > > > ## Рішення > > > > 1. Виклики бібліотеки 1 та 4. Для прямого посилання на `sin` та `pi` без > > назви бібліотеки як префікса, вам потрібно використовувати `from ... import ...` > > оператор. Виклик бібліотеки 1 спеціально імпортує дві функції > > `sin` та `pi`, тоді як виклик бібліотеки 4 імпортує всі functions з модуля `math`. > > 2. Виклик бібліотеки 3. Тут `sin` та `pi` посилаються на скорочену назву бібліотеки > > `m` замість `math`. Виклик бібліотеки 3 робить саме це за допомогою > > синтаксису `import ... as ...` , що створює псевдонім для `math` в формі > > скороченої назви `m`. > > 3. Виклик бібліотеки 2. Тут `sin` та `pi` посилаються на звичайну бібліотеку > > `math`, тому буде достатньо звичайного виклику `import ...` .

source: > ## Importing Specific Items
es: > ## Importando elementos específicos
uk: > ## Імпорт певних елементів

source: > > 1. Fill in the blanks so that the program below prints `90.0`. > 2. Do you find this version easier to read than preceding ones? > 3. Why *wouldn't* programmers always use this form of `import`? > > ~~~ > ____ math import ____, ____ > angle = degrees(pi / 2) > print(angle) > ~~~ > {: .language-python} > > > ## Solution > > > > ~~~ > > from math import degrees, pi > > angle = degrees(pi / 2) > > print(angle) > > ~~~ > > {: .language-python} > > > > Most likely you find this version easier to read since it's less dense. > > The main reason not to use this form of import is to avoid name clashes. > > For instance, you wouldn't import `degrees` this way if you also wanted to > > use the name `degrees` for a variable or function of your own. Or if you > > were to also import a function named `degrees` from another library.
es: > > 1. Rellena los espacios en blanco para que el programa de abajo imprima `90.0` > 2. ¿Te parece que esta versión es más fácil de leer que las anteriores? > 3. Why *wouldn't* programmers always use this form of `import`? > 3. ¿Por qué los programadores *no suelen* usar siempre esta forma del `import`? > > ~~~ > ____ math import ____, ____ > angle = degrees(pi / 2) > print(angle) > ~~~ > {: .language-python} > > > ## Solución > > > > ~~~ > > from math import degrees, pi > > angle = degrees(pi / 2) > > print(angle) > > ~~~ > > {: .language-python} > > > > Seguramente te parece más legible esta versión puesto que es menos densa. > > La razón principal para no usar esta forma de importar es para evitar conflictos de nombres. > > Por ejemplo, no importarías `degrees` de tal forma si también quisieras usar > > el nombre `degrees` para una variable o función propia. O si también > > fueras a importar una función llamada `degrees` de otra biblioteca.
uk: > > 1. Заповніть порожні поля так, щоб програма, наведена нижче, вивела `90.0`. > 2. Чи вважаєте ви цю версію легшою для читання, ніж попередні? > 3. Чому *не* програмісти завжди використовують цю форму `імпорту`? > > ~~~ > ____ math import ____, ____ > angle = degrees(pi / 2) > print(angle) > ~~~ > {: .language-python} > > > ## Рішення > > > > ~~~ > > from math import degrees, pi > > angle = degrees(pi / 2) > > print(angle) > > ~~~ > > {: .language-python} > > > > Швидше за все, вам легше читати цю версію, оскільки вона менш щільна. > > Основною причиною не використовувати цю форму імпорту є уникнення зіткнень імен. > > Наприклад, ви б не імпортували `degrees` таким чином, якби також хотіли > > використовувати назву `degrees` для власної змінної або функції. Або якщо вам > > необхідно також імпортувати функцію з назвою `degrees` з іншої бібліотеки.

source: > ## Reading Error Messages
es: > ## Leyendo mensajes de error
uk: > ## Читання повідомлень про помилки
