Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: --- layout: page title: "Contributor Code of Conduct" ---
es: --- layout: page title: "Código de Conducta del Colaborador " permalink: /es/conduct/ ---

source: As contributors and maintainers of this project, we pledge to follow the [Carpentry Code of Conduct][coc].
es: Como colaboradores y mantenedores de este proyecto, nos comprometemos a seguir el [Código de Conducta de las Carpentries][coc].

source: Instances of abusive, harassing, or otherwise unacceptable behavior may be reported by following our [reporting guidelines][coc-reporting].
es: Instancias de comportamiento abusivo, acoso u otro comportamiento inaceptable serán denunciadas siguiendo nuestra [guía de reportes][coc-reporting].

source: # Contributing
es: # Colaborando

source: [The Carpentries][c-site] ([Software Carpentry][swc-site], [Data Carpentry][dc-site], and [Library Carpentry][lc-site]) are open source projects, and we welcome contributions of all kinds: new lessons, fixes to existing material, bug reports, and reviews of proposed changes are all welcome.
es: [Las Carpentries][c-site] ([Software Carpentry][swc-site], [Data Carpentry][dc-site] y [Library Carpentry][lc-site]) son proyectos de código abierto, y agradecemos las colaboraciones de todo tipo: nuevas lecciones, correcciones del material existente, informes de errores, y las revisiones de cambios propuestas, todas son bienvenidas.

source: ## Contributor Agreement
es: ## Acuerdo de colaboración

source: By contributing, you agree that we may redistribute your work under [our license](LICENSE.md). In exchange, we will address your issues and/or assess your change proposal as promptly as we can, and help you become a member of our community. Everyone involved in [The Carpentries][c-site] agrees to abide by our [code of conduct](CODE_OF_CONDUCT.md).
es: Al colaborar, aceptas que podemos redistribuir tu trabajo bajo [nuestra licencia](LICENSE.md). A cambio, abordaremos tus informes de errores y/o evaluaremos tu propuesta de cambio tan pronto como podamos, y te ayudaremos a convertirte en miembro de nuestra comunidad. Todos los involucrados en [Las Carpentries][c-site] aceptan cumplir con nuestro [código de conducta](CODE_OF_CONDUCT.md).

source: ## How to Contribute
es: ## Cómo contribuir

source: The easiest way to get started is to file an issue to tell us about a spelling mistake, some awkward wording, or a factual error. This is a good way to introduce yourself and to meet some of our community members.
es: La forma más fácil de comenzar es informarnos de un problema para poder corregirlo, como un error ortográfico, algunas palabras no claras, o un error. Contribuir es una buena forma de presentarte y conocer a algunos de los miembros de nuestra comunidad.

source: 1. If you do not have a [GitHub][github] account,
es: 1. Si no tienes una cuenta de [GitHub][github],

source: you can [send us comments by email][email]. However, we will be able to respond more quickly if you use one of the other methods described below.
es: puedes [enviarnos comentarios por correo electrónico][email]. Sin embargo, podremos responder más rápidamente si usas uno de los otros métodos descritos a continuación.

source: 2. If you have a [GitHub][github] account,
es: 2. Si tienes una cuenta de[GitHub][github],

source: or are willing to [create one][github-join], but do not know how to use Git, you can report problems or suggest improvements by [creating an issue][issues]. This allows us to assign the item to someone and to respond to it in a threaded discussion.
es: o estás dispuesto a [crear una][github-join], pero no sabes como usar Git, puedes informar de problemas o sugerir mejoras al [crear un informe de error][issues] (**issue** en inglés). Esto nos permite asignar la tarea a alguien y seguirla en un hilo de discusión.

source: 3. If you are comfortable with Git,
es: 3. Si te sientes cómodo con Git,

source: and would like to add or change material, you can submit a pull request (PR). Instructions for doing this are [included below](#using-github).
es: y te gustaría añadir o cambiar algo del material, puedes enviar una solicitud de inclusión (PR por sus siglas en inglés, **pull request**). Las instrucciones para hacerlo [se incluyen a continuación](#usando-github).

source: ## Where to Contribute
es: ## Dónde contribuir

source: 1. If you wish to change this lesson,
es: 1. Si deseas cambiar esta lección,

source: please work in <https://github.com/swcarpentry/python-novice-gapminder/>, which can be viewed at <https://swcarpentry.github.io/python-novice-gapminder>.
es: por favor trabaja en <https://github.com/swcarpentry/python-novice-gapminder/>, que se puede visualizar en <https://swcarpentry.github.io/python-novice-gapminder>.

source: 2. If you wish to change the example lesson,
es: 2. Si deseas cambiar la lección de ejemplo,

source: please work in <https://github.com/carpentries/lesson-example>, which documents the format of our lessons and can be viewed at <https://carpentries.github.io/lesson-example>.
es: por favor trabaja en <https://github.com/carpentries/lesson-example>, que documenta el formato de nuestras lecciones y se puede ver en <https://carpentries.github.io/lesson-example>.

source: 3. If you wish to change the template used for workshop websites,
es: 3. Si deseas cambiar la plantilla utilizada para la página web del taller,

source: please work in <https://github.com/carpentries/workshop-template>. The home page of that repository explains how to set up workshop websites, while the extra pages in <https://carpentries.github.io/workshop-template> provide more background on our design choices.
es: por favor trabaja en <https://github.com/carpentries-es/workshop-template-es>. La página de inicio de ese repositorio explica cómo configurar los sitios web de los talleres, mientras que las páginas adicionales en <https://carpentries-es.github.io/workshop-template-es> proporcionan más información sobre nuestros criterios de diseño.

source: 4. If you wish to change CSS style files, tools,
es: 4. Si deseas cambiar los archivos de estilo CSS, herramientas,

source: or HTML boilerplate for lessons or workshops stored in `_includes` or `_layouts`, please work in <https://github.com/carpentries/styles>.
es: o texto estándar HTML para lecciones o talleres almacenados en `_includes` o ` _layouts`, por favor trabaja en <https://github.com/carpentries/styles-es>.

source: ## What to Contribute
es: ## Qué aportar

source: There are many ways to contribute, from writing new exercises and improving existing ones to updating or filling in the documentation and submitting [bug reports][issues] about things that don't work, aren't clear, or are missing. If you are looking for ideas, please see the 'Issues' tab for a list of issues associated with this repository, or you may also look at the issues for [Data Carpentry][dc-issues], [Software Carpentry][swc-issues], and [Library Carpentry][lc-issues] projects.
es: Hay muchas maneras de contribuir, desde escribir ejercicios nuevos y mejorar los existentes hasta actualizar o completar la documentación y enviando [informes de errores][issue] sobre cosas que no funcionan, no son claras o faltan. Si estás buscando ideas, por favor revisa la pestaña 'Issues' para ver la lista de problemas para este repositorio, o la de los problemas de los proyectos de [Data Carpentry][dc-issues], [Software Carpentry][swc-issues] y [Library Carpentry][lc-issues].

source: Comments on issues and reviews of pull requests are just as welcome: we are smarter together than we are on our own. Reviews from novices and newcomers are particularly valuable: it's easy for people who have been using these lessons for a while to forget how impenetrable some of this material can be, so fresh eyes are always welcome.
es: Los comentarios sobre problemas y revisiones de solicitudes de inclusión son bienvenidos: somos más inteligentes juntos que solos. Los comentarios de principiantes y recién llegados son particularmente valiosos. Es fácil para las personas que usan estas lecciones frecuentemente olvidar lo impenetrable que pueden ser partes de este material; por lo tanto, una nueva perspectiva es siempre bienvenida.

source: ## What *Not* to Contribute
es: ## Qué *No* contribuir

source: Our lessons already contain more material than we can cover in a typical workshop, so we are usually *not* looking for more concepts or tools to add to them. As a rule, if you want to introduce a new idea, you must (a) estimate how long it will take to teach and (b) explain what you would take out to make room for it. The first encourages contributors to be honest about requirements; the second, to think hard about priorities.
es: Nuestras lecciones ya contienen más material de lo que podemos cubrir en un taller típico, por lo que normalmente *no* buscamos más conceptos o herramientas para agregarles. Como regla general, si quieres presentar una idea nueva, debes (a) estimar cuánto tiempo tomará enseñarla y (b) explicar lo que sacarías para darle espacio. El primero anima a los contribuyentes a ser honestos acerca de los requisitos; el segundo, pensar bien las prioridades.

source: We are also not looking for exercises or other material that only run on one platform. Our workshops typically contain a mixture of Windows, macOS, and Linux users; in order to be usable, our lessons must run equally well on all three.
es: Tampoco buscamos ejercicios u otro material que sólo se ejecute en una plataforma. Nuestros talleres suelen contener una mezcla de usuarios de Windows, macOS y Linux; para ser utilizable, nuestras lecciones deben correr igualmente bien en las tres plataformas.

source: ## Using GitHub
es: ## Usando GitHub

source: If you choose to contribute via GitHub, you may want to look at [How to Contribute to an Open Source Project on GitHub][how-contribute]. To manage changes, we follow [GitHub flow][github-flow]. Each lesson has two maintainers who review issues and pull requests or encourage others to do so. The maintainers are community volunteers and have final say over what gets merged into the lesson. To use the web interface for contributing to a lesson:
es: Si eliges contribuir a través de GitHub, es posible que desees echarle un vistazo a [Cómo contribuir a un proyecto de código abierto en GitHub][how-contribute]. Para gestionar los cambios, seguimos [el flujo de GitHub][github-flow]. Cada lección tiene dos mantenedores que revisan problemas y solicitudes de inclusión o invitan a otros que lo hagan. Los mantenedores son voluntarios de la comunidad y tienen la última palabra sobre qué se acepta en la lección. Para usar la interfaz web para contribuir a una lección deberás:

source: 1. Fork the originating repository to your GitHub profile.
es: 1. Bifurcar el repositorio original a tu perfil de GitHub.

source: 2. Within your version of the forked repository, move to the `gh-pages` branch and
es: 2. En tu versión del repositorio, cámbiate a la rama `gh-pages` y

source: create a new branch for each significant change being made. 3. Navigate to the file(s) you wish to change within the new branches and make revisions as required. 4. Commit all changed files within the appropriate branches. 5. Create individual pull requests from each of your changed branches to the `gh-pages` branch within the originating repository. 6. If you receive feedback, make changes using your issue-specific branches of the forked repository and the pull requests will update automatically. 7. Repeat as needed until all feedback has been addressed.
es: crea una nueva rama por cada cambio significativo que se vaya a a hacer. 3. Navega al archivo (o archivos) que desees cambiar en la misma rama y realiza los cambios necesarios. 4. Confirma todos los archivos cambiados en las ramas apropiadas. 5. Crea solicitudes de inclusión para cada una de tus distintas ramas a la rama `gh-pages` dentro del repositorio origen. 6. Si recibes comentarios, realiza los cambios necesarios usando la rama específica de tu repositorio bifurcado y la solicitud de inclusión se actualizará automáticamente. 7. Repite esos pasos cuanto sea necesario hasta que todos los comentarios se hayan atendido.

source: When starting work, please make sure your clone of the originating `gh-pages` branch is up-to-date before creating your own revision-specific branch(es) from there. Additionally, please only work from your newly-created branch(es) and *not* your clone of the originating `gh-pages` branch. Lastly, published copies of all the lessons are available in the `gh-pages` branch of the originating repository for reference while revising.
es: Cuando empieces a trabajar, por favor, asegúrate que tu rama `gh-pages` está al día con el repositorio original antes de crear tu rama de ella. Además, por favor sólo trabaja en la rama nueva creada y *no* en el clon de la rama `gh-pages`. Finalmente, copias públicas de todas las lecciones están disponibles en la rama `gh-pages` del repositorio origen para referencia mientras se haga la revisión.

source: Each lesson has maintainers who review issues and pull requests or encourage others to do so. The maintainers are community volunteers, and have final say over what gets merged into the lesson.
es: Cada lección tiene mantenedores que revisan problemas y solicitudes de inclusión o invitan a otros que lo hagan. Los mantenedores son voluntarios de la comunidad y tienen la última palabra sobre qué se acepta en la lección.

source: ## Other Resources
es: ## Otros recursos

source: General discussion of [Software Carpentry][swc-site] and [Data Carpentry][dc-site] happens on the [discussion mailing list][discuss-list], which everyone is welcome to join. You can also [reach us by email][email].
es: Discusiones generales de [Software Carpentry][swc-site] y [Data Carpentry][dc-site] están en la [lista de distribución de discusiones][discuss-list], a la cual todos son bienvenidos. También puedes [contactarnos por correo electrónico][email].

source: --- layout: page title: "Licenses" root: . ---
es: --- layout: page title: "Licencias" ---

source: ## Instructional Material
es: ### Material didáctico

source: All Software Carpentry, Data Carpentry, and Library Carpentry instructional material is made available under the [Creative Commons Attribution license][cc-by-human]. The following is a human-readable summary of (and not a substitute for) the [full legal text of the CC BY 4.0 license][cc-by-legal].
es: Todo el material de instrucción de Software Carpentry, Data Carpentry y Library Carpentry está disponible bajo la licencia [Creative Commons Atribución][cc-by-human]. El siguiente es un resumen de la licencia (y no un sustituto) del [texto legal completo de la licencia CC BY 4.0][cc-by-legal].

source: You are free:
es: Puedes libremente:

source: * to **Share**---copy and redistribute the material in any medium or format
es: * **Compartir**---copiar y redistribuir el material en cualquier medio o formato

source: * to **Adapt**---remix, transform, and build upon the material
es: * **Adaptar**---remezclar, transformar y construir a partir del material

source: for any purpose, even commercially.
es: para cualquier propósito, incluso comercialmente.

source: The licensor cannot revoke these freedoms as long as you follow the license terms.
es: El licenciante no puede revocar estas libertades mientras siga los términos de la licencia.

source: Under the following terms:
es: Bajo los siguientes términos:

source: * **Attribution**---You must give appropriate credit (mentioning that
es: * **Atribución**---Debes dar crédito a éste material de manera adecuada (mencionando que

source: your work is derived from work that is Copyright © Software Carpentry and, where practical, linking to http://software-carpentry.org/), provide a [link to the license][cc-by-human], and indicate if changes were made. You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.
es: su trabajo se deriva del trabajo que es Copyright de © Software Carpentry y, donde sea práctico, agrega un enlace a http://software-carpentry.org/), proporciona un [enlace a la licencia][cc-by-human], e indica si se han realizado cambios. Puedes hacerlo en cualquier forma razonable, pero no de forma tal que sugiera que tú o su uso tienen el apoyo del licenciante.

source: **No additional restrictions**---You may not apply legal terms or technological measures that legally restrict others from doing anything the license permits. With the understanding that:
es: **No hay restricciones adicionales**---No puedes aplicar términos legales ni medidas tecnológicas que restrinjan legalmente a otros a hacer cualquier uso permitido por la licencia. Con el entendimiento de que:

source: Notices:
es: Avisos:

source: * You do not have to comply with the license for elements of the
es: * No tienes que cumplir con la licencia de los

source: material in the public domain or where your use is permitted by an applicable exception or limitation. * No warranties are given. The license may not give you all of the permissions necessary for your intended use. For example, other rights such as publicity, privacy, or moral rights may limit how you use the material.
es: de los materiales que estén en el dominio público o cuando su uso esté permitido por una excepción o limitación aplicable. * No se dan garantías. La licencia puede no dar todos los permisos necesarios para su uso que tengas previsto. Por ejemplo, otros derechos como publicidad, privacidad, o derechos morales pueden limitar la forma en que utilices el material.

source: Except where otherwise noted, the example programs and other software provided by Software Carpentry and Data Carpentry are made available under the [OSI][osi]-approved [MIT license][mit-license].
es: Salvo que se indique lo contrario, los programas de ejemplo y otro software proporcionado por Software Carpentry y Data Carpentry están disponibles bajo el [OSI][osi]-aprobado [Licencia de MIT][mit-license].

source: Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
es: Se concede permiso, de forma gratuita, a cualquier persona que obtenga una copia de este software y los archivos de documentación asociados (el "Software"), para tratar el Software sin restricciones, incluido, entre otros, los derechos de uso, copia, modificación, fusión, publicación, distribución, sublicencia y / o venta de copias del Software, y Permitir a las personas a quienes se les proporciona el Software que lo hagan, sujeto a las siguientes condiciones:

source: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
es: El aviso de copyright anterior y este aviso de permiso serán incluido en todas las copias o porciones sustanciales del Software.

source: THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
es: EL SOFTWARE SE PROPORCIONA "TAL CUAL", SIN GARANTÍA DE NINGÚN TIPO, EXPRESO O IMPLÍCITO, INCLUIDAS, ENTRE OTRAS, LAS GARANTÍAS DE COMERCIALIZACIÓN, APTITUD PARA UN PROPÓSITO PARTICULAR Y SIN INFRACCIÓN. EN NINGÚN CASO SERÁN LOS AUTORES O LOS TITULARES DE LOS DERECHOS DE AUTOR RESPONSABLE POR CUALQUIER RECLAMO, DAÑOS U OTRA RESPONSABILIDAD, YA SEA EN ACCIÓN DEL CONTRATO, EXTRACONTRACTUAL O DE OTRO TIPO, DERIVADOS, FUERA DE O EN CONEXIÓN CON EL SOFTWARE O EL USO U OTROS TRATOS EN EL SOFTWARE.

source: ## Trademark
es: ## Marca registrada

source: "Software Carpentry" and "Data Carpentry" and their respective logos are registered trademarks of [Community Initiatives][CI].
es: "Software Carpentry" y "Data Carpentry" y sus respectivos logos son marcas registradas de [Community Initiatives][CI].

source: [cc-by-human]: https://creativecommons.org/licenses/by/4.0/ [cc-by-legal]: https://creativecommons.org/licenses/by/4.0/legalcode [mit-license]: https://opensource.org/licenses/mit-license.html [ci]: http://communityin.org/ [osi]: https://opensource.org
es: [cc-by-human]: https://creativecommons.org/licenses/by/4.0/deed.es [cc-by-legal]: https://creativecommons.org/licenses/by/4.0/legalcode.es [mit-license]: https://opensource.org/licenses/mit-license.html [ci]: http://communityin.org/ [osi]: https://opensource.org
