Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: > > 1. What does `thing[low:high]` do? > 2. What does `thing[low:]` (without a value after the colon) do? > 3. What does `thing[:high]` (without a value before the colon) do? > 4. What does `thing[:]` (just a colon) do? > 5. What does `thing[number:some-negative-number]` do? > 6. What happens when you choose a `high` value which is out of range? (i.e., try `atom_name[0:15]`) > > > ## Solutions > > > > 1. `thing[low:high]` returns a slice from `low` to the value before `high` > > 2. `thing[low:]` returns a slice from `low` all the way to the end of `thing` > > 3. `thing[:high]` returns a slice from the beginning of `thing` to the value before `high` > > 4. `thing[:]` returns all of `thing` > > 5. `thing[number:some-negative-number]` returns a slice from `number` to `some-negative-number` values from the end of `thing` > > 6. If a part of the slice is out of range, the operation does not fail. `atom_name[0:15]` gives the same result as `atom_name[0:]`.
es: > > 1. ¿Qué hace `algo[inicio:fin]` ? > 2. ¿Qué hace `algo [inicio:]` (sin un valor después de los dos puntos)? > 3. ¿Qué hace `algo[:fin]` (sin un valor antes de los dos puntos)? > 4. ¿Qué hace `algo[:]` (solo dos puntos)? > 5. ¿Qué hace `algo[número:algún-número-negativo]` ? > 6. ¿Qué pasa cuando eliges un valor `fin` que está fuera de rango? (es decir, probar con `atom_name[0:15]`) > > > ## Soluciones > > > > 1. `algo[inicio:fin]` devuelve un corte desde `inicio` hasta un valor antes de `fin` > > 2. `algo[inicio:]` devuelve un corte desde `inicio` hasta el final de ese `algo` > > 3. `algo[:fin]` devuelve un corte desde el comienzo de ese `algo` hasta el valor anterior a `fin` > > 4. `algo[:]` devuelve todo de `algo` > > 5. `algo[número:algún-número-negativo]` devuelve un corte desde ese `número` hasta el `algún-número-negativo` desde el final de `algo` > > 6. Si una parte del corte está fuera de rango, la operación no falla. `atom_name [0:15]` da el mismo resultado que `atom_name [0:]`.
uk: > > 1. Що є результатом зрізу `thing[low:high]`? > 2. Що є результатом зрізу `thing[low:]` (без значення після двокрапки)? > 3. Що є результатом зрізу `thing[:high]` (без значення до двокрапки) ? > 4. Що є результатом зрізу `thing[:]` (тільки двокрапка)? > 5. Що є результатом зрізу `thing[number:some-negative-number]`? > 6. Що станеться, якщо ми оберемо значення `high`, яке виходить за рамки діапазону? (наприклад, спробуйте `atom_name[0:15]`) > > > ## Рішення > > > > 1. `thing[low:high]` поверне зріз, починаючи зі значення `low` до значення перед `high` > > 2. `thing[low:]` поверне зріз, починаючи зі значення `low`, що містить всі значення до кінця `thing` > > 3. `thing[:high]` поверне зріз, починаючи зі значення `thing` до значення перед `high` > > 4. `thing[:]` поверне всі значення рядка `thing` > > 5. `thing[number:some-negative-number]` поверне зріз, починаючи зі значення `number` до значення `some-negative-number`, що розраховується з кінця рядка `thing` > > 6. Якщо частина фрагмента виходить за межі діапазону, операція не завершується. `atom_name[0:15]` дає той самий результат, що й`atom_name[0:]`.

source: --- title: "Data Types and Type Conversion" teaching: 10 exercises: 10 questions: - "What kinds of data do programs store?" - "How can I convert one type to another?" objectives: - "Explain key differences between integers and floating point numbers." - "Explain key differences between numbers and character strings." - "Use built-in functions to convert between integers, floating point numbers, and strings." keypoints: - "Every value has a type." - "Use the built-in function `type` to find the type of a value." - "Types control what operations can be done on values." - "Strings can be added and multiplied." - "Strings have a length (but numbers don't)." - "Must convert numbers to strings or vice versa when operating on them." - "Can mix integers and floats freely in operations." - "Variables only change value when something is assigned to them." ---
es: --- title: "Tipos de Datos y Conversión de Tipos" teaching: 10 exercises: 10 questions: - "¿Qué tipo de datos almacenan los programas?" - "¿Cómo puedo convertir un tipo a otro?" objectives: - "Explicar las diferencias clave entre números enteros y números de punto flotante." - "Use las funciones de la biblioteca de Python para convertir entre enteros, números de punto flotante, y secuencia de caracteres." keypoints: - "Cada valor tiene un tipo." - "Use la función `type` para encontrar el tipo de un valor." - "Los tipos controlan qué operaciones se pueden hacer con los valores." - "A las secuencias de caracteres se les pueden agregar y multiplicar." - "Las secuencias de caracteres tienen una longitud (pero los números no)." - "Se deben convertir números a secuencias de caracteres o viceversa cuando se opera con ellas." - "Se pueden mezclar enteros y puntos flotantes libremente en operaciones." - "Las variables solo cambian de valor cuando se les asigna algo." ---
uk: --- title: "Типи даних та їх перетворення" teaching: 10 exercises: 10 questions: - "Які типи даних зберігають програми?" - "Як перетворити один тип в інший?" objectives: - "Зʼясувати, чим відрізняються цілі числа від чисел з плаваючою крапкою." - "Зʼясувати, чим відрізняються числа та рядки символів." - "Використовувати вбудовані функції для перетворень між цілими числами, числами з плаваючою крапкою та рядками." keypoints: - "Кожне значення має тип." - "Використовуйте вбудовану функцію `type` для визначення типу значення." - "Типи контролюють, які операції можуть бути виконані над значеннями." - "Рядки можна додавати та множити." - "Рядки мають довжину (а числа - ні)." - "Деякі операції вимагають перетворення числа у рядок або навпаки." - "Цілі та дійсні числа можна використовувати разом для арифметичних дій." - "Змінні можуть змінити своє значення тільки через присвоювання." ---

source: ## Every value has a type.
es: ## Cada valor tiene un tipo.
uk: ## Кожне значення має тип.

source: * Every value in a program has a specific type.
es: * Cada valor en un programa tiene un tipo específico.
uk: * Кожне значення, яке використовує програма, має деякий тип.

source: * Integer (`int`): represents positive or negative whole numbers like 3 or -512.
es: * Entero (`int`): representa números enteros positivos o negativos como 3 o -512.
uk: * Ціле число (`int`): зображує додатні або від’ємні цілі числа, наприклад 3 або -512.

source: * Floating point number (`float`): represents real numbers like 3.14159 or -2.5.
es: * Número de punto flotante (`float`): representa números reales como 3.14159 o -2.5.
uk: * Число з плаваючою крапкою (`float`): зображує дійсні числа, наприклад 3.14159 або -2.5.

source: * Character string (usually called "string", `str`): text.
es: * secuencia de caracteres (usualmente llamado "string", `str`): texto.
uk: * Рядки символів (звичайно просто "рядки", `str`): представляють текст.

source: * Written in either single quotes or double quotes (as long as they match).
es: * Escrito entre comillas simples o comillas dobles (siempre y cuando se usen las mismas).
uk: * Укладені в одинарні або подвійні лапки (тип лапок має збігатися).

source: * The quote marks aren't printed when the string is displayed.
es: * El entrecomillado no se imprimen cuando una secuencia de caracteres / cadena de texto es desplegada.
uk: * Під час відображення рядку лапки не друкуються.

source: ## Use the built-in function `type` to find the type of a value.
es: ## Use la función integrada `type` para encontrar el tipo de un valor.
uk: ## Вбудована функція `type` повертає тип значення.

source: * Use the built-in function `type` to find out what type a value has.
es: * Use la función integrada `type` para averiguar de que tipo es un valor.
uk: * Використовуйте вбудовану функцію `type`, щоб з'ясувати, який тип має значення.

source: * Works on variables as well.
es: * Funciona también en variables.
uk: * Це також працює зі змінними.

source: * But remember: the *value* has the type --- the *variable* is just a label.
es: * Pero recuerda: el *valor* tiene el tipo --- la *variable* es solo una etiqueta.
uk: * Але запамʼятайте: *значення* має свій тип, а *змінна* тільки вказує на деяке значення.

source: ## Types control what operations (or methods) can be performed on a given value.
es: ## Los tipos controlan qué operaciones (o métodos) se pueden realizar en un valor dado.
uk: ## Тип визначає, які операції (або методи) можна виконувати із даним значенням.

source: * A value's type determines what the program can do to it.
es: * El tipo de un valor determina lo que el programa puede hacerle.
uk: * Тип значення визначає, що може робити з ним програма.

source: ## You can use the "+" and "*" operators on strings.
es: ## Puede usar los operadores "+" y "*" en secuencia de caracteres
uk: ## Ви можете використовувати оператори "+" та "*" для дій над рядками.

source: * "Adding" character strings concatenates them.
es: * "Sumar" secuencia de caracteres les concatena.
uk: * "Додавання" рядків виконує їх конкатенацію.

source: * Multiplying a character string by an integer _N_ creates a new string that consists of that character string repeated _N_ times.
es: * Multiplicar una secuencia de caracteres por un entero _N_ crea una nueva cadena que consiste en esa cadena de caracteres repetida _N_ veces.
uk: * Якщо рядок помножити на ціле число _N_, то це створить новий рядок, який буде містити вихідний рядок, повторений _N_ разів.

source: * Since multiplication is repeated addition.
es: * Ya que la multiplicación es suma repetida.
uk: * Оскільки множення - це повторюване додавання.

source: ## Strings have a length (but numbers don't).
es: ## Las secuencias de caracteres tienen una longitud (pero los números no).
uk: ## Рядки мають довжину (але числа її не мають).

source: * The built-in function `len` counts the number of characters in a string.
es: * La función incorporada `len` cuenta el número de caracteres en una secuencia de caracteres / cadena de texto.
uk: * Вбудована функція `len` повертає кількість символів у рядку.

source: * But numbers don't have a length (not even zero).
es: * Pero los números no tienen una longitud (ni siquiera cero).
uk: * Але числа не мають довжини (навіть нуль).

source: ## <a name='convert-numbers-and-strings'></a> Must convert numbers to strings or vice versa when operating on them.
es: ## <a name='convert-numbers-and-strings'></a> Debe convertir los números en secuencia de caracteres o viceversa cuando realizando operaciones sobre ellos.
uk: ## <a name='convert-numbers-and-strings'></a> Деякі операції вимагають перетворення числа у рядок або навпаки.

source: * Cannot add numbers and strings.
es: * No se puede sumar números y secuencias de caracteres.
uk: * Додавання чисел та рядків неможливе.

source: * Not allowed because it's ambiguous: should `1 + '2'` be `3` or `'12'`?
es: * No está permitido porque es ambiguo: ¿debería `1 + '2'` ser `3` o `'12`'?
uk: * Таке додавання не дозволено, тому що воно не визначене: чи має `1 + '2'` повертати `3` чи `'12'`?

source: * Some types can be converted to other types by using the type name as a function.
es: * Algunos tipos se pueden convertir a otros tipos utilizando el nombre del tipo como una función.
uk: * Перетворення типу виконується за допомогою функції, яка має те ж саме імʼя, що і потрібний тип.

source: ## Can mix integers and floats freely in operations.
es: ## Puede mezclar enteros y números de punto flotantes libremente en las operaciones.
uk: ## Цілі та дійсні числа можна використовувати разом.

source: * Integers and floating-point numbers can be mixed in arithmetic.
es: * Enteros y números de punto flotante se pueden mezclar en aritmética.
uk: * Цілі та дійсні числа можна використовувати разом для арифметичних дій.

source: * Python 3 automatically converts integers to floats as needed. (Integer division in Python 2 will return an integer, the *floor* of the division.)
es: * Python 3 convierte automáticamente los enteros en números de puntos flotantes según sea necesario. (La división de enteros en Python 2 devolverá un entero, el entero más bajo del valor de la división).
uk: * Python 3 автоматично перетворить цілі числа у дійсні, якщо це потрібно. (У Python 2 ділення цілих чисел поверне ціле число, яке буде цілою частиною відповідного дійсного числа).

source: ## Variables only change value when something is assigned to them.
es: ## Las variables solo cambian de valor cuando se les asigna algo.
uk: ## Змінні можуть набути своє значення тільки через присвоювання.

source: * If we make one cell in a spreadsheet depend on another,
es: * Si hacemos que una celda de una hoja de cálculo dependa de otra,
uk: * В електроних таблицях, якщо одна клітинка залежить від іншої,

source: and update the latter, the former updates automatically. * This does **not** happen in programming languages.
es: y actualizamos esta última, la anterior se actualiza automáticamente. * Esto **no** ocurre en lenguajes de programación.
uk: то у разі зміни у останній, залежна клітинка оновиться автоматично. * Це **не** трапляється у мовах програмування.

source: * The computer reads the value of `first` when doing the multiplication,
es: * La computadora lee el valor de `first` cuando hace la multiplicación,
uk: * Компʼютер використовує значення змінної `first` коли виконує множення,

source: creates a new value, and assigns it to `second`. * After that, `second` does not remember where it came from.
es: el resultado de la multiplicación lo asigna a `second`. * Después de eso, `second` solo guarda el valor y no recuerda de dónde vino.
uk: створює нове значення, та присвоює його змінній `second`. * Після цього значення `second` встановлюється на нове значення і не залежить від `first`, тому його значення не змінюється автоматично, коли змінюється значення `first`.

source: > ## Fractions
es: > ## Fracciones
uk: > ## Дроби

source: > > What type of value is 3.4? > How can you find out? > > > ## Solution > > > > It is a floating-point number (often abbreviated "float"). > > > > ~~~ > > print(type(3.4)) > > ~~~ > > {: .language-python} > > ~~~ > > <class 'float'> > > ~~~ > > {: .output}
es: > > ¿Qué tipo de valor es 3.4? > ¿Cómo puedes averiguarlo? > > > ## Solución > > > >Es un número de punto flotante (a menudo abreviado "float"). > > > > ~~~ > > print(type(3.4)) > > ~~~ > > {: .language-python} > > ~~~ > > <class 'float'> > > ~~~ > > {: .output}
uk: > > Який тип має число 3.4? > Як це можна встановити? > > > ## Рішення > > > > Це - дійсне число (або число з плаваючою крапкою). > > > > ~~~ > > print(type(3.4)) > > ~~~ > > {: .language-python} > > ~~~ > > <class 'float'> > > ~~~ > > {: .output}

source: > ## Automatic Type Conversion
es: > ## Conversión Automática de Tipos
uk: > ## Автоматичне перетворення типів

source: > > What type of value is 3.25 + 4? > > > ## Solution > > > > It is a float: > > integers are automatically converted to floats as necessary. > > > > ~~~ > > result = 3.25 + 4 > > print(result, 'is', type(result)) > > ~~~ > > {: .language-python} > > ~~~ > > 7.25 is <class 'float'> > > ~~~ > > {: .output}
es: > > ¿Qué tipo de valor resulta de 3.25 + 4? > > > ## Solución > > > > Es **float**: > > Enteros son convertidos automáticamente en números de puntos flotantes según sea necesario. > > > > ~~~ > > result = 3.25 + 4 > > print(result, 'is', type(result)) > > ~~~ > > {: .language-python} > > ~~~ > > 7.25 is <class 'float'> > > ~~~ > > {: .output}
uk: > > Який тип має 3.25 + 4? > > > ## Рішення > > > > Це - дійсне число: > > цілі числа автоматично перетворюються у дійсні, коли це необхідно. > > > > ~~~ > > result = 3.25 + 4 > > print(result, 'is', type(result)) > > ~~~ > > {: .language-python} > > ~~~ > > 7.25 is <class 'float'> > > ~~~ > > {: .output}

source: > ## Choose a Type
es: > ## Elige un Tipo
uk: > ## Вибір типу

source: > > What type of value (integer, floating point number, or character string) > would you use to represent each of the following? Try to come up with more than one good answer for each problem. For example, in # 1, when would counting days with a floating point variable make more sense than using an integer? > > 1. Number of days since the start of the year. > 2. Time elapsed from the start of the year until now in days. > 3. Serial number of a piece of lab equipment. > 4. A lab specimen's age > 5. Current population of a city. > 6. Average population of a city over time. > > > ## Solution > > > > The answers to the questions are: > > 1. Integer, since the number of days would lie between 1 and 365. > > 2. Floating point, since fractional days are required > > 3. Character string if serial number contains letters and numbers, otherwise integer if the serial number consists only of numerals > > 4. This will vary! How do you define a specimen's age? whole days since collection (integer)? date and time (string)? > > 5. Choose floating point to represent population as large aggregates (eg millions), or integer to represent population in units of individuals. > > 6. Floating point number, since an average is likely to have a fractional part. > > {: .output}
es: > > ¿Qué tipo de valor (**integer**, **float**, o **string**) > usarías para representar cada uno de los siguientes? Intenta encontrar más de una buena respuesta para cada problema. Por ejemplo, en el n. ° 1, ¿cuándo tendría más sentido contar días con una variable de punto flotante que usar un entero? > > 1. Número de días desde el comienzo del año. > 2. Tiempo transcurrido desde el inicio del año hasta ahora en días. > 3. Número de serie de un equipo de laboratorio. > 4. Edad de un espécimen de laboratorio > 5. Población actual de una ciudad. > 6. Población media de una ciudad a lo largo del tiempo. > >> ## Solución > > >> Las respuestas a las preguntas son: >> 1. Entero, ya que el número de días estaría entre 1 y 365. >> 2. Punto flotante, ya que se requieren días fraccionados >> 3. Secuencia de caracteres si el número de serie contiene letras y números; de lo contrario, entero si el número de serie consta solo de números >> 4. ¡Esto variará! ¿Cómo define la edad de un espécimen? días completos desde la colección (**entero**)? fecha y hora (**secuencia de caracteres**)? >> 5. Elija punto flotante para representar la población como grandes agregados (por ejemplo, millones), o entero para representar la población en unidades de individuos. >> 6. Punto flotante, ya que es probable que un promedio tenga una parte fraccionaria. > > {: .output}
uk: > > Який тип (ціле число, дійсне число, рядок символів) ви будете використовувати для зберігання наступних значень? Спробуйте надати більш ніж одну відповідь у кожному випадку. Наприклад, в питанні # 1, коли для рахування днів дійсні числа можуть бути більш доречними, ніж цілі? > > 1. Кількість днів з початку року. > 2. Час, який пройшов з початку року до поточного моменту, у днях. > 3. Серійний номер лабораторного обладнання. > 4. Вік лабораторного зразка. > 5. Чисельність населення міста. > 6. Середня чисельність населення міста за певний час. > > > ## Рішення > > > > Ці питання мають наступні відповіді: > > 1. Ціле число, оскільки кількість днів приймає значення від 1 до 365. > > 2. Дійсне число, оскільки треба використовувати частини дня. > > 3. Рядок символів, якщо серійний номер містить букви та цифри; ціле число, якщо він містить тільки цифри. > > 4. Це залежить від багатьох факторів! Як вимірюється вік зразка? Кількість днів з моменту, коли його було виготовлено (ціле число)? Дата і час (рядок)? > > 5. Виберіть дійсне число, щоб представити приблизну кількість населення за допомогою округлення (наприклад, до мільйонів), або ціле число, щоб представити точну кількість населення. > > 6. Дійсне число, оскільки результат усереднення, швидше за все, буде мати дрібну частину. > > {: .output}

source: > ## Division Types
es: > ## Tipos de División
uk: > ## Типи операцій ділення

source: > > In Python 3, the `//` operator performs integer (whole-number) floor division, the `/` operator performs floating-point > division, and the '%' (or *modulo*) operator calculates and returns the remainder from integer division: > > ~~~ > print('5 // 3:', 5//3) > print('5 / 3:', 5/3) > print('5 % 3:', 5%3) > ~~~ > {: .language-python} > > ~~~ > 5 // 3: 1 > 5 / 3: 1.6666666666666667 > 5 % 3: 2 > ~~~
es: > > En Python 3, el operador `//` realiza una división de piso de número entero ( devuelve la parte entera de la división), el operador `/` realiza una división > de número de punto flotante, y el operador '%' (o *módulo*) calcula y devuelve el resto de la división entera: > > ~~~ > print('5 // 3:', 5//3) > print('5 / 3:', 5/3) > print('5 % 3:', 5%3) > ~~~ > {: .language-python} > > ~~~ > 5 // 3: 1 > 5 / 3: 1.6666666666666667 > 5 % 3: 2 > ~~~
uk: > > У Python 3 оператор `//` виконує ціле ділення (повертає цілу частину результату), оператор `/` виконує ділення з плаваючою крапкою, > та оператор '%' (або *модуль*) повертає залишок від цілого ділення: > > ~~~ > print('5 // 3:', 5//3) > print('5 / 3:', 5/3) > print('5 % 3:', 5%3) > ~~~ > {: .language-python} > > ~~~ > 5 // 3: 1 > 5 / 3: 1.6666666666666667 > 5 % 3: 2 > ~~~
