Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: > > What do these two programs print? > In simple terms, explain the difference between `new = old` and `new = old[:]`. > > ~~~ > # Program A > old = list('gold') > new = old # simple assignment > new[0] = 'D' > print('new is', new, 'and old is', old) > ~~~ > {: .language-python} > > ~~~ > # Program B > old = list('gold') > new = old[:] # assigning a slice > new[0] = 'D' > print('new is', new, 'and old is', old) > ~~~ > {: .language-python} > > > ## Solution > > Program A prints > > ~~~ > > new is ['D', 'o', 'l', 'd'] and old is ['D', 'o', 'l', 'd'] > > ~~~ > > Program B prints > > ~~~ > > new is ['D', 'o', 'l', 'd'] and old is ['g', 'o', 'l', 'd'] > > ~~~ > > {: .language-python} > > `new = old` makes `new` a reference to the list `old`; `new` and `old` point > > towards the same object. > > > > `new = old[:]` however creates a new list object `new` containing all elements > > from the list `old`; `new` and `old` are different objects.
es: > > ¿Qué muestran estos dos programas? > Explica la diferencia entre `new = old` y `new = old[:]` en términos simples. > > ~~~ > # Programa A > old = list('gold') > new = old # asignación simple > new[0] = 'D' > print('new es', new, 'y old es', old) > ~~~ > {: .language-python} > > ~~~ > # Programa B > old = list('gold') > new = old[:] # asignación de un corte > new[0] = 'D' > print('new es', new, 'y old es', old) > ~~~ > {: .language-python} > > > ## Solución > > El programa A muestra > > ~~~ > > new es ['D', 'o', 'l', 'd'] y old es ['D', 'o', 'l', 'd'] > > ~~~ > > El programa B muestra > > ~~~ > > new es ['D', 'o', 'l', 'd'] y old es ['g', 'o', 'l', 'd'] > > ~~~ > > {: .language-python} > > `new = old` crea una referencia a la lista `old`; `new` y `old` apuntan > > al mismo objeto. > > > > `new = old[:]`, sin embargo, crea una nueva lista `new` con todos los elementos > > de la lista `old`; `new` y `old` son dos objetos diferentes.
uk: > > Що друкують ці дві програми? > Простими словами поясніть різницю між `new = old` and `new = old[:]`. > > ~~~ > # Програма A > old = list('gold') > new = old # просте присвоювання > new[0] = 'D' > print('новим є', new, 'і старим є', old) > ~~~ > {: .language-python} > > ~~~Програма B > old = list('gold') > new = old[:] # присвоювання зріза > new[0] = 'D' > print('новим є', new, 'і старим є', old) > ~~~ > {: .language-python} > > > ## Рішення > > Програма А друкує > > ~~~ > > новим є ['D', 'o', 'l', 'd'] і старим є ['D', 'o', 'l', 'd'] > > ~~~ > > Програма В друкує > > ~~~ > > новим є ['D', 'o', 'l', 'd'] і старим є ['g', 'o', 'l', 'd'] > > ~~~ > > {: .language-python} > > `new = old` робить `new` посиланням на список `old`; `new` and `old` вказують > > на той самий об'єкт. > > > > `new = old[:]` однак створює новий об’єкт списку `new`, який містить усі елементи > > зі списку `old`; `new` та `old` є різними об'єктами.

source: --- title: "For Loops" teaching: 10 exercises: 15 questions: - "How can I make a program do many things?" objectives: - "Explain what for loops are normally used for." - "Trace the execution of a simple (unnested) loop and correctly state the values of variables in each iteration." - "Write for loops that use the Accumulator pattern to aggregate values." keypoints: - "A *for loop* executes commands once for each value in a collection." - "A `for` loop is made up of a collection, a loop variable, and a body." - "The first line of the `for` loop must end with a colon, and the body must be indented." - "Indentation is always meaningful in Python." - "Loop variables can be called anything (but it is strongly advised to have a meaningful name to the looping variable)." - "The body of a loop can contain many statements." - "Use `range` to iterate over a sequence of numbers." - "The Accumulator pattern turns many values into one." ---
es: --- title: "Bucles For" teaching: 10 exercises: 15 questions: - "¿Cómo puedo hacer que un programa haga muchas cosas?" objectives: - "Explicar para qué se usan normalmente los bucles for." - "Rastrear la ejecución de un bucle simple (no anidado) e indicar correctamente los valores de las variables en cada iteración." - "Escribir bucles for que usan el patrón del Acumulador para agregar valores." keypoints: - "Un *bucle for* ejecuta comandos una vez para cada valor en una colección." - "Un bucle `for` se compone de una colección, una variable de bucle y un cuerpo." - "La primera línea del bucle `for` debe terminar con dos puntos, y el cuerpo debe ser indentado." - "La indentación siempre es significativa en Python." - "Las variables de bucle se pueden llamar de cualquier forma (pero se recomienda encarecidamente tener un nombre significativo para la variable de bucle)." - "El cuerpo de un bucle puede contener muchas instrucciones." - "Usa `range` para iterar sobre una secuencia de números." - "El patrón Acumulador convierte muchos valores en uno." ---
uk: --- title: "Цикли for" teaching: 10 exercises: 15 questions: - "Як змусити програму робити багато речей?" objectives: - "Поясніть, для чого зазвичай використовуються цикли for." - "Відстежуйте виконання простого (невкладеного) циклу та правильно вказуйте значення змінних у кожній ітерації." - "Пишить цикли for, які використовують паттерн накопичувача для агрегування значень." keypoints: - "Цикл *for* виконує команди один раз для кожного значення в колекції." - "Цикл `for` складається з колекції, змінної циклу та тіла." - "Перший рядок циклу `for` має закінчуватися двокрапкою, а тіло має бути з відступом." - "Відступи завжди важливі в Python." - "Змінні циклу можна називати як завгодно (але настійно рекомендується мати значущу назву для змінної циклу)." - "Тіло циклу може містити багато операторів." - "Використовуйте `range` для перебору послідовності чисел." - "Патерн накопичувача перетворює багато значень в одне." ---

source: ## A *for loop* executes commands once for each value in a collection.
es: ## Un *bucle for* ejecuta comandos una vez para cada valor en una colección.
uk: ## *Цикл for* виконує команди один раз для кожного значення в колекції.

source: * Doing calculations on the values in a list one by one
es: * Hacer cálculos sobre los valores en una lista uno por uno
uk: * Виконувати обчислення для значень у списку одне за іншим

source: is as painful as working with `pressure_001`, `pressure_002`, etc. * A *for loop* tells Python to execute some statements once for each value in a list, a character string, or some other collection. * "for each thing in this group, do these operations"
es: es tan incómodo como trabajar con `pressure_001`, `pressure_002`, etc. * Un *bucle for* le dice a Python que ejecute algunas instrucciones una vez por cada valor de una lista, una secuencia de caracteres, o alguna otra colección. * "para cada cosa en este grupo, realiza estas operaciones"
uk: так само неприємно, як працювати з `pressure_001`, `pressure_002` і так далі. * *Цикл for* повідомляє Python що треба виконати деякі оператори один раз для кожного значення в списку, рядку символів, або якісь іншій колекції. * "для кожного елемента в цій групі виконайте ці операції"

source: * This `for` loop is equivalent to:
es: * Este bucle `for` es equivalente a:
uk: * Цей цикл `for` є еквівалентним наступному:

source: * And the `for` loop's output is:
es: * Y la salida del bucle `for` es:
uk: * І результат циклу `for` є таким:

source: ## A `for` loop is made up of a collection, a loop variable, and a body.
es: ## Un bucle `for` se compone de una colección, una variable de control y un cuerpo.
uk: ## Цикл `for` складається з колекції, змінної циклу та тіла циклу.

source: * The collection, `[2, 3, 5]`, is what the loop is being run on.
es: * La colección, `[2, 3, 5]`, es sobre lo que se está ejecutando el bucle.
uk: * Колекція `[2, 3, 5]` є тим, на чому виконується цикл.

source: * The body, `print(number)`, specifies what to do for each value in the collection.
es: * El cuerpo, `print (number)`, especifica qué hacer para cada valor en la colección.
uk: * Тіло циклу, `print(number)`, визначає, що робити для кожного значення в колекції.

source: * The loop variable, `number`, is what changes for each *iteration* of the loop.
es: * La variable de control, `number`, es lo que cambia para cada *iteración* del bucle.
uk: * Змінна циклу, `number`, змінюється для кожної *ітерації* циклу.

source: * The "current thing".
es: * El "valor actual de la variable".
uk: * "Актуальне".

source: ## The first line of the `for` loop must end with a colon, and the body must be indented.
es: ## La primera línea del bucle `for` debe terminar con dos puntos, y el cuerpo debe estar indentado.
uk: ## Перший рядок циклу `for` має закінчуватися двокрапкою, а тіло циклу має бути з відступом.

source: * The colon at the end of the first line signals the start of a *block* of statements.
es: * Los dos puntos al final de la primera línea indican el inicio de un *bloque* de instrucciones.
uk: * Двокрапка в кінці першого рядка вказує на початок *блоку* операторів.

source: * Python uses indentation rather than `{}` or `begin`/`end` to show *nesting*.
es: * Python usa indentación en lugar de `{}` o `begin` /` end` para mostrar *anidamiento *.
uk: * Python використовує відступ, а не `{}` або `begin`/`end`, щоб показати *вкладеність*.

source: * Any consistent indentation is legal, but almost everyone uses four spaces.
es: * Cualquier indentación consistente es legal, pero casi todos usan cuatro espacios.
uk: * Будь-який послідовний відступ є допустимим, але майже усі використовують чотири пробіли.

source: * Indentation is always meaningful in Python.
es: * La indentación es siempre significativa en Python.
uk: * Відступи у Python завжди важливі.

source: * This error can be fixed by removing the extra spaces
es: * Este error se puede solucionar eliminando los espacios adicionales
uk: * Цю помилку можна виправити, видаливши зайві пробіли

source: at the beginning of the second line.
es: al comienzo de la segunda línea.
uk: на початку другого рядка.

source: ## Loop variables can be called anything.
es: ## Las variables de control pueden tener cualquier nombre.
uk: ## Змінні циклу можна називати як завгодно.

source: * As with all variables, loop variables are:
es: * Como todas las variables, las variables de control son:
uk: * Як і всі інші змінні, змінні циклу:

source: * Created on demand.
es: * Creadas a petición.
uk: * Створюються коли потрібно.

source: * Meaningless: their names can be anything at all.
es: * Sin significado: pueden usar cualquier nombre.
uk: * Не несуть смислового навантаження: їхні імена можуть бути будь-якими.

source: ## The body of a loop can contain many statements.
es: ## El cuerpo de un bucle puede contener muchas instrucciones.
uk: ## Тіло циклу може містити багато операторів.

source: * But no loop should be more than a few lines long.
es: * Pero ningún bucle debería tener más de unas pocas líneas de longitud.
uk: * Але жоден цикл не повинен мати довжину більше кількох рядків.

source: * Hard for human beings to keep larger chunks of code in mind.
es: * Es difícil para los seres humanos tener en mente grandes fragmentos de código.
uk: * Людям важко запам’ятати великі фрагменти коду.

source: ## Use `range` to iterate over a sequence of numbers.
es: ## Usa `range` para iterar sobre una secuencia de números.
uk: ## Використовуйте `range` для перебору послідовності чисел.

source: * The built-in function [`range`](https://docs.python.org/3/library/stdtypes.html#range) produces a sequence of numbers.
es: * La función incorporada [`range`](https://docs.python.org/3/library/stdtypes.html#range) produce una secuencia de números.
uk: * Вбудована функція [`range`](https://docs.python.org/3/library/stdtypes.html#range) створює послідовність чисел.

source: * *Not* a list: the numbers are produced on demand
es: * *No es* una lista: los números se producen a pedido.
uk: * Це *не* список: числа виготовляються на замовлення

source: to make looping over large ranges more efficient. * `range(N)` is the numbers 0..N-1 * Exactly the legal indices of a list or character string of length N
es: para hacer que el bucle en grandes rangos sea más eficiente * `range(N)` son los números 0..N-1 * Exactamente los índices legales de una lista o secuencia de caracteres de longitud N
uk: щоб зробити цикл у великих діапазонах більш ефективним. * `range(N)` - це числа 0..N-1 * Точно допустимі індекси списку або рядка символів довжиною N

source: ~~~ print('a range is not a list: range(0, 3)') for number in range(0, 3): print(number) ~~~
es: ~~~ print('un range no es una lista: range(0, 3)') for number in range(0, 3): print(number) ~~~

source: {: .language-python} ~~~ a range is not a list: range(0, 3) 0 1 2 ~~~
es: {: .language-python} ~~~ un range no es una lista: range(0, 3) 0 1 2 ~~~

source: ## The Accumulator pattern turns many values into one.
es: ## El patrón Acumulador convierte muchos valores en uno.
uk: ## Патерн накопичувача перетворює багато значень в одне.

source: * A common pattern in programs is to:
es: * Un patrón común en los programas es:
uk: * Загальний паттерн у програмах:

source: 1. Initialize an *accumulator* variable to zero, the empty string, or the empty list. 2. Update the variable with values from a collection.
es: 1. Inicializar una variable *acumulador* a cero, la secuencia de caracteres vacía o la lista vacía. 2. Actualizar la variable con valores de una colección.
uk: 1. Ініціалізуйте *накопичувальну* змінну нулем, порожнім рядком або порожнім списком. 2. Оновіть змінну значеннями з колекції.

source: ~~~ # Sum the first 10 integers. total = 0 for number in range(10): total = total + (number + 1) print(total) ~~~
es: ~~~ # Suma los primeros 10 números enteros. total = 0 for number in range(10): total = total + (number + 1) print(total) ~~~
uk: ~~~ # Знайдіть суму перших 10 цілих чисел. total = 0 for number in range(10): total = total + (number + 1) print(total) ~~~

source: * Read `total = total + (number + 1)` as:
es: * Lee `total = total + (number + 1)` como:
uk: * Прочитайте `total = total + (number + 1)` наступним чином:

source: * Add 1 to the current value of the loop variable `number`.
es: * Suma 1 al valor actual de la variable de control `number`.
uk: * Додати 1 до поточного значення змінної циклу `number`.

source: * Add that to the current value of the accumulator variable `total`.
es: * Añade esto al valor actual de la variable acumuladora `total`.
uk: * Додати це до поточного значення накопичувальної змінної `total`.

source: * Assign that to `total`, replacing the current value.
es: * Asigna esto a `total`, reemplazando el valor actual.
uk: * Призначити це `total`, замінивши поточне значення.

source: * We have to add `number + 1` because `range` produces 0..9, not 1..10.
es: * Tenemos que añadir `number + 1` porque `range` produce 0..9, no 1..10.
uk: * Ми маємо додавати `number + 1`, тому що `range` продукує 0..9, а не 1..10.

source: > ## Classifying Errors
es: > ## Clasificación de errores
uk: > ## Класифікація помилок

source: > > Is an indentation error a syntax error or a runtime error? > > ## Solution > > An IndentationError is a syntax error. Programs with syntax errors cannot be started. > > A program with a runtime error will start but an error will be thrown under certain conditions.
es: > > ¿Es un error de indentación un error de sintaxis o un error de tiempo de ejecución? > > ## Solución > > Un IndentationError es un error de sintaxis. Los programas con errores de sintaxis no se pueden iniciar > > Un programa con un error de ejecución se iniciará pero se lanzará un error bajo ciertas condiciones.
uk: > > Помилка відступу є синтаксичною чи помилкою виконання? > > ## Рішення > > IndentationError є синтаксичною помилкою. Неможливо запустити програми з синтаксичними помилками. > > Програма з помилкою виконання запускається, але за певних умов видається помилка.

source: > ## Tracing Execution
es: > ## Rastreo de Ejecución
uk: > ## Відстеження виконання

source: > > Create a table showing the numbers of the lines that are executed when this program runs, > and the values of the variables after each line is executed. > > ~~~ > total = 0 > for char in "tin": > total = total + 1 > ~~~ > {: .language-python} > > ## Solution > > > > | Line no | Variables | > > |---------|----------------------| > > | 1 | total = 0 | > > | 2 | total = 0 char = 't' | > > | 3 | total = 1 char = 't' | > > | 2 | total = 1 char = 'i' | > > | 3 | total = 2 char = 'i' | > > | 2 | total = 2 char = 'n' | > > | 3 | total = 3 char = 'n' |
es: > > Crea una tabla que muestre los números de las líneas que se ejecutan cuando se corre este programa, > y los valores de las variables después de ejecutar cada línea. > > ~~~ > total = 0 > for char in "tin": > total = total + 1 > ~~~ > {: .language-python} > > ## Solución > > > > | no. de linea | Variables | > > |---------|----------------------| > > | 1 | total = 0 | > > | 2 | total = 0 char = 't' | > > | 3 | total = 1 char = 't' | > > | 2 | total = 1 char = 'i' | > > | 3 | total = 2 char = 'i' | > > | 2 | total = 2 char = 'n' | > > | 3 | total = 3 char = 'n' |
uk: > > Створіть таблицю з номерами рядків, які виконуються під час виконання цієї програми, > і значення змінних після виконання кожного рядка. > > ~~~ > total = 0 > for char in "tin": > total = total + 1 > ~~~ > {: .language-python} > > ## Solution > > > > | Line no | Variables | > > |---------|----------------------| > > | 1 | total = 0 | > > | 2 | total = 0 char = 't' | > > | 3 | total = 1 char = 't' | > > | 2 | total = 1 char = 'i' | > > | 3 | total = 2 char = 'i' | > > | 2 | total = 2 char = 'n' | > > | 3 | total = 3 char = 'n' |

source: > ## Reversing a String
es: > ## Invertir a una secuencia de caracteres
uk: > ## Перевертання рядка

source: > > Fill in the blanks in the program below so that it prints "nit" > (the reverse of the original character string "tin"). > > ~~~ > original = "tin" > result = ____ > for char in original: > result = ____ > print(result) > ~~~ > {: .language-python} > > ## Solution > > ~~~ > > original = "tin" > > result = "" > > for char in original: > > result = char + result > > print(result) > > ~~~ > > {: .language-python}
es: > > Completa los espacios en blanco en el programa a continuación para que imprima "nit" > (el reverso de la secuencia de caracteres original "tin"). > > ~~~ > original = "tin" > result = ____ > for char in original: > result = ____ > print(result) > ~~~ > {: .language-python} > > ## Solución > > ~~~ > > original = "tin" > > result = "" > > for char in original: > > result = char + result > > print(result) > > ~~~ > > {: .language-python}
uk: > > Заповніть порожні місця в програмі нижче, щоб вона друкувала "nit" > (зворотний вихідний рядок символів "tin"). > > ~~~ > original = "tin" > result = ____ > for char in original: > result = ____ > print(result) > ~~~ > {: .language-python} > > ## Рішення > > ~~~ > > original = "tin" > > result = "" > > for char in original: > > result = char + result > > print(result) > > ~~~ > > {: .language-python}

source: > ## Practice Accumulating
es: > ## Practica con el Acumulador
uk: > ## Практика накопичення.

source: > > Fill in the blanks in each of the programs below > to produce the indicated result. > > ~~~ > # Total length of the strings in the list: ["red", "green", "blue"] => 12 > total = 0 > for word in ["red", "green", "blue"]: > ____ = ____ + len(word) > print(total) > ~~~ > {: .language-python} > > ## Solution > > ~~~ > > total = 0 > > for word in ["red", "green", "blue"]: > > total = total + len(word) > > print(total) > > ~~~ > > {: .language-python}
es: > > Complete los espacios en blanco en cada uno de los programas de abajo > para producir el resultado indicado. > > ~~~ > # Longitud total de las cadenas de texto en la lista: ["red", "green", "blue"] => 12 > total = 0 > for word in ["red", "green", "blue"]: > ____ = ____ + len(word) > print(total) > ~~~ > {: .language-python} > > ## Solución > > ~~~ > > total = 0 > > for word in ["red", "green", "blue"]: > > total = total + len(word) > > print(total) > > ~~~ > > {: .language-python}
uk: > > Заповніть пропуски в кожній із наведених нижче програм, > щоб отримати вказаний результат > > ~~~ > # Загальна довжина рядків у списку: ["red", "green", "blue"] => 12 > total = 0 > for word in ["red", "green", "blue"]: > ____ = ____ + len(word) > print(total) > ~~~ > {: .language-python} > > ## Рішення > > ~~~ > > total = 0 > > for word in ["red", "green", "blue"]: > > total = total + len(word) > > print(total) > > ~~~ > > {: .language-python}

source: > > ~~~ > # List of word lengths: ["red", "green", "blue"] => [3, 5, 4] > lengths = ____ > for word in ["red", "green", "blue"]: > lengths.____(____) > print(lengths) > ~~~ > {: .language-python} > > ## Solution > > ~~~ > > lengths = [] > > for word in ["red", "green", "blue"]: > > lengths.append(len(word)) > > print(lengths) > > ~~~ > > {: .language-python}
es: > > ~~~ > # Lista de longitudes de las palabras: ["red", "green", "blue"] => [3, 5, 4] > lengths = ____ > for word in ["red", "green", "blue"]: > lengths.____(____) > print(lengths) > ~~~ > {: .language-python} > > ## Solución > > ~~~ > > lengths = [] > > for word in ["red", "green", "blue"]: > > lengths.append(len(word)) > > print(lengths) > > ~~~ > > {: .language-python}
uk: > > ~~~ > # Список довжин слів: ["red", "green", "blue"] => [3, 5, 4] > lengths = ____ > for word in ["red", "green", "blue"]: > lengths.____(____) > print(lengths) > ~~~ > {: .language-python} > > ## Рішення > > ~~~ > > lengths = [] > > for word in ["red", "green", "blue"]: > > lengths.append(len(word)) > > print(lengths) > > ~~~ > > {: .language-python}

source: > > ~~~ > # Concatenate all words: ["red", "green", "blue"] => "redgreenblue" > words = ["red", "green", "blue"] > result = ____ > for ____ in ____: > ____ > print(result) > ~~~ > {: .language-python} > > ## Solution > > ~~~ > > words = ["red", "green", "blue"] > > result = "" > > for word in words: > > result = result + word > > print(result) > > ~~~ > > {: .language-python}
es: > > ~~~ > # Concatena todas las palabras: ["red", "green", "blue"] => "redgreenblue" > words = ["red", "green", "blue"] > result = ____ > for ____ in ____: > ____ > print(result) > ~~~ > {: .language-python} > > ## Solución > > ~~~ > > words = ["red", "green", "blue"] > > result = "" > > for word in words: > > result = result + word > > print(result) > > ~~~ > > {: .language-python}
uk: > > ~~~ > # Concatenate all words: ["red", "green", "blue"] => "redgreenblue" > words = ["red", "green", "blue"] > result = ____ > for ____ in ____: > ____ > print(result) > ~~~ > {: .language-python} > > ## Рішення > > ~~~ > > words = ["red", "green", "blue"] > > result = "" > > for word in words: > > result = result + word > > print(result) > > ~~~ > > {: .language-python}

source: > > ~~~ > # Create acronym: ["red", "green", "blue"] => "RGB" > # write the whole thing > ~~~ > {: .language-python} > > ## Solution > > ~~~ > > acronym = "" > > for word in ["red", "green", "blue"]: > > acronym = acronym + word[0].upper() > > print(acronym) > > ~~~ > > {: .language-python}
es: > > ~~~ > # Crea un acrónimo: ["red", "green", "blue"] => "RGB" > # escribe toda la solución. > ~~~ > {: .language-python} > > ## Solución > > ~~~ > > acronym = "" > > for word in ["red", "green", "blue"]: > > acronym = acronym + word[0].upper() > > print(acronym) > > ~~~ > > {: .language-python}
uk: > > ~~~ > # Створіть акронім: ["red", "green", "blue"] => "RGB" > # Напишіть всю прграму > ~~~ > {: .language-python} > > ## Рішення > > ~~~ > > acronym = "" > > for word in ["red", "green", "blue"]: > > acronym = acronym + word[0].upper() > > print(acronym) > > ~~~ > > {: .language-python}

source: > ## Cumulative Sum
es: > ## Suma acumulativa
uk: > ## Кумулятивна сума
