Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: * ...do simple data extraction and formatting using Pandas.
es: * ...hacer extracciones de datos simples y formatear datos usando Pandas.
uk: * ...повертати та форматувати дані за допомогою Pandas.

source: ### Concepts
es: ### Conceptos
uk: ### Визначення

source: I know...
es: Yo sé...
uk: Я дізнаюся...

source: * ...that a program is a piece of lab equipment that implements an analysis
es: * ...que un programa es una herramienta para el análisis de datos
uk: * ...що програма - це частина обладнання, яке виконує аналіз

source: * Needs to be validated/calibrated before/during use
es: * Necesita ser validado/calibrado antes/durante el uso
uk: * Програму потрібно перевіряти/налагоджувати перед/під час використання

source: * Makes analysis reproducible, reviewable, shareable
es: * Hace los análisis reproducibles, revisables, compartibles
uk: * Аналіз програми потрібно робити відтворюваним, доступним для перегляду та обміну

source: * ...that programs are written for people, not for computers
es: * ...que los programas son escritos para personas no para computadoras
uk: * ...що програми пишуться для людей, а не для комп'ютерів

source: * Meaningful variable names
es: * Usar nombres de variable significativos
uk: * Значущі імена змінної

source: * Modularity for readability as well as re-use
es: * Usar modularidad para legibilidad y reutilización
uk: * Створення модулів для зручності читання та повторного використання

source: * No duplication
es: * Evitar duplicación
uk: * Відсутність дублювання

source: * Document purpose and use
es: * Documentar el propósito y el uso
uk: * Призначення та використання документа

source: * ...that there is no magic: the programs they use are no different
es: * ...que no hay resultados mágicos y que los programas que usan no son diferentes
uk: * ...що немає магії: програми, що використовуються, нічим не відрізняються

source: in principle from those they build * ...how to assign values to variables * ...what integers, floats, strings, NumPy arrays, and Pandas dataframes are * ...how to trace the execution of a `for` loop * ...how to trace the execution of `if`/`else` statements * ...how to create and index lists * ...how to create and index NumPy arrays * ...how to create and index Pandas dataframes * ...how to create time series plots * ...the difference between defining and calling a function * ...where to find documentation on standard libraries * ...how to find out what else scientific Python offers
es: de los que ellas hacen * ... cómo asignar valores a las variables * ... que son números enteros, flotantes, cadenas, arreglos en NumPy y dataframes de Pandas * ... cómo rastrear la ejecución de un bucle `for` * ... cómo rastrear la ejecución de sentencias `if` /` else` * ... cómo crear e indexar listas * ... cómo crear e indexar arreglos de NumPy * ... cómo crear e indexar dataframes en Pandas * ... cómo crear gráficas de series de tiempo * ... la diferencia entre definir y llamar a una función * ... dónde encontrar documentación sobre bibliotecas estándar * ... cómo averiguar qué más ofrece Python científico
uk: від тих, які створюються * ...як присвоїти значення змінним * ...що таке цілі числа, числа з плаваючою точкою, рядки, масиви NumPy і структури даних Pandas * ...як відстежити виконання циклу `for` * ...як відстежити виконання операторів `if`/`else` * ...як створити та індексувати списки * ...як створити та індексувати масиви NumPy * ...як створити та індексувати структури даних Pandas * ...як створити графіки часових рядів * ...яка різниця між призначенням і викликом функції * ...де знайти документацію про стандартні бібліотеки * ...як дізнатися, що пропонує Python для наукових досліджень

source: ## Stage 3: Learning Plan
es: ## Etapa 3: Plan de aprendizaje
uk: ## Етап 3: Навчальний план

source: ### Summative Assessment
es: ### Evaluación sumativa
uk: ### Підсумкове оцінювання

source: * Midpoint: create time-series plot for each file in a directory.
es: * A la mitad de la lección: crear una gráfica de series de tiempo por cada archivo de datos en una carpeta
uk: * Проміжний результат: створення графіка часових рядів для кожного файлу в каталозі.

source: * Final: extract data from Pandas dataframe
es: * Final: extraer datos de un DataFrame de Pandas
uk: * Остаточний результат: повернути значення зі структури даних Pandas

source: and create comparative multi-line time series plot.
es: y crear gráficas de series de tiempo comparables de varias líneas
uk: і створити порівняльний графік багаторядкового часового ряду.

source: ### [Running and Quitting Interactively]({{page.root}}/01-run-quit/) (9:00)
es: ### [Correr y salir interactivamente]({{page.root}}/01-run-quit/) (9:00)
uk: ### [Інтерактивний запуск і вихід з програми]({{page.root}}/01-run-quit/) (9:00)

source: * Teaching: 15 min (because setup issues)
es: * Enseñanza: 15 min (debido a problemas de configuración)
uk: * Навчання: 15 хв (через проблеми з налаштуванням)

source: * Launch the Jupyter Notebook, create new notebooks, and exit the Notebook.
es: * Iniciar Jupyter Notebooks, crear nuevos cuadernos y salir de Notebook.
uk: * Запустіть Jupyter Notebook, створіть новий документ та вийдіть із Jupyter Notebook.

source: * Create Markdown cells in a notebook.
es: * Crear celdas de Markdown en un cuaderno.
uk: * Створіть в блокноті комірки типу Markdown.

source: * Create and run Python cells in a notebook.
es: * Crear y correr celdas de Python en un cuaderno.
uk: * Створіть в блокноті комірки Python та виконайте їх.

source: * Challenges: 0 min (accounted for in teaching time - no separate exercise)
es: * Desafíos: 0 min (contando el tiempo de enseñanza - sin ejercicios separados)
uk: * Завдання: 0 хв (враховується в навчальний час - без окремої вправи)

source: * Creating lists in Markdown
es: * Crear listas en Markdown
uk: * Створіть список у Markdown

source: * What is displayed when several expressions are put in a single cell?
es: * ¿Qué se muestra cuando varias expresiones se escriben en una celda?
uk: * Що буде відображатися, якщо кілька виразів помістити в одну клітинку?

source: * Change an existing cell from code to Markdown
es: * Cambiar el tipo de una celda existente de código a Markdown
uk: * Змініть існуючу клітинку з коду на Markdown

source: * Rendering LaTeX-style equations
es: * Formatear ecuaciones estilo LaTeX
uk: * Візуалізація рівнянь у стилі LaTeX

source: ### [Variables and Assignment]({{page.root}}/02-variables/) (9:15)
es: ### [Variables y Asignaciones]({{page.root}}/02-variables/) (9:15)
uk: ### [Змінні та призначення]({{page.root}}/02-variables/) (9:15)

source: * Teaching: 10 min
es: * Enseñanza: 10 min
uk: * Навчання: 10 хв.

source: * Write programs that assign scalar values to variables and perform calculations with those values.
es: * Escribir programas que asignan valores escalares a variables y hacen cálculos con esos valores.
uk: * Напишіть програми, які присвоюють скалярні значення змінним і виконують обчислення з цими значеннями.

source: * Correctly trace value changes in programs that use scalar assignment.
es: * Rastrear cambios en los programas que usan asignaciones de escalares.
uk: * Правильно відстежуйте у програмах значення змінних, які використовують скалярне присвоєння.

source: * Challenges: 10 min
es: * Desafíos: 10 min
uk: * Завдання: 10 хв.

source: * Trace execution of code swapping two values using an intermediate variable.
es: * Rastrear la ejecución de intercambio de código de dos valores usando variables intermedias.
uk: * Відстеження виконання коду, що міняє місцями два значення за допомогою проміжної змінної.

source: * Predict final values of variables after several assignments.
es: * Predecir el valor final de una variable después de varias asignaciones.
uk: * Передбачення кінцевих значень змінних після виконання декількох призначень.

source: * What happens if you try to index a number?
es: * ¿Qué pasa si tratas de indexar un número?
uk: * Що станеться при спробі присвоїти індекс?

source: * Which is a better variable name, `m`, `min`, or `minutes`?
es: * ¿Qué nombre es mejor para una variable `m`, `min`, o `minutos`?
uk: * Яке ім'я для змінної є кращим: `m`, `min` або `minutes`?

source: * What do the following slice expressions produce?
es: * ¿Qué producen los siguentes cortes?
uk: * Що повертають наступні вирази?

source: ### [Data Types and Type Conversion]({{page.root}}/03-types-conversion/) (09:35)
es: ### [Tipos de Datos y Conversión de tipo de datos]({{page.root}}/03-types-conversion/) (09:35)
uk: ### [Типи даних і перетворення типів]({{page.root}}/03-types-conversion/) (09:35)

source: * Explain key differences between integers and floating point numbers.
es: * Explicar la diferencia entre los enteros y los números de punto flotante.
uk: * Поясніть ключові відмінності між цілими числами та числами з плаваючою комою.

source: * Explain key differences between numbers and character strings.
es: * Explicar la diferencia entre números y las cadenas de caracteres.
uk: * Поясніть ключові відмінності між числами та символьними рядками.

source: * Use built-in functions to convert between integers, floating point numbers, and strings.
es: * Usar funciones incorporadas para convertir enteros, números de punto flotante y secuencias de caracteres.
uk: * Використовуйте вбудовані функції для перетворення цілих чисел, чисел з плаваючою комою та рядків.

source: * What type of value is 3.4?
es: * ¿Qué tipo de dato es 3.4?
uk: * Який тип має вираз 3.4?

source: * What type of value is 3.25 + 4?
es: * ¿Qué tipo de dato es 3.25 + 4?
uk: * Який тип має вираз 3.25 + 4?

source: * What type of value would you use to represent:
es: * ¿Qué tipo de dato usarías para representar:
uk: * Який тип значення ви б використали для представлення:

source: * Number of days since the start of the year.
es: * Número de días desde el inicio del año?
uk: * Кількість днів, які пройшли з початку року.

source: * Time elapsed since the start of the year.
es: * El tiempo que ha pasado desde el inicio del año?
uk: * Час, що минув з початку року.

source: * How can you use `//` (integer division) and `%` (modulo)?
es: * ¿Cómo puedes usar `//` (división de enteros) y `%` (módulo)?
uk: * Як можна використовувати `//` (цілочисельне ділення) і `%` (за модулем)?

source: * What does `int("3.4")` do?
es: * ¿Qué hace `int("3.4")`?
uk: * Що поверне функція `int("3.4")`?

source: * Given these float, int, and string values, which expressions will print a particular result?
es: * Dados estos números de punto flotante, enteros, y secuencias de caracteres, ¿qué expresiones mostrarán un resultado en particular?
uk: * Які значення набуде вираз, що розглядається, якщо використовувати float, int та string?

source: * What do you expect `1+2j + 3` to produce?
es: * ¿Qué esperas que `1+2j + 3` produzca?
uk: * Яке значення виразу `1+2j + 3` слід очікувати?

source: ### [Built-in Functions and Help]({{page.root}}/04-built-in/) (09:55)
es: ### [Funciones incorporadas y ayuda]({{page.root}}/04-built-in/) (09:55)
uk: ### [Вбудовані функції та Довідка]({{page.root}}/04-built-in/) (09:55)

source: * Teaching: 15 min
es: * Enseñanza: 15 min
uk: * Навчання: 15 хв.

source: * Explain the purpose of functions.
es: * Explicar el propósito de las funciones.
uk: * Пояснення призначення функцій.

source: * Correctly call built-in Python functions.
es: * Llamar correctamente las funciones incorporadas de Python.
uk: * Правильно виклик вбудованих функції Python.

source: * Correctly nest calls to built-in functions.
es: * Anidar correctamente las llamadas a las funciones incorporadas.
uk: * Правильне використання вкладених вбудованих функцій.

source: * Use help to display documentation for built-in functions.
es: * Usar la ayuda para mostras documentación de las funciones incorporadas.
uk: * Використання Довідки для відображення документації про вбудовані функції.

source: * Correctly describe situations in which SyntaxError and NameError occur.
es: * Describe correctamente situaciones en las que ocurren **SyntaxError** y **NameError**.
uk: * Правильний опис ситуацій, в яких виникають помилки SyntaxError і NameError.

source: * Explain the order of operations in the following complex expression.
es: * Explica el orden de las operaciones en la siguiente expresión compleja.
uk: * Пояснення порядку дій у наступній ситуації.

source: * What will each nested combination of `min` and `max` calls produce?
es: * ¿Qué producirá cada combinación anidada de llamadas `min` y `max`?
uk: * Що поверне кожна вкладена комбінація функцій `min` та `max`?

source: * Why don't `max` and `min` return `None` when given no arguments?
es: * ¿Por qué `max` y `min` no devuelven `None` cuando no se presentan argumentos?
uk: * Чому `max` та `min` не повертають `None`, якщо немає аргументів?

source: * Given what we have seen so far,
es: * Dado lo que hemos visto hasta ahora,
uk: * Беручи до уваги те, що ми вже виконали раніше,

source: what index expression will get the last character in a string?
es: ¿Qué expresión de índice obtendrá el último carácter en una secuencia de caracteres?
uk: який індекс отримає останній символ у рядку?

source: ### [Coffee]({{page.root}}/05-coffee/): 15 min (10:20)
es: ### [Café]({{page.root}}/05-coffee/): 15 min (10:20)
uk: ### [Кава]({{page.root}}/05-coffee/): 15 min (10:20)

source: ### [Libraries]({{page.root}}/06-libraries/) (10:35)
es: ### [Bibliotecas]({{page.root}}/06-libraries/) (10:35)
uk: ### [Бібліотеки]({{page.root}}/06-libraries/) (10:35)

source: * Explain what software libraries are and why programmers create and use them.
es: * Explica qué son las bibliotecas de software y por qué los programadores las crean y usan.
uk: * Поясніть, що таке бібліотека та для чого програмісти їх створюють і використовують.

source: * Write programs that import and use libraries from Python's standard library.
es: * Escribe programas que importen y usen bibliotecas de la biblioteca estándar de Python.
uk: * Пишіть програми, які імпортують і використовують стандартні бібліотеки Python.

source: * Find and read documentation for standard libraries interactively (in the interpreter) and online.
es: * Busca y lee la documentación para bibliotecas estándar de forma interactiva (en el intérprete) y en línea.
uk: * Знаходьте та читайте документацію про стандартні бібліотеки в інтерактивному режимі (в інтерпретаторі) або онлайн.

source: * Which function from the standard math library could you use to calculate a square root?
es: * ¿Qué función de la biblioteca matemática estándar podrías usar para calcular una raíz cuadrada?
uk: * Яку функцію зі стандартної математичної бібліотеки можна використати для обчислення квадратного кореня?

source: * What library would you use to select a random value from data?
es: * ¿Qué biblioteca usarías para seleccionar un valor aleatorio de los datos?
uk: * Яка бібліотека підходить для вибору випадкового значення з набору даних?

source: * If `help(math)` produces an error, what have you forgotten to do?
es: * Si `help(math)` produce un error, ¿qué has olvidado hacer?
uk: * Якщо `help(math)` видає помилку, що ви забули зробити?

source: * Fill in the blanks in code below so that the import statement and program run.
es: * Completa los espacios en blanco en el código a continuación para que la importación y el programa se ejecuten.
uk: * Заповніть пропуски в коді нижче, щоб запускалися оператор імпорту та програма в цілому.

source: ### [Reading Tabular Data]({{page.root}}/07-reading-tabular/) (10:55)
es: ### [Lectura de Datos Tabulados]({{page.root}}/07-reading-tabular/) (10:55)
uk: ### [Зчитування табличних даних]({{page.root}}/07-reading-tabular/) (10:55)

source: * Import the Pandas library.
es: * Importar la biblioteca Pandas.
uk: * Імпортуйте бібліотеку Pandas.

source: * Use Pandas to load a simple CSV data set.
es: * Usar Pandas para cargar un conjunto de datos CSV simple.
uk: * Використовуйте Pandas, щоб завантажити простий набір даних CSV.

source: * Get some basic information about a Pandas DataFrame.
es: * Obtener información básica sobre un DataFrame de Pandas.
uk: * Отримайте базову інформацію про Pandas DataFrame.

source: * Read the data for the Americas and display its summary statistics.
es: * Leer los datos de las Américas y mostrar sus estadísticas resumidas.
uk: * Зчитайте дані про Америки та відобразіть їхню підсумкову статистику.

source: * What do `.head` and `.tail` do?
es: * ¿Qué hacen `.head` y `.tail`?
uk: * Що роблять `.head` та `.tail`?

source: * What string(s) should you pass to `read_csv` to read files from other directories?
es: * ¿Qué secuencia de caracteres debes pasar a `read_csv` para leer archivos de otros directorios?
uk: * Який(і) рядок(и) слід передати в `read_csv`, щоб зчитувати файли з інших каталогів?

source: * How can you *write* CSV data?
es: * ¿Cómo puedes *escribir* datos CSV?
uk: * Як можна *записати* дані CSV?

source: * Select individual values from a Pandas dataframe.
es: * Seleccionar valores individuales de un dataframe de Pandas.
uk: * Виберіть окремі значення з DataFrame Pandas.

source: * Select entire rows or entire columns from a dataframe.
es: * Seleccionar filas o columnas enteras de un dataframe.
uk: * Виділіть цілі рядки або цілі стовпці з dataFrame.

source: * Select a subset of both rows and columns from a dataframe in a single operation.
es: * Seleccionar un subconjunto de filas y columnas de un dataframe en una sola operación.
uk: * Виберіть підмножину рядків і стовпців із DataFrame за одну операцію.

source: * Select a subset of a dataframe by a single Boolean criterion.
es: * Seleccionar un subconjunto de un dataframe por un único criterio booleano.
uk: * Виберіть підмножину з DataFrameданих за єдиним булевим критерієм.

source: * Challenges: 15 min
es: * Desafíos: 15 min.
uk: * Завдання: 15 хв.

source: * Write an expression to find the Per Capita GDP of Serbia in 2007.
es: * Escribir una expresión para encontrar el PIB per cápita de Serbia en 2007.
uk: * Напишіть вираз для визначення ВВП Сербії на душу населення у 2007 році.

source: * What rule governs what is (or isn't) included in numerical and named slices in Pandas?
es: * ¿Qué regla rige lo que se incluye (o no) en cortes numéricos y con nombre en Pandas?
uk: * Яке правило регулює те, що включається (або не включається) до числових та іменованих фрагментів у Pandas?

source: * What does each line in the following short program do?
es: * ¿Qué hace cada línea en el siguiente programa corto?
uk: * Що робить кожен рядок у наступній короткій програмі?

source: * What do `idxmin` and `idxmax` do?
es: * ¿Qué hacen `idxmin` e `idxmax`?
uk: * Що роблять `idxmin` та `idxmax`?

source: * Write expressions to get the GDP per capita for all countries in 1982,
es: * Escriba expresiones para obtener el PIB per cápita para todos los países en 1982,
uk: * Напишіть вирази, щоб отримати ВВП на душу населення для всіх країн у 1982 році,

source: for all countries *after* 1985, etc. * Given the way its borders have changed since 1900, what would you do if asked to create a table of GDP per capita for Poland for the Twentieth Century?
es: para todos los países *después de* 1985, etc. * Dada la forma en que sus fronteras han cambiado desde 1900, ¿Qué harías si te pidieran crear una tabla de PIB per cápita para Polonia? para el siglo veinte?
uk: для всіх країни *після* 1985 року тощо. * Враховуючи те, як змінилися кордони після 1900 року, що б ви зробили, якби вас попросили створити таблицю ВВП на душу населення для Польщі 20-го сторіччя?

source: ### [Plotting]({{page.root}}/09-plotting/) (11:45)
es: ### [Graficación]({{page.root}}/09-plotting/) (11:45)
uk: ### [Графік]({{page.root}}/09-plotting/) (11:45)

source: * Create a time series plot showing a single data set.
es: * Cree un gráfico de series de tiempo que muestre un único conjunto de datos.
uk: * Створіть графік часового ряду, який відповідає одному набору даних.

source: * Create a scatter plot showing relationship between two data sets.
es: * Cree un gráfico de dispersión que muestre la relación entre dos conjuntos de datos.
uk: * Створіть діаграму розсіювання, яка показує зв’язок між двома наборами даних.

source: * Exercise: 15 min
es: * Ejercicio: 15 min.
uk: * Вправи: 15 хв.

source: * Fill in the blanks to plot the minimum GDP per capita over time for European countries.
es: * Complete los espacios en blanco para graficar el PIB mínimo per cápita a lo largo del tiempo para los países europeos.
uk: * Заповніть порожні поля, щоб побудувати графік мінімального ВВП на душу населення в європейських країнах.

source: * Modify the example to create a scatter plot of GDP per capita in Asian countries.
es: * Modifique el ejemplo para crear un gráfico de dispersión del PIB per cápita en los países asiáticos.
uk: * Змініть приклад так, щоб створити точкову діаграму ВВП на душу населення в країнах Азії.

source: * Explain what each argument to `plot` does in the following example.
es: * Explique qué hace cada argumento de `plot` en el siguiente ejemplo.
uk: * Поясніть, що робить кожен аргумент `plot` у наступному прикладі.

source: ### [Lunch]({{page.root}}/10-lunch/) (12:15): 45 min
es: ### [Almuerzo]({{page.root}}/10-lunch/) (12:15): 45 min
uk: ### [Обід]({{page.root}}/10-lunch/) (12:15): 45 min

source: ### [Lists]({{page.root}}/11-lists/) (13:00)
es: ### [Listas]({{page.root}}/11-lists/) (13:00)
uk: ### [Списки]({{page.root}}/11-lists/) (13:00)

source: * Explain why programs need collections of values.
es: * Explique por qué los programas necesitan colecciones de valores.
uk: * Поясніть, навіщо програмам потрібні колекції значень.

source: * Write programs that create flat lists, index them, slice them, and modify them through assignment and method calls.
es: * Escriba programas que creen listas planas, indexe, fraccione y modifique mediante asignaciones y llamadas a métodos.
uk: * Напишіть програми, які створюють списки, індексують їх, а також розрізають і змінюють їх через призначення та виклик методів.

source: * Fill in the blanks so that the program produces the output shown.
es: * Complete los espacios en blanco para que el programa produzca el resultado que se muestra.
uk: * Заповніть порожні поля, щоб програма повернула потрібні результати.

source: * How large are the following slices?
es: * ¿Cuán grandes son los siguientes cortes?
uk: * Наскільки великими є наступні зрізи?

source: * What do negative index expressions print?
es: * ¿Qué imprimen las expresiones de índice negativo?
uk: * Що повертають вирази з від’ємним індексом?

source: * What does a "stride" in a slice do?
es: * ¿Qué hace `stride` en un corte?
uk: * Що робить «stride» у зрізі?

source: * How do slices treat out-of-range bounds?
es: * ¿Cómo se manejan los límites de rango en los cortes?
uk: * Як зрізи задовольняють межі діапазону?

source: * What are the differences between sorting these two ways?
es: * ¿Cuál es la diferencia en ordenar usando estas dos maneras?
uk: * Які відмінності між цими двома способами сортування?

source: * What is the difference between `new = old` and `new = old[:]`?
es: * ¿Cuál es la diferencia entre `nuevo = viejo` y `nuevo = viejo[:]`?
uk: * Яка різниця між `new = old` та `new = old[:]`?

source: ### [Loops]({{page.root}}/12-for-loops/) (13:20)
es: ### [Bucles]({{page.root}}/12-for-loops/) (13:20)
uk: ### [Цикли]({{page.root}}/12-for-loops/) (13:20)

source: * Explain what for loops are normally used for.
es: * Explicar para que son usados los bucles.
uk: * Поясніть, для чого зазвичай використовуються цикли for.
