Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: * Trace the execution of a simple (unnested) loop and correctly state the values of variables in each iteration.
es: * Rastrear la ejecución de un bucle simple (no anidado) y correctamente indicar el estado de los valores de cada variable en cada interación.
uk: * Проаналізуйте виконання простого (невкладеного) циклу та правильно вкажіть значення змінних у кожній ітерації.

source: * Write for loops that use the Accumulator pattern to aggregate values.
es: * Escribir bucles que usan un patrón acumulador para agregar valores.
uk: * Напишіть цикли for, які використовують шаблон накопичувача для агрегування значень.

source: * Is an indentation error a syntax error or a runtime error?
es: * ¿Un error de indentación es un error de syntax o runtime?
uk: * Чи є помилка відступу синтаксичною чи помилкою виконання?

source: * Trace which lines of this program are executed in what order.
es: * Rastrear que líneas del programa son ejecutadas y en qué orden.
uk: * Простежте, в якому порядку виконуються рядки цієї програми.

source: * Fill in the blanks in this program so that it reverses a string.
es: * Llenar los espacios en blanco en este program para invertir la secuencia de caracteres.
uk: * Заповніть пропуски в цій програмі, щоб вона перевернула рядок.

source: * Fill in the blanks in this series of examples to get practice accumulating values.
es: * Llenar los espacios en blanco en estos ejemplos para ganar práctica en valores acumulados.
uk: * Заповніть пропуски в цій серії прикладів, щоб навчитися накопичувати значення.

source: * Reorder and indent these lines to calculate the cumulative sum of the list values.
es: * Reordenar e indentar estas líneas para calcular la suma cumulativa de los valores de la lista.
uk: * Змініть порядок і відступи в цих рядках, щоб обчислити сукупну суму значень списку.

source: ### [Looping Over Data Sets]({{page.root}}/13-looping-data-sets/) (13:45)
es: ### [Iterando Sobre Datos]({{page.root}}/13-looping-data-sets/) (13:45)
uk: ### [Зациклення]({{page.root}}/13-looping-data-sets/) (13:45)

source: * Teaching: 5 min
es: * Desafíos: 15 min.
uk: * Навчання: 5 хв.

source: * Be able to read and write globbing expressions that match sets of files.
es: * Ser capaz de leer y escribir expresiones **glob** que encuentren un conjunto de archivos.
uk: * Навчіться читати та писати вирази модулю glob, які відповідають наборам файлів.

source: * Use glob to create lists of files.
es: * Usar `glob` para crear listas de archivos.
uk: Використовуйте модуль glob для створення списків файлів

source: * Write for loops to perform operations on files given their names in a list.
es: * Escribir bucles para realizar operaciones en archivos, dada una lista con sus nombres.
uk: * Напишіть цикли for для виконання операцій над файлами, зазначеними в списку.

source: * Which filenames are *not* matched by this glob expression?
es: * ¿Qué archivos no se encuentran con una expresión **glob**?
uk: * Які назви файлів *не* відповідають виразу модуля glod?

source: * Modify this program so that it prints the number of records in the shortest file.
es: * Modificar este programa para mostrar el número de filas en el archivo más pequeño.
uk: * Змініть цю програму так, щоб вона зберігала кількість записів у найкоротшому файлі.

source: * Write a program that reads and plots all of the regional data sets.
es: * Escribir un programa que lea y visualice todos los datos regionales.
uk: * Напишіть програму, яка зчитує дані та будує по них графіки для всіх регіонів.

source: ### [Writing Functions]({{page.root}}/14-writing-functions/) (14:00)
es: ### [Escribiendo Funciones]({{page.root}}/14-writing-functions/) (14:00)
uk: ### [Написання функцій]({{page.root}}/14-writing-functions/) (14:00)

source: * Explain and identify the difference between function definition and function call.
es: * Explicar e identificar la diferencia entre definir y llamar una función.
uk: * Знайдіть і поясніть різницю між визначенням функції та викликом функції.

source: * Write a function that takes a small, fixed number of arguments and produces a single result.
es: * Escribir una función que recibe un número definido de argumentos y produce un resultado.
uk: * Напишіть функцію, яка використовує невелику фіксовану кількість вхідних аргументів, а видає єдиний результат.

source: * This code defines and calls a function - what does it print when run?
es: * Este código define y llama a una función - ¿Qué muestra cuando se ejecuta?
uk: * Цей код визначає та викликає функцію. Подумайте, що вона друкує під час запуску?

source: * Explain why this short program prints things in the order it does.
es: * Explicar por que este programa muestra cosas en un orden particular.
uk: * Поясніть, чому ця коротка програма повертає відповіді саме в такому порядку?

source: * Fill in the blanks to create a function that finds the minimum value in a data file.
es: * Llenar los espacios en blanco para crear una función que encuentra el valor mínimo en un archivo de datos.
uk: * Заповніть порожні поля, щоб створити функцію, яка знаходить мінімальне значення у файлі даних.

source: * Fill in the blanks to create a function that finds the first negative value in a list.
es: * Llenar los espacios en blanco para crear una función que encuentre el primer valor negativo en una lista.
uk: * Заповніть порожні поля, щоб створити функцію, яка знаходить перше від’ємне значення в списку.

source: What does your function do if the list is empty? * Why is it sometimes useful to pass arguments by naming the corresponding parameters? * Fill in the blanks and turn this short piece of code into a function.
es: ¿Qué hace la función si la lista está vacía? * ¿Porqué es importante pasar argumentos nombrando los parámetros correspondientes? * Llena los espacios en blanco y convierte este código en una función.
uk: Що робить ваша функція, якщо список порожній? * Чому іноді корисно передавати аргументи, називаючи відповідні параметри? * Заповніть пропуски та перетворіть цей короткий фрагмент коду на функцію.

source: ### [Variable Scope]({{page.root}}/15-scope/) (14:25)
es: ### [Alcance de una variable]({{page.root}}/15-scope/) (14:25)
uk: ### [Область застосування змінної]({{page.root}}/15-scope/) (14:25)

source: * Identify local and global variables.
es: * Identificar variables locales y globales.
uk: * Визначення локальних і глобальних змінних.

source: * Identify parameters as local variables.
es: * Identificar parámetros como variables locales.
uk: * Ідентифікуйте параметри як локальні змінні.

source: * Read a traceback and determine the file, function, and line number on which the error occurred.
es: * Leer un rastreo y determinar el archivo, la función y el número de línea donde el error ha ocurrido.
uk: * Прочитайте відстеження та визначте файл, функцію та номер рядка, у якому сталася помилка.

source: * Trace the changes to the values in this program,
es: * Rastrear los cambios de valores en el programa,
uk: * Відстежуйте зміни значень у цій програмі,

source: being careful to distinguish local from global values.
es: siendo cuidadosa en distinguir valores locales de globales.
uk: ретельно відрізняйте локальні змінні від глобальних.

source: ### [Coffee]({{page.root}}/16-coffee/) (14:45): 15 min
es: ### [Café]({{page.root}}/16-coffee/) (14:45): 15 min
uk: ### [Кава]({{page.root}}/16-coffee/) (14:45): 15 хв.

source: ### [Conditionals]({{page.root}}/17-conditionals/) (15:00)
es: ### [Condicionales]({{page.root}}/17-conditionals/) (15:00)
uk: ### [Умови]({{page.root}}/17-conditionals/) (15:00)

source: * Correctly write programs that use if and else statements and simple Boolean expressions (without logical operators).
es: * Escribir correctamente programas que usan declaraciones if y else y expresiones booleanas (sin operadores lógicos).
uk: * Правильно писати програми, які використовують оператори if і else і прості булеві вирази (без логічних операторів).

source: * Trace the execution of unnested conditionals and conditionals inside loops.
es: * Rastrear la ejecución de condicionales no anidados y condicionales dentro de bucles.
uk: * Відстежувати виконання невкладених умовних операторів і умовних операторів всередині циклів.

source: * Trace the execution of this conditional statement.
es: * Rastrear la ejecución de esta declaración condicional.
uk: * Простежити за виконанням цього умовного оператора.

source: * Fill in the blanks so that this function replaces negative values with zeroes.
es: * Llena los espacios en blanco para que esta función remplace los valores negativos por ceros.
uk: * Заповнити пропуски так, щоб ця функція замінювала від’ємні значення нулями.

source: * Modify this program so that it only processes files with fewer than 50 records.
es: * Modifica este programa para que sólo procese archivos de menos de 50 registros.
uk: * Змінити цю програму так, щоб вона обробляла лише файли, які містять менше 50 записів.

source: * Modify this program so that it always finds the largest and smallest values in a list
es: * Modifica este programa para que siempre encuentre el valor máximo y mínimo en una lista
uk: * Змінити цю програму так, щоб вона завжди знаходила найбільші та найменші значення у списку,

source: no matter what the list's values are.
es: sin importar los valores en la lista.
uk: незалежно від того, які значення знаходяться у списку.

source: ### [Programming Style]({{page.root}}/18-style/) (15:25)
es: ### [Estilo de Programación]({{page.root}}/18-style/) (15:25)
uk: ### [Стиль програмування]({{page.root}}/18-style/) (15:25)

source: * How can I make my programs more readable?
es: * ¿Cómo puedo hacer mis programas más legibles?
uk: * Як я можу зробити свої програми більш читабельними?

source: * How do most programmers format their code?
es: * ¿Cómo formatean su código la mayoría de los programadores?
uk: * Як більшість програмістів форматують свій код?

source: * How can programs check their own operation?
es: * ¿Cómo pueden los programas revisar sus operaciones?
uk: * Як програми самі можуть перевірити свою роботу?

source: * Which lines in this code will be available as online help?
es: * ¿Qué líneas en este código estarán disponibles como ayuda online?
uk: * Які рядки цього коду будуть доступні як онлайн-довідка?

source: * Turn the comments in this program into docstrings.
es: * Convertir los comentarios de un programa en docstrings.
uk: * Перетворіть коментарі в цій програмі на рядки документів.

source: * Rewrite this short program to be more readable.
es: * Reescribir este pequeño programa para que sea más fácil de leer.
uk: * Перепишіть цю коротку програму так, щоб її було легше читати.

source: ### [Wrap-Up]({{page.root}}/19-wrap/) (15:55)
es: ### [Cerrar]({{page.root}}/19-wrap/) (15:55)
uk: ### [Підсумок]({{page.root}}/19-wrap/) (15:55)

source: * Teaching: 20 min
es: * Enseñanza: 20 min
uk: * Навчання: 20 хв.

source: * Name and locate scientific Python community sites for software, workshops, and help.
es: * Nombrar y localizar sitios web de la comunidad científica de Python para software, talleres, y ayuda.
uk: * Назвіть і знайдіть сайти наукової спільноти Python для програмного забезпечення, семінарів і допомоги.

source: * Challenges: 0 min
es: * Desafíos: 0 min
uk: * Задання: 0 хв.

source: * None.
es: * Ninguno.
uk: * Немає.

source: ### [Feedback]({{page.root}}/20-feedback/) (16:15)
es: ### [Retroalimentación]({{page.root}}/20-feedback/) (16:15)
uk: ### [Зворотній зв'язок]({{page.root}}/20-feedback/) (16:15)

source: * Teaching: 0 min
es: * Enseñanza: 0 min
uk: * Навчання: 0 хв.

source: * Collect feedback
es: * Recopilar comentarios
uk: * Збір та обробка відгуків

source: ### Finish (16:30)
es: ### Fin (16:30)
uk: ### Завершення (16:30)

source: --- layout: page title: "Discussion" permalink: /discuss/ ---
es: --- layout: page title: "Discusión" permalink: /es/discuss/ ---
uk: --- layout: page title: "Обговорення" permalink: /discuss/ ---

source: FIXME: general discussion and further reading for learners.
es: FIXME: discusión general y lecturas adicionales para aprendices.
uk: FIXME: загальне обговорення та подальше читання для учасників.

source: --- layout: page title: "Further Exercises" permalink: /exercises/ ---
es: --- layout: page title: "Ejercicios adicionales" permalink: /es/exercises/ ---
uk: --- layout: page title: "Подальші вправи" permalink: /exercises/ ---

source: FIXME: exercises that don't fit into the regular schedule.
es: FIXME: ejercicios que no tienen cabida en el programa regular.
uk: FIXME: вправи, які не вписуються в звичайний розклад.

source: --- title: Figures ---
es: --- title: Figuras ---
uk: --- title: Ілюстрації ---

source: --- layout: page title: "Instructors' Guide" permalink: /guide/ ---
es: --- layout: page title: "Guía para Instructores" permalink: /es/guide/ ---

source: ## General Notes
es: ## Notas Generales
uk: ## Загальні зауваження

source: It's all right not to get through the whole lesson. : This lesson is designed for people who have never programmed before, but any given class may include people with a wide range of prior experience. We have therefore included enough material to fill a full day if need be, but expect that many offerings will only get as far as the introduction to Pandas.
es: Está bien si no se consigue impartir toda la lección. : Esta lección está diseñada para gente que no ha programado nunca, pero en cada taller puede que haya un espectro amplio de experiencias previas. Por lo que hemos incluido material suficiente para llenar un día entero si se necesitase, pero esperamos que muchos de los talleres sólo lleguen hasta la introducción a Pandas.
uk: Можна не проходити весь урок. : Цей урок призначений для людей, які раніше ніколи не займалися програмуванням, але в будь-якому класі можуть брати участь люди з різним попереднім досвідом. Тому ми включили достатньо матеріалу, щоб при необхідності заповнити цілий день, але очікуємо, що багато пропозицій дійдуть лише до введення у Pandas.

source: Don't tell people to Google things. : One of the goals of this lesson is to help novices build a workable mental model of how programming works. Until they have that model, they will not know what to search for or how to recognize a helpful answer. Telling them to Google can also give the impression that we think their problem is trivial. (That said, if learners have done enough programming before to be past these issues, having them search for solutions online can help them solidify their understanding.) It's also worth quoting [Trevor King](https://github.com/swcarpentry/python-novice- gapminder/issues/22#issuecomment-182573516)'s comment about online search: "If you find anything, other folks were confused enough to bother with a blog or Stack Overflow post, so it's probably not trivial."
es: No digas a la gente que busquen en Google las cosas. : Uno de los objetivos de esta lección es ayudar a los principiantes a crear un modelo mental de como funciona la programación. Hasta que no tengan ese modelo, no sabrán que buscar o cómo identificar una buena respuesta. Decirles que busquen en Goolge también les puede dar la impresión de que pensamos que el problema es trivial. (Dicho esto, si los aprendices tienen suficiente experiencia para sobrepasar esos problemas, que busquen la solución en Internet puede ayudarles a solidificar su comprensión.) Vale la pena citar el comentario de [Trevor King](https://github.com/swcarpentry/python-novice- gapminder/issues/22#issuecomment-182573516) sobre búsquedas en Internet: "Si encuentras algo, quiere decir que otros estaban confundidos suficientemente para molestarse en escribir un blog o una pregunta en Stack Overflow, por lo que seguramente no es trivial."
uk: Не кажіть людям, що потрібно гуглити. : Однією з цілей цього уроку є допомогти новачкам побудувати робочу уявну модель того, як працює програмування. Поки вони не мають цієї моделі, вони не знатимуть, що шукати або як розпізнати корисну відповідь. Пропозиція пошукати відпівідь в Google може створити враження, що ми вважаємо їх проблему тривіальною. (Тим не менш, якщо учні вже достатньо програмували, щоб вирішити ці проблеми, пошук рішень в Інтернеті може допомогти їм зміцнити своє розуміння) Також варто процитувати коментар [Тревора Кінга](https://github.com/swcarpentry/python-novice- gapminder/issues/22#issuecomment-182573516) про онлайн-пошук: "Якщо ви знайдете щось, чим інші люди були стурбовані достатньо, щоб возитися з блогом чи публікацією поста про переповнення стеку, то, ймовірно, це не тривіально."

source: --- layout: page permalink: /aio/ permalink: /aio/index.html ---
es: --- layout: page permalink: /es/aio/ ---

source: {% comment %} As a maintainer, you don't need to edit this file. If you notice that something doesn't work, please open an issue: https://github.com/carpentries/styles/issues/new {% endcomment %}
es: {% comment %} Como mantenedor no tienes que editar este archivo. Si notas que algo no funciona puedes abrir un issue: https://github.com/carpentries/styles/issues/new {% endcomment %}
uk: {% comment %} Як супроводжувачу, Вам не потрібно редагувати цей файл. Якщо Ви помітили, що щось не працює так як треба, будь ласка повідомте про проблему тут: https://github.com/carpentries/styles/issues/new {% endcomment %}

source: --- layout: lesson root: . # Is the only page that doesn't follow the pattern /:path/index.html permalink: index.html # Is the only page that doesn't follow the pattern /:path/index.html ---
es: --- layout: lesson root: /es/ # Is the only page that doesn't follow the pattern /:path/index.html permalink: /es/index.html # Is the only page that doesn't follow the pattern /:path/index.html ---

source: This lesson is an introduction to programming in Python for people with little or no previous programming experience. It uses plotting as its motivating example, and is designed to be used in both [Data Carpentry][dc-lessons] and [Software Carpentry][swc-lessons] workshops. This lesson references [JupyterLab][jupyterlab], but can be taught using a regular Python interpreter as well. Please note that this lesson uses Python 3 rather than Python 2.
es: Esta lección es una introducción a la programación en Python para personas con poca o sin experiencia previa en programación. Usa visualizaciones de datos como ejemplos motivadores, y está diseñada para que se use en talleres de [Data Carpentry][dc-lessons] y [Software Carpentry][swc-lessons]. Esta lección usa [JupyterLab][jupyterlab], pero se puede también enseñar usando cualquier intérprete de Python. Por favor, nota que esta lección usa Python 3 y no Python 2.
uk: Цей урок містить введення до програмування на мові Python для користувачів, які не мають зовсім або мають початковий досвід програмування. Він використовує побудову графіків як мотиваційний приклад, та розроблений для використання на [Data Carpentry][dc-lessons] та [Software Carpentry][swc-lessons] тренігах. Цей урок використовує [JupyterLab][jupyterlab], але його також можна викладати у звичайному інтрепретаторі мови Python. Зверніть увагу, що він використовує Python 3, а не Python 2.

source: > ## Under Design
es: > ## En diseño
uk: > ## У розробці

source: > > **This lesson is currently in its early design stage; > please check [the design notes]({{ page.root }}/design/) > to see what we have so far. > Contributions are very welcome: > we would be particularly grateful for exercises > and for commentary on the ones already there.**
es: > > **Esta lección está aún en su etapa inicial de diseño; > por favor revisa [las notas de diseño]({{ page.root }}/design/) > para ver que es lo que se ha hecho hasta ahora. > Las contribuciones son agradecidas: > agradeceríamos particularmente ejercicios nuevos > y comentarios en los ya existentes.**
uk: > > **Цей урок знаходиться на початковій стадії розробки; > будь ласка, перевірте [цю сторінку]({{ page.root }}/design/) > щоб побачити що вже зроблено. > Ми будемо дуже вдячні за допомогу, > особливо за нові вправи > та за коментарі до їснуючих вправ.**

source: > ## Prerequisites
es: > ## Prerequisitos
uk: > ## Передумови

source: > > 1. Learners need to understand what files and directories are, > what a working directory is, > and how to start a Python interpreter. > > 2. Learners must install Python before the class starts. > > 3. Learners must get the gapminder data before class starts: > please download and unzip the file > [python-novice-gapminder-data.zip]({{page.root}}/files/python-novice-gapminder-data.zip). > > Please see [the setup instructions][lesson-setup] > for details.
es: > > 1. Aprendices necesitan entender que son ficheros y directorios, > que es un directorio de trabajo, > y como iniciar un intérprete de Python. > > 2. Aprendices deben instalar Python antes del comienzo de la clase. > > 3. Aprendices deben obtener los datos gapminder antes del comienzo de la clase: > por favor descarga y descomprime el fichero > [python-novice-gapminder-data.zip]({{ site.baseurl }}/files/python-novice-gapminder-data.zip). > > Por favor consulta [las instrucciones de configuración][lesson-setup] > para más detalles.
uk: > > 1. Слухачі мають розуміти що таке файли та каталоги, > що таке робочий каталог, > та як запустити інтерпретатор мови Python. > > 2. Слухачі мають встановити Python до початку тренінгу. > > 3. Слухачі мають отримати дані (gapminder) перед початком тренінгу: > будь ласка, завантажте та розархівуйте файл > [python-novice-gapminder-data.zip]({{page.root}}/files/python-novice-gapminder-data.zip). > > Будь ласка, дивіться [the setup instructions][lesson-setup] > для отримання детальної інформації.

source: --- layout: reference permalink: /reference/ root: .. ---
es: --- layout: reference permalink: /es/reference/ root: /es/_episodes/ ---

source: ## Reference
es: ## Referencia
uk: ## Довідник

source: ## [Running and Quitting]({{ page.root }}/01-run-quit/)
es: ## [Iniciando y Saliendo]({{ page.root }}/01-run-quit/)
uk: ## [Запуск та завершення роботи]({{ page.root }}/01-run-quit/)

source: - Python files have the `.py` extension.
es: - Los archivos de Python tienen la extensión `.py`.
uk: - Python файли мають розширення `.py`.

source: - Can be written in a text file or a [Jupyter Notebook][jupyter].
es: - Se pueden escribir en un archivo de texto o en una [libreta de Jupyter][jupyter].
uk: - Можуть бути створені у текстовому редакторі або у [Jupyter Notebook][jupyter].

source: - Jupyter notebooks have the extension `.ipynb`
es: - Los cuadernos de Jupyter tienen la extensión `.ipynb`
uk: - Файли, створені в середовищі Jupyter notebook, мають розширення `.ipynb`

source: - Jupyter notebooks can be opened from [Anaconda](https://docs.continuum.io/anaconda/install) or through the command line by entering `$ jupyter notebook`
es: - Los cuadernos de Jupyter se pueden abrir desde [Anaconda](https://docs.continuum.io/anaconda/install) o través de la línea de comandos usando `$ jupyter notebook`
uk: - Файли, створені в середовищі Jupyter notebook, можуть бути відкриті в [Anaconda](https://docs.continuum.io/anaconda/install) or through the command line by entering `$ jupyter notebook`

source: - Markdown and HTML are allowed in markdown cells for documenting code.
es: - Markdown y HTML están permitidos en las celdas de markdown para documentar código.
uk: - В комірках markdown для документування коду можна використовувати як Markdown так і HTML.

source: ## [Variables and Assignment]({{ page.root }}/02-variables/)
es: ## [Variables y Asignación]({{ page.root }}/02-variables/)
uk: ## [Змінні та присвоєння]({{ page.root }}/02-variables/)

source: - Variables are stored using `=`.
es: - Las variables se guardan usando `=`.
uk: - Значення змінних зберігаються за допомогою `=`.
