Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: * **Help:** A list of JupyterLab and kernel help links.
es: * **Help:** Una lista de enlaces de ayuda de JupyterLab y del kernel.
uk: * **Help:** Список посилань на довідку JupyterLab і ядра.

source: A screenshot of the default Menu Bar is provided below.
es: A continuación se muestra una captura de pantalla de la barra de menús predeterminada.
uk: Нижче наведено скриншот панелі меню за замовчуванням.

source: <p align='center'> <img alt="JupyterLab Menu Bar" src="../fig/0_jupyterlab_menu_bar.png" width="750"/> </p>
es: <p align='center'> <img alt="Barra de Menús en JupyterLab" src="{{ site.baseurl }}/fig/0_jupyterlab_menu_bar.png" width="750"/> </p>

source: ### Left Sidebar
es: ### Barra lateral izquierda
uk: ### Ліва бічна панель

source: The left sidebar contains a number of commonly-used tabs, such as a file browser (showing the contents of the directory in which the JupyterLab server was launched!), a list of running kernels and terminals, the command palette, and a list of open tabs in the main work area. A screenshot of the default Left Side Bar is provided below.
es: La barra lateral izquierda contiene varias pestañas de uso común, como un explorador de archivos (que muestra el contenido del directorio en el que se lanzó el servidor JupyterLab), una lista de núcleos en ejecución y terminales, la paleta de comandos y una lista de pestañas abiertas en el área de trabajo principal. Una captura de pantalla de la barra lateral izquierda predeterminada se muestra a continuación.
uk: Ліва бічна панель містить множину вкладок, що часто використовуються, а саме: браузер файлів (показує вміст каталогу, де сервер JupyterLab server був запущений!), перелік працюючих ядер та терміналов, панель команд і список відкритих вкладок в основній робочій області.Скріншот вигляду лівої бічної панелі за замовчуванням наведений нижче.

source: <p align='center'> <img alt="JupyterLab Left Side Bar" src="../fig/0_jupyterlab_left_side_bar.png" width="250"/> </p>
es: <p align='center'> <img alt="Barra lateral izquierda de JupyterLab" src="{{ site.baseurl }}/fig/0_jupyterlab_left_side_bar.png" width="250"/> </p>

source: The left sidebar can be collapsed or expanded by selecting “Show Left Sidebar” in the View menu or by clicking on the active sidebar tab.
es: La barra lateral izquierda se puede contraer o expandir seleccionando "Show Left Sidebar" en el menú View o haciendo clic en la pestaña de la barra lateral activa.
uk: Ліву бічну панель можна згорнути або розгорнути за допомогою вибору пункту “Show Left Sidebar” меню View або натиснувши на активну вкладку бічної панелі.

source: ### Main Work Area
es: ### Área principal de Trabajo
uk: ### Основна робоча область

source: The main work area in JupyterLab enables you to arrange documents (notebooks, text files, etc.) and other activities (terminals, code consoles, etc.) into panels of tabs that can be resized or subdivided. A screenshot of the default Menu Bar is provided below.
es: El área de trabajo principal en JupyterLab permite organizar documentos (cuadernos, archivos de texto, etc.) y otras actividades (terminales, consolas de códigos, etc.) en paneles de pestañas que pueden redimensionarse o subdividirse. A continuación se muestra una captura de pantalla de la barra de menús predeterminada.
uk: Основна робоча область JupyterLab уможливлює групування документів (блокнотів, текстових файлів, і так далі) та інших інструментів (терміналів, консолей кода, та інше) у вигляді панелей зі вкладками, які можна розділити або змінити їх розмір. Скриншот панелі меню надано нижче.

source: <p align='center'> <img alt="JupyterLab Main Work Area" src="../fig/0_jupyterlab_main_work_area.png" width="750"/> </p>
es: <p align='center'> <img alt="Área de trabajo principal en JupyterLab" src="{{ site.baseurl }}/fig/0_jupyterlab_main_work_area.png" width="750"/> </p>

source: Drag a tab to the center of a tab panel to move the tab to the panel. Subdivide a tab panel by dragging a tab to the left, right, top, or bottom of the panel. The work area has a single current activity. The tab for the current activity is marked with a colored top border (blue by default).
es: Arrastra una pestaña al centro de un panel de pestañas para mover la pestaña al panel. Subdivide un panel de pestañas arrastrando una pestaña a la izquierda, derecha, arriba o abajo del panel. El área de trabajo tiene una sola actividad actual. La pestaña de la actividad actual está marcada con un borde superior de color (azul por defecto).
uk: Перетягніть вкладку в центр панелі вкладок, щоб перемістити вкладку на панель. Розділіть панель вкладок за допомогою перетягування вкладки ліворуч, праворуч, до верху або до низу панелі. Робоча панель має одну поточну дію. Вкладка для поточної дії позначена кольоровою верхньою рамкою (за замовчуванням - синьою).

source: ## Creating a Python script
es: ## Creando un script Python
uk: ## Створення сценарію Python

source: * To start writing a new Python program click the Text File icon under the *Other* header in the Launcher tab of the Main Work Area.
es: * Para comenzar a escribir un nuevo programa de Python, haz clic en el icono Text File bajo el encabezado *Other* en la pestaña Iniciador del Área de trabajo principal.
uk: * Щоб почати писати нову програму на Python, натисніть піктограму текстового файлу під заголовком *Інше* на вкладці Launcher (Запуск) головної робочої області.

source: * You can also create a new plain text file by selecting the *New -> Text File* from the *File* menu in the Menu Bar.
es: * También puedes crear un nuevo archivo de texto sin formato seleccionando *New -> Text File* en el menú *File* en la barra de menú.
uk: * Можна також створити новий звичайний текстовий файл, якщо обрати *New -> Text File* меню *File* на панелі Menu.

source: * To convert this plain text file to a Python program, select the *Save File As* action from the *File* menu in the Menu Bar and give your new text file a name that ends with the `.py` extension.
es: * Para convertir este archivo de texto sin formato a un programa de Python, selecciona la opción *Save File As* del menú *File* en la barra de menú y asigna a tu nuevo archivo de texto un nombre que termine con la extensión `.py`.
uk: * Щоб перетворити цей звичайний текстовий файл на програму Python, виберіть дію *Save File As* у меню *File* на панелі мenu та надайте новому текстовому файлу назву, яка закінчується розширенням `.py`.

source: * The `.py` extension lets everyone (including the operating system) know that this text file is a Python program.
es: * La extensión `.py` les permite a todos (incluido el sistema operativo) saber que este archivo de texto es un programa de Python.
uk: * Розширення `.py` повідомляє всім ( операційній системі включно), що цей текстовий файл є програмою Python.

source: * This is convention, not a requirement.
es: * Esta es una convención, no un requisito.
uk: * Це умовність, а не вимога.

source: ## Creating a Jupyter Notebook
es: ## Creando un cuaderno de Jupyter
uk: ## Створення Jupyter Notebook

source: To open a new notebook click the Python 3 icon under the *Notebook* header in the Launcher tab in the main work area. You can also create a new notebook by selecting *New -> Notebook* from the *File* menu in the Menu Bar.
es: Para abrir un Cuaderno nuevo, haga clic en el icono de Python 3 debajo del encabezado *Notebook* en la pestaña Launcher en el área principal de trabajo. También puede crear un Cuaderno nuevo seleccionando *New -> Notebook* desde el menú *File* en la Barra de menú.
uk: Щоб відкрити новий блокнот, натисніть піктограму Python 3 під заголовком *Notebook* на вкладці Запуск в у головній робочій області. Ви також можете створити новий блокнот, обравши *New -> Notebook* у меню *File* на панелі меню.

source: Additional notes on Jupyter notebooks.
es: Notas adicionales sobre los cuadernos de Jupyter.
uk: Додаткові зауваження щодо Jupyter notebooks.

source: * Notebook files have the extension `.ipynb` to distinguish them from plain-text Python programs.
es: * Los cuadernos de Jupyter tienen la extensión `.ipynb` para distinguirlos de los programas Python de texto plano.
uk: * Файли, створені в notebook, мають розширення `.ipynb`, щоб відрізнити їх від програм на Python, створених як звичайний текстовий файл.

source: * Notebooks can be exported as Python scripts that can be run from the command line.
es: * Los cuadernos pueden ser exportados como scripts de Python que pueden ser ejecutados desde la línea de comandos.
uk: * Notebooks можна експортувати як сценарії Python, які можна запускати з командного рядка.

source: Below is a screenshot of a Jupyter notebook running inside JupyterLab. If you are interested in more details, then see the [official notebook documentation][jupyterlab-notebook-docs].
es: A continuación se muestra una captura de pantalla de un cuaderno de Jupyter que se ejecuta dentro de JupyterLab. Si estás interesada en más detalles, mira la [documentación oficial sobre los cuadernos][jupyterlab-notebook-docs].
uk: Нижче наведено скриншот екрана Jupyter notebook, який працює в JupyterLab. Якщо вам цікаво, докладніше дивиться в [official notebook documentation][jupyterlab-notebook-docs].

source: <p align='center'> <img alt="Example Jupyter Notebook" src="../fig/0_jupyterlab_notebook_screenshot.png" width="750"/> </p>
es: <p align='center'> <img alt="Ejemplo de un Cuaderno de Jupyter" src="{{ site.baseurl }}/fig/0_jupyterlab_notebook_screenshot.png" width="750"/> </p>

source: > ## How It's Stored
es: > ## Cómo se almacenan
uk: > ## Як це зберігається

source: > > * The notebook file is stored in a format called JSON. > * Just like a webpage, what's saved looks different from what you see in your browser. > * But this format allows Jupyter to mix source code, text, and images, all in one file.
es: > > * Los cuadernos son almacenados en un formato llamado JSON. > * Justo como una página web, lo que se guarda se ve diferente a lo que se ve en el navegador. > * Pero este formato permite a Jupyter mezclar código fuente, texto e imágenes, todo en un sólo archivo.
uk: > > * Файл notebook зберігається у форматі JSON. > * Подібно до вебсторінки, те, що зберігається, відрізняється від того, що ви бачите у своєму браузері. > * Але формат JSON дозволяє Jupyter змішувати вихідний код, текст і зображення в одному файлі.

source: > ## Arranging Documents into Panels of Tabs
es: > ## Organizando documentos en paneles de pestañas
uk: > ## Упорядкування документів в панелях вкладок

source: > > In the JupyterLab Main Work Area you can arrange documents into panels of tabs. Here is an > example from the [official documentation][jupyterlab]. > > <p align='center'> > <img alt="Multi-panel JupyterLab" src="../fig/0_multipanel_jupyterlab_screenshot.png" width="750"/> > </p> > > First, create a text file, Python console, and terminal window and arrange then into three > panels in the main work area. Next, create a notebook, terminal window, and text file and > arrange then into three panels in the main work area. Finally, create your own combination of > panels and tabs. What combination of panels and tabs do you think will be most useful for your > workflow? > > > ## Solution > > > > After creating the necessary tabs, you can drag one of the tabs to the center of a panel to > > move the tab to the panel; next you can subdivide a tab panel by dragging a tab to the left, > > right, top, or bottom of the panel.
es: > > En el Área de trabajo principal de JupyterLab puedes organizar documentos en paneles de pestañas. Aquí hay un > ejemplo de la [documentación oficial][jupyterlab]. > > <p align='center'> > <img alt="JupyterLab con multiples paneles" src="{{ site.baseurl }}/fig/0_multipanel_jupyterlab_screenshot.png" width="750"/> > </p> > > Primero, crea un archivo de texto, una consola de Python y una ventana de terminal y luego organízalas en tres > paneles en el área de trabajo principal. A continuación, crea un cuaderno, una ventana de terminal y un archivo de texto y > luego, organízalas en tres paneles en el área de trabajo principal. Finalmente, crea tu propia combinación de > paneles y pestañas. ¿Qué combinación de paneles y pestañas crees que será más útil para tu > flujo de trabajo? > > > ## Solución > > > > Después de crear las pestañas necesarias, puedes arrastrar una de las pestañas al centro de un panel para > > mover la pestaña al panel; a continuación, puedes subdividir un panel de pestañas arrastrando una pestaña hacia la izquierda, > > derecha, arriba o bajo del panel.

source: ## Use the Jupyter Notebook for editing and running Python.
es: ## Usa el Cuaderno de Jupyter para editar y ejecutar Python.
uk: ## Застосування Jupyter Notebook для редагування та запуску Python

source: * While it's common to write Python scripts using a text editor, we are going to use the [Jupyter Notebook][jupyter] for the remainder of this workshop.
es: * Si bien es común escribir scripts de Python usando un editor de texto, vamos a usar el [Jupyter Notebook][jupyter] para el resto de este taller.
uk: * Незважаючи на те, що сценарії Python зазвичай пишуть за допомогою текстового редактора, ми надалі будемо використовувати [Jupyter Notebook][jupyter].

source: * This has several advantages:
es: * Esto tiene varias ventajas:
uk: * Застосування Jupyter Notebook має кілька переваг:

source: * You can easily type, edit, and copy and paste blocks of code.
es: * Puedes escribir, editar y copiar y pegar fácilmente bloques de código.
uk: * Ви можете легко вводити, редагувати, копіювати та вставляти блоки коду.

source: * Tab complete allows you to easily access the names of things you are using
es: * Autocompletar (con el tabulador) permite acceder fácilmente a los nombres de las cosas que estás utilizando
uk: * Автодоповнення за допомогою клавіші Tab дозволяє легко отримати доступ до назв об'єктів, які ви використовуєте,

source: and learn more about them. * It allows you to annotate your code with links, different sized text, bullets, etc. to make it more accessible to you and your collaborators. * It allows you to display figures next to the code that produces them to tell a complete story of the analysis. * Each notebook contains one or more cells that contain code, text, or images.
es: y aprender más sobre ellos * Esto te permite anotar tu código con enlaces, texto de diferentes tamaños, viñetas, etc. para que sea más accesible para ti y tus colaboradores. * Esto te permite mostrar figuras al lado del código que las produce para contar una historia completa del análisis. * Cada cuaderno contiene una o más celdas que contienen código, texto o imágenes.
uk: та отримати додаткову інформацію. * Ви можете коментувати свій код посиланнями, текстом різного розміру, маркерами тощо, щоб зробити його більш читабельним для себе та своїх колег * Ви можете відображати результати одразу за кодом, який їх продукує, щоб вести повну історію аналізу. * Кожен блокнот має одну або кілька клітинок, які містять код, текст або зображення.

source: > ## Code vs. Text
es: > ## Código vs. Texto
uk: > ## Код проти тексту

source: > > Jupyter mixes code and text in different types of blocks, called cells. We often use the term > "code" to mean "the source code of software written in a language such as Python". > A "code cell" in a Notebook is a cell that contains software; > a "text cell" is one that contains ordinary prose written for human beings.
es: > > Jupyter mezcla código y texto en diferentes tipos de bloques, llamados celdas. A menudo usamos el término > "código" que significa "el código fuente del software escrito en un lenguaje como Python". > Una "celda de código" en una cuaderno es una celda que contiene software; > una "celda de texto" es una que contiene a prosa ordinaria escrita para seres humanos.
uk: > > Jupyter змішує код і текст у різних типах блоків, які називаються клітинками. Ми часто використовуємо термін > «код», що означає «вихідний код програмного забезпечення, написаний такою мовою, як Python». > «Клітинка коду» в блокноті — це клітинка, що містить програмне забезпечення; > «текстова клітинка» — це клітинка, що містить звичайний текст, написаний для людей.

source: ## The Notebook has Command and Edit modes.
es: ## Los cuadernos tienen modos Comandos y Edición.
uk: ## Jupiter Notebook має режими команд та редагування

source: * If you press <kbd>Esc</kbd> and <kbd>Return</kbd> alternately, the outer border of your code cell will change from gray to blue.
es: * Si presionas <kbd>Esc</kbd> y <kbd>Return</kbd> alternadamente, el borde exterior de tu celda de código cambiará de gris a azul.
uk: * Якщо ви натиснете<kbd>Esc</kbd> та <kbd>Return</kbd> по черзі, то зовнішня границя клітинки коду зміниться з сірої на синю.

source: * These are the **Command** (gray) and **Edit** (blue) modes of your notebook.
es: * Estos son los modos **Comando** (gris) y **Edición** (azul) de tu cuaderno.
uk: * Існують **Command** (сірий) та **Edit** (синій) режими вашого блокноту.

source: * Command mode allows you to edit notebook-level features, and Edit mode changes the content of cells.
es: * El modo de comando te permite editar características a nivel de tu cuaderno, y el modo Editar cambia el contenido de las celdas.
uk: * Командний режим дозволяє редагувати функції на рівні блокнота, а режим редагування змінює вміст клітинок.

source: * When in Command mode (esc/gray),
es: * Cuando está en modo Comando (esc/gris),
uk: * В командному режимі (esc/сірий),

source: * The <kbd>b</kbd> key will make a new cell below the currently selected cell.
es: * La tecla <kbd>b</kbd> creará una nueva celda debajo de la celda seleccionada actualmente.
uk: * Клавіша <kbd>b</kbd> створює нову клітинку нижче поточної обраної клітинки.

source: * The <kbd>a</kbd> key will make one above.
es: * La tecla <kbd>a</kbd> creará una arriba.
uk: * Клавіша <kbd>a</kbd> створює одну клітинку вище поточної.

source: * The <kbd>x</kbd> key will delete the current cell.
es: * La tecla <kbd>x</kbd> borrará la actual celda.
uk: * Клавіша <kbd>x</kbd> видаляє поточну клітинку.

source: * The <kbd>z</kbd> key will undo your last cell operation (which could be a deletion, creation, etc).
es: * La tecla <kbd>z</kbd> deshará su última operación de celda (que podría ser una eliminación, creación, etc.).
uk: * Клавіша <kbd>z</kbd> скасовує вашу останню операцію з клітинкою (це може бути операція видалення, створення тощо).

source: * All actions can be done using the menus, but there are lots of keyboard shortcuts to speed things up.
es: * Todas las acciones se pueden hacer usando los menús, pero hay muchos atajos de teclado para acelerar las cosas.
uk: * Усі дії можна виконувати за допомогою меню, але є багато комбінацій клавіш для прискорення.

source: > ## Command Vs. Edit
es: > ## Comando Vs. Editar
uk: > ## Команди проти Редагування

source: > > In the Jupyter notebook page are you currently in Command or Edit mode? > Switch between the modes. > Use the shortcuts to generate a new cell. > Use the shortcuts to delete a cell. > Use the shortcuts to undo the last cell operation you performed. > > > ## Solution > > > > Command mode has a grey border and Edit mode has a blue border. > > Use <kbd>Esc</kbd> and <kbd>Return</kbd> to switch between modes. > > You need to be in Command mode (Press <kbd>Esc</kbd> if your cell is blue). Type <kbd>b</kbd> or <kbd>a</kbd>. > > You need to be in Command mode (Press <kbd>Esc</kbd> if your cell is blue). Type <kbd>x</kbd>. > > You need to be in Command mode (Press <kbd>Esc</kbd> if your cell is blue). Type <kbd>z</kbd>.
es: > > En la página de un Cuaderno de Jupyter, ¿estás actualmente en modo de comando o edición? > Intercambia entre modos. > Usa los atajos para generar una nueva celda. > Usa los atajos para borrar una celda > Usa los atajos para deshacer la última operación de celda que realizaste. > > > ## Solución > > > > El modo de comando tiene un borde gris y el modo de edición tiene un borde azul. > > Usa <kbd>Esc</kbd> y <kbd>Return</kbd> para intercambiar modos > > Necesitas estar en modo comando (Presiona <kbd>Esc</kbd> si tu celda esta en azul). Teclea <kbd>b</kbd> o <kbd>a</kbd>. > > Necesitas estar en modo comando (Presiona <kbd>Esc</kbd> si tu celda es azul). Teclea <kbd>x</kbd>. > > Necesitas estar en modo comando (Presiona <kbd>Esc</kbd> si tu celda es azul). Teclea <kbd>z</kbd>.
uk: > > На сторінці Jupyter notebook ви зараз перебуваєте в командному режимі чи режимі редагування? > Переключиться між режимами. > Використайте комбінації клавіш, щоб створити нову клітинку. > Використайте комбінації клавіш, щоб видалити клітинку. > Використайте комбінації клавіш, щоб скасувати останню операцію з клітинкою. > > > ## Рішення > > > >Командний режим має сіру рамку, а режим редагування — синю. > > Використовуйте <kbd>Esc</kbd> та <kbd>Return</kbd>, щоб переключатися між режимами. > > Ви маєте бути в командному режимі (Натисніть <kbd>Esc</kbd>, якщо ваша клітинка синя). Натисніть <kbd>b</kbd> або <kbd>a</kbd>. > > Ви маєте бути в командному режимі (Натисніть <kbd>Esc</kbd>, якщо ваша клітинка синя). Натисніть <kbd>x</kbd>. > > Ви маєте бути в командному режимі (Натисніть <kbd>Esc</kbd> якщо ваша клітинка синя). Натисніть <kbd>z</kbd>.

source: ### Use the keyboard and mouse to select and edit cells.
es: ### Usa el teclado y el ratón para seleccionar y editar celdas.
uk: ### Використовуйте клавіатуру та мишу для виділення та редагування клітинок.

source: * Pressing the <kbd>Return</kbd> key turns the border blue and engages Edit mode, which allows
es: * Presiona la tecla <kbd>Return</kbd> convierte el borde en azul y activa el modo Edición, que te permite
uk: * Натискання клавіші <kbd>Return</kbd> перетворює рамку на синю та вмикає режим редагування, що дозволяє

source: you to type within the cell. * Because we want to be able to write many lines of code in a single cell, pressing the <kbd>Return</kbd> key when in Edit mode (blue) moves the cursor to the next line in the cell just like in a text editor. * We need some other way to tell the Notebook we want to run what's in the cell. * Pressing <kbd>Shift</kbd>+<kbd>Return</kbd> together will execute the contents of the cell. * Notice that the <kbd>Return</kbd> and <kbd>Shift</kbd> keys on the right of the keyboard are right next to each other.
es: escribir dentro de la celda. * Debido a que queremos poder escribir muchas líneas de código en una sola celda, presiona la tecla <kbd>Return</kbd> cuando está en modo Edición (azul) mueve el cursor a la siguiente línea en la celda al igual que en un editor de texto. * Necesitamos otra forma de decirle al cuaderno que queremos ejecutar lo que hay en la celda. * Presiona <kbd>Shift</kbd>+<kbd>Return</kbd> juntos para ejecutar el contenido de la celda. * Ten en cuenta que <kbd>Return</kbd> y <kbd>Shift</kbd> a la derecha del teclado están una al lado de la otra.
uk: вам вводити інформацію в клітинку. * Якщо є необхідність введення кількох рядків кода в одну клітинку, натискання клавіші <kbd>Return</kbd> в режимі редагування (синя рамка) переміщує курсор на наступний рядок в клітинці як у текстовому редакторі. * Якщо ми хочемо запустити код, що знаходиться в клітинці, нам потрібен інший спосіб повідомити про це Notebook. * Одночасне натискання клавіш <kbd>Shift</kbd>+<kbd>Return</kbd> призведе до виконання вмісту клітинки. * Зверніть увагу, що клавіші <kbd>Return</kbd> та <kbd>Shift</kbd> розташовані поруч на клавіатурі справа .

source: ### The Notebook will turn Markdown into pretty-printed documentation.
es: ### El Cuaderno convertirá Markdown en documentación con formato.
uk: ### Notebook підтримує мову розмітки текстів Markdown

source: * Notebooks can also render [Markdown][markdown].
es: * Los cuadernos también pueden mostrar [Markdown][markdown].
uk: * Notebooks також можуть відображати [Markdown][markdown].
