Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: > > > ## Solution > > 1: > > ~~~ > > data['gdpPercap_1982'] > > ~~~ > > {: .language-python} > > > > 2: > > ~~~ > > data.loc['Denmark',:] > > ~~~ > > {: .language-python} > > > > 3: > > ~~~ > > data.loc[:,'gdpPercap_1985':] > > ~~~ > > {: .language-python} > > Pandas is smart enough to recognize the number at the end of the column label and does not give you an error, although no column named `gdpPercap_1985` actually exists. This is useful if new columns are added to the CSV file later. > > > > 4: > > ~~~ > > data['gdpPercap_2007']/data['gdpPercap_1952'] > > ~~~ > > {: .language-python}
es: > > > ## Solución > > 1: > > ~~~ > > data['gdpPercap_1982'] > > ~~~ > > {: .language-python} > > > > 2: > > ~~~ > > data.loc['Denmark',:] > > ~~~ > > {: .language-python} > > > > 3: > > ~~~ > > data.loc[:,'gdpPercap_1985':] > > ~~~ > > {: .language-python} > > Pandas es lo suficientemente inteligente como para reconocer el número al final de la etiqueta de la columna y no te da un error, aunque en realidad no existe una columna llamada `gdpPercap_1985`. Esto es útil si se agregan nuevas columnas al archivo CSV después. > > > > 4: > > ~~~ > > data['gdpPercap_2007']/data['gdpPercap_1952'] > > ~~~ > > {: .language-python}
uk: > > > ## Рішення > > 1: > > ~~~ > > data['gdpPercap_1982'] > > ~~~ > > {: .language-python} > > > > 2: > > ~~~ > > data.loc['Denmark',:] > > ~~~ > > {: .language-python} > > > > 3: > > ~~~ > > data.loc[:,'gdpPercap_1985':] > > ~~~ > > {: .language-python} > > Pandas достатньо розумний, щоб розпізнати число в кінці мітки стовпця та не видає вам помилку, хоча стовпця з назвою `gdpPercap_1985` насправді не існує. Це корисно, якщо нові стовпці додаються до файлу CSV пізніше. > > > > 4: > > ~~~ > > data['gdpPercap_2007']/data['gdpPercap_1952'] > > ~~~ > > {: .language-python}

source: > ## Using the dir function to see available methods
es: > ## Usando la función dir para ver los métodos disponibles
uk: > ## Використання функції dir для перегляду доступних методів

source: > > Python includes a `dir` function that can be used to display all of the available methods (functions) that are built into a data object. As an example, the functions available for a [list data type](https://docs.python.org/3/tutorial/datastructures.html#more-on-lists) are: > ~~~ > potatoes = ["Russet", "Norkota", "Yukon Gold", "Pontiac"] > dir(potatoes) > ~~~ > {: .language-python} > > This command returns: > ~~~ > ['__add__', > ... > '__subclasshook__', > 'append', > 'clear', > 'copy', > 'count', > 'extend', > 'index', > 'insert', > 'pop', > 'remove', > 'reverse', > 'sort'] > ~~~ > {: .language-python} > > The double underscore functions can be ignored for now; functions that are not surrounded by double underscores are the *public interface* of the [list type](https://docs.python.org/3/tutorial/datastructures.html#more-on-lists). So, if you want to sort the list of potatoes, according to `dir` you should try, > ~~~ > potatoes.sort() > ~~~ > {: .language-python} > > Assume Pandas has been imported and the Gapminder GDP data for Europe has been loaded as `data`. Then, use `dir` to find the function that prints out the median per-capita GDP across all European countries for each year that information is available.
es: > > Python incluye una función `dir` que puede ser usada para desplegar todas los métodos disponibles (funciones) dentro de un objeto de datos. Como un ejemplo, las funciones disponibles para una [list data type](https://docs.python.org/3/tutorial/datastructures.html#more-on-lists) son: > ~~~ > potatoes = ["Russet", "Norkota", "Yukon Gold", "Pontiac"] > dir(potatoes) > ~~~ > {: .language-python} > > Este comando regresa: > ~~~ > ['__add__', > ... > '__subclasshook__', > 'append', > 'clear', > 'copy', > 'count', > 'extend', > 'index', > 'insert', > 'pop', > 'remove', > 'reverse', > 'sort'] > ~~~ > {: .language-python} > > Las funciones con doble guion bajo pueden ser ignoradas por ahora; las funciones que no están bordeadas por un doble guion bajo son la *interface publica* de la [list type](https://docs.python.org/3/tutorial/datastructures.html#more-on-lists). Así, si tu quieres ordenar la lista de patatas, acorde a `dir` podrías intentar, > ~~~ > potatoes.sort() > ~~~ > {: .language-python} > > Asume que Pandas ha sido importado y los datos del PIB (GDP) de Gapminder para Europa han sido cargados como `data`. Entonces, usa `dir` para encontrar la función para imprimir la media del PIB per-capita a través de todos los países Europeos por cada año de información disponible.
uk: > > Python включає функцію `dir`, яку можна використовувати для відображення всіх доступних методів (функцій), вбудованих в об’єкт даних. Як приклад, функції, доступні для [list data type](https://docs.python.org/3/tutorial/datastructures.html#more-on-lists): > ~~~ > potatoes = ["Russet", "Norkota", "Yukon Gold", "Pontiac"] > dir(potatoes) > ~~~ > {: .language-python} > > Ця команда повертає: > ~~~ > ['__add__', > ... > '__subclasshook__', > 'append', > 'clear', > 'copy', > 'count', > 'extend', > 'index', > 'insert', > 'pop', > 'remove', > 'reverse', > 'sort'] > ~~~ > {: .language-python} > > Функції подвійного підкреслення можна поки що ігнорувати; функції, які не оточені подвійним підкресленням, є *загальнодоступним інтерфейсом* [list type](https://docs.python.org/3/tutorial/datastructures.html#more-on-lists). Отже, якщо ви хочете відсортувати список картоплі відповідно до `dir`, вам слід спробувати > ~~~ > potatoes.sort() > ~~~ > {: .language-python} > > Припустимо, Pandas було імпортовано, а дані Gapminder про ВВП для Європи завантажено як `data`. Потім скористайтеся `dir`, щоб знайти функцію, яка друкує середній ВВП на душу населення для всіх європейських країн за кожен рік, коли інформація доступна.

source: > > > ## Solution > > Among many choices, dir lists the `median()` function as a possibility. Thus, > > ~~~ > > data.median() > > ~~~ > > {: .language-python}
es: > > > ## Solución > > Entre muchas opciones, dir enumera la función `median()` como una posibilidad. Así, > > ~~~ > > data.median() > > ~~~ > > {: .language-python}
uk: > > > ## Рішення > > Серед багатьох варіантів dir пропонує функцію `median()` як можливість. Таким чином, > > ~~~ > > data.median() > > ~~~ > > {: .language-python}

source: > ## Interpretation
es: > ## Interpretación
uk: > ## Інтерпретація

source: > > Poland's borders have been stable since 1945, > but changed several times in the years before then. > How would you handle this if you were creating a table of GDP per capita for Poland > for the entire twentieth century?
es: > > Las fronteras de Polonia se han mantenido estables desde 1945, > pero cambió varias veces en los años anteriores. > ¿Cómo manejarías esto si estuvieras creando una tabla de PIB per cápita para Polonia > para todo el siglo XX?
uk: > > Кордони Польщі стабільні з 1945 року, > але кілька разів змінювалися перед цим. > Як би ви впоралися з цим, якби створювали таблицю ВВП на душу населення для Польщі > на все ХХ століття?

source: --- title: "Plotting" teaching: 15 exercises: 15 questions: - "How can I plot my data?" - "How can I save my plot for publishing?" objectives: - "Create a time series plot showing a single data set." - "Create a scatter plot showing relationship between two data sets." keypoints: - "[`matplotlib`](https://matplotlib.org/) is the most widely used scientific plotting library in Python." - "Plot data directly from a Pandas dataframe." - "Select and transform data, then plot it." - "Many styles of plot are available: see the [Python Graph Gallery](https://python-graph-gallery.com/matplotlib/) for more options." - "Can plot many sets of data together." ---
es: --- title: "Visualizando" teaching: 15 exercises: 15 questions: - "¿Cómo puedo graficar mis datos?" - "¿Cómo puedo guardar mi gráfico para publicarlo?" objetivos: - "Crear un gráfico de serie temporal que muestre un único conjunto de datos." - "Crear un gráfico de dispersión que muestre la relación entre dos conjuntos de datos." keypoints: - "[`matplotlib`](https://matplotlib.org/) es la biblioteca de generación de gráficos científicos más utilizada en Python." - "Grafica datos directamente desde un **dataframe** de Pandas." - "Selecciona y transforma datos, luego grafícalos." - "Muchos estilos de gráfico están disponibles: ve la [Galería de Gráficos de Python](https://python-graph-gallery.com/matplotlib/) para más opciones." - "Puedes graficar muchos conjuntos de datos juntos." ---
uk: --- title: "Побудова графіків" teaching: 15 exercises: 15 questions: - "Я побудувати графік за моїми даними?" - "Як зберегти графік для публікації?" objectives: - "Створити графік часового ряду для одного набору даних." - "Створити діаграму розсіювання, що показує зв’язок між двома наборами даних." keypoints: - "[`matplotlib`](https://matplotlib.org/) є найбільш розповсюдженою графічною бібліотекою у Python." - "Будуйте графіки безпосередньо з фрейму даних Pandas." - "Виберіть і трансформуйте дані, а потім будуйте графік." - "Доступно багато стилів графіку: перегляньте [Python Graph Gallery](https://python-graph-gallery.com/matplotlib/) for more options." - "Можна будувати разом графіки за багатьма наборами даних." ---

source: ## [`matplotlib`](https://matplotlib.org/) is the most widely used scientific plotting library in Python.
es: ## [`matplotlib`](https://matplotlib.org/) es la biblioteca de graficado científico más utilizada en Python.
uk: ## [`matplotlib`](https://matplotlib.org/) є найбільш відомою науковою бібіліотекою візуалізації даних на Python.

source: * Commonly use a sub-library called [`matplotlib.pyplot`](https://matplotlib.org/api/pyplot_api.html).
es: * Comúnmente usa una sub-biblioteca llamada [`matplotlib.pyplot`](https://matplotlib.org/api/pyplot_api.html).
uk: * Найчастіше використовують підбібліотеку, що має назву [`matplotlib.pyplot`](https://matplotlib.org/api/pyplot_api.html).

source: * The Jupyter Notebook will render plots inline if we ask it to using a "magic" command.
es: * Jupyter Notebook insertará los gráficos en el cuaderno si lo pedimos usando un comando "mágico".
uk: * Jupyter Notebook відтворюватиме графікі вбудовано, якщо ми попросимо його про це за допомогою «магічної» команди

source: * Simple plots are then (fairly) simple to create.
es: * Gráficas simples son entonces (bastante) simples de crear.
uk: * Прості графіки (досить) легко створити.

source: ![Simple Position-Time Plot](../fig/9_simple_position_time_plot.svg) ## Plot data directly from a [`Pandas dataframe`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html).
es: ![Gráfica simple de Posición-Tiempo]({{ site.baseurl }}/fig/9_simple_position_time_plot.svg) ## Graficar datos directamente desde un [`dataframe` de Pandas](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html).

source: * We can also plot [Pandas dataframes](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html).
es: * También podemos graficar [marcos de datos de Pandas](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html).
uk: * Можна також використовувати [Pandas dataframes](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html).

source: * This implicitly uses [`matplotlib.pyplot`](https://matplotlib.org/api/pyplot_api.html).
es: * Esto usa implicitamente [`matplotlib.pyplot`](https://matplotlib.org/api/pyplot_api.html).
uk: * Це опосередковано використовує [`matplotlib.pyplot`](https://matplotlib.org/api/pyplot_api.html).

source: * Before plotting, we convert the column headings from a `string` to `integer` data type, since they represent numerical values
es: * Antes de graficar, convertimos las cabeceras de las columnas de una cadena a un tipo de dato entero, siendo que ellos representan valores numéricos.
uk: * Перед побудовою графіка ми перетворюємо заголовки стовпців з типу даних "string" на "integer", оскільки вони представляють числові значення.

source: ~~~ import pandas as pd data = pd.read_csv('data/gapminder_gdp_oceania.csv', index_col='country') # Extract year from last 4 characters of each column name # The current column names are structured as 'gdpPercap_(year)', # so we want to keep the (year) part only for clarity when plotting GDP vs. years # To do this we use strip(), which removes from the string the characters stated in the argument # This method works on strings, so we call str before strip() years = data.columns.str.strip('gdpPercap_') # Convert year values to integers, saving results back to dataframe data.columns = years.astype(int) data.loc['Australia'].plot() ~~~
es: ~~~ import pandas as pd data = pd.read_csv('data/gapminder_gdp_oceania.csv', index_col='country') # Extraer el año de los 4 últimos caracteres de cada nombre de columna # Los nombres de columna actuales están estructurados como 'gdpPercap_(year)', # Entonces queremos mantener la parte del año (year) solo para claridad cuando grafiquemos PIB vs. años # Para hacer esto, usamos strip(), el cual remueve de la cadena los caracteres declarados en el argumento # Este método funciona en cadenas, entonces llamamos str antes de strip() years = data.columns.str.strip('gdpPercap_') # Convertir los valores del año a enteros, guardando los resultados nuevamente en el marco de datos. data.columns = years.astype(int) data.loc['Australia'].plot() ~~~
uk: ~~~ import pandas as pd data = pd.read_csv('data/gapminder_gdp_oceania.csv', index_col='country') # Вилучаємо рік з останніх 4 символів назви кожного стовпця # Поточні назви стовпців структуровані як 'gdpPercap_(year)', # тому ми зберігаємо частину назви (рік) лише для чіткості під час побудови ВВП за роками # Для цього ми використовуємо strip(), яка видаляє з рядка символи, що зазначені як аргумент # Цей метод працює з рядками, тому ми викликаємо str перед strip() years = data.columns.str.strip('gdpPercap_') # Перетворіть значення років в цілі числа, зберігаючи результати назад у dataframe data.columns = years.astype(int) data.loc['Australia'].plot() ~~~

source: ![GDP plot for Australia](../fig/9_gdp_australia.svg) ## Select and transform data, then plot it.
es: ![Gráfico del PIB de Australia]({{ site.baseurl }}/fig/9_gdp_australia.svg) ## Selecciona y transforma los datos, luego lo graficas.

source: * By default, [`DataFrame.plot`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.plot.html#pandas.DataFrame.plot) plots with the rows as the X axis.
es: * Por defecto, [`DataFrame.plot`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.plot.html#pandas.DataFrame.plot) grafica con las filas como el eje X .
uk: * За замовчуванням, [`DataFrame.plot`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.plot.html#pandas.DataFrame.plot) зображує рядки на осі X.

source: * We can transpose the data in order to plot multiple series.
es: * Podemos transponer los datos para graficar multiples series.
uk: * Ми можемо транспонувати дані, щоб побудувати кілька графіків разом.

source: ~~~ data.T.plot() plt.ylabel('GDP per capita') ~~~
es: ~~~ data.T.plot() plt.ylabel('PIB per capita') ~~~
uk: ~~~ data.T.plot() plt.ylabel('ВВП на душу населення') ~~~

source: ![GDP plot for Australia and New Zealand](../fig/9_gdp_australia_nz.svg) ## Many styles of plot are available.
es: ![Gráfico del PIB de Australia y Nueva Zelanda]({{ site.baseurl }}/fig/9_gdp_australia_nz.svg) ## Varios estilos de gráficos están disponibles.

source: * For example, do a bar plot using a fancier style.
es: * Por ejemplo, hacer un diagrama de barras usando un estilo mas elegante.
uk: * Наприклад, створіть стовпчикову діаграму, використовуючи більш вишуканий стиль.

source: ![GDP barplot for Australia](../fig/9_gdp_bar.svg)
es: ![Diagrama de barras del PIB de Australia]({{ site.baseurl }}/fig/9_gdp_bar.svg)

source: ## Data can also be plotted by calling the `matplotlib` `plot` function directly.
es: ## Los datos pueden ser también graficados llamando a la función `plot` de `matplotlib` directamente.
uk: ## Графік також можна побудувати, викликавши безпосередньо функцію `plot` бібліотеки `matplotlib` .

source: * The command is `plt.plot(x, y)`
es: * El comando es `plt.plot(x, y)`
uk: * Формат команди є таким: `plt.plot(x, y)`

source: * The color / format of markers can also be specified as an optical argument: e.g. 'b-' is a blue line, 'g--' is a green dashed line.
es: * El color / formato de los marcadores también pueden ser especificados como un argumento óptico: ejemplo. 'b-' es una linea azul, 'g--' es una linea verde discontinua.
uk: * Колір / формат маркерів також можна вказати як оптичний аргумент: напр. «b-» — синя лінія, «g--» — зелена пунктирна лінія.

source: ## Get Australia data from dataframe
es: ## Obtener datos de Australia desde el marco de datos
uk: ## Отримаємо дані Австралії з dataframe.

source: ![GDP formatted plot for Australia](../fig/9_gdp_australia_formatted.svg)
es: ![Gráfico formateado del PIB para Australia]({{ site.baseurl }}/fig/9_gdp_australia_formatted.svg)

source: ## Can plot many sets of data together.
es: ## Se puede trazar varios conjuntos de datos juntos.
uk: ## Можна побудувати кілька графіків за різними наборами даних разом

source: ~~~ # Select two countries' worth of data. gdp_australia = data.loc['Australia'] gdp_nz = data.loc['New Zealand'] # Plot with differently-colored markers. plt.plot(years, gdp_australia, 'b-', label='Australia') plt.plot(years, gdp_nz, 'g-', label='New Zealand') # Create legend. plt.legend(loc='upper left') plt.xlabel('Year') plt.ylabel('GDP per capita ($)') ~~~
es: ~~~ # Selecciona el valor de los datos de dos países. gdp_australia = data.loc['Australia'] gdp_nz = data.loc['New Zealand'] # Grafica con marcadores de diferentes colores. plt.plot(years, gdp_australia, 'b-', label='Australia') plt.plot(years, gdp_nz, 'g-', label='New Zealand') # Crea leyenda plt.legend(loc='upper left') plt.xlabel('Year') plt.ylabel('GDP per capita ($)') ~~~
uk: ~~~ # Виберіть дані для двох країн. gdp_australia = data.loc['Australia'] gdp_nz = data.loc['New Zealand'] # Побудуйте графіки з маркерами різних кольорів. plt.plot(years, gdp_australia, 'b-', label='Australia') plt.plot(years, gdp_nz, 'g-', label='New Zealand') # Створіть легенду. plt.legend(loc='upper left') plt.xlabel('Year') plt.ylabel('ВВП на душу населення ($)') ~~~

source: > ## Adding a Legend
es: > ## Añadiendo una leyenda
uk: > ## Додавання легенди

source: > Often when plotting multiple datasets on the same figure it is desirable to have
es: > A menudo, al trazar múltiples conjuntos de datos en la misma figura, es deseable tener
uk: > Часто при побудові графіків з кількох наборів даних разом бажано мати

source: > a legend describing the data.
es: > una leyenda describiendo los datos.
uk: > легенду, що містить опис даних.

source: > > This can be done in `matplotlib` in two stages: > > * Provide a label for each dataset in the figure: > > ~~~ > plt.plot(years, gdp_australia, label='Australia') > plt.plot(years, gdp_nz, label='New Zealand') > ~~~ > > * Instruct `matplotlib` to create the legend. > > ~~~ > plt.legend() > ~~~ > > By default matplotlib will attempt to place the legend in a suitable position. If you > would rather specify a position this can be done with the `loc=` argument, e.g to place > the legend in the upper left corner of the plot, specify `loc='upper left'` > {: .language-python}
es: > > Esto se puede hacer en `matplotlib` en dos etapas: > > * Provee una etiqueta por cada set de datos en la figura: > > ~~~ > plt.plot(years, gdp_australia, label='Australia') > plt.plot(years, gdp_nz, label='New Zealand') > ~~~ > > * Instruye a `matplotlib` para que crea una leyenda. > > ~~~ > plt.legend() > ~~~ > > Por defecto matplotlib intentara colocar la leyenda en una posición adecuada. Si > preferirías especificar una posición se podría hacer con el argumento `loc=`, por ejemplo, para colocar > la leyenda en la esquina superior izquierda de la gráfica, se puede especificar `loc='upper left'` > {: .language-python}
uk: > > Легенда може бути створеною in `matplotlib` за два кроки: > > * Забезпечимо мітку для кожного набору даних на графіку: > > ~~~ > plt.plot(years, gdp_australia, label='Australia') > plt.plot(years, gdp_nz, label='New Zealand') > ~~~ > > * Доручимо `matplotlib` створити легенду. > > ~~~ > plt.legend() > ~~~ > > За замовчуванням matplotlib спробує розмістити легенду у відповідному місці. Якщо > необхідно вказати конкретне розташування, можна застосувати аргументи функції `loc=`, наприклад, щоб розмістити > легенду в лівому верхньому куті графіку, задайте `loc='upper left'` > {: .language-python}

source: ![GDP formatted plot for Australia and New Zealand](../fig/9_gdp_australia_nz_formatted.svg) * Plot a scatter plot correlating the GDP of Australia and New Zealand * Use either `plt.scatter` or `DataFrame.plot.scatter`
es: ![Gráfica formateada del PIB para Australia y Nueva Zelanda]({{ site.baseurl }}/fig/9_gdp_australia_nz_formatted.svg) * Grafica un diagrama de dispersión que correlacione el PIB de Australia y Nueva Zelanda * Utiliza `plt.scatter` o `DataFrame.plot.scatter`

source: ![GDP correlation using plt.scatter](../fig/9_gdp_correlation_plt.svg) ~~~ data.T.plot.scatter(x = 'Australia', y = 'New Zealand') ~~~ {: .language-python}
es: ![Correlación del PIB utilizando plt.scatter]({{ site.baseurl }}/fig/9_gdp_correlation_plt.svg) ~~~ data.T.plot.scatter(x = 'Australia', y = 'New Zealand') ~~~ {: .language-python}

source: ![GDP correlation using data.T.plot.scatter](../fig/9_gdp_correlation_data.svg)
es: ![Correlación del PIB utilizando data.T.plot.scatter]({{ site.baseurl }}/fig/9_gdp_correlation_data.svg)

source: > ## Minima and Maxima
es: > ## Mínimo y Máximo
uk: > ## Мінімум та максимум

source: > > Fill in the blanks below to plot the minimum GDP per capita over time > for all the countries in Europe. > Modify it again to plot the maximum GDP per capita over time for Europe. > > ~~~ > data_europe = pd.read_csv('data/gapminder_gdp_europe.csv', index_col='country') > data_europe.____.plot(label='min') > data_europe.____ > plt.legend(loc='best') > plt.xticks(rotation=90) > ~~~ > {: .language-python} > > > ## Solution > > > > ~~~ > > data_europe = pd.read_csv('data/gapminder_gdp_europe.csv', index_col='country') > > data_europe.min().plot(label='min') > > data_europe.max().plot(label='max') > > plt.legend(loc='best') > > plt.xticks(rotation=90) > > ~~~ > > {: .language-python} > > ![Minima Maxima Solution](../fig/9_minima_maxima_solution.png)
es: > > Completa los espacios en blanco a continuación para graficar el PIB mínimo per cápita a lo largo del tiempo > para todos los países en Europa. > Modificalo de nuevo para graficar el PIB máximo per cápita a lo largo del tiempo para Europa. > > ~~~ > data_europe = pd.read_csv('data/gapminder_gdp_europe.csv', index_col='country') > data_europe.____.plot(label='min') > data_europe.____ > plt.legend(loc='best') > plt.xticks(rotation=90) > ~~~ > {: .language-python} > > > ## Solución > > > > ~~~ > > data_europe = pd.read_csv('data/gapminder_gdp_europe.csv', index_col='country') > > data_europe.min().plot(label='min') > > data_europe.max().plot(label='max') > > plt.legend(loc='best') > > plt.xticks(rotation=90) > > ~~~ > > {: .language-python} > > ![Minima Maxima Solución]({{ site.basurl }}/fig/9_minima_maxima_solution.png)

source: > ## Correlations
es: > ## Correlaciones
uk: > ## Співвідношення
