Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: > > After reading the data for the Americas, > use `help(americas.head)` and `help(americas.tail)` > to find out what `DataFrame.head` and `DataFrame.tail` do. > > 1. What method call will display the first three rows of this data? > 2. What method call will display the last three columns of this data? > (Hint: you may need to change your view of the data.) > > > ## Solution > > 1. We can check out the first five rows of `americas` by executing `americas.head()` (allowing us to view the head > > of the DataFrame). We can specify the number of rows we wish to see by specifying the parameter `n` in our call > > to `americas.head()`. To view the first three rows, execute: > > > > ~~~ > > americas.head(n=3) > > ~~~ > >{: .language-python} > > > > The output is then > > ~~~ > > continent gdpPercap_1952 gdpPercap_1957 gdpPercap_1962 \ > >country > >Argentina Americas 5911.315053 6856.856212 7133.166023 > >Bolivia Americas 2677.326347 2127.686326 2180.972546 > >Brazil Americas 2108.944355 2487.365989 3336.585802 > > > > gdpPercap_1967 gdpPercap_1972 gdpPercap_1977 gdpPercap_1982 \ > >country > >Argentina 8052.953021 9443.038526 10079.026740 8997.897412 > >Bolivia 2586.886053 2980.331339 3548.097832 3156.510452 > >Brazil 3429.864357 4985.711467 6660.118654 7030.835878 > > > > gdpPercap_1987 gdpPercap_1992 gdpPercap_1997 gdpPercap_2002 \ > >country > >Argentina 9139.671389 9308.418710 10967.281950 8797.640716 > >Bolivia 2753.691490 2961.699694 3326.143191 3413.262690 > >Brazil 7807.095818 6950.283021 7957.980824 8131.212843 > > > > gdpPercap_2007 > >country > >Argentina 12779.379640 > >Bolivia 3822.137084 > >Brazil 9065.800825 > > ~~~ > >{: .output} > > 2. To check out the last three rows of `americas`, we would use the command, `americas.tail(n=3)`, > > analogous to `head()` used above. However, here we want to look at the last three columns so we need > > to change our view and then use `tail()`. To do so, we create a new DataFrame in which rows and > > columns are switched > > > > ~~~ > > americas_flipped = americas.T > > ~~~ > >{: .language-python} > > > > We can then view the last three columns of `americas` by viewing the last three rows of `americas_flipped`: > > ~~~ > > americas_flipped.tail(n=3) > > ~~~ > >{: .language-python} > > The output is then > > ~~~ > > country Argentina Bolivia Brazil Canada Chile Colombia \ > > gdpPercap_1997 10967.3 3326.14 7957.98 28954.9 10118.1 6117.36 > > gdpPercap_2002 8797.64 3413.26 8131.21 33329 10778.8 5755.26 > > gdpPercap_2007 12779.4 3822.14 9065.8 36319.2 13171.6 7006.58 > > > > country Costa Rica Cuba Dominican Republic Ecuador ... \ > > gdpPercap_1997 6677.05 5431.99 3614.1 7429.46 ... > > gdpPercap_2002 7723.45 6340.65 4563.81 5773.04 ... > > gdpPercap_2007 9645.06 8948.1 6025.37 6873.26 ... > > > > country Mexico Nicaragua Panama Paraguay Peru Puerto Rico \ > > gdpPercap_1997 9767.3 2253.02 7113.69 4247.4 5838.35 16999.4 > > gdpPercap_2002 10742.4 2474.55 7356.03 3783.67 5909.02 18855.6 > > gdpPercap_2007 11977.6 2749.32 9809.19 4172.84 7408.91 19328.7 > > > > country Trinidad and Tobago United States Uruguay Venezuela > > gdpPercap_1997 8792.57 35767.4 9230.24 10165.5 > > gdpPercap_2002 11460.6 39097.1 7727 8605.05 > > gdpPercap_2007 18008.5 42951.7 10611.5 11415.8 > > ~~~ > >{: .output} > > Note: we could have done the above in a single line of code by 'chaining' the commands: > > ~~~ > > americas.T.tail(n=3) > > ~~~ > >{: .language-python}
es: > > Después de leer los datos para las Américas, > use `help(americas.head)` y `help(americas.tail)` > para averiguar qué hacen `Data Frame.head` y `DataFrame.tail`. > > 1. ¿Qué llamado de método mostrará las primeras tres filas de estos datos? > 2. ¿Qué llamado de método mostrará las últimas tres columnas de estos datos? > (Sugerencia: es posible que deba cambiar su vista de los datos). > > > ## Solución > > 1. Podemos ver las primeras cinco filas de `americas` ejecutando` americas.head() `(lo que nos permite ver las primeras filas > > del DataFrame). Podemos especificar el número de filas que deseamos ver especificando el parámetro `n` en nuestra llamada > > a `americas.head()`. Para ver las primeras tres filas, ejecute: > > > > ~~~ > > americas.head(n=3) > > ~~~ > >{: .language-python} > > > > La salida es entonces > > ~~~ > > continent gdpPercap_1952 gdpPercap_1957 gdpPercap_1962 \ > >country > >Argentina Americas 5911.315053 6856.856212 7133.166023 > >Bolivia Americas 2677.326347 2127.686326 2180.972546 > >Brazil Americas 2108.944355 2487.365989 3336.585802 > > > > gdpPercap_1967 gdpPercap_1972 gdpPercap_1977 gdpPercap_1982 \ > >country > >Argentina 8052.953021 9443.038526 10079.026740 8997.897412 > >Bolivia 2586.886053 2980.331339 3548.097832 3156.510452 > >Brazil 3429.864357 4985.711467 6660.118654 7030.835878 > > > > gdpPercap_1987 gdpPercap_1992 gdpPercap_1997 gdpPercap_2002 \ > >country > >Argentina 9139.671389 9308.418710 10967.281950 8797.640716 > >Bolivia 2753.691490 2961.699694 3326.143191 3413.262690 > >Brazil 7807.095818 6950.283021 7957.980824 8131.212843 > > > > gdpPercap_2007 > >country > >Argentina 12779.379640 > >Bolivia 3822.137084 > >Brazil 9065.800825 > > ~~~ > >{: .output} > > 2. Para ver las últimas tres filas de `americas`, usaríamos el comando` americas.tail (n = 3) `, > > análogo a `head ()` usado anteriormente. Sin embargo, aquí queremos ver las últimas tres columnas, que necesitamos > > para cambiar nuestra vista y luego usar `tail()`. Para hacerlo, creamos un nuevo DataFrame en el que las filas y > > las columnas se cambian > > > > ~~~ > > americas_flipped = americas.T > > ~~~ > >{: .language-python} > > > > Podemos ver las últimas tres columnas de `americas` al ver las últimas tres filas de` americas_flipped`: > > ~~~ > > americas_flipped.tail(n=3) > > ~~~ > >{: .language-python} > > La salida es entonces > > ~~~ > > country Argentina Bolivia Brazil Canada Chile Colombia \ > > gdpPercap_1997 10967.3 3326.14 7957.98 28954.9 10118.1 6117.36 > > gdpPercap_2002 8797.64 3413.26 8131.21 33329 10778.8 5755.26 > > gdpPercap_2007 12779.4 3822.14 9065.8 36319.2 13171.6 7006.58 > > > > country Costa Rica Cuba Dominican Republic Ecuador ... \ > > gdpPercap_1997 6677.05 5431.99 3614.1 7429.46 ... > > gdpPercap_2002 7723.45 6340.65 4563.81 5773.04 ... > > gdpPercap_2007 9645.06 8948.1 6025.37 6873.26 ... > > > > country Mexico Nicaragua Panama Paraguay Peru Puerto Rico \ > > gdpPercap_1997 9767.3 2253.02 7113.69 4247.4 5838.35 16999.4 > > gdpPercap_2002 10742.4 2474.55 7356.03 3783.67 5909.02 18855.6 > > gdpPercap_2007 11977.6 2749.32 9809.19 4172.84 7408.91 19328.7 > > > > country Trinidad and Tobago United States Uruguay Venezuela > > gdpPercap_1997 8792.57 35767.4 9230.24 10165.5 > > gdpPercap_2002 11460.6 39097.1 7727 8605.05 > > gdpPercap_2007 18008.5 42951.7 10611.5 11415.8 > > ~~~ > >{: .output} > > Nota: podríamos haber hecho lo anterior en una sola línea de código con 'chaining' encadenando los comandos: > > ~~~ > > americas.T.tail(n=3) > > ~~~ > >{: .language-python}
uk: > > Прочитавши дані для Південної Америки, > використовуйте `help(americas.head)` та `help(americas.tail)`, >щоб дізнатися про призначення `DataFrame.head` and `DataFrame.tail`. > > 1. Виклик якого методу відобразить перші три рядки цих даних? > 2. Виклик якого методу відобразить останні три стовпці цих даних? > (Підказка: вам може знадобитися змінити спосіб перегляду даних.) > > > ## Рішення > > 1. Ми можемо перевірити перші п’ять рядків `americas` за викликом `americas.head()` (що дозволяє нам переглянути заголовок > > DataFrame). Ми можемо вказати кількість рядків, які ми хочемо бачити, визначивши параметр `n` у нашому виклику > > `americas.head()`. TЩоб переглянути перші три рядки, виконайте: > > > > ~~~ > > americas.head(n=3) > > ~~~ > >{: .language-python} > > > > Результат є таким: > > ~~~ > > continent gdpPercap_1952 gdpPercap_1957 gdpPercap_1962 \ > >country > >Argentina Americas 5911.315053 6856.856212 7133.166023 > >Bolivia Americas 2677.326347 2127.686326 2180.972546 > >Brazil Americas 2108.944355 2487.365989 3336.585802 > > > > gdpPercap_1967 gdpPercap_1972 gdpPercap_1977 gdpPercap_1982 \ > >country > >Argentina 8052.953021 9443.038526 10079.026740 8997.897412 > >Bolivia 2586.886053 2980.331339 3548.097832 3156.510452 > >Brazil 3429.864357 4985.711467 6660.118654 7030.835878 > > > > gdpPercap_1987 gdpPercap_1992 gdpPercap_1997 gdpPercap_2002 \ > >country > >Argentina 9139.671389 9308.418710 10967.281950 8797.640716 > >Bolivia 2753.691490 2961.699694 3326.143191 3413.262690 > >Brazil 7807.095818 6950.283021 7957.980824 8131.212843 > > > > gdpPercap_2007 > >country > >Argentina 12779.379640 > >Bolivia 3822.137084 > >Brazil 9065.800825 > > ~~~ > >{: .output} > > 2. Щоб перевірити останні три рядки `americas`, ми можемо використати команду, `americas.tail(n=3)`, > > analogous to команді `head()` used, що застосовувалась вище. Однак тут ми хочемо переглянути останні три стовпці, отже, нам потрібно > > змінити подання інформації, а потім використати `tail()`. Для цього ми створюємо новий DataFrame, у якому рядки та > > стовпці транспонуються > > > > ~~~ > > americas_flipped = americas.T > > ~~~ > >{: .language-python} > > > > Потім ми можемо переглянути останні три стовпці `americas`, переглянувши останні три рядки `americas_flipped`: > > ~~~ > > americas_flipped.tail(n=3) > > ~~~ > >{: .language-python} > > Результат є таким: > > ~~~ > > country Argentina Bolivia Brazil Canada Chile Colombia \ > > gdpPercap_1997 10967.3 3326.14 7957.98 28954.9 10118.1 6117.36 > > gdpPercap_2002 8797.64 3413.26 8131.21 33329 10778.8 5755.26 > > gdpPercap_2007 12779.4 3822.14 9065.8 36319.2 13171.6 7006.58 > > > > country Costa Rica Cuba Dominican Republic Ecuador ... \ > > gdpPercap_1997 6677.05 5431.99 3614.1 7429.46 ... > > gdpPercap_2002 7723.45 6340.65 4563.81 5773.04 ... > > gdpPercap_2007 9645.06 8948.1 6025.37 6873.26 ... > > > > country Mexico Nicaragua Panama Paraguay Peru Puerto Rico \ > > gdpPercap_1997 9767.3 2253.02 7113.69 4247.4 5838.35 16999.4 > > gdpPercap_2002 10742.4 2474.55 7356.03 3783.67 5909.02 18855.6 > > gdpPercap_2007 11977.6 2749.32 9809.19 4172.84 7408.91 19328.7 > > > > country Trinidad and Tobago United States Uruguay Venezuela > > gdpPercap_1997 8792.57 35767.4 9230.24 10165.5 > > gdpPercap_2002 11460.6 39097.1 7727 8605.05 > > gdpPercap_2007 18008.5 42951.7 10611.5 11415.8 > > ~~~ > >{: .output} > > Примітка: ми могли б зробити вищезазначене в одному рядку коду, «поєднавши» команди: > > ~~~ > > americas.T.tail(n=3) > > ~~~ > >{: .language-python}

source: > ## Reading Files in Other Directories
es: > ## Lectura de archivos en otros directorios
uk: > ## Читання файлів в інших каталогах

source: > > The data for your current project is stored in a file called `microbes.csv`, > which is located in a folder called `field_data`. > You are doing analysis in a notebook called `analysis.ipynb` > in a sibling folder called `thesis`: > > ~~~ > your_home_directory > +-- field_data/ > | +-- microbes.csv > +-- thesis/ > +-- analysis.ipynb > ~~~
es: > > Los datos de su proyecto actual se almacenan en un archivo llamado `microbes.csv`, > que se encuentra en una carpeta llamada `field_data`. > Estás haciendo un análisis en un cuaderno llamado `analysis.ipynb` > en una carpeta llamada `tesis`: > > ~~~ > your_home_directory > +-- field_data/ > | +-- microbes.csv > +-- thesis/ > +-- analysis.ipynb > ~~~
uk: > > Дані вашого поточного проекту зберігаються у файлі під назвою `microbes.csv`, > який знаходиться в каталозі під назвою `field_data`. > Ви виконуєте аналіз у блокноті під назвою `analysis.ipynb` > у спорідненому каталозі під назвою `thesis`: > > ~~~ > Ваш_домашній_каталог > +-- field_data/ > | +-- microbes.csv > +-- thesis/ > +-- analysis.ipynb > ~~~

source: > > What value(s) should you pass to `read_csv` to read `microbes.csv` in `analysis.ipynb`? > > > ## Solution > > We need to specify the path to the file of interest in the call to `pd.read_csv`. We first need to 'jump' out of > > the folder `thesis` using '../' and then into the folder `field_data` using 'field_data/'. Then we can specify the filename `microbes.csv. > > The result is as follows: > > ~~~ > > data_microbes = pd.read_csv('../field_data/microbes.csv') > > ~~~ > >{: .language-python}
es: > > ¿Qué valor(es) debe pasar a `read_csv` para leer `microbes.csv` en `analysis.ipynb`? > > > ## Solución > > Necesitamos especificar la ruta al archivo de interés en la llamada a `pd.read_csv`. Primero necesitamos 'saltar' de > > la carpeta `tesis` usando '../' y luego en la carpeta` field_data` usando 'field_data /'. Luego podemos especificar el nombre de archivo `microbes.csv. > > El resultado es el siguiente: > > ~~~ > > data_microbes = pd.read_csv('../field_data/microbes.csv') > > ~~~ > >{: .language-python}
uk: > > Які значення потрібно передати в `read_csv`, щоб прочитати `microbes.csv` у `analysis.ipynb`? > > > ## Рішення > > Нам потрібно вказати шлях до потрібного файлу як аргумент у виклику `pd.read_csv`. По-перше, потрібно «вистрибнути» з > > теки `thesis` за допомогою '../', а потім зайти у теку `field_data` за допомогою 'field_data/'. Після цього вказати назву файлу `microbes.csv. > > Результат є таким: > > ~~~ > > data_microbes = pd.read_csv('../field_data/microbes.csv') > > ~~~ > >{: .language-python}

source: > ## Writing Data
es: > ## Escritura de datos
uk: > ## Запис даних

source: > As well as the `read_csv` function for reading data from a file,
es: > Además de la función `read_csv` para leer datos de un archivo,
uk: > Подібно функції `read_csv` для читання даних із файлу,

source: > Pandas provides a `to_csv` function to write dataframes to files.
es: > Pandas proporciona una función `to_csv` para escribir dataframes en archivos.
uk: > Pandas має функцію `to_csv` для запису кадрів даних у файли.

source: > Applying what you've learned about reading from files,
es: > Aplicando lo que has aprendido sobre la lectura de archivos,
uk: > Застосовуючи те, що ви дізналися про читання з файлів,

source: > write one of your dataframes to a file called `processed.csv`.
es: > escriba su dataframe en un archivo llamado `procesado.csv`.
uk: > запишіть один із ваших фреймів даних у файл під назвою `processed.csv`.

source: > You can use `help` to get information on how to use `to_csv`.
es: > Puedes usar `help` para obtener información sobre cómo usar` to_csv`.
uk: > Ви можете скористатися `help`, щоб отримати інформацію про застосування `to_csv`.

source: > > ## Solution
es: > > ## Solución
uk: > > ## Рішення

source: > > In order to write the DataFrame `americas` to a file called `processed.csv`, execute the following command:
es: > > Para escribir el DataFrame `americas` en un archivo llamado `processed.csv`, ejecute el siguiente comando:
uk: > > Щоб записати DataFrame `americas` у файл під назвою `processed.csv`, виконайте таку команду:

source: > > For help on `to_csv`, you could execute, for example,
es: > > Para obtener ayuda sobre `to_csv`, puedes ejecutar, por ejemplo,
uk: > >Щоб отримати допомогу щодо `to_csv`, ви можете виконати, наприклад,

source: > > Note that `help(to_csv)` throws an error! This is a subtlety and is due to the fact that `to_csv` is NOT a function in
es: > > Tenga en cuenta que `help (to_csv)` produce un error! Esto es sutil y se debe al hecho de que `to_csv` NO es una función
uk: > > Зверніть увагу, що `help(to_csv)` видає помилку! Це тонкощі, і це пов’язано з тим, що `to_csv` НЕ є функцією сама по собі

source: > > and of itself and the actual call is `americas.to_csv`.
es: > > de sí misma sino `americas.to_csv`.
uk: > > а фактичним викликом є `americas.to_csv`.

source: --- title: "Pandas DataFrames" teaching: 15 exercises: 15 questions: - "How can I do statistical analysis of tabular data?" objectives: - "Select individual values from a Pandas dataframe." - "Select entire rows or entire columns from a dataframe." - "Select a subset of both rows and columns from a dataframe in a single operation." - "Select a subset of a dataframe by a single Boolean criterion." keypoints: - "Use `DataFrame.iloc[..., ...]` to select values by integer location." - "Use `:` on its own to mean all columns or all rows." - "Select multiple columns or rows using `DataFrame.loc` and a named slice." - "Result of slicing can be used in further operations." - "Use comparisons to select data based on value." - "Select values or NaN using a Boolean mask." ---
es: --- title: "DataFrames de Pandas" teaching: 15 exercises: 15 questions: - "¿Cómo puedo hacer análisis estadístico con datos tabulares?" objetives: - "Seleccionar valores individuales de un DataFrame de Pandas" - "Seleccionar filas enteras o columnas enteras de un DataFrame" - "Seleccionar un subconjunto de ambas filas y columnas de un DataFrame en una operación singular." - "Seleccionar un subconjunto de un DataFrame por un booleano singular" keypoints: - "Usa `DataFrame.iloc[...,...]`para seleccionar valores por su localización entera" - "Usa `:` solo, para referirte a todas las columnas o a todos los renglones" - "Selecciona múltiples columnas o filas usando `DataFrame.loc` y un segmento con nombre. " - "El resultado de cortar puede ser usado en operaciones adicionales" - "Usa comparaciones para seleccionar datos basados en un valor" - "Selecciona valores de NaN usando mascaras booleanas" ---
uk: --- title: "Pandas DataFrames" teaching: 15 exercises: 15 questions: - "Як я можу зробити статистичний аналіз табличних даних?" objectives: - "Вибір окремих значень з фрейму даних Pandas." - "Вибір цілих рядків або цілих стовпців з фрейму даних." - "Вибір підмножини рядків і стовпців з фрейму даних за одну операцію." - "Вибір підмножини фрейму даних за одним бульовим критерієм." keypoints: - "Використовуйте `DataFrame.iloc[..., ...]` для вибору значень за їх позицією." - "Використовуйте `:` окремо для позначення всіх стовпців або всіх рядків." - "Вибирайте кілька стовпців або рядків за допомогою `DataFrame.loc` і визначеного зрізу." - "Результат зрізу можна використовувати в подальших операціях." - "Використовуйте порівняння для вибору даних на основі певного значення." - "Виберіть значення або NaN за допомогою булевої маски." ---

source: ## Note about Pandas DataFrames/Series
es: ## Nota acerca de pandas DataFrames/Series
uk: ## Зауваження щодо Pandas DataFrames/Series

source: A [DataFrame][pandas-dataframe] is a collection of [Series][pandas-series]; The DataFrame is the way Pandas represents a table, and Series is the data-structure Pandas use to represent a column.
es: Un [DataFrame][pandas-dataframe] es una colección de [Series][pandas-series]; El DataFrame es la manera en que pandas representa una tabla, y una Serie es la estructura de datos que usa Pandas para representar una columna.
uk: [DataFrame][pandas-dataframe] є колекцією [Series][pandas-series]; DataFrame — це спосіб, у який Pandas представляє таблицю, а Series — це структура даних, яку Pandas використовує для представлення стовпця.

source: Pandas is built on top of the [Numpy][numpy] library, which in practice means that most of the methods defined for Numpy Arrays apply to Pandas Series/DataFrames.
es: Pandas esta construido en el top de la biblioteca [Numpy][numpy], la cual en la práctica significa que la mayoría de los métodos definidos para Numpy arrays aplican a Series/DataFrames de Pandas.
uk: Pandas побудована на основі бібліотеки [Numpy][numpy], що на практиці означає, що більшість методів, визначених для Numpy Arrays, застосовуються до Pandas Series/DataFrames.

source: What makes Pandas so attractive is the powerful interface to access individual records of the table, proper handling of missing values, and relational-databases operations between DataFrames.
es: Lo que hace que pandas sea tan atractivo es la potente interfaz para acceder a registros individuales de la tabla, el manejo adecuado de valores perdidos y las operaciones de bases de datos relacionales entre DataFrames.
uk: Що робить Pandas таким привабливим? Це потужний інтерфейс для доступу до окремих записів таблиці, належна обробка відсутніх значень і операції з з фреймами даних подібно до тих, що застосовуються в реляційних базах даних.

source: ## Selecting values
es: ## Seleccionando valores
uk: ## Вибір значень

source: To access a value at the position `[i,j]` of a DataFrame, we have two options, depending on what is the meaning of `i` in use. Remember that a DataFrame provides an *index* as a way to identify the rows of the table; a row, then, has a *position* inside the table as well as a *label*, which uniquely identifies its *entry* in the DataFrame.
es: Para acceder a un valor en la posición `[i, j]` de un DataFrame, tenemos dos opciones, dependiendo de cuál es el significado de `i` en uso. Recuerda que un DataFrame proporciona un *índice* como una forma para identificar las filas de la tabla; Una fila, entonces, tiene una *posición* dentro de la tabla, así como una *etiqueta*, que identifica de forma única su *entrada* en el DataFrame.
uk: Щоб отримати доступ до значення в позиції `[i,j]` у DataFrame, у нас є два варіанти, залежно від того, в якому значенні використовується `i`. Пам’ятайте, що DataFrame використовує *індекс* як спосіб ідентифікації рядків таблиці; крім того, рядок має *позицію* всередині таблиці, а також *мітку*, яка унікально ідентифікує *введення* значення у DataFrame.

source: ## Use `DataFrame.iloc[..., ...]` to select values by their (entry) position
es: ## Usa `DataFrame.iloc[..., ...]` para seleccionar valores por su (entrada) posición
uk: ## Використовуйте `DataFrame.iloc[..., ...]` для вибору значень за їх позицією

source: * Can specify location by numerical index analogously to 2D version of character selection in strings.
es: * Puedes especificar la localización por un indice numérico de forma análoga a la version2D de la selección de caracteres en cadenas.
uk: * Можна вказати позицію значення за допомогою числового індексу аналогічно 2D-версії вибору символів у рядках.

source: ## Use `DataFrame.loc[..., ...]` to select values by their (entry) label.
es: ## Usa `DataFrame.loc[..., ...]` para seleccionar valores por su (entrada) etiqueta.
uk: ## Використовуйте `DataFrame.loc[..., ...]`, щоб вибрати значення за їх міткою.

source: * Can specify location by row name analogously to 2D version of dictionary keys.
es: * Puedes especificar la localización por el nombre de la fila de forma análoga a la versión 2D de las claves del diccionario.
uk: * Можна вказати позицію за допомогою імені рядка аналогічно до 2D-версії ключів словника.

source: ## Use `:` on its own to mean all columns or all rows.
es: ## Usa `:` por si sola para referirte a todas las columnas o todos los renglones.
uk: ## Використовуйте `:` окремо для позначення всіх стовпців або всіх рядків.

source: * Just like Python's usual slicing notation.
es: * Al igual que la notación de segmentación habitual de Python.
uk: * Так само, як у звичайній Python нотації зрізу.

source: * Would get the same result printing `data.loc["Albania"]` (without a second index).
es: * Podría dar el mismo resultado imprimiendo `data.loc["Albania"]` (sin el segundo indice).
uk: * Той самий результат можна отримати, якщо надрукувати `data.loc["Albania"]` (без другого індексу).

source: * Would get the same result printing `data["gdpPercap_1952"]`
es: * Podría dar el mismo resultado imprimiendo `data["gdpPercap_1952"]`
uk: * Той самий результат можна отримати, якщо надрукувати `data["gdpPercap_1952"]`
