Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: ~~~ def add_numbers(a, b): result = a + b return result add_numbers(1, 4) ~~~
es: ~~~ def suma_numeros(a, b): resultado = a + b return resultado suma_numeros(1, 4) ~~~

source: ## [Variable Scope]({{ page.root }}/17-scope/)
es: ## [Alcance de una Variable]({{ page.root }}/17-scope/)
uk: ## [Область видимості змінної]({{ page.root }}/17-scope/)

source: - A local variable is defined in a function and can only be seen and used within that function.
es: - Una variable local se define en una función y sólo puede verse y usarse dentro de dicha función.
uk: - Локальна змінна визначена у функції, і її можна побачити та використовувати лише в цій функції.

source: - A global variable is defined outside of a function and can be seen or used anywhere after definition.
es: - Una variable global se define fuera de una función y puede verse o usarse en cualquier lugar después de su definición.
uk: - Глобальна змінна визначається поза функцією, і її можна побачити або використати будь-де після її визначення.

source: ## [Programming Style]({{ page.root }}/18-style/)
es: ## [Estilo de Programación]({{ page.root }}/18-style/)
uk: ## [Стиль програмування]({{ page.root }}/18-style/)

source: - Document your code.
es: - Documenta tu código.
uk: - Документуйте свій код.

source: - Use clear and meaningful variable names.
es: - Usa nombres de variables que sean claros y significativos.
uk: - Використовуйте чіткі та зрозумілі назви змінних.

source: - Follow [the PEP8 style guide](https://www.python.org/dev/peps/pep-0008) when setting up your code.
es: - Sigue [la guía de estilos PEP8](https://www.python.org/dev/peps/pep-0008) cuando escribas tus programas.
uk: - Притримуйтесь [the PEP8 style guide](https://www.python.org/dev/peps/pep-0008) під час налаштування коду.

source: - Use assertions to check for internal errors.
es: - Usa aserciones para comprobar errores internos.
uk: - Використовуйте твердження для перевірки внутрішніх помилок.

source: - Use docstrings to provide help.
es: - Usa docstrings para proporcionar ayuda.
uk: - Використовуйте docstrings для створення довідки.

source: ## Glossary
es: ## Glosario
uk: ## Словник

source: {:auto_ids} Arguments : Values passed to functions.
es: {:auto_ids} Argumentos : Valores pasados a las funciones.
uk: {:auto_ids} Аргументи : Значення, що передаються функціям.

source: Array : A container holding elements of the same type.
es: Array : Un contenedor con elementos del mismo tipo.
uk: Масив : контейнер, що містить елементи одного типу

source: Boolean : An object composed of `true` and `false`.
es: Booleano : Un objeto compuesto de `True` (verdadero) y `False` (falso).
uk: Булевий : об’єкт, що складається з `true` і `false`

source: DataFrame : The way Pandas represents a table; a collection of series.
es: DataFrame : La forma en que Pandas representa una tabla; una colección de series.
uk: Фрейм даних : Засіб подання таблиці у Pandas; колекція серій.

source: Element : An item in a list or an array. For a string, these are the individual characters.
es: Elemento : Un artículo en una lista o un array. Para una cadena, son los caracteres individuales.
uk: Element : Окреме значення у списку або масиві. Для рядка це окремі символи.

source: Function : A block of code that can be called and re-used elsewhere.
es: Función : Un bloque de código que se puede llamar y reusar en otras partes.
uk: Функція : блок коду, який можна викликати та повторно використовувати деінде.

source: Global variable : A variable defined outside of a function that can be used anywhere.
es: Variable global : Una variable definida fuera de una función que se puede usar en cualquier sitio.
uk: Глобальна змінна : Змінна, визначена поза функцією, яку можна використовувати будь-де.

source: Index : The position of a given element.
es: Índice : La posición de un elemento dado.
uk: Індекс : Позиція даного елемента.

source: Jupyter Notebook : Interactive coding environment allowing a combination of code and markdown.
es: Libreta de Jupyter : Entorno interactivo de programación que permite combinar código y markdown.
uk: Jupyter Notebook : Інтерактивне середовище кодування, що дозволяє поєднувати код і розмітку.

source: Library : A collection of files containing functions used by other programs.
es: Biblioteca : Una colección de archivos con funciones usados por otros programas.
uk: Бібліотека : Колекція файлів, що містять функції, які використовуються іншими програмами.

source: Local Variable : A variable defined inside of a function that can only be used inside of that function.
es: Variable Local : Una variable definida dentro de una función que sólo puede ser usada dentro de dicha función.
uk: Локальна змінна : Змінна, визначена всередині функції, яку можна використовувати лише всередині цієї функції.

source: Mask : A boolean object used for selecting data from another object.
es: Máscara : Un objeto booleano usado para seleccionar datos de otro objeto.
uk: Маска : Булевий об’єкт, який використовується для вибору даних з іншого об’єкта.

source: Method : An action tied to a particular object. Called by using `object.method`.
es: Método : Una acción ligada a un objeto en particular. Se le llama usando `objeto.metodo`.
uk: Метод : Дія, пов'язана з певним об'єктом. Викликається за допомогою `object.method`.

source: Modules : The files within a library containing functions used by other programs.
es: Módulos : Los archivos dentro de una biblioteca con funciones usadas por otros programas.
uk: Модулі : файли в бібліотеці, що містять функції, які використовуються іншими програмами.

source: Parameters : Variables used when executing a function.
es: Parámetros : Variables usadas cuand se ejecuta una función.
uk: Параметри : Змінні, що використовуються під час виконання функції.

source: Series : A Pandas data structure to represent a column.
es: Series : Una estructura de datos de Pandas que representa una columna.
uk: Серія : Структура даних Pandas для подання стовпця.

source: Substring : A part of a string.
es: Subcadena : Una parte de una cadena de texto.
uk: Підрядок : Частина рядка.

source: Variables : Names for values.
es: Variables : Nombres para valores.
uk: Змінні : Назви значень.

source: --- layout: page title: "Setup" permalink: /setup/ root: .. ---
es: --- layout: page title: "Configuración" permalink: /es/setup/ root: /es/_episodes/ ---
uk: --- layout: page title: "Налаштування" permalink: /setup/ root: .. ---

source: ## Installing Python Using Anaconda
es: ## Instalando Python usando Anaconda
uk: ## Встановлення Python за допомогою Anaconda

source: [Python][python] is a popular language for scientific computing, and great for general-purpose programming as well. Installing all of its scientific packages individually can be a bit difficult, however, so we recommend the all-in-one installer [Anaconda][anaconda].
es: [Python][python] es un lenguaje muy popular en la computación científica y también es ideal para la programación en general. La instalación de todos los paquetes científicos individualmente puede ser un poco difícil, por lo que recomendamos [Anaconda][anaconda], un instalador todo en uno.
uk: [Python][python] - це популярна мова для наукових обчислень, яка чудово підходить для програмування загального призначення. Однак встановлення всіх його наукових пакетів окремо може бути трохи складніше, тому ми рекомендуємо інсталятор "все-в-одному" від [Anaconda][anaconda].

source: Regardless of how you choose to install it, please make sure you install Python version 3.x (e.g., 3.4 is fine). Also, please set up your python environment at least a day in advance of the workshop. If you encounter problems with the installation procedure, ask your workshop organizers via e-mail for assistance so you are ready to go as soon as the workshop begins.
es: Independientemente de como elijas instalarlo, por favor asegúrate que instalas la versión 3.x de Python (e.g., 3.4 está bien). Además, por favor configura tu entorno de Python al menos un día antes del taller. Si encuentras problemas con el proceso de instalación, solicita ayuda a los organizadores del taller por correo electrónico así estás listo para empezar tan pronto como el taller comience.
uk: Незалежно від того, як ви вирішите його встановити, переконайтеся, що ви встановили Python версія 3.x (наприклад, 3.4 добре підходить). Крім того, налаштуйте середовище python принаймні за день до семінару. Якщо у вас виникли проблеми з процедури встановлення, зверніться по допомогу до організаторів семінару електронною поштою, щоб ви були готові, як тільки почнеться семінар.

source: ### Windows - [Video tutorial][video-windows]
es: ### Windows - [Vídeo tutorial][video-windows] (en inglés)

source: 1. Open [https://www.anaconda.com/distribution/][anaconda-windows] with your web browser.
es: 1. Abre [https://www.anaconda.com/distribution/][anaconda-windows] en tu navegador web.
uk: 1. Відкрийте [https://www.anaconda.com/distribution/][anaconda-windows] у вашому веб браузері

source: 2. Download the Python 3 installer for Windows.
es: 2. Descarga el instalador de Python 3 para Windows.
uk: 2. Завантажте програму встановлення Python 3 для Windows.

source: 3. Double-click the executable and install Python 3 using the recommended settings. Make sure that **Register Anaconda as my default Python 3.x** option is checked - it should be in the latest version of Anaconda
es: 3. Haz doble-click en el ejecutable e instala Python 3 usando la configuración recomendada. Asegúrate que la opción **Register Anaconda as my default Python 3.x** está marcada - debería de ser así en la última versión de Anaconda.
uk: 3. Двічі клацніть виконуваний файл і встановіть Python 3 із рекомендованими налаштуваннями. Переконайтеся, що опція **"Register Anaconda as my default Python 3.x"** (Зареєструвати Anaconda як мій Python 3.x) позначена — вона має бути в останній версії Anaconda

source: ### Mac OS X - [Video tutorial][video-mac]
es: ### Mac OS X - [Vídeo tutorial][video-mac] (en inglés)

source: 1. Visit [https://www.anaconda.com/distribution/][anaconda-mac] with your web browser.
es: 1. Abre [https://www.anaconda.com/distribution/][anaconda-mac] en tu navegador web.
uk: 1. Відкрийте [https://www.anaconda.com/distribution/][anaconda-mac] у вашому веб браузері.

source: 2. Download the Python 3 installer for OS X. These instructions assume that you use the graphical installer `.pkg` file.
es: 2. Descarga el instalador de Python 3 para OS X. Estas instrucciones asumen que estás usando el archivo de instalación gráfico `.pkg`.
uk: 2. Завантажте інсталятор Python 3 для OS X. У цих інструкціях передбачається, що ви використовуєте графічний файл інсталятора `.pkg`.

source: 3. Follow the Python 3 installation instructions. Make sure that the install location is set to "Install only for me" so Anaconda will install its files locally, relative to your home directory. Installing the software for all users tends to create problems in the long run and should be avoided.
es: 3. Sigue las instrucciones de instalación de Python 3. Asegúrate que la ubicación de instalación este configurado como "*Install only for me*" (Instalarlo sólo para mi) así Anaconda instalará sus archivos localmente, relativamente a tu directorio de inicio. Instalar el software para todos los usuarios tiende a dar problemas a largo plazo y debe evitarse.
uk: 3. Слідуйте інструкціям з інсталяції Python 3. Переконайтеся, що опція "Install only for me" (встановити тільки для мене) позначена, щоб Anaconda встановила необхідні файли локально, у Вашому домашньому каталозі. Інсталляція програми для всіх користувачів може призвести до проблем у майбутньому, і тому її треба уникати.

source: Note that the following installation steps require you to work from the shell. If you run into any difficulties, please request help before the workshop begins.
es: Tenga en cuenta que los pasos a continuación requieren que trabajes usando la terminal. Si encuentras alguna dificultad, por favor solicite ayuda antes de que comience el taller.
uk: Зверніть увагу на те, що ці інструкції треба виконувати у командній строці. У разі будь-яких труднощів, будь ласка зверніться за допомогою до початку тренінгу.

source: 1. Open [https://www.anaconda.com/distribution/][anaconda-linux] with your web browser.
es: 1. Abre [https://www.anaconda.com/distribution/][anaconda-linux] en tu navegador web.
uk: 1. Відкрийте [https://www.anaconda.com/distribution/][anaconda-linux] у Вашому веб браузері.

source: 2. Download the Python 3 installer for Linux.
es: 2. Descarga el instalador de Python 3 para Linux.
uk: 2. Завантажте інсталятор Python 3 для Linux.

source: 3. Install Python 3 using all of the defaults for installation.
es: 3. Instala Python 3 usando todos los valores predeterminados para la instalación.
uk: 3. Інсталюйте Python 3 з усіма рекомендованими налагодженнями.

source: a. Open a terminal window.
es: a. Abre una terminal.
uk: a. Відкрийте вікно терміналу.

source: b. Navigate to the folder where you downloaded the installer
es: b. Navega a la carpeta donde descargaste el instalador
uk: b. Перейдіть до каталогу, у якому Ви зберігли завантажений інсталятор

source: c. Type
es: c. Escribe
uk: c. Уведіть

source: and press tab. The name of the file you just downloaded should appear.
es: y pulsa el tabulador. El nombre del archivo que acabas de descargar debe aparecer.
uk: та натисніть клавішу tab. Після цього має з'явитися ім'я завантаженого файлу.

source: d. Press enter.
es: d. Pulsa enter.
uk: d. Натисніть клавішу enter.

source: e. Follow the text-only prompts. When the license agreement appears (a colon will be present at the bottom of the screen) press the space bar until you see the bottom of the text. Type `yes` and press enter to approve the license. Press enter again to approve the default location for the files. Type `yes` and press enter to prepend Anaconda to your `PATH` (this makes the Anaconda distribution your user's default Python).
es: e. Sigue los pasos de solo-texto. Cuando aparezca el acuerdo de la licencia (habrá dos puntos en la parte inferior de la pantalla) pulsa la barra espaciadora hasta que veas el final del texto. Escribe `yes` (sí) y pulsa enter para aceptar la licencia. Pulsa enter otra vez para aceptar el lugar predeterminado para los archivos. Escribe `yes` y pulsa enter para anteponer Anaconda a tu `PATH` (esto hace que la distribución de Anaconda sea el Python predeterminado para tu usuario).
uk: e. Слідуйте підказкам, які будуть з'являтися у терміналі. Коли з'явиться текст ліцензійної угоди (двокрапка буде зображена у останньому рядку на екрані) натискайте клавішу space доки не побачите останню частину тексту. Уведіть `yes` та натисніть клавішу enter щоб погодитися з угодою. Натисніть enter ще раз щоб згодитися з місцезнаходженням файлів за замовчуванням. Уведіть `yes` та натисніть клавішу enter щоб добавити Anaconda до початку вашої змінної `PATH` (це зробить Anaconda стандартною інсталяцією Python для Вас як користувача).

source: ## Getting the Data
es: ## Obteniendo los datos
uk: ## Отримання даних

source: The data we will be using is taken from the [gapminder][gapminder] dataset. To obtain it, download and unzip the file [python-novice-gapminder-data.zip]({{page.root}}/files/python-novice-gapminder-data.zip). In order to follow the presented material, you should launch the JupyterLab server in the root directory (see [Starting JupyterLab]({{ page.root }}/01-run-quit/#starting-jupyterlab)).
es: Los datos que usaremos están tomados del conjunto de datos [gapminder][gapminder]. Para obtenerlos, descarga y descomprime el archivo [python-novice-gapminder-data.zip]({{ site.baseurl }}/files/python-novice-gapminder-data.zip). Para seguir el material presentado, debes iniciar el servidor JupyterLab en el directorio raíz (consulta [Starting JupyterLab] (iniciando JupyterLab)({{ page.root }}/01-run-quit/#starting-jupyterlab)).
uk: Дані які ми будемо використовувати належать до набору даних [gapminder][gapminder]. Щоб їх отримати, завантажте та разпакуйте файл [python-novice-gapminder-data.zip]({{page.root}}/files/python-novice-gapminder-data.zip). Для того щоб стежити за викладанням, Ви маєте запустити JupyterLab сервер у кореневому каталозі (див. [Starting JupyterLab]({{ page.root }}/01-run-quit/#starting-jupyterlab)).

source: ### Mac OS X
uk: ### Користувачі Mac OS X

source: > > In the JupyterLab Main Work Area you can arrange documents into panels of tabs. Here is an > example from the [official documentation][jupyterlab]. > > <p align='center'> > <img alt="Multi-panel JupyterLab" src="{{ site.baseurl }}/fig/0_multipanel_jupyterlab_screenshot.png" width="750"/> > </p> > > First, create a text file, Python console, and terminal window and arrange then into three > panels in the main work area. Next, create a notebook, terminal window, and text file and > arrange then into three panels in the main work area. Finally, create your own combination of > panels and tabs. What combination of panels and tabs do you think will be most useful for your > workflow? > > > ## Solution > > > > After creating the necessary tabs, you can drag one of the tabs to the center of a panel to > > move the tab to the panel; next you can subdivide a tab panel by dragging a tab to the left, > > right, top, or bottom of the panel.
uk: > > У головній робочій області JupyterLab ви можете впорядковувати документи на панелі вкладок. Нижче наведено > приклад з [official documentation][jupyterlab]. > > <p align='center'> > <img alt="Multi-panel JupyterLab" src="{{ site.baseurl }}/fig/0_multipanel_jupyterlab_screenshot.png" width="750"/> > </p> > > Спочатку створіть текстовий файл, консоль Python і вікно терміналу, а потім розділіть їх на три > панелі в основній робочій зоні. Далі створіть блокнот, вікно терміналу та текстовий файл та > потім розподіліть на три панелі в основній робочій зоні. Нарешті, створіть власну комбінацію > панелей та вкладок. Яка, на вашу думку, комбінація панелей та вкладок буде найбільш корисною для Вашого > робочого процесу? > > > ## Рішення > > > > Після створення необхідних вкладок Ви можете перетягнути одну з вкладок у центр панелі для > > переміщення вкладки по панелі; потім ви можете розділити панель вкладок, перетягнувши вкладку ліворуч,> > праворуч, вгору або до низу панелі.

source: ![an illustration of indexing]({{ site.baseurl }}/fig/2_indexing.svg)
uk: ![Ілюстрація індексації]({{ site.baseurl }}/fig/2_indexing.svg)

source: >{: .solution}
uk: >{: .Рішення}

source: {: .language-python} ~~~ Help on built-in function round in module builtins:
uk: {: .language-python} ~~~ Допомога щодо вбудованих функцій у модулі builtins:

source: round(number, ndigits=None) Round a number to a given precision in decimal digits.
uk: round(number, ndigits=None) Округлення числа до заданої точності в десяткових цифрах.

source: The return value is an integer if ndigits is omitted or None. Otherwise the return value has the same type as the number. ndigits may be negative. ~~~
uk: Повернене значення є цілим числом, якщо ndigits опущено - None. Інакше значення, що повертається, має той самий тип, що й число. ndigits може бути від'ємним. ~~~

source: {: .language-python} ~~~ Subset of data: gdpPercap_1962 gdpPercap_1967 gdpPercap_1972 country Italy 8243.582340 10022.401310 12269.273780 Montenegro 4649.593785 5907.850937 7778.414017 Netherlands 12790.849560 15363.251360 18794.745670 Norway 13450.401510 16361.876470 18965.055510 Poland 5338.752143 6557.152776 8006.506993
uk: {: .language-python} ~~~ Підмножина даних: gdpPercap_1962 gdpPercap_1967 gdpPercap_1972 country Italy 8243.582340 10022.401310 12269.273780 Montenegro 4649.593785 5907.850937 7778.414017 Netherlands 12790.849560 15363.251360 18794.745670 Norway 13450.401510 16361.876470 18965.055510 Poland 5338.752143 6557.152776 8006.506993

source: ![Simple Position-Time Plot]({{ site.baseurl }}/fig/9_simple_position_time_plot.svg) ## Plot data directly from a [`Pandas dataframe`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html).
uk: ![Simple Position-Time Plot]({{ site.baseurl }}/fig/9_simple_position_time_plot.svg) ## Побудова графіків безпосередньо з [`Pandas dataframe`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html).

source: ![GDP plot for Australia]({{ site.baseurl }}/fig/9_gdp_australia.svg) ## Select and transform data, then plot it.
uk: ![Графік ВВП Австралії]({{ site.baseurl }}/fig/9_gdp_australia.svg) ## Виберіть і трансформуйте дані, а потім будуйте графік»

source: ![GDP plot for Australia and New Zealand]({{ site.baseurl }}/fig/9_gdp_australia_nz.svg) ## Many styles of plot are available.
uk: ![Графіки ВВП для Австралії та Нової Зеландії]({{ site.baseurl }}/fig/9_gdp_australia_nz.svg) ## Доступно багато типів графіків.

source: ~~~ plt.style.use('ggplot') data.T.plot(kind='bar') plt.ylabel('GDP per capita') ~~~
uk: ~~~ plt.style.use('ggplot') data.T.plot(kind='bar') plt.ylabel('ВВП на душу населення) ~~~

source: ![GDP barplot for Australia]({{ site.baseurl }}/fig/9_gdp_bar.svg)
uk: ![ Стовпчикова діаграма для ВВП Австралії]({{ site.baseurl }}/fig/9_gdp_bar.svg)

source: ![GDP formatted plot for Australia]({{ site.baseurl }}/fig/9_gdp_australia_formatted.svg)
uk: ![Відформатований графік ВВП для Австралії]({{ site.baseurl }}/fig/9_gdp_australia_formatted.svg)

source: ![GDP formatted plot for Australia and New Zealand]({{ site.baseurl }}/fig/9_gdp_australia_nz_formatted.svg) * Plot a scatter plot correlating the GDP of Australia and New Zealand * Use either `plt.scatter` or `DataFrame.plot.scatter`
uk: ![Відформатований графік ВВП Австралії та Нової Зеландії]({{ site.baseurl }}/fig/9_gdp_australia_nz_formatted.svg) * Побудуємо точкову діаграму співвідношення ВВП Австралії та Нової Зеландії * Використаємо `plt.scatter` або `DataFrame.plot.scatter`

source: ![GDP correlation using plt.scatter]({{ site.baseurl }}/fig/9_gdp_correlation_plt.svg) ~~~ data.T.plot.scatter(x = 'Australia', y = 'New Zealand') ~~~ {: .language-python}
uk: ![Співвідношення ВВП з використанням plt.scatter]({{ site.baseurl }}/fig/9_gdp_correlation_plt.svg) ~~~ data.T.plot.scatter(x = 'Австралія', y = 'Нова Зеландія') ~~~ {: .language-python}

source: ![GDP correlation using data.T.plot.scatter]({{ site.baseurl }}/fig/9_gdp_correlation_data.svg)
uk: ![Кореляція ВВП на основі data.T.plot.scatter]({{ site.baseurl }}/fig/9_gdp_correlation_data.svg)
