Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: > > Fill in the blanks below to plot the minimum GDP per capita over time > for all the countries in Europe. > Modify it again to plot the maximum GDP per capita over time for Europe. > > ~~~ > data_europe = pd.read_csv('data/gapminder_gdp_europe.csv', index_col='country') > data_europe.____.plot(label='min') > data_europe.____ > plt.legend(loc='best') > plt.xticks(rotation=90) > ~~~ > {: .language-python} > > > ## Solution > > > > ~~~ > > data_europe = pd.read_csv('data/gapminder_gdp_europe.csv', index_col='country') > > data_europe.min().plot(label='min') > > data_europe.max().plot(label='max') > > plt.legend(loc='best') > > plt.xticks(rotation=90) > > ~~~ > > {: .language-python} > > ![Minima Maxima Solution]({{ site.baseurl }}/fig/9_minima_maxima_solution.png)
uk: > > Заповніть порожні поля нижче, щоб побудувати графік мінімального ВВП на душу населення протягом часу > для всіх країн Європи. > Потім побудуйте графік максимального ВВП на душу населення в Європі. > > ~~~ > data_europe = pd.read_csv('data/gapminder_gdp_europe.csv', index_col='country') > data_europe.____.plot(label='min') > data_europe.____ > plt.legend(loc='best') > plt.xticks(rotation=90) > ~~~ > {: .language-python} > > > ## Рішення > > > > ~~~ > > data_europe = pd.read_csv('data/gapminder_gdp_europe.csv', index_col='country') > > data_europe.min().plot(label='min') > > data_europe.max().plot(label='max') > > plt.legend(loc='best') > > plt.xticks(rotation=90) > > ~~~ > > {: .language-python} > > ![Мінімум Максимум Рішення]({{ site.baseurl }}/fig/9_minima_maxima_solution.png)

source: > > Modify the example in the notes to create a scatter plot showing > the relationship between the minimum and maximum GDP per capita > among the countries in Asia for each year in the data set. > What relationship do you see (if any)? > > ~~~ > data_asia = pd.read_csv('data/gapminder_gdp_asia.csv', index_col='country') > data_asia.describe().T.plot(kind='scatter', x='min', y='max') > ~~~ > {: .language-python} > > > ## Solution > > > > ![Correlations Solution 1]({{ site.baseurl }}/fig/9_correlations_solution1.svg) > > > > No particular correlations can be seen between the minimum and maximum gdp values > > year on year. It seems the fortunes of asian countries do not rise and fall together.
uk: > > Модифікуйте приклад у примітках, щоб створити діаграму розсіювання, що показує > співвідношення між мінімальним і максимальним ВВП на душу населення > серед країн Азії за кожен рік у наборі даних. >Який зв’язок ви бачите (якщо такий є)? > > ~~~ > data_asia = pd.read_csv('data/gapminder_gdp_asia.csv', index_col='country') > data_asia.describe().T.plot(kind='scatter', x='min', y='max') > ~~~ > {: .language-python} > > > ## Рішення > > > > ![Кореляції Рішення 1]({{ site.baseurl }}/fig/9_correlations_solution1.svg) > > > > Жодних особливих кореляцій між мінімальними та максимальними значеннями ВВП не простежується > > з року в рік. Здається, статки азіатських країн не зростає і не падає разом.

source: > > You might note that the variability in the maximum is much higher than > that of the minimum. Take a look at the maximum and the max indexes: > > ~~~ > data_asia = pd.read_csv('data/gapminder_gdp_asia.csv', index_col='country') > data_asia.max().plot() > print(data_asia.idxmax()) > print(data_asia.idxmin()) > ~~~ > {: .language-python} > > ## Solution > > ![Correlations Solution 2]({{ site.baseurl }}/fig/9_correlations_solution2.png) > > > > Seems the variability in this value is due to a sharp drop after 1972. > > Some geopolitics at play perhaps? Given the dominance of oil producing countries, > > maybe the Brent crude index would make an interesting comparison? > > Whilst Myanmar consistently has the lowest gdp, the highest gdb nation has varied > > more notably.
uk: > > Можна помітити, що варіабельність максимуму набагато вища, ніж > мінімуму. Подивіться на максимальний і максимальний індекси:: > > ~~~ > data_asia = pd.read_csv('data/gapminder_gdp_asia.csv', index_col='country') > data_asia.max().plot() > print(data_asia.idxmax()) > print(data_asia.idxmin()) > ~~~ > {: .language-python} > > ## Рішення > > ![Кореляції Рішення 2]({{ site.baseurl }}/fig/9_correlations_solution2.png) > > > > Здається, варіабельність цього значення пов’язана з різким падінням після 1972 року > > Можливо, якісь геополітичні фактори грають роль? Враховуючи домінування нафтовидобувних країн, > > можливо, індекс нафти Brent стане цікавим порівнянням? > > У той час як М’янма постійно має найнижчий ВВП, найвищий ВВП країн варіюється > > більш помітно.

source: > > This short program creates a plot showing > the correlation between GDP and life expectancy for 2007, > normalizing marker size by population: > > ~~~ > data_all = pd.read_csv('data/gapminder_all.csv', index_col='country') > data_all.plot(kind='scatter', x='gdpPercap_2007', y='lifeExp_2007', > s=data_all['pop_2007']/1e6) > ~~~ > {: .language-python} > > Using online help and other resources, > explain what each argument to `plot` does. > > > ## Solution > > ![More Correlations Solution]({{ site.baseurl }}/fig/9_more_correlations_solution.svg) > > > > A good place to look is the documentation for the plot function - > > help(data_all.plot). > > > > kind - As seen already this determines the kind of plot to be drawn. > > > > x and y - A column name or index that determines what data will be > > placed on the x and y axes of the plot > > > > s - Details for this can be found in the documentation of plt.scatter. > > A single number or one value for each data point. Determines the size > > of the plotted points.
uk: > > Ця невеличка програма створює графік, який демонструє > кореляцію між ВВП і очікуваною тривалістю життя на 2007 рік, > нормалізуючи розмір маркерів за чисельністю населення: > > ~~~ > data_all = pd.read_csv('data/gapminder_all.csv', index_col='country') > data_all.plot(kind='scatter', x='ВВП_на_душу_населення_2007', y='Тривалість_Життя_2007', > s=data_all['pop_2007']/1e6) > ~~~ > {: .language-python} > > Використовуючи онлайн help та інші ресурси, > поясніть кожний аргумент функції `plot`. > > > ## Рішення > > ![Більше кореляцій Рішення]({{ site.baseurl }}/fig/9_more_correlations_solution.svg) > > > > Багато корисної інформації щодо функції plot - > > help(data_all.plot). > > > > kind - Як уже було показано, цей параметр визначає тип графіку, який буде створено. > > > > x та y - Назва стовпця або індекс, який визначає, які дані будуть > > розміщені на осях x і y графіка > > > > s - Подробиці щодо цього параметру є в документації по plt.scatter. > > Це одне число або одне значення для кожної точки даних. Визначає розмір > > маркера.

source: ~~~ goals = [1, 'Create lists.', 2, 'Extract items from lists.', 3, 'Modify lists.'] ~~~
uk: ~~~ goals = [1, 'Створити списки.', 2, 'Вилучити елементи із списків.', 3, 'Змінити списки.'] ~~~

source: {: .language-python} ~~~ TypeError: 'str' object does not support item assignment ~~~
uk: {: .language-python} ~~~ TypeError: об'єкт 'str' не підтримує призначення елементів ~~~

source: ~~~ mass = 3.54 if mass > 3.0: print(mass, 'is large') mass = 2.07 if mass > 3.0: print (mass, 'is large') ~~~
uk: ~~~ mass = 3.54 if mass > 3.0: print(mass, 'є великим') mass = 2.07 if mass > 3.0: print (mass, 'є великим') ~~~

source: {: .language-python} ~~~ 3.54 is large ~~~
uk: {: .language-python} ~~~ 3.54 є великим ~~~

source: ~~~ masses = [3.54, 2.07, 9.22, 1.86, 1.71] for m in masses: if m > 3.0: print(m, 'is large') ~~~
uk: ~~~ masses = [3.54, 2.07, 9.22, 1.86, 1.71] for m in masses: if m > 3.0: print(m, 'є великим') ~~~

source: {: .language-python} ~~~ 3.54 is large 9.22 is large ~~~
uk: {: .language-python} ~~~ 3.54 є великим 9.22 є великим ~~~

source: ~~~ masses = [3.54, 2.07, 9.22, 1.86, 1.71] for m in masses: if m > 3.0: print(m, 'is large') else: print(m, 'is small') ~~~
uk: ~~~ masses = [3.54, 2.07, 9.22, 1.86, 1.71] for m in masses: if m > 3.0: print(m, 'є великим') else: print(m, 'є малим') ~~~

source: {: .language-python} ~~~ 3.54 is large 2.07 is small 9.22 is large 1.86 is small 1.71 is small ~~~
uk: {: .language-python} ~~~ 3.54 є великим 2.07 є малим 9.22 є великим 1.86 є малим 1.71 є малим ~~~

source: ~~~ masses = [3.54, 2.07, 9.22, 1.86, 1.71] for m in masses: if m > 9.0: print(m, 'is HUGE') elif m > 3.0: print(m, 'is large') else: print(m, 'is small') ~~~
uk: ~~~ masses = [3.54, 2.07, 9.22, 1.86, 1.71] for m in masses: if m > 9.0: print(m, 'є ВЕЛИЧЕЗНИМ') elif m > 3.0: print(m, 'є великим') else: print(m, 'є малим') ~~~

source: {: .language-python} ~~~ 3.54 is large 2.07 is small 9.22 is HUGE 1.86 is small 1.71 is small ~~~
uk: {: .language-python} ~~~ 3.54 є великим 2.07 є малим 9.22 є ВЕЛИЧЕЗНИМ 1.86 є малим 1.71 є малим ~~~

source: ~~~ velocity = 10.0 if velocity > 20.0: print('moving too fast') else: print('adjusting velocity') velocity = 50.0 ~~~
uk: ~~~ velocity = 10.0 if velocity > 20.0: print('рухається занадто швидко') else: print('регулювання швидкості') velocity = 50.0 ~~~

source: {: .language-python} ~~~ adjusting velocity ~~~
uk: {: .language-python} ~~~ регулювання швидкості ~~~

source: ~~~ velocity = 10.0 for i in range(5): # execute the loop 5 times print(i, ':', velocity) if velocity > 20.0: print('moving too fast') velocity = velocity - 5.0 else: print('moving too slow') velocity = velocity + 10.0 print('final velocity:', velocity) ~~~
uk: ~~~ velocity = 10.0 for i in range(5): # виконати цикл 5 разів print(i, ':', velocity) if velocity > 20.0: print('рухається занадто швидко') velocity = velocity - 5.0 else: print('рухається надто повільно') velocity = velocity + 10.0 print('кінцева швидкість:', velocity) ~~~

source: {: .language-python} ~~~ 0 : 10.0 moving too slow 1 : 20.0 moving too slow 2 : 30.0 moving too fast 3 : 25.0 moving too fast 4 : 20.0 moving too slow final velocity: 30.0 ~~~
uk: {: .language-python} ~~~ 0 : 10.0 рухається занадто повільно 1 : 20.0 рухається занадто повільно 2 : 30.0 рухається занадто швидко 3 : 25.0 рухається занадто швидко 4 : 20.0 рухається занадто повільно кінцева швидкість: 30.0 ~~~

source: <table> <tr> <td><strong>i</strong></td> <td>0</td> <td>.</td> <td>1</td> <td>.</td> <td>2</td> <td>.</td> <td>3</td> <td>.</td> <td>4</td> <td>.</td> </tr> <tr> <td><strong>velocity</strong></td> <td>10.0</td> <td>20.0</td> <td>.</td> <td>30.0</td> <td>.</td> <td>25.0</td> <td>.</td> <td>20.0</td> <td>.</td> <td>30.0</td> </tr> </table>
uk: <table> <tr> <td><strong>i</strong></td> <td>0</td> <td>.</td> <td>1</td> <td>.</td> <td>2</td> <td>.</td> <td>3</td> <td>.</td> <td>4</td> <td>.</td> </tr> <tr> <td><strong>швидкість</strong></td> <td>10.0</td> <td>20.0</td> <td>.</td> <td>30.0</td> <td>.</td> <td>25.0</td> <td>.</td> <td>20.0</td> <td>.</td> <td>30.0</td> </tr> </table>

source: * Via [Twitter](https://twitter.com/minisciencegirl/status/693486088963272705):
uk: * Згідно [Twitter](https://twitter.com/minisciencegirl/status/693486088963272705):

source: ~~~ print('adjusted:', adjust(0.9)) print('temperature after call:', temperature) ~~~
uk: ~~~ print('adjusted:', adjust(0.9)) print('температура після виклику функції:', temperature) ~~~

source: * Etc.
uk: * тощо.

source: {% comment %} Create anchor for each one of the episodes. {% endcomment %} {% for episode in site.episodes %} <article id="{{ episode.url }}" class="figures"></article> {% endfor %}
uk: {% comment %} Створіть якір для кожного з епізодів. {% endcomment %} {% for episode in site.episodes %} <article id="{{ episode.url }}" class="figures"></article> {% endfor %}
