Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: * A simple plain-text format for writing lists, links,
es: * Un formato de texto plano simple para escribir listas, enlaces,
uk: * Простий текстовий формат для створення списків, посилань

source: and other things that might go into a web page. * Equivalently, a subset of HTML that looks like what you'd send in an old-fashioned email. * Turn the current cell into a Markdown cell by entering the Command mode (<kbd>Esc</kbd>/gray) and press the <kbd>M</kbd> key. * `In [ ]:` will disappear to show it is no longer a code cell and you will be able to write in Markdown. * Turn the current cell into a Code cell by entering the Command mode (<kbd>Esc</kbd>/gray) and press the <kbd>y</kbd> key.
es: y otras cosas que pueden ir en una página web. * De manera equivalente, un subconjunto de HTML que se parece a lo que enviarías en un correo electrónico antiguo. * Convierte la celda actual en una celda Markdown ingresando el modo Comando (<kbd>Esc</kbd>/gris) y presiona la tecla <kbd>M</kbd>. * `In [ ]:` desaparecerá para mostrar que ya no es una celda de código y podrás escribir Markdown. * Convierte la celda actual en una celda de Código ingresando el modo Comando (<kbd>Esc</kbd>/gris) y presiona la tecla <kbd>y</kbd>.
uk: та інших елементів, які можуть бути розміщені на вебсторінці. * Відповідно, це підмножина HTML, яка виглядає як те, що Ви надіслали б у старомодному електронному листі. * Перетворіть поточну клітинку на клітинку Markdown, увійшовши в командний режим (<kbd>Esc</kbd>/gray) та натиснувши <kbd>M</kbd> key. * `In [ ]:` зникне, щоб показати, що це вже не клітинка коду, і Ви зможете писати в Markdown. * Перетворіть поточну клітинку на клітинку з кодом, увійшовши в командний режим (<kbd>Esc</kbd>/gray) та натиснувши клавішу <kbd>y</kbd> .

source: ### Markdown does most of what HTML does.
es: ### Markdown hace la mayor parte de lo que hace HTML.
uk: ### Markdown робить більшість того, що робить HTML.

source: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ * Use asterisks * to create * bullet lists. ~~~ </div> <div class="col-md-6" markdown="1"> * Use asterisks * to create * bullet lists. </div> </div>
es: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ * Usa asteriscos * para crear * listas de viñetas. ~~~ </div> <div class="col-md-6" markdown="1"> * Usa asteriscos * para crear * listas de viñetas. </div> </div>
uk: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ * Використовуйте зірочки * щоб створити * марковані списки. ~~~ </div> <div class="col-md-6" markdown="1"> * Використовуйте зірочки * щоб створити * марковані списки. </div> </div>

source: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ 1. Use numbers 1. to create 1. numbered lists. ~~~ </div> <div class="col-md-6" markdown="1"> 1. Use numbers 1. to create 1. numbered lists. </div> </div>
es: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ 1. Usa números 1. para crear 1. listas numeradas. ~~~ </div> <div class="col-md-6" markdown="1"> 1. Usa números 1. para crear 1. listas numeradas. </div> </div>
uk: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ 1. Використовуйте цифри, 1. щоб створити 1. нумеровані списки. ~~~ </div> <div class="col-md-6" markdown="1"> 1. Використовуйте цифри, 1. щоб створити 1. нумеровані списки. </div> </div>

source: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ * You can use indents * To create sublists * of the same type * Or sublists 1. Of different 1. types ~~~ </div> <div class="col-md-6" markdown="1"> * You can use indents * To create sublists * of the same type * Or sublists 1. Of different 1. types </div> </div>
es: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ * Puedes usar sangrías * Para crear sublistas * del mismo tipo * O sublistas 1. de diferentes 1. tipos ~~~ </div> <div class="col-md-6" markdown="1"> * Puedes usar sangrías * Para crear sublistas * del mismo tipo * O sublistas 1. de diferentes 1. tipos </div> </div>
uk: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ * Можна використовувати відступи, * щоб створити підсписки * одного типу * Або підсписки 1. різних 1. типів ~~~ </div> <div class="col-md-6" markdown="1"> * Можна використовувати відступи, * щоб створити підсписки * одного типу * Або підсписки 1. різних 1. типів </div> </div>

source: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ # A Level-1 Heading ~~~ </div> <div class="col-md-6" markdown="1"> # A Level-1 Heading </div> </div>
es: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ # Un título de nivel-1 ~~~ </div> <div class="col-md-6" markdown="1"> # Un título de nivel-1 </div> </div>
uk: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ # Заголовок рівня-1 ~~~ </div> <div class="col-md-6" markdown="1"> # Заголовок рівня-1 </div> </div>

source: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ ## A Level-2 Heading (etc.) ~~~ </div> <div class="col-md-6" markdown="1"> ## A Level-2 Heading (etc.) </div> </div>
es: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ ## Un título de nivel-2 (etc.) ~~~ </div> <div class="col-md-6" markdown="1"> ## Un título de nivel-2 (etc.) </div> </div>
uk: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ ## Заголовок рівня 2 (і так далі) ~~~ </div> <div class="col-md-6" markdown="1"> ## Заголовок рівня 2 (і так далі) </div> </div>

source: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ Line breaks don't matter.
es: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ Los saltos de línea no importan.
uk: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ Розриви рядків не мають значення.

source: But blank lines create new paragraphs. ~~~ </div> <div class="col-md-6" markdown="1"> Line breaks don't matter.
es: Pero líneas en blanco crean párrafos nuevos. ~~~ </div> <div class="col-md-6" markdown="1"> Los saltos de línea no importan.
uk: Але порожні рядки створюють нові параграфи. ~~~ </div> <div class="col-md-6" markdown="1"> Розриви рядків не мають значення.

source: But blank lines create new paragraphs. </div> </div>
es: Pero líneas en blanco crean párrafos nuevos. </div> </div>
uk: Але порожні рядки створюють нові параграфи. </div> </div>

source: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ [Create links](http://software-carpentry.org) with `[...](...)`. Or use [named links][data_carpentry].
es: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ [Crea enlaces](http://software-carpentry.org) con `[...](...)`. O usa el [nombre del enlace][data_carpentry].
uk: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ [Create links](http://software-carpentry.org) разом з `[...](...)`. Або використовуйте [named links][data_carpentry].

source: [data_carpentry]: http://datacarpentry.org ~~~ </div> <div class="col-md-6" markdown="1"> [Create links](http://software-carpentry.org) with `[...](...)`. Or use [named links][data_carpentry].
es: [data_carpentry]: http://datacarpentry.org ~~~ </div> <div class="col-md-6" markdown="1"> [Crea enlaces](http://software-carpentry.org) con `[...](...)`. O usa el [nombre del enlace][data_carpentry].
uk: [data_carpentry]: http://datacarpentry.org ~~~ </div> <div class="col-md-6" markdown="1"> [Create links](http://software-carpentry.org) разом з `[...](...)`. Або використовуйте [named links][data_carpentry].

source: > ## Creating Lists in Markdown
es: > ## Creando listas en Markdown
uk: > ## Створення списків в Markdown

source: > > Create a nested list in a Markdown cell in a notebook that looks like this: > > 1. Get funding. > 2. Do work. > * Design experiment. > * Collect data. > * Analyze. > 3. Write up. > 4. Publish. > > > ## Solution > > > > This challenge integrates both the numbered list and bullet list. > > Note that the bullet list is indented 2 spaces so that it is inline with the items of the numbered list. > > ~~~ > > 1. Get funding. > > 2. Do work. > > * Design experiment. > > * Collect data. > > * Analyze. > > 3. Write up. > > 4. Publish. > > ~~~
es: > > Crea una lista anidada en una celda Markdown en un cuaderno que tenga este aspecto: > > 1. Obtener fondos > 2. Hacer el trabajo. > * Diseñar experimento. > * Recolectar datos. > * Analizar. > 3. Escribir. > 4. Publicar. > > > ## Solución > > > > Este desafío integra tanto la lista numerada como la lista de viñetas. > > Ten en cuenta que la lista de viñetas tiene sangría de 2 espacios para que esté en línea con los elementos de la lista numerada. > > ~~~ > > 1. Obtener fondos. > > 2. Hacer el trabajo. > > * Diseñar experimento. > > * Recolectar datos. > > * Analizar. > > 3. Escribir. > > 4. Publicar. > > ~~~
uk: > > Створіть вкладений список в Markdown клітинці блокноту так, щоб вона виглядала наступним чином: > > 1. Знайти фінансування. > 2. Виконати роботу. > * Провести експеримент. > * Зібрати дані. > * Провести аналіз. > 3. Написати статтю. > 4. Опублікувати. > > > ## Рішення > > > > Це завдання поєднує як нумерований, так і маркований списки. > > Зверніть увагу, що маркований список має відступ на 2 проміжки, щоб він не збігався з елементами нумерованого списку. > > ~~~ > > 1. Знайти фінансування. > > 2. Виконати роботу. > > * Провести експеримент. > > * Зібрати дані. > > * Провести аналіз. > > 3. Написати статтю. > > 4. Опублікувати. > > ~~~

source: > ## More Math
es: > ## Más matemáticas
uk: > ## Більше математики

source: > > What is displayed when a Python cell in a notebook > that contains several calculations is executed? > For example, what happens when this cell is executed? > > ~~~ > 7 * 3 > 2 + 1 > ~~~ > {: .language-python} > > > ## Solution > > > > Python returns the output of the last calculation. > > ~~~ > > 3 > > ~~~ > > {: .language-python}
es: > > ¿Qué se muestra cuando se ejecuta una celda de Python en un cuaderno > que contiene varios cálculos? > Por ejemplo, ¿qué sucede cuando esta celda es ejecutada? > > ~~~ > 7 * 3 > 2 + 1 > ~~~ > {: .language-python} > > > ## Solución > > > > Python devuelve la salida del último cálculo. > > ~~~ > > 3 > > ~~~ > > {: .language-python}
uk: > > Що відображається, коли виконується клітинка Python в блокноті, > що містить декілька обчислень? > Наприклад, що трапиться при виконанні дій наступної клітинки? > > ~~~ > 7 * 3 > 2 + 1 > ~~~ > {: .language-python} > > > ## Рішення > > > > Python поверне результат останнього обчислення. > > ~~~ > > 3 > > ~~~ > > {: .language-python}

source: > ## Change an Existing Cell from Code to Markdown
es: > ## Cambiar una celda existente de código a Markdown
uk: > ## Зміна типу певної клітинки з Code на Markdown

source: > > What happens if you write some Python in a code cell > and then you switch it to a Markdown cell? > For example, > put the following in a code cell: > > ~~~ > x = 6 * 7 + 12 > print(x) > ~~~ > {: .language-python} > > And then run it with <kbd>Shift</kbd>+<kbd>Return</kbd> to be sure that it works as a code cell. > Now go back to the cell and use <kbd>Esc</kbd> then <kbd>m</kbd> to switch the cell to Markdown > and "run" it with <kbd>Shift</kbd>+<kbd>Return</kbd>. > What happened and how might this be useful? > > > ## Solution > > > > The Python code gets treated like Markdown text. > > The lines appear as if they are part of one contiguous paragraph. > > This could be useful to temporarily turn on and off cells in notebooks that get used for multiple purposes. > > ~~~ > > x = 6 * 7 + 12 print(x) > > ~~~ > > {: .language-python}
es: > > ¿Qué sucede si escribes algo de Python en una celda de código > y luego lo cambias a una celda Markdown? > Por ejemplo, > pon lo siguiente en una celda de código: > > ~~~ > x = 6 * 7 + 12 > print(x) > ~~~ > {: .language-python} > > Y entonces corre con <kbd>Shift</kbd>+<kbd>Return</kbd> Para estar seguro de que funciona como una celda de código. > Ahora vuelve a la celda y usa<kbd>Esc</kbd> entonces <kbd>m</kbd> para cambiar la celda a Markdown > y "corre" esto con <kbd>Shift</kbd>+<kbd>Return</kbd>. > ¿Qué pasó y cómo podría ser útil? > > > ## Solución > > > > El código de Python se trata como texto de Markdown. > > Las líneas aparecen como si fueran parte de un párrafo contiguo. > > Esto podría ser útil para activar y desactivar temporalmente las celdas en los cuadernos que se utilizan para múltiples propósitos. > > ~~~ > > x = 6 * 7 + 12 print(x) > > ~~~ > > {: .language-python}
uk: > > Що станеться, якщо Ви напишете код Python у клітинку > а потім перемкнете клітинку у режим Markdown? > Наприклад, > помістіть наступний код в клітинку: > > ~~~ > x = 6 * 7 + 12 > print(x) > ~~~ > {: .language-python} > > а потім запустіть цей код за допомогою <kbd>Shift</kbd>+<kbd>Return</kbd>, щоб переконатися, що він працює. > Тепер поверніться до клітинки, використайте комбінацію <kbd>Esc</kbd> та <kbd>m</kbd>, щоб переключитися в режим Markdown, > а потім "запустіть" її за допомогою <kbd>Shift</kbd>+<kbd>Return</kbd>. > Що сталося, і як це може бути корисним? > > > ## Рішення > > > > Код Python розглядається як текст Markdown. > > Рядки виглядають так, ніби вони є частиною одного суміжного абзацу. > > Це може бути корисним для тимчасового вмикання та вимикання клітинок у блокнотах, які використовуються для різних цілей. > > ~~~ > > x = 6 * 7 + 12 print(x) > > ~~~ > > {: .language-python}

source: > ## Equations
es: > ## Ecuaciones
uk: > ## Рівняння

source: > > Standard Markdown (such as we're using for these notes) won't render equations, > but the Notebook will. > Create a new Markdown cell > and enter the following: > > ~~~ > $\sum_{i=1}^{N} 2^{-i} \approx 1$ > ~~~ > > (It's probably easier to copy and paste.) > What does it display? > What do you think the underscore, `_`, circumflex, `^`, and dollar sign, `$`, do? > > > ## Solution > > > > The notebook shows the equation as it would be rendered from LaTeX equation syntax. > > The dollar sign, `$`, is used to tell Markdown that the text in between is a LaTeX equation. > > If you're not familiar with LaTeX, underscore, `_`, is used for subscripts and circumflex, `^`, is used for superscripts. > > A pair of curly braces, `{` and `}`, is used to group text together so that the statement `i=1` becomes the subscript and `N` becomes the superscript. > > Similarly, `-i` is in curly braces to make the whole statement the superscript for `2`. > > `\sum` and `\approx` are LaTeX commands for "sum over" and "approximate" symbols.
es: > > Markdown estándar (como el que estamos usando para estas notas) no mostrará ecuaciones, > pero el Cuaderno lo hará. > Crea una nueva celda Markdown > e introduce lo siguiente: > > ~~~ > $\sum_{i=1}^{N} 2^{-i} \approx 1$ > ~~~ > > (Probablemente sea más fácil copiar y pegar.) > ¿Qué muestra? > ¿Qué piensas que hace el subguión, `_`, circunflejo, `^`, y el signo de dólar, `$`? > > > ## Solución > > > > El cuaderno muestra la ecuación tal como se representaría a partir de la sintaxis de ecuación de LaTeX. > > El signo de dólar, `$`, se usa para indicarle a Markdown que el texto intermedio es una ecuación de LaTeX. > > Si no está familiarizado con LaTeX, el guion bajo, `_`, se usa para subíndices y el circunflejo,` ^ `, se usa para superíndices. > > Se usa un par de llaves, `{` y `}`, para agrupar el texto de manera que la declaración`i=1` se convierta en el subíndice y `N` se convierta en el superíndice. > > Similarmente, `-i` está entre llaves para hacer que toda la declaración sea el superíndice de `2`. > > `\sum` y `\approx` son comandos LaTeX para símbolos de "suma" y "aproximado".
uk: > > Стандартний Markdown (наприклад, який ми використовуємо для цих приміток) не відтворює рівняння, > але Notebook може. > Створіть нову клітинку Markdown > і введіть наступне: > > ~~~ > $\sum_{i=1}^{N} 2^{-i} \approx 1$ > ~~~ > >(Ймовірно, легше скопіювати та вставити). > Що ми побачимо? > Як Ви думаєте, що роблять: підкреслення `_`, циркумфлекс `^` і знак долара `$`? > > > ## Рішення > > > > Блокнот показує рівняння так, як воно було б відтворено за допомогою синтаксису рівняння LaTeX. > > Знаки долара, `$`, використовуються, щоб повідомити Markdown, що текст між ними є рівнянням LaTeX. > > Якщо ви не знайомі з LaTeX, то повідомляємо, що символ підкреслення `_` використовується для нижніх індексів, а циркумфлекс `^` використовується для верхніх індексів. > > Пара фігурних дужок, `{` і `}`, використовується для групування тексту так, що оператор `i=1` стає нижнім індексом, а `N` стає верхнім індексом. > > Подібним чином, `-i` у фігурних дужках використовується, щоб зробити весь оператор верхнім індексом для `2`. > > `\sum` and `\approx` є командами LaTeX символів «сума» і «приблизно».

source: ## Closing JupyterLab
es: ## Cerrando JupyterLab
uk: ## Закриття JupyterLab

source: * From the Menu Bar select the "File" menu and the choose "Quit" at the bottom of the dropdown menu. You will be prompted to confirm that you wish to shutdown the JupyterLab server (don't forget to save your work!). Click "Confirm" to shutdown the JupyterLab server.
es: * En la barra de menú, selecciona el menú "File" y elige "Quit" en la parte inferior del menú desplegable. Se te pedirá que confirmes que deseas cerrar el servidor JupyterLab (¡no olvides guardar tu trabajo!). Haz clic en "Confirm" para cerrar el servidor JupyterLab.
uk: * На панелі меню оберіть меню «File» і натисніть «Quit» внизу спадного меню. Вам буде запропоновано підтвердити, що Ви бажаєте вимкнути сервер JupyterLab (не забудьте зберегти свою роботу!). Натисніть «Confirm», щоб вимкнути сервер JupyterLab.

source: * To restart the JupyterLab server you will need to re-run the following command from a shell.
es: * Para reiniciar el servidor JupyterLab, deberás volver a ejecutar el siguiente comando desde una terminal.
uk: * Щоб перезапустити сервер JupyterLab, Вам потрібно буде повторно активувати наступну команду з оболонки.

source: > ## Closing JupyerLab
es: > ## Cerrando JupyerLab
uk: > ## Закриття JupyterLab

source: > > Practice closing and restarting the JupyterLab server.
es: > > Practica cerrar y reiniciar el servidor JupyterLab.
uk: > > Потренуйтеся закривати та перезапускати сервер JupyterLab.

source: --- title: "Variables and Assignment" teaching: 10 exercises: 10 questions: - "How can I store data in programs?" objectives: - "Write programs that assign scalar values to variables and perform calculations with those values." - "Correctly trace value changes in programs that use scalar assignment." keypoints: - "Use variables to store values." - "Use `print` to display values." - "Variables persist between cells." - "Variables must be created before they are used." - "Variables can be used in calculations." - "Use an index to get a single character from a string." - "Use a slice to get a substring." - "Use the built-in function `len` to find the length of a string." - "Python is case-sensitive." - "Use meaningful variable names." ---
es: --- title: "Variables y Asignación" teaching: 10 exercises: 10 questions: - "¿Cómo puede guardar datos en los programas?" objectives: - "Escribir programas que asignen valores escalares a variables y realicen cálculos con esos valores." - "Rastrear correctamente cambios de valores en programas que usan asignación de escalares." keypoints: - "Usa variables para guardar valores." - "Usa `print` para mostrar los valores." - "Las variables persisten entre celdas." - "Las variables deben ser creadas antes de ser utilizadas." - "Las variables pueden ser usadas en cálculos." - "Usa un índice para obtener un solo carácter de una secuencia de caracteres." - "Usa un corte para obtener una parte de una secuencia de caracteres." - "Usa la función incorporada `len` para encontrar la longitud de una secuencia de caracteres." - "Python distingue mayúsculas de minúsculas." - "Usa nombres de variables significativos." ---
uk: --- title: "Змінні та присвоєння" teaching: 10 exercises: 10 questions: - "Як я можу зберігати дані в програмах?" objectives: - "Написати програми, які присвоюють скалярні значення змінним і виконують обчислення з цими значеннями." - "Правильнo відстежувати зміни значень у програмах, які використовують скалярне присвоєння." keypoints: - "Використовуйте змінні для зберігання значень." - "Використовуйте `print` для відображення значень." - "Змінні зберігаються між клітинками." - "Змінні мають бути створені перед їх використанням." - "Змінні можна використовувати в обчисленнях." - "Використовуйте індекс, щоб отримати один символ із рядка (string)." - "Використовуйте зріз, щоб отримати підрядок (substring)." - "Використовуйте вбудовану функцію `len`, щоб знайти довжину рядка." - "Python чутливий до регістру." - "Використовуйте змістовні імена змінних." ---

source: ## Use variables to store values.
es: ## Usa variables para guardar valores.
uk: ## Використовуйте змінні для зберігання значень.

source: * **Variables** are names for values.
es: * **Variables** son nombres de valores.
uk: * **Змінні** - це назви значень.

source: * In Python the `=` symbol assigns the value on the right to the name on the left.
es: * En Python el símbolo `=` asigna el valor que se encuentra a la derecha al nombre que se encuentra a la izquierda.
uk: * У Python символ `=` використовується для присвоєння значення, яке знаходиться праворуч, до її назви, яка вказана ліворуч.

source: * The variable is created when a value is assigned to it.
es: * La variable es creada en el momento que se le asigna un valor.
uk: * Змінна створeна, коли ій присвоюється значення.

source: * Here, Python assigns an age to a variable `age`
es: * Aquí, Python asigna una edad a la variable `age`
uk: * Нижче Python присвоює значення року змінній `age`

source: and a name in quotes to a variable `first_name`.
es: y un nombre entre comillas a la variable `first_name`.
uk: та ім'я у лапках - змінній `first_name`.

source: * Variable names
es: * Nombres de variables
uk: * Назви змінних

source: * can **only** contain letters, digits, and underscore `_` (typically used to separate words in long variable names)
es: * puede contener **sólo** letras, dígitos y guión bajo `_` (habitualmente usado para separar palabras en nombres largos de variable)
uk: * можуть складатися **тільки** з букв, цифр та підкреслення `_` (яке звичайно використовується, щоб відокремити слова у довгих назвах змінних)

source: * cannot start with a digit
es: * no se puede comenzar con un dígito
uk: * не можуть починатися з цифри

source: * are **case sensitive** (age, Age and AGE are three different variables)
es: * se **distingue mayúsculas de minúsculas** (age, Age and AGE son tres variables diferentes)
uk: * **залежать від регістру** (тобто `age`, `Age` та `AGE` - це три різні змінні)

source: * Variable names that start with underscores like `__alistairs_real_age` have a special meaning
es: * Los nombres de variables que comiencen con un guión bajo `__alistairs_real_age` tienen un significado especial
uk: * Назви змінних які починаються з підкреслення, як наприклад `__alistairs_real_age`, мають спеціальне значення,

source: so we won't do that until we understand the convention.
es: , por lo cual no lo usaremos hasta que comprendamos la convención.
uk: і тому ми не будемо використовувати їх, доки не зрозуміємо цього правила.

source: ## Use `print` to display values.
es: ## Usa `print` para mostrar los valores.
uk: ## Використовуйте `print` для виводу значень.

source: * Python has a built-in function called `print` that prints things as text.
es: * Python tiene una función incorporada llamada `print` que muestra cosas como texto.
uk: * Python має вбудовану функцію `print`, яка друкує щось як текст.

source: * Call the function (i.e., tell Python to run it) by using its name.
es: * Llama a una función usando su nombre (por ejemplo, decirle a Python que la ejecute).
uk: * Щоб викликати функцію (тобто, щоб виконати її), треба вказати її ім'я.
