Repository: carpentries-i18n/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: es, uk

source: --- title: "Writing Functions" teaching: 10 exercises: 15 questions: - "How can I create my own functions?" objectives: - "Explain and identify the difference between function definition and function call." - "Write a function that takes a small, fixed number of arguments and produces a single result." keypoints: - "Break programs down into functions to make them easier to understand." - "Define a function using `def` with a name, parameters, and a block of code." - "Defining a function does not run it." - "Arguments in call are matched to parameters in definition." - "Functions may return a result to their caller using `return`." ---
es: --- title: "Escribiendo Funciones" teaching: 10 exercises: 15 questions: - "¿Cómo puedo crear mis funciones?" objectives: - "Explicar e identificar la diferencia entre definir una función y el llamado de una función." - "Escribe una función que toma un número de argumentos fijo y pequeño, y produce un sólo resultado." keypoints: - "Divide los programas en funciones para hacerlos mas entendibles o mas fácil de interpretar." - "Define una función usando `def` con nombre, parámetros, y código en bloque." - "Defining a function does not run it." - "Los argumentos en una llamada corresponden a los parametros en la definición." - "Las funciones pueden devolver un resultado, a quienes las invocan (llaman) usando `return`." ---
uk: --- title: "Написання функцій" teaching: 10 exercises: 15 questions: - "Як я можу створити власні функції?" objectives: - "Пояснити і визначитие різницю між визначенням функції та викликом функції." - "Написати функцію, яка приймає невелику фіксовану кількість аргументів і видає єдиний результат." keypoints: - "Розбийте програми на функції, щоб їх було легше зрозуміти." - "Визначте функцію за допомогою `def` з назвою, параметрами та блоком коду." - "Визначення функції не запускає її." - "Аргументи у виклику зіставляються з параметрами у визначенні." - "Функції можуть повертати результат своєго виклику за допомогою `return`." ---

source: ## Break programs down into functions to make them easier to understand.
es: ## Dividir los programas en funciones para que sean mas fácil de entender.
uk: ## Розбийте програми на функції, щоб їх було легше зрозуміти.

source: * Human beings can only keep a few items in working memory at a time.
es: * Las personas pueden mantener unos pocos elementos en la memoria de trabajo, cada vez que lo hacen.
uk: * Людина може одночасно зберігати лише кілька елементів у робочій пам’яті.

source: * Understand larger/more complicated ideas by understanding and combining pieces.
es: * Comprender ideas más grandes / más complicadas y saber combinar o relacionar las partes.
uk: * Розуміти великі/складніші ідеї, розуміючи та комбінуючи їх частини.

source: * Components in a machine.
es: * Componentes en una computadora.
uk: * Компоненти в машині.

source: * Lemmas when proving theorems.
es: * Ideas al probar teoremas.
uk: * Леми при доведенні теорем.

source: * Functions serve the same purpose in programs.
es: * Las funciones tienen el mismo propósito en los programas.
uk: * Функції служать тій же меті в програмах.

source: * *Encapsulate* complexity so that we can treat it as a single "thing".
es: * *Encapsular* reducir la complejidad para que podamos tratarlo como una sola "cosa".
uk: * *Інкапсулю.nm* складність, щоб ми могли розглядати їх як одну «річ».

source: * Also enables *re-use*.
es: * También facilita el *re-uso*.
uk: * Також уможливлюють *повторне використання*.

source: * Write one time, use many times.
es: * Se escribe una vez, se usa muchas veces.
uk: * Пишемо один раз, використовуємо багато разів..

source: ## Define a function using `def` with a name, parameters, and a block of code.
es: ## Definir una función usando `def` con nombre, parámetros y bloque de código.
uk: ## Визначте функцію за допомогою `def` з назвою, параметрами та блоком коду."

source: * Begin the definition of a new function with `def`.
es: * Empieza o inicia la definición de una nueva función con`def`.
uk: * Почніть визначення нової функції з `def`.

source: * Followed by the name of the function.
es: * Seguido por el nombre de la función.
uk: * Далі йде назва функції.

source: * Must obey the same rules as variable names.
es: * Debe respetar las normas de los nombres de las variables.
uk: * Назви функцій мають відповідати тим самим правилам, що й імена змінних.

source: * Then *parameters* in parentheses.
es: * Entonces los parámetros / argumentos van entre paréntesis.
uk: * Потім *параметри* в дужках.

source: * Empty parentheses if the function doesn't take any inputs.
es: * Paréntesis vacíos, si la función no toma ningún argumento.
uk: * Порожні дужки, якщо функція не приймає жодних вхідних даних.

source: * We will discuss this in detail in a moment.
es: * Discutiremos en detalle en un momento
uk: * Ми наразі обговоримо це детально.

source: * Then a colon.
es: * Después un punto y coma.
uk: * Потім двокрапка.

source: * Then an indented block of code.
es: * Después un bloque de código identado.
uk: * Потім блок коду з відступом.

source: ~~~ def print_greeting(): print('Hello!') ~~~
es: ~~~ def mostrar_saludos(): print ('¡Hola!') ~~~

source: ## Defining a function does not run it.
es: ## Definir una función, no significa que esta se ejecuta.
uk: ## Визначення функції не запускає її.

source: * Defining a function does not run it.
es: * La definición de una función no la ejecuta.
uk: * Визначення функції не запускає її.

source: * Like assigning a value to a variable.
es: * Como asignar un valor en una variable.
uk: * Як присвоєння значення змінній.

source: * Must call the function to execute the code it contains.
es: * Debes llamar a la función para ejecutar el código que contiene.
uk: * Необхідно викликати функцію, щоб виконати код, який вона містить.

source: ~~~ print_greeting() ~~~
es: ~~~ mostrar_saludo() ~~~

source: {: .language-python} ~~~ Hello! ~~~
es: {: .language-python} ~~~ ¡Hola! ~~~

source: ## Arguments in call are matched to parameters in definition.
es: ## Los argumentos en la llamada corresponden a los parámetros de la definición.
uk: ## Аргументи у виклику зіставляються з параметрами у визначенні.

source: * Functions are most useful when they can operate on different data.
es: * Las funciones son más efectivas cuando pueden operar sobre datos diferentes.
uk: * Функції найбільш корисні, коли вони можуть працювати з різними даними.

source: * Specify *parameters* when defining a function.
es: * Especificar *parámetros* al definir una función.
uk: * Укажіть *параметри* під час визначення функції.

source: * These become variables when the function is executed.
es: * Estos se convierten en variables cuando se ejecuta la función.
uk: * Вони стають змінними під час виконання функції.

source: * Are assigned the arguments in the call (i.e., the values passed to the function).
es: * Se asignan los argumentos en la llamada (es decir, los valores se pasan ​​a la función).
uk: * Праметрам присвоюються аргументи виклику (тобто значення, передані у функцію)

source: * If you don't name the arguments when using them in the call, the arguments will be matched to
es: * Si no invoca los argumentos cuando los usa en la llamada, los argumentos se compararán con los
uk: * Якщо ви не називаєте аргументи під час їх використання у виклику, аргументи будуть зіставлені з

source: parameters in the order the parameters are defined in the function.
es: parámetros en el orden definido en la función.
uk: параметрами в тому порядку, у якому вони визначені у функції.

source: ~~~ def print_date(year, month, day): joined = str(year) + '/' + str(month) + '/' + str(day) print(joined) print_date(1871, 3, 19) ~~~
es: ~~~ def mostrar_fecha (year, mes, día): unido = str (year) + '/' + str (mes) + '/' + str (dia) print (unido) mostrar_fecha (1871, 3, 19) ~~~

source: {: .language-python} ~~~ 1871/3/19 ~~~
es: {: .lenguaje-python} ~~~ 1871/3/19 ~~~

source: Or, we can name the arguments when we call the function, which allows us to specify them in any order: ~~~ print_date(month=3, day=19, year=1871) ~~~ {: .language-python} ~~~ 1871/3/19 ~~~
es: O bien, podemos nombrar los argumentos cuando llamamos a la función, lo que nos permite especificarlos en cualquier orden: ~~~ print_date(mes=3, dia=19, year=1871) ~~~ {: .language-python} ~~~ 1871/3/19 ~~~
uk: Або ми можемо назвати аргументи під час виклику функції, що дозволяє нам це зробити вказати їх у довільному порядку: ~~~ print_date(month=3, day=19, year=1871) ~~~ {: .language-python} ~~~ 1871/3/19 ~~~

source: `()` contains the ingredients for the function while the body contains the recipe.
es: `()` contiene las componentes de la función mientras el cuerpo contiene la fórmula.
uk: `()` містить інгредієнти для функції тоді як тіло містить рецепт.

source: ## Functions may return a result to their caller using `return`.
es: ## Las funciones pueden devolver un resultado a quien la llama usando `return`.
uk: ## Функції можуть повертати результат до свого виклику за допомогою `return`.

source: * Use `return ...` to give a value back to the caller.
es: * Usa `return` para devolver el valor.
uk: * Використовуте `return ...` щоб повернути значення у місце виклику.

source: * May occur anywhere in the function.
es: * Puede ocurrir en cualquier parte de la función.
uk: * Може виникнути будь-де у функції.

source: * But functions are easier to understand if `return` occurs:
es: * Pero las funciones son más fácil de entender si tienen un `return`:
uk: * Але функції легше зрозуміти, якщо реалізовано функцію `return`:

source: * At the start to handle special cases.
es: * Al principio para manejar casos especiales.
uk: * На початку функції для обробки особливих випадків.

source: * At the very end, with a final result.
es: * Al final, con un resultado final.
uk: * У самому кінці з остаточним результатом.

source: ~~~ def average(values): if len(values) == 0: return None return sum(values) / len(values) ~~~
es: ~~~ def average(valores): if len(valores) == 0: return None return sum(valores) / len(valores) ~~~

source: ~~~ a = average([1, 3, 4]) print('average of actual values:', a) ~~~
es: ~~~ a = average([1, 3, 4]) print('promedio de valores:', a) ~~~
uk: ~~~ a = average([1, 3, 4]) print('середнє фактичних значень:', a) ~~~

source: {: .language-python} ~~~ average of actual values: 2.6666666666666665 ~~~
es: {: .language-python} ~~~ promedio de valores: 2.6666666666666665 ~~~
uk: {: .language-python} ~~~ середнє фактичних значень: 2.6666666666666665 ~~~

source: ~~~ print('average of empty list:', average([])) ~~~
es: ~~~ print('promedio de la lista vacía:', average([])) ~~~
uk: ~~~ print('середнє порожнього списку:', average([])) ~~~

source: {: .language-python} ~~~ average of empty list: None ~~~
es: {: .language-python} ~~~ promedio de la lista vacía: None ~~~
uk: {: .language-python} ~~~ середнє порожнього списку: None ~~~

source: * Remember: [every function returns something]({{ page.root }}/04-built-in/).
es: * Recuerda: [toda función devuelve algo]({{ page.root }}/04-built-in/).
uk: * Пам'ятайте: [кожна функція щось повертає]({{ page.root }}/04-built-in/).

source: * A function that doesn't explicitly `return` a value automatically returns `None`.
es: * Una función que no devuelve un valor explícitamente `devuelve` automáticamente `None`.
uk: * Функція, яка явно не містить `return` , автоматично повертає `None`.

source: ~~~ result = print_date(1871, 3, 19) print('result of call is:', result) ~~~
es: ~~~ resultado = print_date(1871, 3, 19) print('resultado de la llamada es:', resultado) ~~~
uk: ~~~ result = print_date(1871, 3, 19) print('результат виклику є таким:', result) ~~~

source: {: .language-python} ~~~ 1871/3/19 result of call is: None ~~~
es: {: .language-python} ~~~ 1871/3/19 resultado de la llamada es: None ~~~
uk: {: .language-python} ~~~ 1871/3/19 результат виклику є таким: None ~~~

source: > ## Identifying Syntax Errors
es: > ## Identificación de errores de sintaxis
uk: > ## Виявлення синтаксичних помилок

source: > > 1. Read the code below and try to identify what the errors are > *without* running it. > 2. Run the code and read the error message. > Is it a `SyntaxError` or an `IndentationError`? > 3. Fix the error. > 4. Repeat steps 2 and 3 until you have fixed all the errors. > > ~~~ > def another_function > print("Syntax errors are annoying.") > print("But at least python tells us about them!") > print("So they are usually not too hard to fix.") > ~~~ > {: .language-python} > > > ## Solution > > > > ~~~ > > def another_function(): > > print("Syntax errors are annoying.") > > print("But at least Python tells us about them!") > > print("So they are usually not too hard to fix.") > > ~~~ > > {: .language-python}
es: > > 1. Lee el código a continuación e intente identificar cuáles son los errores > *sin* ejecutarlo. > 2. Corre el código y lee el mensaje de error. > Es un `SyntaxError` o un `IndentationError`? > 3. Corrige el error. > 4. Repite los pasos 2 y 3 hasta que hasta que haya solucionado todos los errores. > > ~~~ > def another_function > print("Los errores de sintaxis son molestos.") > print("¡Pero al menos Python nos cuenta sobre ellos!") > print("Generalmente no son demasiado difíciles de arreglar.") > ~~~ > {: .language-python} > > > ## Solución > > > > ~~~ > > def another_function(): > > print("Los errores de sintaxis son molestos.") > > print("¡Pero al menos Python nos cuenta sobre ellos!") > > print("Generalmente no son demasiado difíciles de arreglar.") > > ~~~ > > {: .language-python}
uk: > > 1. Прочитайте наведений нижче код і спробуйте визначити, у чому полягають помилки > *без* запуску. > 2. Запустіть код і прочитайте повідомлення про помилку. > Це `SyntaxError` чи `IndentationError`? > 3. Виправте помилку. > 4. Повторюйте кроки 2 та 3 доки не виправите всі помилки. > > ~~~ > def another_function > print("Syntax errors are annoying.") > print("But at least python tells us about them!") > print("So they are usually not too hard to fix.") > ~~~ > {: .language-python} > > > ## Рішення > > > > ~~~ > > def another_function(): > > print("Синтаксичні помилки дратують.") > > print("Але принаймні Python розповідає нам про них!") > > print("Тож їх зазвичай не надто важко виправити.") > > ~~~ > > {: .language-python}

source: > ## Definition and Use
es: > ## Definición y Uso
uk: > ## Визначення та використання

source: > > What does the following program print? > > ~~~ > def report(pressure): > print('pressure is', pressure) > > print('calling', report, 22.5) > ~~~ > {: .language-python} > > ## Solution > > > > ~~~ > > calling <function report at 0x7fd128ff1bf8> 22.5 > > ~~~ > > {: .output} > > > > A function call always needs parenthesis, otherwise you get memory address of the function object. So, if we wanted to call the function named report, and give it the value 22.5 to report on, we could have our function call as follows > > ~~~ > > print("calling") > > report(22.5) > > ~~~
es: > > ¿Qué muestra el siguiente programa? > > ~~~ > def report(presion): > print('presion es', presion) > > print('llamado', report, 22.5) > ~~~ > {: .language-python} > > ## Solución > > > > ~~~ > > calling <function report at 0x7fd128ff1bf8> 22.5 > > ~~~ > > {: .output} > > > > La llamada a una función siempre necesita paréntesis, de lo contrario, obtiene la dirección de memoria del objeto función. Entonces, si queremos llamar a la función de nombre report, y le damos el valor 22.5, podríamos tener la llamada a la función de la siguiente manera > > ~~~ > > print("llamada") > > report(22.5) > > ~~~
uk: > > Що друкує наступна програма? > > ~~~ > def report(pressure): > print('тиск', pressure) > > print('виклик', report, 22.5) > ~~~ > {: .language-python} > > ## Рішення > > > > ~~~ > > calling <function report at 0x7fd128ff1bf8> 22.5 > > ~~~ > > {: .output} > > > > Для виклику функції завжди потрібні круглі дужки, інакше ви отримаєте адресу пам’яті об’єкта функції. Отже, якщо ми хочемо викликати функцію під назвою report і надати їй значення 22,5 для звіту, ми могли б викликати нашу функцію так > > ~~~ > > print("виклик") > > report(22.5) > > ~~~

source: > ## Order of Operations
es: > ## Orden de Operaciones
uk: > ## Порядок виконання операцій

source: > > The example above: > > ~~~ > result = print_date(1871, 3, 19) > print('result of call is:', result) > ~~~ > {: .language-python} > > printed: > ~~~ > 1871/3/19 > result of call is: None > ~~~
es: > > El ejemplo anterior: > > ~~~ > resultado = print_date(1871, 3, 19) > print('resultado de la llamada es:', resultado) > ~~~ > {: .language-python} > > muestra: > ~~~ > 1871/3/19 > resultado de la llamada es: None > ~~~
uk: > > Приклад вище: > > ~~~ > result = print_date(1871, 3, 19) > print('результат виклику:', result) > ~~~ > {: .language-python} > > надруковано: > ~~~ > 1871/3/19 > результат виклику: None > ~~~

source: > > Explain why the two lines of output appeared in the order they did. > > What's wrong in this example? > ~~~ > result = print_date(1871,3,19) > > def print_date(year, month, day): > joined = str(year) + '/' + str(month) + '/' + str(day) > print(joined) > ~~~ > {: .language-python} > > > ## Solution > > > > 1. The first line of output (`1871/3/19`) is from the print function inside `print_date()`, while the second line > > is from the print function below the function call. All of the code inside `print_date()` is executed first, and > > the program then "leaves" the function and executes the rest of the code. > > 2. The problem with the example is that the function is defined *after* the call to the function is made. Python > > therefore doesn't understand the function call.
es: > > Explica por qué las dos líneas de salida aparecieron en el orden en que lo hicieron. > > ¿Qué hay de malo en este ejemplo? > ~~~ > resultado = print_date(1871,3,19) > > def print_date(year, mes, dia): > joined = str(year) + '/' + str(mes) + '/' + str(dia) > print(joined) > ~~~ > {: .language-python} > > > ## Solution > > > > 1. La primer línea de salida (`1871/3/19`) es lo que muestra la función dentro de `print_date()`, mientras que la segunda línea > > lo que muestra está debajo de la llamadaa la función. Todo el código dentro de `print_date ()` se ejecuta primero, y > > el programa luego "deja" la función y ejecuta el resto del código. > > 2. El problema con el ejemplo es que la función se define * después de * que se realiza la llamada a la función. Python > > por lo tanto no entiende la llamada a la función.
uk: > > Поясніть, чому два рядки виводу з’явилися в такому порядку. > > Що не так у цьому прикладі? > ~~~ > result = print_date(1871,3,19) > > def print_date(year, month, day): > joined = str(year) + '/' + str(month) + '/' + str(day) > print(joined) > ~~~ > {: .language-python} > > > ## Рішення > > > > 1. Перший рядок виводу (`1871/3/19`) є результатом функції друку всередині `print_date()`, тоді як другий рядок > > з функції друку під викликом функції. Весь код всередині `print_date()` виконується спочатку, а потім > > програма "залишає" функцію та виконує решту коду. > > 2. Проблема з прикладом полягає в тому, що функція визначається *після* виклику функції. Тому Python > > не розуміє виклик функції.

source: > ## Encapsulation
es: > ## Encapsulamiento
uk: > ## Інкапсуляція

source: > > Fill in the blanks to create a function that takes a single filename as an argument, > loads the data in the file named by the argument, > and returns the minimum value in that data. > > ~~~ > import pandas as pd > > def min_in_data(____): > data = ____ > return ____ > ~~~ > {: .language-python} > > ## Solution > > > > ~~~ > > import pandas as pd > > > > def min_in_data(filename): > > data = pd.read_csv(filename) > > return data.min() > > ~~~ > > {: .language-python}
es: > > Completa los espacios en blanco para crear una función que tome un nombre de archivo como argumento, > cargue los datos de ese archivo pasado como argumento, > y devuelva el mínimo valor de esos datos. > > ~~~ > import pandas as pd > > def min_in_data(____): > data = ____ > return ____ > ~~~ > {: .language-python} > > ## Solución > > > > ~~~ > > import pandas as pd > > > > def min_in_data(filename): > > data = pd.read_csv(filename) > > return data.min() > > ~~~ > > {: .language-python}
uk: > > Заповніть порожні поля, щоб створити функцію, яка приймає одне ім’я файлу як аргумент, > завантажує дані у файл, названий аргументом, > і повертає мінімальне значення цих даних. > > ~~~ > import pandas as pd > > def min_in_data(____): > data = ____ > return ____ > ~~~ > {: .language-python} > > ## Рішення > > > > ~~~ > > import pandas as pd > > > > def min_in_data(filename): > > data = pd.read_csv(filename) > > return data.min() > > ~~~ > > {: .language-python}

source: > ## Find the First
es: > ## Encuentra el primero
uk: > ## Знайди Перший

source: > > Fill in the blanks to create a function that takes a list of numbers as an argument > and returns the first negative value in the list. > What does your function do if the list is empty? > > ~~~ > def first_negative(values): > for v in ____: > if ____: > return ____ > ~~~ > {: .language-python} > > ## Solution > > > > ~~~ > > def first_negative(values): > > for v in values: > > if v<0: > > return v > > ~~~ > > {: .language-python} > > If an empty list is passed to this function, it returns `None`: > > ~~~ > > my_list = [] > > print(first_negative(my_list)) > > ~~~ > > {: .language-python} > > ~~~ > > None > > ~~~ > > {: .output}
es: > > Completa los espacios en blanco para crear una función que tome una lista de números como argumento > y devuelva el primer valor negativo en la lista. > ¿Qué hace su función si la lista está vacía? > > ~~~ > def first_negative(valores): > for v in ____: > if ____: > return ____ > ~~~ > {: .language-python} > > ## Solution > > > > ~~~ > > def first_negative(valores): > > for v in valores: > > if v<0: > > return v > > ~~~ > > {: .language-python} > > Si se pasa una lista vacía a esta función, devuelve `None`: > > ~~~ > > my_list = [] > > print(first_negative(my_list)) > > ~~~ > > {: .language-python} > > ~~~ > > None > > ~~~ > > {: .output}
uk: > > Заповніть порожні поля, щоб створити функцію, яка приймає список чисел як аргумент > і повертає перше від’ємне значення в списку. > Що робить ваша функція, якщо список порожній? > > ~~~ > def first_negative(values): > for v in ____: > if ____: > return ____ > ~~~ > {: .language-python} > > ## Рішення > > > > ~~~ > > def first_negative(values): > > for v in values: > > if v<0: > > return v > > ~~~ > > {: .language-python} > > Якщо цій функції передається порожній список, вона повертає `None`: > > ~~~ > > my_list = [] > > print(first_negative(my_list)) > > ~~~ > > {: .language-python} > > ~~~ > > None > > ~~~ > > {: .output}

source: > ## Calling by Name
es: > ## Llamando por nombre
uk: > ## Виклик по імені
