Repository: carpentries-i18n/i18n
Catalog: po/r-intro-geospatial.*.po
Languages: es

source: --- # Please do not edit this file directly; it is auto generated. # Instead, please edit 07-plot-ggplot2.md in _episodes_rmd/ title: Introduction to Visualization teaching: 20 exercises: 15 questions: - "What are the basics of creating graphics in R?" objectives: - "To be able to use ggplot2 to generate histograms and bar plots." - "To apply geometry and aesthetic layers to a ggplot plot." - "To manipulate the aesthetics of a plot using different colors and position parameters." keypoints: - "Use `ggplot2` to create plots." - "Think about graphics in layers: aesthetics, geometry, etc." source: Rmd ---
es: --- # Please do not edit this file directly; it is auto generated. # Instead, please edit 07-plot-ggplot2.md in _episodes_rmd/ title: Introducción a la Visualización teaching: 20 exercises: 15 questions: - "¿Cuáles son los aspectos básicos para crear gráficos en R?" objectives: - "Ser capaz de usar `ggplot2` para generar histogramas y gráficos de barras." - "Aplicar capas geométricas y estéticas a un gráfico de ggplot." - "Manipular la estética de un gráfico usando diferentes colores y parámetros de posición." keypoints: - "Usar `ggplot2` para crear gráficos." - "Pensar los gráficos en capas: estética, geometría, etc." source: Rmd ---

source: Plotting our data is one of the best ways to quickly explore it and the various relationships between variables. There are three main plotting systems in R, the [base plotting system](http://www.statmethods.net/graphs/), the [lattice](http://www.statmethods.net/advgraphs/trellis.html) package, and the [ggplot2](http://www.statmethods.net/advgraphs/ggplot2.html) package. Today and tomorrow we'll be learning about the ggplot2 package, because it is the most effective for creating publication quality graphics. In this episode, we will introduce the key features of a ggplot and make a few example plots. We will expand on these concepts and see how they apply to geospatial data types when we start working with geospatial data in the [R for Raster and Vector Data](https://datacarpentry.org/r-raster-vector-geospatial/) lesson.
es: Graficar nuestros datos es una de las mejores formas de explorarlos de manera rápida y ver relaciones entre diferentes variables. Hay tres sistemas principales para gráficos en R, el [sistema base de gráficos](http://www.statmethods.net/graphs/), el paquete [lattice](http://www.statmethods.net/advgraphs/trellis.html), y el paquete [ggplot2](http://www.statmethods.net/advgraphs/ggplot2.html). Hoy y mañana aprenderemos acerca del paquete ggplot2, ya que es el más efectivo para crear gráficos con calidad de publicación. En este episodio, vamos a introducir los aspectos claves de ggplot y haremos algunos gráficos de ejemplo. Ampliaremos estos conceptos y veremos cómo se aplican a datos geoespaciales cuando comencemos a trabajar con datos geoespaciales en la lección [R para datos Ráster y Vectoriales](https://datacarpentry.org/r-raster-vector-geospatial/).

source: ggplot2 is built on the grammar of graphics, the idea that any plot can be expressed from the same set of components: a **data** set, a **coordinate system**, and a set of **geoms**--the visual representation of data points. The key to understanding ggplot2 is thinking about a figure in layers. This idea may be familiar to you if you have used image editing programs like Photoshop, Illustrator, or Inkscape. In this episode we will focus on two geoms - histograms and bar plot. In the [R for Raster and Vector Data](https://datacarpentry.org/r-raster-vector-geospatial/) lesson we will work with a number of other geometries and learn how to customize our plots.
es: ggplot2 está basado en la gramática de gráficos, la idea de que cualquier gráfico se puede expresar a partir del mismo conjunto de componentes: un conjunto de **datos**, un **sistema de coordenadas** , y un conjunto de **geoms**--la representación visual de los puntos de datos. La clave para entender ggplot2 es pensar una figura como un conjunto de capas. Esta idea puede ser familiar si has usado programas para edición de imágenes como Photoshop, Illustrator, o Inkscape. En este episodio nos concentraremos en dos geoms - histogramas y gráficos de barras. En la lección [R para Datos Ráster y Vectoriales](https://datacarpentry.org/r-raster-vector-geospatial/) usaremos otros tipos de geoms y aprenderemos como personalizar nuestros gráficos.

source: Let's start off with an example plotting the distribution of life expectancy in our dataset. The first thing we do is call the `ggplot` function. This function lets R know that we're creating a new plot, and any of the arguments we give the `ggplot()` function are the global options for the plot: they apply to all layers on the plot.
es: Empecemos con un ejemplo representando la distribución de la esperanza de vida de nuestro set de datos. Lo primero que vamos hacer es escribir la función `ggplot`. Esta función permite a R saber que estamos creando un nuevo gráfico, y cualquiera de los argumentos que le demos a la función `ggplot` son funciones globales para el gráfico: y se aplicarán a todas las capas del gráfico.

source: We will pass in two arguments to `ggplot`. First, we tell `ggplot` what data we want to show on our figure, in this example we use the gapminder data we read in earlier. For the second argument we pass in the `aes()` function, which tells `ggplot` how variables in the data map to aesthetic properties of the figure. Here we will tell `ggplot` we want to plot the "lifeExp" column of the gapminder data frame on the x-axis. We don't need to specify a y-axis for histograms.
es: Pasaremos dos argumentos a `ggplot`. Primero, le diremos a `ggplot` qué datos queremos mostrar en nuestra figura, en este ejemplo utilizamos los datos de gapminder que leímos antes. Para el segundo argumento pasamos la función `aes ()`, la cual le dice a `ggplot` cómo se mapean las propiedades estéticas con los datos de la figura. Aquí le diremos a `ggplot` que queremos graficar la columna "lifeExp" de la base de datos gapminder en el eje de las x. No necesitamos especificar un eje y para los histogramas.

source: <img src="../fig/rmd-07-lifeExp-vs-gdpPercap-scatter-1.png" title="plot of chunk lifeExp-vs-gdpPercap-scatter" alt="plot of chunk lifeExp-vs-gdpPercap-scatter" width="612" style="display: block; margin: auto;" />
es: <img src="{{ site.baseurl }}/fig/rmd-07-lifeExp-vs-gdpPercap-scatter-1.png" title="plot of chunk lifeExp-vs-gdpPercap-scatter" alt="plot of chunk lifeExp-vs-gdpPercap-scatter" style="display: block; margin: auto;" width="612"/>

source: By itself, the call to `ggplot` isn't enough to draw a figure:
es: Por si misma, la llamada a `ggplot` no es suficiente para graficar una figura:

source: <img src="../fig/rmd-07-blank-plot-1.png" title="plot of chunk blank-plot" alt="plot of chunk blank-plot" width="612" style="display: block; margin: auto;" />
es: <img src="{{ site.baseurl }}/fig/rmd-07-blank-plot-1.png" title="plot of chunk blank-plot" alt="plot of chunk blank-plot" style="display: block; margin: auto;" width="612"/>

source: We need to tell `ggplot` how we want to visually represent the data, which we do by adding a geom layer. In our example, we used `geom_histogram()`, which tells `ggplot` we want to visually represent the distribution of one variable (in our case "lifeExp"):
es: Necesitamos decirle a `ggplot` cómo queremos representar visualmente los datos, lo cual hacemos al agregar capas de geom. En nuestro ejemplo, utilizamos `geom_histogram()`, la cual le dice a `ggplot` que queremos representar visualmente la distribución de una variable (en nuestro caso "lifeExp"):

source: <img src="../fig/rmd-07-lifeExp-vs-gdpPercap-scatter2-1.png" title="plot of chunk lifeExp-vs-gdpPercap-scatter2" alt="plot of chunk lifeExp-vs-gdpPercap-scatter2" width="612" style="display: block; margin: auto;" />
es: <img src="{{ site.baseurl }}/fig/rmd-07-lifeExp-vs-gdpPercap-scatter2-1.png" title="plot of chunk lifeExp-vs-gdpPercap-scatter2" alt="plot of chunk lifeExp-vs-gdpPercap-scatter2" style="display: block; margin: auto;" width="612"/>

source: > > Modify the example so that the figure shows the > distribution of gdp per capita, rather than life > expectancy: > > > ## Solution to challenge 1 > > > > > > ~~~ > > ggplot(data = gapminder, aes(x = gdpPercap)) + > > geom_histogram() > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > `stat_bin()` using `bins = 30`. Pick better value with `binwidth`. > > ~~~ > > {: .output} > > > > <img src="../fig/rmd-07-ch1-sol-1.png" title="plot of chunk ch1-sol" alt="plot of chunk ch1-sol" width="612" style="display: block; margin: auto;" />
es: > > Modifica el ejemplo para que la figura muestre la > distribución del pib per capita, en lugar de la expectativa > de vida: > > > ## Solución al desafío 1 > > > > > > ~~~ > > ggplot(data = gapminder, aes(x = gdpPercap)) + > > geom_histogram() > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > `stat_bin()` using `bins = 30`. Pick better value with `binwidth`. > > ~~~ > > {: .salida} > > > > <img src="{{ site.baseurl }}/fig/rmd-07-ch1-sol-1.png" title="plot of chunk ch1-sol" alt="plot of chunk ch1-sol" style="display: block; margin: auto;" width="612"/>

source: The histogram is a useful tool for visualizing the distribution of a single categorical variable. What if we want to compare the gdp per capita of the countries in our dataset? We can use a bar (or column) plot. To simplify our plot, let's look at data only from the most recent year and only from countries in the Americas.
es: Los histogramas son una herramienta útil para visualizar la distribución de una variable categórica. ¿Qué pasa si queremos comparar el PIB per cápita de los países en nuestro conjunto de datos? Podemos usar un gráfico de barras (o columnas). Para simplificar nuestro gráfico, miremos datos del año más reciente y sólo de países en América.

source: This time, we will use the `geom_col()` function as our geometry. We will plot countries on the x-axis (listed in alphabetic order by default) and gdp per capita on the y-axis.
es: Esta vez, utilizaremos la función `geom_col()` como nuestra geometría. Trazaremos los países en el eje x (enumerados en orden alfabético por defecto) y pib per cápita en el eje y.

source: With this many bars plotted, it's impossible to read all of the x-axis labels. A quick fix to this is the add the `coord_flip()` function to the end of our plot code.
es: Con muchas barras representadas, es imposible leer todas las etiquetas del eje x. Una solución rápida es añadir la función `coord_flip()` al final del código de nuestro gráfico

source: There are more sophisticated ways of modifying axis labels. We will be learning some of those methods later in this workshop.
es: Hay formas más sofisticadas de modificar el nombre de los ejes. Aprenderemos algunos de esos métodos más adelante en este taller.

source: > > In the previous examples and challenge we've used the `aes` function to tell > the `geom_histogram()` and `geom_col()` functions which columns > of the > data set to plot. > Another aesthetic property we can modify is the > color. Create a new bar (column) plot showing the gdp per capita > of all countries in the Americas for the years 1952 and 2007, > color coded by year. > > > ## Solution to challenge 2 > > > > First we create a new object with > > our filtered data: > > > > > > ~~~ > > gapminder_small_2 <- gapminder %>% > > filter(continent == "Americas", > > year %in% c(1952, 2007)) > > ~~~ > > {: .language-r} > > > > Then we plot that data using the `geom_col()` > > geom function. We color bars using the `fill` > > parameter within the `aes()` function. > > Since there are multiple bars for each > > country, we use the `position` parameter > > to "dodge" them so they appear side-by-side. > > The default behavior for `postion` in `geom_col()` > > is "stack". > > > > > > ~~~ > > ggplot(gapminder_small_2, > > aes(x = country, y = gdpPercap, > > fill = as.factor(year))) + > > geom_col(position = "dodge") + > > coord_flip() > > ~~~ > > {: .language-r} > > > > <img src="../fig/rmd-07-gpd-per-cap-1.png" title="plot of chunk gpd-per-cap" alt="plot of chunk gpd-per-cap" width="612" style="display: block; margin: auto;" />
es: > > En los ejemplos anteriores y en el desafío hemos utilizado la función `aes` para decirle > a las funciones `geom_histogram()` y `geom_col()` qué columnas > del > conjunto de datos graficar. > Otra propiedad estética que podemos modificar es el > color. Crea un nuevo gráfico de barra (columna) mostrando el gdp per capita > de todos los países de las Américas para los años 1952 y 2007, > codificando el color por año. > > > ## Solución al desafío 2 > > > > Primero creamos un nuevo objeto con > > nuestros datos filtrados: > > > > > > ~~~ > > gapminder_small_2 <- gapminder %>% > > filter(continent == "Americas", > > year %in% c(1952, 2007)) > > ~~~ > > {: .language-r} > > > > Luego graficamos los datos usando la función `geom_col()`. > > Coloreamos las barras usando los parámetros `fill` > > dentro de la función `aes()`. > > Como hay múltiples barras para cada > > país, utilizamos el parámetro `position` > > para "esquivarlas" para que aparezcan lado a lado. > > El comportamiento por defecto para `postion` en `geom_col()` > > es "apilado". > > > > > > ~~~ > > ggplot(gapminder_small_2, > > aes(x = country, y = gdpPercap, > > fill = as.factor(year))) + > > geom_col(position = "dodge") + > > coord_flip() > > ~~~ > > {: .language-r} > > > > <img src="{{ site.baseurl }}/fig/rmd-07-gpd-per-cap-1.png" title="plot of chunk gpd-per-cap" alt="plot of chunk gpd-per-cap" style="display: block; margin: auto;" width="612"/>

source: The examples given here are just the start of creating complex and beautiful graphics with R. In [a later lesson](https://datacarpentry.org/r-raster-vector-geospatial/) we will go into much more depth, including: - plotting geospatial specific data types - adjusting the color scheme of our plots - setting and formatting plot titles, subtitles, and axis labels - creating multi-panel plots - creating point (scatter) and line plots - layering datasets to create multi-layered plots - creating and customizing a plot legend - and much more!
es: Los ejemplos dados aquí son solo el comienzo par crear gráficos complejos y atractivos con R. En [una lección posterior](https://datacarpentry.org/r-raster-vector-geospatial/) entraremos en mayor profundidad, incluyendo: - graficar tipos de datos geoespaciales específicos - ajustar el esquema de colores de nuestros gráficos - configurar y dar formato a títulos, subtítulos y etiquetas de los ejes - crear gráficos de paneles múltiples - crear gráficos de puntos (dispersión) y de líneas - apilar conjuntos de datos para crear gráficos de varias capas - crear y personalizar una leyenda de un gráfico - ¡y mucho más!

source: The examples we've worked through in this episode should give you the building blocks for working with the more complex graphic types and customizations we will be working with in that lesson.
es: Los ejemplos en los que hemos trabajado en este episodio deberían darte las bases para trabajar con tipos de gráficos más complejos y personalizaciones con las que vamos a trabajar en esa lección.

source: --- # Please do not edit this file directly; it is auto generated. # Instead, please edit 08-writing-data.md in _episodes_rmd/ title: Writing Data teaching: 10 exercises: 10 questions: - "How can I save plots and data created in R?" objectives: - "To be able to write out plots and data from R." keypoints: - "Save plots using `ggsave()` or `pdf()` combined with `dev.off()`." - "Use `write.csv` to save tabular data." source: Rmd ---
es: --- #Por favor no edites este archivo directamente; Se genera automáticamente. #En su lugar, por favor, edita 08-writing-data.md en _episodes_rmd/ title: Escribiendo datos teaching: 10 exercises: 10 questions: - "¿Cómo puedo guardar gráficos y datos creados en R?" objectives: - "Poder escribir gráficos y datos en R." keypoints: - "Guardar gráficos con `ggsave()` o `pdf()` combinado con `dev.off()`." - "Usar `write.csv` para guardar datos tabulares." source: Rmd ---

source: ## Saving plots
es: ## Guardando gráficos

source: You can save a plot from within RStudio using the 'Export' button in the 'Plot' window. This will give you the option of saving as a .pdf or as .png, .jpg or other image formats.
es: Puedes guardar un gráfico desde RStudio con el botón '**Export**' en la ventana '**Plot**'. Esto te dará la opción de guardar como .pdf o como .png, .jpg u otros formatos de imagen.

source: Sometimes you will want to save plots without creating them in the 'Plot' window first. Perhaps you want to make a pdf document with multiple pages: each one a different plot, for example. Or perhaps you're looping through multiple subsets of a file, plotting data from each subset, and you want to save each plot. In this case you can use a more flexible approach. The `pdf()` function creates a new pdf device. You can control the size and resolution using the arguments to this function.
es: A veces querrás guardar gráficos sin crearlos en la ventana '**Plot**' primero. Quizás quieras hacer un documento pdf con múltiples páginas: cada una con un gráfico diferente, por ejemplo. O quizás estás recorriendo múltiples subconjuntos de un archivo, graficando datos de cada subconjunto y deseas guardar cada gráfico. En este caso, puedes utilizar un enfoque más flexible. La función `pdf ()` crea un nuevo dispositivo pdf. Puedes controlar el tamaño y la resolución usando los argumentos de esta función.

source: ~~~ pdf("Distribution-of-gdpPercap.pdf", width=12, height=4) ggplot(data = gapminder, aes(x = gdpPercap)) + geom_histogram() # You then have to make sure to turn off the pdf device! dev.off() ~~~
es: ~~~ pdf("Distribution-of-gdpPercap.pdf", width=12, height=4) ggplot(data = gapminder, aes(x = gdpPercap)) + geom_histogram() # ¡Debes asegurarte de apagar el dispositivo pdf! dev.off() ~~~

source: Open up this document and have a look.
es: Abre este documento y échale un vistazo.

source: > > Rewrite your 'pdf' command to print a second > page in the pdf, showing the side-by-side bar > plot of gdp per capita in countries in the Americas > in the years 1952 and 2007 that you created in the > previous episode. > > > ## Solution to challenge 1 > > > > > > ~~~ > > pdf("Distribution-of-gdpPercap.pdf", width = 12, height = 4) > > ggplot(data = gapminder, aes(x = gdpPercap)) + > > geom_histogram() > > > > ggplot(data = gapminder_small_2, aes(x = country, y = gdpPercap, fill = as.factor(year))) + > > geom_col(position = "dodge") + coord_flip() > > > > dev.off() > > ~~~ > > {: .language-r}
es: > > Reescribe tu comando 'pdf' para imprimir una segunda > página en el pdf, mostrando el gráfico side-by-side bar > de pib per cápita en países de las Américas > en los años 1952 y 2007 que creaste en el > episodio previo. > > > ## Solución al desafío 1 > > > > > > ~~~ > > pdf("Distribution-of-gdpPercap.pdf", width = 12, height = 4) > > ggplot(data = gapminder, aes(x = gdpPercap)) + > > geom_histogram() > > > > ggplot(data = gapminder_small_2, aes(x = country, y = gdpPercap, fill = as.factor(year))) + > > geom_col(position = "dodge") + coord_flip() > > > > dev.off() > > ~~~ > > {: .language-r}

source: The commands `jpeg`, `png` etc. are used similarly to produce documents in different formats.
es: Los comandos `jpeg`, `png`, etc. se usan de manera similar para producir documentos en diferentes formatos.

source: ## Writing data
es: ## Escribiendo datos

source: At some point, you'll also want to write out data from R.
es: En algún momento, también querrás escribir datos para usarlos fuera de R.

source: We can use the `write.csv` function for this, which is very similar to `read.csv` from before.
es: Podemos usar la función `write.csv` para esto, que es muy similar a `read.csv` que vimos antes.

source: Let's create a data-cleaning script, for this analysis, we only want to focus on the gapminder data for Australia:
es: Vamos a crear un script de limpieza de datos, para este análisis, sólo queremos centrarnos en los datos de gapminder para Australia:

source: Let's open the file to make sure it contains the data we expect. Navigate to your `cleaned-data` directory and double-click the file name. It will open using your computer's default for opening files with a `.csv` extension. To open in a specific application, right click and select the application. Using a spreadsheet program (like Excel) to open this file shows us that we do have properly formatted data including only the data points from Australia. However, there are row numbers associated with the data that are not useful to us (they refer to the row numbers from the gapminder data frame).
es: Abrimos el archivo para asegurarnos de que contiene los datos que esperamos. Navega a tu directorio **`cleaned-data`** y haz doble clic en el nombre del archivo. Se abrirá usando el programa que está configurado por defecto en tu computadora para abrir archivos con extensión `.csv`. Para abrir en una aplicación específica, haz clic derecho y selecciona la aplicación.Usando un programa de hoja de cálculo (como Excel) para abrir este archivo nos muestra que tenemos datos con el formato correcto incluyendo solo los datos de Australia. Sin embargo, hay números de fila asociados con los datos que no nos son útiles (se refieren a los números de fila del conjunto de datos **gapminder**).

source: Let's look at the help file to work out how to change this behaviour.
es: Veamos el archivo de ayuda para averiguar cómo cambiar este comportamiento.

source: By default R will write out the row and column names when writing data to a file. To over write this behavior, we can do the following:
es: Por defecto, R escribirá la fila y los nombres de las columnas al escribir datos en un archivo. Para cambiar este comportamiento, podemos hacer lo siguiente:

source: > > Subset the gapminder > data to include only data points collected since 1990. Write out the new subset to a file > in the `cleaned-data/` directory. > > > ## Solution to challenge 2 > > > > > > ~~~ > > gapminder_after_1990 <- filter(gapminder, year > 1990) > > > > write.csv(gapminder_after_1990, > > file = "cleaned-data/gapminder-after-1990.csv", > > row.names = FALSE) > > ~~~ > > {: .language-r}
es: > Filtra los datos de gapminder > para incluir solo los datos que se recolectaron desde 1990. Escribe el nuevo subconjunto en un > archivo en el directorio **`clean-data/`**. > > > ## Solución al desafío 2 > > > > > > ~~~ > > gapminder_after_1990 <- filter(gapminder, year > 1990) > > > > write.csv(gapminder_after_1990, > > file = "cleaned-data/gapminder-after-1990.csv", > > row.names = FALSE) > > ~~~ > > {: .language-r}

source: --- layout: page title: About ---
es: --- layout: page title: Acerca de ---

source: --- layout: page title: Discussion ---
es: --- layout: page title: Discusión ---

source: Please see [our other R lesson][r-gap] for a different and more detailed presentation of these concepts.
es: Consulta [nuestra otra lección de R][r-gap] para obtener una presentación diferente y más detallada de estos conceptos.

source: --- title: Figures ---
es: --- title: Figuras ---

source: {% comment %} Create anchor for each one of the episodes. {% endcomment %} {% for episode in site.episodes %} <article id="{{ episode.url }}" class="figures"></article> {% endfor %}
es: {% comment %} Crear un ancla para cada uno de los episodios {% endcomment %} {% for episode in site.episodes %} <article id="{{ episode.url }}" class="figures"></article> {% endfor %}

source: --- layout: page title: "Instructor Notes" ---
es: --- layout: page title: "Notas del Instructor" ---

source: ## Instructor notes
es: ## Notas del instructor
