Repository: carpentries-i18n/i18n
Catalog: po/r-intro-geospatial.*.po
Languages: es

source: > > Run the code from the previous challenge, and write a command to > compare mass to age. Is mass larger than age? > > > ## Solution to challenge 2 > > > > One way of answering this question in R is to use the `>` to set up the following: > > > > ~~~ > > mass > age > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > [1] TRUE > > ~~~ > > {: .output} > > This should yield a boolean value of TRUE since 109.25 is greater than 102.
es: > > Ejecuta el código del desafío anterior y escribe un comando para > comparar la masa con la edad. ¿La masa es mayor que la edad? > > > ## Solución al desafío 2 > > > > Una forma de responder a esta pregunta en R es usar el `>` para configurar lo siguiente: > > > > ~~~ > > mass > age > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > [1] TRUE > > ~~~ > > {: .output} > > Esto debería producir un valor booleano de VERDADERO (TRUE) ya que 109.25 es más grande que 102.

source: Variable names can contain letters, numbers, underscores and periods. They cannot start with a number nor contain spaces at all. Different people use different conventions for long variable names, these include
es: Los nombres de las variables pueden contener letras, números, guiones bajos y puntos. Ellos no puede comenzar con un número ni contener espacios en absoluto. Diferentes personas usan diferentes convenciones para nombres de variables largos, estas incluyen

source: * periods.between.words
es: * puntos.entre.palabras

source: * underscores\_between_words
es: * guiones_ bajos\ _entre_palabras

source: * camelCaseToSeparateWords
es: * CamelCaseParaSepararPalabras

source: What you use is up to you, but **be consistent**.
es: Lo que uses depende de ti, pero **debes ser consistente**.

source: It is also possible to use the `=` operator for assignment:
es: También es posible utilizar el operador `=` para la asignación:

source: But this is much less common among R users. The most important thing is to **be consistent** with the operator you use. There are occasionally places where it is less confusing to use `<-` than `=`, and it is the most common symbol used in the community. So the recommendation is to use `<-`.
es: Pero esto es mucho menos común entre los usuarios de R. Lo mas importante es **Ser consistennte** con el operador que uses. Ocasionalmente hay lugares donde es menos confuso usar `<-` que` = `, y este es el símbolo más común en la comunidad. Entonces la recomendación es usar `<-`.

source: > ## Challenge 3
es: > ## Desafío 3

source: > > Which of the following are valid R variable names? > > ~~~ > min_height > max.height > _age > .mass > MaxLength > min-length > 2widths > celsius2kelvin > ~~~ > {: .language-r} > > > ## Solution to challenge 3 > > > > The following can be used as R variables: > > > > ~~~ > > min_height > > max.height > > MaxLength > > celsius2kelvin > > ~~~ > > {: .language-r} > > > > The following creates a hidden variable: > > > > ~~~ > > .mass > > ~~~ > > {: .language-r} > > > > We won't be discussing hidden variables in this lesson. We recommend not using a period at the > > beginning of variable names unless you intend your variables to be hidden. > > > > The following will not be able to be used to create a variable > > > > ~~~ > > _age > > min-length > > 2widths > > ~~~ > > {: .language-r}
es: > > ¿Cuáles de los siguientes son nombres de variables válidos en R? > > ~~~ > min_height > max.height > _age > .mass > MaxLength > min-length > 2widths > celsius2kelvin > ~~~ > {: .language-r} > > > ## Solución al desafío 3 > > > > Los siguientes nombres pueden estar usados para variables en R: > > > > ~~~ > > min_height > > max.height > > MaxLength > > celsius2kelvin > > ~~~ > > {: .language-r} > > > > Lo siguiente crea una variable oculta: > > > > ~~~ > > .mass > > ~~~ > > {: .language-r} > > > > No discutiremos las variables ocultas en esta lección. Recomendamos no utilizar un punto en el > > comienzo de los nombres de las variables a menos que desee ocultar sus variables. > > > > Los siguientes nombres no se podrán utilizar para crear una variable > > > > ~~~ > > _age > > min-length > > 2widths > > ~~~ > > {: .language-r}

source: --- # Please do not edit this file directly; it is auto generated. # Instead, please edit 02-project-intro.md in _episodes_rmd/ title: "Project Management With RStudio" teaching: 10 exercises: 5 questions: - "How can I manage my projects in R?" objectives: - Create self-contained projects in RStudio keypoints: - "Use RStudio to create and manage projects with consistent layout." - "Treat raw data as read-only." - "Treat generated output as disposable." source: Rmd ---
es: --- # Por favor no edites este archivo directamente; es autogenerado. # en su lugar, porfavor edita el epidosio 02-project-intro.md en _episodes_rmd/ title: "Gestión de proyectos con RStudio" teaching: 10 exercises: 5 questions: - "¿Cómo puedo manejar mis proyectos en RStudio?" objectives: - Crear proyectos en RStudio keypoints: - "Usa RStudio para crear y manejar proyectos de una manera consistente." - "Trata los datos originales sólo para lectura." - "Trata los resultados generados como salida desechable." source: Rmd ---

source: ## Introduction
es: ## Introducción

source: The scientific process is naturally incremental, and many projects start life as random notes, some code, then a manuscript, and eventually everything is a bit mixed together. Organising a project involving spatial data is no different from any other data analysis project, although you may require more disk space than usual.
es: El proceso científico es naturalmente incremental, y muchos proyectos comienzan la vida como notas al azar, algo de código, luego un manuscrito, y eventualmente todo estará un poco mezclado. Organizar un proyecto que involucra datos espaciales no es diferente de cualquier otro proyecto de análisis de datos, aunque puede requerir más espacio en disco que lo usual.

source: <div class="text-center"> <blockquote class="twitter-tweet"><p>Managing your projects in a reproducible fashion doesn't just make your science reproducible, it makes your life easier.</p>— Vince Buffalo (@vsbuffalo) <a href="https://twitter.com/vsbuffalo/status/323638476153167872">April 15, 2013</a></blockquote> <script async src="//platform.twitter.com/widgets.js" charset="utf-8"></script> </div>
es: <div class="text-center"> <blockquote class="twitter-tweet"><p> Gestionar los proyectos de manera reproducible no sólo hace que la ciencia sea reproducible, sino que te facilita la vida.</p>— Vince Buffalo (@vsbuffalo) <a href="https://twitter.com/vsbuffalo/status/323638476153167872">April 15, 2013</a></blockquote> <script async src="//platform.twitter.com/widgets.js" charset="utf-8"></script> </div>

source: Most people tend to organize their projects like this:
es: Algunas personas organizan sus proyectos así:

source: ![](../fig/bad_layout.png)
es: ![]({{ site.baseurl }}/fig/bad_layout.png)

source: There are many reasons why we should *ALWAYS* avoid this:
es: Hay muchas razones por las que *SIEMPRE* debemos evitar esto:

source: 1. It is really hard to tell which version of your data is
es: 1. Es difícil saber qué versión de tus datos es

source: the original and which is the modified; 2. It gets really messy because it mixes files with various extensions together; 3. It probably takes you a lot of time to actually find things, and relate the correct figures to the exact code that has been used to generate it;
es: la original y cuál es la modificada; 2. Está desorganizado porque mezcla archivos con varias extensiones juntas; 3. Se necesita más tiempo para encontrar cosas y para encontrar el código que se utilizó para generar las figuras.

source: A good project layout will ultimately make your life easier:
es: Un buen diseño de proyecto hará tu vida más fácil:

source: * It will help ensure the integrity of your data;
es: * Ayudará a garantizar la integridad de tus datos;

source: * It makes it simpler to share your code with someone else
es: * Facilita compartir tu código con otra persona

source: (a lab-mate, collaborator, or supervisor); * It allows you to easily upload your code with your manuscript submission; * It makes it easier to pick the project back up after a break.
es: (un compañero de laboratorio, colaborador o supervisor); * Te permite subir fácilmente tu código cuando envías tu manuscrito; * Facilita la volver al proyecto después de un descanso.

source: ## A possible solution
es: ## Una solución posible

source: Fortunately, there are tools and packages which can help you manage your work effectively.
es: Afortunadamente, existen herramientas y paquetes que pueden ayudarte a administrar su trabajo de manera efectiva.

source: One of the most powerful and useful aspects of RStudio is its project management functionality. We'll be using this today to create a self-contained, reproducible project.
es: Uno de los aspectos más potentes y útiles de RStudio es su funcionalidad para gestión de proyectos. Usaremos esto hoy para crear un proyecto autocontenido, reproducible.

source: > ## Challenge: Creating a self-contained project
es: > ## Desafío: Crear un proyecto autocontenido

source: > > We're going to create a new project in RStudio: > > 1. Click the "File" menu button, then "New Project". > 2. Click "New Directory". > 3. Click "Empty Project". > 4. Type in "r-geospatial" as the name of the directory. > 5. Click the "Create Project" button.
es: > > Vamos a crear un nuevo proyecto en RStudio: > > 1. Dale clic en el botón de menú "Archivo", luego en "Nuevo proyecto". > 2. Dale clic en "Nuevo directorio". > 3. Dale clic en "Proyecto vacío". > 4. Escribe "r-geoespacial" como el nombre del directorio. > 5. Dale clic en el botón "Crear proyecto".

source: A key advantage of an RStudio Project is that whenever we open this project in subsequent RStudio sessions our working directory will *always* be set to the folder `r-geospatial`. Let's check our working directory by entering the following into the R console:
es: Una ventaja clave de un proyecto en RStudio es que cada vez que abrimos este proyecto en sesiones posteriores de RStudio nuestro directorio de trabajo *siempre* se establecerá en la misma carpeta, por ejemplo la que creamos `r-geoespacial`. Verifiquemos nuestro directorio de trabajo ingresando lo siguiente en la consola de R:

source: R should return `your/path/r-geospatial` as the working directory.
es: R retornará `your/path/r-geospatial` como el directorio de trabajo.

source: ## Best practices for project organization
es: ## Buenas prácticas para la organización del proyecto

source: Although there is no "best" way to lay out a project, there are some general principles to adhere to that will make project management easier:
es: Aunque no hay una "mejor" manera de diseñar un proyecto, hay algunos principios a seguir que harán que la gestión del proyecto sea más fácil:

source: ### Treat data as read only
es: ### Tratar los datos como sólo lectura

source: This is probably the most important goal of setting up a project. Data is typically time consuming and/or expensive to collect. Working with them interactively (e.g., in Excel) where they can be modified means you are never sure of where the data came from, or how it has been modified since collection. It is therefore a good idea to treat your data as "read-only".
es: Este es probablemente el objetivo más importante de establecer un proyecto. Collectar datos normalmente requiere mucho tiempo y / o es costoso. Trabajajando con datos interactivamente (por ejemplo, en Excel) te permite modificar los datos todo el tiempo y significa que nunca estás segura de dónde provienen los datos o cómo se han modificado desde la recopilación. Por lo tanto, es una buena idea tratar tus datos como "sólo lectura".

source: ### Data Cleaning
es: ### Limpiando datos

source: In many cases your data will be "dirty": it will need significant preprocessing to get into a format R (or any other programming language) will find useful. This task is sometimes called "data munging". I find it useful to store these scripts in a separate folder, and create a second "read-only" data folder to hold the "cleaned" data sets.
es: En muchos casos, tus datos estarán "desordenados": y necesitarán un preprocesamiento para obtener un formato para R (o cualquier otro lenguaje de programación). Esta tarea a veces se denomina "limpiar datos". Resulta útil guardar estos pasos en una carpeta separada llamada `scripts` y crear una segunda carpeta de `datos_limpios` "de solo lectura" para guardar el conjuntos de datos "limpios".

source: ### Treat generated output as disposable
es: ### Trata los resultados generados como salida desechable

source: Anything generated by your scripts should be treated as disposable: it should all be able to be regenerated from your scripts.
es: Cualquier cosa generada por tus scripts debe tratarse como desechable: los resultados deberán poderse regenerarse a partir de tus scripts.

source: There are lots of different ways to manage this output. I find it useful to have an output folder with different sub-directories for each separate analysis. This makes it easier later, as many of my analyses are exploratory and don't end up being used in the final project, and some of the analyses get shared between projects.
es: Hay muchas formas diferentes de administrar las salida. Me parece útil tener una carpeta de salida con diferentes subdirectorios para cada análisis por separado. Esto lo hace más fácil luego, ya que muchos de mis análisis son exploratorios. y talvés no terminan siendo utilizados en el proyecto final, y algunos de los análisis se pueden compartir entre otros proyectos.

source: ### Keep related data together
es: ### Mantiene los datos relacionados juntos

source: Some GIS file formats are really 3-6 files that need to be kept together and have the same name, e.g. shapefiles. It may be tempting to store those components separately, but your spatial data will be unusable if you do that.
es: Los formatos de los archivos GIS son realmente 3-6 archivos que necesitan ser mantenidos juntos y tener el mismo nombre, por ejemplo, los **shapefiles**. Sería tentador almacenar estos componentes de forma separada, pero tus datos espaciales se volverán inútiles si haces eso.

source: ### Keep a consistent naming scheme
es: ### Manten un esquema de nombres consistente

source: It is generally best to avoid renaming downloaded spatial data, so that a clear connection is maintained with the point of truth. You may otherwise find yourself wondering whether `file_A` really is just a copy of `Official_file_on_website` or not.
es: Es generalmente mejor evitar renombrar los datos espaciales descargados para que se mantenga una clara conexión con el punto de origen. De otra forma te encontrarás preguntándote si `file_A` realmente es sólo una copia del `archivo_oficial de_la_pagina_web` o no.

source: For datasets you generate, it's worth taking the time to come up with a naming convention that works for your project, and sticking to it. File names don't have to be long, they just have to be long enough that you can tell what the file is about. Date generated, topic, and whether a product is intermediate or final are good bits of information to keep in a file name. For more tips on naming files, check out [the slides from Jenny Bryan's talk "Naming things" at the 2015 Reproducible Science Workshop](https://speakerdeck.com/jennybc/how-to-name-files).
es: Para los conjuntos de datos que tu generes, vale la pena tomarse el tiempo para crear una convención de nombres que funcione para tu proyecto, y apegarse a eso. Los nombres de los archivos no tienen que ser largos, solo tienen que ser lo suficientemente largos para que puedas saber cuál es el archivo. La fecha de generación, el tema y si un producto es intermedio o final son buenos datos para mantener en un nombre de archivo. Para obtener más consejos sobre cómo nombrar archivos, consulta [las diapositivas de la charla de Jenny Bryan "Naming things" del 2015 Reproducible Science Workshop](https://speakerdeck.com/jennybc/how-to-name-files) en inglés.

source: > ## Tip: Good Enough Practices for Scientific Computing
es: > ## Sugerencia: Buenas prácticas para la computación científica

source: > > [Good Enough Practices for Scientific Computing](https://github.com/swcarpentry/good-enough-practices-in-scientific-computing/blob/gh-pages/good-enough-practices-for-scientific-computing.pdf) gives the following recommendations for project organization: > > 1. Put each project in its own directory, which is named after the project. > 2. Put text documents associated with the project in the `doc` directory. > 3. Put raw data and metadata in the `data` directory, and files generated during cleanup and analysis in a `results` directory. > 4. Put source for the project's scripts and programs in the `src` directory, and programs brought in from elsewhere or compiled locally in the `bin` directory. > 5. Name all files to reflect their content or function.
es: > > [Buenas prácticas para computación científica](https://github.com/swcarpentry/good-enough-practices-in-scientific-computing/blob/gh-pages/good-enough-practices-for-scientific-computing. pdf) da las siguientes recomendaciones para la organización del proyecto: > > 1. Coloca cada proyecto en su propio directorio, que lleva el nombre del proyecto. > 2. Coloca los documentos de texto asociados con el proyecto en el directorio `doc`. > 3. Coloca los datos sin procesar y los metadatos en el directorio `datos`, y los archivos generados durante la limpieza y el análisis en un directorio `resultados`. > 4. Pon la fuente de los scripts y programas del proyecto en el directorio `src`, y los programas traídos de otro lugar o compilados localmente en el directorio `bin`. > 5. Nombra todos los archivos para reflejar su contenido o función.

source: ### Save the data in the data directory
es: ### Guarde los datos en el directorio de datos

source: Now we have a good directory structure we will now place/save our data files in the `data/` directory.
es: Ahora que tenemos una buena estructura para el proyecto, guardaremos nuestros archivos de datos en el directorio `datos/`.

source: > 1\. Download each of the data files listed below (CTRL + S, right mouse click -> "Save as", or File -> "Save page as")
es: > 1 \. Descarga cada uno de los archivos de datos enumerados a continuación (<kbd>Ctrl</kbd>+<kbd>S</kbd>, haz clic con el botón derecho del ratón -> "Guardar como" o Archivo -> "Guardar página como")

source: > - [nordic country data](https://raw.githubusercontent.com/datacarpentry/r-intro-geospatial/master/_episodes_rmd/data/nordic-data.csv)
es: > - [datos de los países nórdicos](https://raw.githubusercontent.com/datacarpentry/r-intro-geospatial/master/_episodes_rmd/data/nordic-data.csv)

source: > - [nordic country data (version 2)](https://raw.githubusercontent.com/datacarpentry/r-intro-geospatial/master/_episodes_rmd/data/nordic-data-2.csv)
es: > - [datos de países nórdicos (versión 2)](https://raw.githubusercontent.com/datacarpentry/r-intro-geospatial/master/_episodes_rmd/data/nordic-data-2.csv)

source: > - [gapminder data](https://raw.githubusercontent.com/datacarpentry/r-intro-geospatial/master/_episodes_rmd/data/gapminder_data.csv)
es: > - [datos de gapminder](https://raw.githubusercontent.com/datacarpentry/r-intro-geospatial/master/_episodes_rmd/data/gapminder_data.csv)

source: > 2\. Make sure the files have the following names:
es: > 2\. Asegúrate de que los archivos tengan los siguientes nombres:

source: > > 3\. Save the files in the `data/` folder within your project. > > We will load and inspect these data later.
es: > > 3\. Guarda los archivos en la carpeta `data/` dentro de tu proyecto. > > Cargaremos e inspeccionaremos estos datos más tarde.

source: > We also want to move the data that we downloaded from the [data page](http://datacarpentry.org/geospatial-workshop/data/) into a subdirectory
es: > También queremos mover los datos que descargamos de la [página de datos](http://datacarpentry.org/geospatial-workshop/data/) a un subdirectorio

source: > inside `r-geospatial`. If you haven't already downloaded the data, you can do so by clicking
es: > dentro de `r-geospatial`. Si aún no has descargado los datos, puedes hacerlo haciendo clic en

source: > [this download link](https://ndownloader.figshare.com/articles/2009586/versions/10).
es: > [este enlace de descargar](https://ndownloader.figshare.com/articles/2009586/versions/10).

source: > 1. Move the downloaded zip file to the `data` directory.
es: > 1. Mueve el archivo zip descargado al directorio `data`.

source: > 2. Once the data have been moved, unzip all files.
es: > 2. Una vez que los datos se hayan movido, descomprima todos los archivos.

source: Once you have completed moving the data across to the new folder, your data directory should look as follows:
es: Una vez que hayas terminado de mover los datos a la nueva carpeta, su directorio de datos debe tener el siguiente aspecto:

source: ### Stage your scripts
es: ### Organiza tus scripts por etapas

source: Creating separate R scripts or Rmarkdown documents for different stages of a project will maximise efficiency. For instance, separating data download commands into their own file means that you won't re-download data unnecessarily.
es: Crear scripts de R o documentos Rmarkdown separados para diferentes etapas de un proyecto maximizará la eficiencia. Por ejemplo, separar los comandos de descarga de datos en su propio archivo significa que no se volverán a descargar datos innecesariamente.

source: --- # Please do not edit this file directly; it is auto generated. # Instead, please edit 03-data-structures-part1.md in _episodes_rmd/ title: "Data Structures" teaching: 40 exercises: 15 questions: - "How can I read data in R?" - "What are the basic data types in R?" - "How do I represent categorical information in R?" objectives: - "To be aware of the different types of data." - "To begin exploring data frames, and understand how they are related to vectors, factors and lists." - "To be able to ask questions from R about the type, class, and structure of an object." keypoints: - "Use `read.csv` to read tabular data in R." - "The basic data types in R are double, integer, complex, logical, and character." - "Use factors to represent categories in R." source: Rmd ---
es: --- # Por favor no edites este archivo directamente; este se genera automáticamente. # en su lugar, por favor edita 03-data-structures-part1.md in _episodes_rmd/ title: "Estructura de datos" teaching: 40 exercises: 15 questions: - "¿Cómo puedo leer datos en R?" - "¿Cuáles son los tipos de datos básicos en R?" - "¿Cómo puedo representar información categórica en R?" objectives: - "Conocer los distintos tipos de datos." - "Iniciar a explorar data frames, y entender como están relacionados con los vectores, factores y listas." - "Ser capaz de hacerle preguntas a R sobre el tipo, la clase y la estructura de un objeto." keypoints: - "Usar `read.csv` para leer datos tabulados desde R." - "Los tipos de datos fundamentales en R son dobles, enteros, complejos, lógicos y caracteres." - "Usar factores para representar categorías en R." source: Rmd ---

source: One of R's most powerful features is its ability to deal with tabular data - such as you may already have in a spreadsheet or a CSV file. Let's start by downloading and reading in a file `nordic-data.csv`. We will save this data as an object named `nordic`:
es: Uno de las características más poderosas de R es su capacidad de manejar datos tabulados - como los que tal vez ya tengas en una hoja de cálculo o un archivo CSV. Empecemos por descargar y leer un archivo `nordic-data.csv`. Guardaremos estos datos como un objeto llamado `nordic`:
