Repository: carpentries-i18n/i18n
Catalog: po/r-intro-geospatial.*.po
Languages: es

source: Alternatively, we can change a factor into a character vector; we lose the handy categories of the factor, but we can subsequently add any word we want to the column without babysitting the factor levels:
es: Alternativamente, podemos cambiar un factor a un vector de caracteres; perderemos categorías del factor que son tan prácticas, pero posteriormente podemos agregar cualquier palabra que queramos a la columna sin preocuparnos por los niveles del factor:

source: ## Appending to a data frame
es: ## Agregando a un dataframe

source: The key to remember when adding data to a data frame is that *columns are vectors and rows are lists.* We can also glue two data frames together with `rbind`:
es: Cuando se agregan datos a un dataframe, la clave es recordar que las *columnas son vectores y filas son listas.* También podemos pegar dos dataframes con `rbind`:

source: But now the row names are unnecessarily complicated (not consecutive numbers). We can remove the rownames, and R will automatically re-name them sequentially:
es: Pero ahora los nombres de las filas son innecesariamente complicadas (no son números consecutivos). Podemos eliminar los nombres de las filas, y R automáticamente los renombrará secuencialmente:

source: > > You can create a new data frame right from within R with the following syntax: > > ~~~ > df <- data.frame(id = c("a", "b", "c"), > x = 1:3, > y = c(TRUE, TRUE, FALSE), > stringsAsFactors = FALSE) > ~~~ > {: .language-r} > > Make a data frame that holds the following information for yourself: > > - first name > - last name > - lucky number > > Then use `rbind` to add an entry for the people sitting beside you. Finally, > use `cbind` to add a column with each person's answer to the question, "Is it > time for coffee break?" > > > ## Solution to Challenge 3 > > > > > > ~~~ > > df <- data.frame(first = c("Grace"), > > last = c("Hopper"), > > lucky_number = c(0), > > stringsAsFactors = FALSE) > > df <- rbind(df, list("Marie", "Curie", 238) ) > > df <- cbind(df, coffeetime = c(TRUE, TRUE)) > > ~~~ > > {: .language-r}
es: > > Puedes crear un nuevo dataframe en R con la siguiente sintaxis: > > ~~~ > df <- data.frame(id = c("a", "b", "c"), > x = 1:3, > y = c(TRUE, TRUE, FALSE), > stringsAsFactors = FALSE) > ~~~ > {: .language-r} > > Crea un dataframe que tenga ltu información: > > - nombre > - apellido > - número de la suerte > > Luego usa `rbind` para agregar una entrada para las personas que están cerca tuyo. Por último, > usa `cbind` para agregar una columna con la respuesta de cada persona a la pregunta, "¿Es > hora de ir por un café?" > > > ## Solución al Desafío 3 > > > > > > ~~~ > > df <- data.frame(first = c("Grace"), > > last = c("Rodriguez"), > > lucky_number = c(0), > > stringsAsFactors = FALSE) > > df <- rbind(df, list("Marie", "Curie", 238) ) > > df <- cbind(df, coffeetime = c(TRUE, TRUE)) > > ~~~ > > {: .language-r}

source: --- # Please do not edit this file directly; it is auto generated. # Instead, please edit 05-data-subsetting.md in _episodes_rmd/ title: Subsetting Data teaching: 25 exercises: 10 questions: - "How can I work with subsets of data in R?" objectives: - "To be able to subset vectors and data frames" - "To be able to extract individual and multiple elements: by index, by name, using comparison operations" - "To be able to skip and remove elements from various data structures." keypoints: - "Indexing in R starts at 1, not 0." - "Access individual values by location using `[]`." - "Access slices of data using `[low:high]`." - "Access arbitrary sets of data using `[c(...)]`." - "Use logical operations and logical vectors to access subsets of data." source: Rmd ---
es: --- # Please do not edit this file directly; it is auto generated. # Instead, please edit 05-data-subsetting.md in _episodes_rmd/ title: Subconjunto de Datos teaching: 25 exercises: 10 questions: - "¿Cómo puedo trabajar con subconjuntos de datos en R?" objectives: - "Para poder obtener subconjunos de vectores y data frames" - "Para poder extraer un elemento individual o multiples elementos: por índice, por nombre, usando operadores de comparación" - "Para poder saltear y eliminar elementos de varias estructuras de datos." keypoints: - "El indexado en R empieza en 1, no en 0." - "Accedes a valores individuales por ubicación utilizando `[]`." - "Accedes a porciones de datos utilizando `[bajo:alto]`." - "Accedes a conjuntos de datos arbitrarios utilizando `[c(...)]`." - "Usas operaciones lógicas y vectores lógicos para acceder a subconjuntos de datos." source: Rmd ---

source: R has many powerful subset operators. Mastering them will allow you to easily perform complex operations on any kind of dataset.
es: R tiene muchos operadores poderosos para crear subconjuntos. Dominarlos te permitirá realizar operaciones complejas de manera sencilla en cualquier tipo de dataset.

source: There are six different ways we can subset any kind of object, and three different subsetting operators for the different data structures.
es: Hay 6 formas diferentes que podemos obtener subconjuntos de cualquier tipo de objeto, y tres diferentes operadores de subconjunto para las diferentes estructuras de datos.

source: Let's start with the workhorse of R: a simple numeric vector.
es: Empezaremos con el caballito de batalla de R: un vector numérico simple.

source: > ## Atomic vectors
es: > ## Vectores atómicos

source: > > In R, simple vectors containing character strings, numbers, or logical values > are called *atomic* vectors because they can't be further simplified.
es: > > En R, los vectores simples que contienen cadenas de caracteres, números, o valores lógicos > se llaman vectores *atómicos* porque no pueden simplificarse más.

source: So now that we've created a dummy vector to play with, how do we get at its contents?
es: Entonces ahora que hemos creado un vector ficticio para jugar, ¿cómo accedemos a su contenido?

source: ## Accessing elements using their indices
es: ## Acceder a elementos usando sus índices

source: To extract elements of a vector we can give their corresponding index, starting from one:
es: Para extraer elementos de un vector podemos dar su correspondiente índice, empezando desde uno:

source: It may look different, but the square brackets operator is a function. For vectors (and matrices), it means "get me the nth element".
es: Puede parecer distinto, pero el operador corchete es una función. Para vectores (y matrices), significa "dame el n-ésimo elemento".

source: We can ask for multiple elements at once:
es: Podemos pedir múltiples elementos de una vez:

source: Or slices of the vector:
es: O porciones del vector:

source: the `:` operator creates a sequence of numbers from the left element to the right.
es: el operador `:` crea una secuencia de números desde el elemento de la izquierda hasta el de la derecha.

source: We can ask for the same element multiple times:
es: Podemos pedir el mismo elemento muchas veces:

source: If we ask for an index beyond the length of the vector, R will return a missing value:
es: Si pedimos un índice mayor a la longitud del vector, R devolverá un valor faltante:

source: This is a vector of length one containing an `NA`, whose name is also `NA`.
es: Este es un vector de longitud uno que contiene un `NA`, cuyo nombre es también `NA`.

source: If we ask for the 0th element, we get an empty vector:
es: Si pedimos el 0-ésimo elemento, obtendremos un vector vacío:

source: > ## Vector numbering in R starts at 1
es: > ## La numeración de vectores en R empieza en 1

source: > > In many programming languages (C and Python, for example), the first > element of a vector has an index of 0. In R, the first element is 1.
es: > > En muchos lenguajes de programación (C y Python, por ejemplo), el primer > elemento de un vector tiene índice 0. En R, el primer elemento es 1.

source: ## Skipping and removing elements
es: Salteando y eliminando elementos

source: If we use a negative number as the index of a vector, R will return every element *except* for the one specified:
es: Si en un vector usamos un número negativo como índice, R devolverá todos los elementos *excepto* el número de elemento especificado:

source: We can skip multiple elements:
es: Podemos saltear múltiples elementos:

source: > ## Tip: Order of operations
es: > ## Consejo: Orden de operaciones

source: > > A common trip up for novices occurs when trying to skip > slices of a vector. It's natural to to try to negate a > sequence like so: > > > ~~~ > x[-1:3] > ~~~ > {: .language-r} > > This gives a somewhat cryptic error: > > > ~~~ > Error in x[-1:3]: only 0's may be mixed with negative subscripts > ~~~
es: > > Un error común en las personas novatass occurre cuando quieren saltear > porciones de un vector. Es natural tratar negando una > secuencia como esto: > > > ~~~ > x[-1:3] > ~~~ > {: .language-r} > > Eso devuelve un error incomprensible: > > > ~~~ > Error in x[-1:3]: only 0's may be mixed with negative subscripts > ~~~

source: > > But remember the order of operations. `:` is really a function. > It takes its first argument as -1, and its second as 3, > so generates the sequence of numbers: `c(-1, 0, 1, 2, 3)`. > > The correct solution is to wrap that function call in brackets, so > that the `-` operator applies to the result: > > > ~~~ > x[-(1:3)] > ~~~ > {: .language-r} > > > > ~~~ > d e > 4.8 7.5 > ~~~
es: > > Pero recuerda el orden de operaciones. `:` es en realidad una función. > Toma como primer argumento un -1, y como segundo el 3, > por lo cual genera la secuencia de números: `c(-1, 0, 1, 2, 3)`. > > La solución correcta sería envolver la función y sus argumentos con un paréntesis, para > que el operador `-` se aplique al resultado: > > > ~~~ > x[-(1:3)] > ~~~ > {: .language-r} > > > > ~~~ > d e > 4.8 7.5 > ~~~

source: To remove elements from a vector, we need to assign the result back into the variable:
es: Para eliminar elementos de un vector, necesitamos asignar el resultado a la misma variable:

source: > > Given the following code: > > > ~~~ > x <- c(5.4, 6.2, 7.1, 4.8, 7.5) > names(x) <- c('a', 'b', 'c', 'd', 'e') > print(x) > ~~~ > {: .language-r} > > > > ~~~ > a b c d e > 5.4 6.2 7.1 4.8 7.5 > ~~~
es: > > Dado el siguiente código : > > > ~~~ > x <- c(5.4, 6.2, 7.1, 4.8, 7.5) > names(x) <- c('a', 'b', 'c', 'd', 'e') > print(x) > ~~~ > {: .language-r} > > > > ~~~ > a b c d e > 5.4 6.2 7.1 4.8 7.5 > ~~~

source: > > Come up with at least 3 different commands that will produce the following output: > > > ~~~ > b c d > 6.2 7.1 4.8 > ~~~
es: > > Escribe por lo menos 3 comandos distintos que produzcan la siguiente salida: > > > ~~~ > b c d > 6.2 7.1 4.8 > ~~~

source: > > After you find 3 different commands, compare notes with your neighbour. Did you have different strategies? > > > ## Solution to challenge 1 > > > > > > ~~~ > > x[2:4] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > b c d > > 6.2 7.1 4.8 > > ~~~ > > {: .output} > > > > ~~~ > > x[-c(1,5)] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > b c d > > 6.2 7.1 4.8 > > ~~~ > > {: .output} > > > > ~~~ > > x[c("b", "c", "d")] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > b c d > > 6.2 7.1 4.8 > > ~~~ > > {: .output} > > > > ~~~ > > x[c(2,3,4)] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > b c d > > 6.2 7.1 4.8 > > ~~~ > > {: .output}
es: > > Después que hayas encontrado 3 comandos distintos, compara tus notas con tu vecino. Tuvieron diferentes estrategias? > > > ## Solución al desafío 1 > > > > > > ~~~ > > x[2:4] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > b c d > > 6.2 7.1 4.8 > > ~~~ > > {: .output} > > > > ~~~ > > x[-c(1,5)] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > b c d > > 6.2 7.1 4.8 > > ~~~ > > {: .output} > > > > ~~~ > > x[c("b", "c", "d")] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > b c d > > 6.2 7.1 4.8 > > ~~~ > > {: .output} > > > > ~~~ > > x[c(2,3,4)] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > b c d > > 6.2 7.1 4.8 > > ~~~ > > {: .output}

source: ## Subsetting by name
es: ## subconjunto por nombre

source: We can extract elements by using their name, instead of extracting by index:
es: Podemos extraer elementos usando su nombre, en vez de extraerlos usando su índice.

source: ~~~ x <- c(a = 5.4, b = 6.2, c = 7.1, d = 4.8, e = 7.5) # we can name a vector 'on the fly' x[c("a", "c")] ~~~
es: ~~~ x <- c(a = 5.4, b = 6.2, c = 7.1, d = 4.8, e = 7.5) # podemos nombrar un vector sobre la marcha x[c("a", "c")] ~~~

source: This is usually a much more reliable way to subset objects: the position of various elements can often change when chaining together subsetting operations, but the names will always remain the same!
es: Normalmente esta es una manera mucho más fiable de crear subconjuntos: la posición de varios elementos a menudo puede cambiar cuando se encadenan operadores para crear subconjuntos, pero los nombres siempre permanecen igual!

source: ## Subsetting through other logical operations
es: ## Haciendo subconjuntos usando otros operadores lógicos

source: We can also use any logical vector to subset:
es: También podemos usar cualquier otro vector de tipo logical para crear subconjuntos:

source: Since comparison operators (e.g. `>`, `<`, `==`) evaluate to logical vectors, we can also use them to succinctly subset vectors: the following statement gives the same result as the previous one.
es: Dado que los operadores de comparación (e.g. `>`,`<`,`==`) evalúan vectores lógicos, también podemos usarlos para crear subconjuntos de vectores: la siguiente declaración da el mismo resultado que la anterior.

source: Breaking it down, this statement first evaluates `x>7`, generating a logical vector `c(FALSE, FALSE, TRUE, FALSE, TRUE)`, and then selects the elements of `x` corresponding to the `TRUE` values.
es: Analizándolo, esta declaración primero evalúa `x>7`, generando un vector de tipo logical `c(FALSE, FALSE, TRUE, FALSE, TRUE)`, y después selecciona los elementos de `x` que corresponden a los valores `TRUE`.

source: We can use `==` to mimic the previous method of indexing by name (remember you have to use `==` rather than `=` for comparisons):
es: Podemos usar `==` para imitar el método previo de indexar por nombre (recuerda que tiene que usar `==` en vez de `=` para comparaciones):

source: > ## Tip: Combining logical conditions
es: > ## Sugerencia: Combinando condiciones lógicas

source: > > We often want to combine multiple logical > criteria. For example, we might want to find all the countries that are > located in Asia **or** Europe **and** have life expectancies within a certain > range. Several operations for combining logical vectors exist in R: > > * `&`, the "logical AND" operator: returns `TRUE` if both the left and right > are `TRUE`. > * `|`, the "logical OR" operator: returns `TRUE`, if either the left or right > (or both) are `TRUE`. > > You may sometimes see `&&` and `||` instead of `&` and `|`. These two-character operators > only look at the first element of each vector and ignore the > remaining elements. In general you should not use the two-character > operators in data analysis; save them > for programming, i.e. deciding whether to execute a statement. > > * `!`, the "logical NOT" operator: converts `TRUE` to `FALSE` and `FALSE` to > `TRUE`. It can negate a single logical condition (eg `!TRUE` becomes > `FALSE`), or a whole vector of conditions(eg `!c(TRUE, FALSE)` becomes > `c(FALSE, TRUE)`). > > Additionally, you can compare the elements within a single vector using the > `all` function (which returns `TRUE` if every element of the vector is `TRUE`) > and the `any` function (which returns `TRUE` if one or more elements of the > vector are `TRUE`).
es: > > A menudo queremos combinar múltiples criterios lógicos. > Por ejemplo, podríamos querer encontrar todos los países que > están en Asia **or** Europa **and** tienen expectativa de vida dentro de un cierto > rango. Existen varias operaciones para combinar vectores lógicos en R: > > * `&`, el operador "logical AND": retorna `TRUE` si ambos la izquierda y la derecha > son `TRUE`. > * `|`, el operador "logical OR": retorna `TRUE`, si cualquiera la izquierda o la derecha > (o ambos) son `TRUE`. > > A veces puedes ver `&&` y `||` en vez de `&` y `|`. Estos operadores de dos caracteres > sólo miran al primer elemento de cada vector e ignoran el resto de > elementos restantes. En general deberías no usar los operadores > de dos caracteres en análisis de datos; resérvalos > para programar, i.e. decidir si ejecutar una declaración o no. > > * Operadores `!`, y "logical NOT": convierten `TRUE` en `FALSE` y `FALSE` en > `TRUE`. Puede negar una condición lógica (e.g. `!TRUE` ser convierte en > `FALSE`), o un vector entero de condiciones(e.g. `!c(TRUE, FALSE)` se convierte en > `c(FALSE, TRUE)`). > > Además, puedes comparar los elementos dentro de un único vector usando la > función `all` (retorna `TRUE` si cada elemento del vector es `TRUE`) > y la función `any` (retorna `TRUE` si uno o más elementos del > vector son `TRUE`).

source: > > Write a subsetting command to return the values in x that are greater than 4 and less than 7. > > > ## Solution to challenge 2 > > > > > > ~~~ > > x_subset <- x[x<7 & x>4] > > print(x_subset) > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > a b d > > 5.4 6.2 4.8 > > ~~~ > > {: .output}
es: > > Escribe un comando de hacer subconjuntos que retorne los valores de x que son mayores que 4 y menores que 7. > > > ## Solución al desafío 2 > > > > > > ~~~ > > x_subset <- x[x<7 & x>4] > > print(x_subset) > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > a b d > > 5.4 6.2 4.8 > > ~~~ > > {: .output}

source: > ## Tip: Getting help for operators
es: > ## Sugerencia: Obteniendo ayuda para los operadores

source: > > Remember you can search for help on operators by wrapping them in quotes: > `help("%in%")` or `?"%in%"`.
es: > > Recuerda que puedes obtener ayuda para los operadores empaquetándolos entre comillas: > `help("%in%")` or `?"%in%"`.

source: > ## Handling special values
es: > ## Manejando valores especiales

source: > At some point you will encounter functions in R that cannot handle missing, infinite,
es: > En algún momento encontraremos funciones en R que no pueden manejar valores faltantes, infinito

source: > or undefined data.
es: > o datos indefinidos.

source: > > There are a number of special functions you can use to filter out this data: > > * `is.na` will return all positions in a vector, matrix, or data frame > containing `NA` (or `NaN`) > * likewise, `is.nan`, and `is.infinite` will do the same for `NaN` and `Inf`. > * `is.finite` will return all positions in a vector, matrix, or data.frame > that do not contain `NA`, `NaN` or `Inf`. > * `na.omit` will filter out all missing values from a vector
es: > > Existen algunas funciones especiales que puedes usar para filtrar estos datos: > > * `is.na` regresa todas las posiciones de un vector, matriz. o data frame > que contengan `NA` (o `NaN`) > * de la misma manera, `is.nan`, y `is.infinite` hacen los mismo para `NaN` y `Inf`. > * `is.finite` regresa todas las posiciones de un vector, matriz, o data frame > que no contengan `NA`, `NaN` o `Inf`. > * `na.omit` filtra todos los valores faltantes de un vector

source: Remember the data frames are lists underneath the hood, so similar rules apply. However they are also two dimensional objects:
es: Recordemos que las data frames son listas, por lo que aplican reglas similares. Sin embargo estos también son objetos de dos dimensiones:

source: `[` with one argument will act the same way as for lists, where each list element corresponds to a column. The resulting object will be a data frame:
es: `[` con un argumento funcionará de la misma manera que para las listas, donde cada elemento de la lista corresponde a una columna. El objecto devuelto será un data frame:

source: Similarly, `[[` will act to extract *a single column*:
es: Similarmente, `[[` extraerá *una sola columna*:

source: And `$` provides a convenient shorthand to extract columns by name:
es: Y `$` proporciona atajo para extraer columnas por nombre:

source: To select specific rows and/or columns, you can provide two arguments to `[`
es: Para seleccionar filas y/o columnas específicas, puedes proporcionar dos argumentos a `[`

source: If we subset a single row, the result will be a data frame (because the elements are mixed types):
es: Si nuestro subconjunto es una sola fila, el resultado será una data frame (porque los elementos son de distintos tipos):

source: But for a single column the result will be a vector (this can be changed with the third argument, `drop = F0ALSE`).
es: Pero para una sola columna el resultado será un vector (esto puede cambiarse con el tercer argumento, `drop = FALSE`).
