Repository: carpentries-i18n/i18n
Catalog: po/r-intro-geospatial.*.po
Languages: es

source: --- # Please do not edit this file directly; it is auto generated. # Instead, please edit 01-rstudio-intro.md in _episodes_rmd/ title: "Introduction to R and RStudio" teaching: 20 exercises: 5 questions: - "How to find your way around RStudio?" - "How to interact with R?" - "How to install packages?" objectives: - "Describe the purpose and use of each pane in the RStudio IDE" - "Locate buttons and options in the RStudio IDE" - "Define a variable" - "Assign data to a variable" - "Use mathematical and comparison operators" - "Call functions" - "Manage packages" keypoints: - "Use RStudio to write and run R programs." - "R has the usual arithmetic operators." - "Use `<-` to assign values to variables." - "Use `install.packages()` to install packages (libraries)." source: Rmd ---
es: --- # Por favor, no edites este archivo directamente; se genera de forma automática. # En cambio, edita 01-rstudio-intro.md en _episodes_rmd/ title: "Introducción a R y RStudio" teaching: 20 exercises: 5 questions: - "¿Cómo encontrar lo que buscas en RStudio?" - "¿Cómo interactuar con R?" - "¿Cómo instalar paquetes?" objectives: - "Describe el propósito y el uso de cada panel en el IDE RStudio" - "Localiza botones y opciones en el IDE RStudio" - "Define una variable" - "Asigna datos a una variable" - "Usa operadores matemáticos y de comparación" - "Llama funciones" - "Administra paquetes" keypoints: - "Usa RStudio para escribir y ejecutar programas R." - "R tiene los operadores aritméticos habituales." - "Usa `<-` para asignar valores a las variables." - "Usa `install.packages()` para instalar paquetes (bibliotecas)." source: Rmd ---

source: ## Motivation
es: ## Motivación

source: Science is a multi-step process: once you've designed an experiment and collected data, the real fun begins! This lesson will teach you how to start this process using R and RStudio. We will begin with raw data, perform exploratory analyses, and learn how to plot results graphically. This example starts with a dataset from [gapminder.org](https://www.gapminder.org) containing population information for many countries through time. Can you read the data into R? Can you plot the population for Senegal? Can you calculate the average income for countries on the continent of Asia? By the end of these lessons you will be able to do things like plot the populations for all of these countries in under a minute!
es: La ciencia es un proceso de múltiples etapas: una vez que haz diseñado un experimento y recolectado datos, ¡empieza la diversión real! Esta lección te enseñará cómo empezar este proceso usando R y RStudio. Empezaremos con datos crudos, realizaremos análisis exploratorios y aprenderemos cómo graficar los resultados. Este ejemplo empieza con un conjunto de datos de [gapminder.org](https://www.gapminder.org) que contiene información poblacional para muchos países a través del tiempo. ¿Puedes leer los datos en R? ¿Puedes graficar la población para Senegal? ¿Puedes calcular el ingreso promedio para países del continente asiático? Al final de estas lecciones, ¡serás capaz de hacer cosas tales como graficar la población de todos estos países en menos de un minuto!

source: ## Before Starting The Workshop
es: ## Antes de comenzar el taller

source: Please ensure you have the latest version of R and RStudio installed on your machine. This is important, as some packages used in the workshop may not install correctly (or at all) if R is not up to date.
es: Por favor asegúrate de tener la última versión de R y de RStudio instalada en tu computadora. Esto es importante, porque algunos paquetes utilizados en el taller pueden no instalarse correctamente (o directamente no instalarse) si R no está al día.

source: - [Download and install the latest version of R here](https://www.r-project.org/)
es: - [Descarga e instala la última versión de R aquí](https://www.r-project.org/)

source: - [Download and install RStudio here](https://www.rstudio.com/)
es: - [Descarga e instala RStudio aquí](https://www.rstudio.com/)

source: ## Introduction to RStudio
es: ## Introducción a RStudio

source: Throughout this lesson, we're going to teach you some of the fundamentals of the R language as well as some best practices for organizing code for scientific projects that will make your life easier.
es: A lo largo de esta lección, te enseñaremos algunos de los fundamentos del lenguaje R así como algunas de las mejores prácticas para organizar el código para proyectos científicos, lo que te hará la vida más fácil.

source: We'll be using RStudio: a free, open source R integrated development environment (IDE). It provides a built in editor, works on all platforms (including on servers) and provides many advantages such as integration with version control and project management.
es: Usaremos RStudio: un entorno de desarrollo integrado (IDE por su nombre en inglés) gratuito y de código abierto. RStudio provee un editor incorporado, funciona en todas las plataformas (incluyendo servidores) y provee muchas ventajas como el hecho de integrarse con control de versiones y manejo de proyectos.

source: **Basic layout**
es: **Diseño básico**

source: When you first open RStudio, you will be greeted by three panels:
es: Cuando abres RStudio por primera vez, serás bienvenida por tres paneles:

source: * The interactive R console (entire left)
es: * La consola interactiva de R (panel completo a la izquierda)

source: * Environment/History (tabbed in upper right)
es: * Entorno/Historia (pestañas arriba a la derecha)

source: * Files/Plots/Packages/Help/Viewer (tabbed in lower right)
es: * Archivos/Gráficos/Paquetes/Ayuda/Visualización (pestañas abajo a la derecha)

source: ![RStudio layout](../fig/01-rstudio.png)
es: ![Diseño de RStudio]({{ site.baseurl }}/fig/01-rstudio.png)

source: Once you open files, such as R scripts, an editor panel will also open in the top left.
es: Una vez que abres archivos, como scripts de R, un panel de edición se abrirá también arriba a la izquierda.

source: ![RStudio layout with .R file open](../fig/01-rstudio-script.png)
es: ![Diseño de RStudio con un archivo .R abierto]({{ site.baseurl }}/fig/01-rstudio-script.png)

source: ## Workflow within RStudio
es: ## Flujo de trabajo dentro de RStudio

source: There are two main ways one can work within RStudio.
es: Hay dos maneras principales en las que se puede trabajar dentro de RStudio.

source: 1. Test and play within the interactive R console then copy code into
es: 1. Evaluar y ejecutar dentro de la consola interactiva de R y luego copiar el código dentro

source: a .R file to run later. * This works well when doing small tests and initially starting off. * It quickly becomes laborious 2. Start writing in an .R file and use RStudio's shortcut keys for the Run command to push the current line, selected lines or modified lines to the interactive R console. * This is a great way to start; all your code is saved for later * You will be able to run the file you create from within RStudio or using R's `source()` function.
es: de un archivo .R para correrlo más tarde * Esto funciona bien cuando se hacen pequeñas pruebas y al inicio del trabajo. * Rápidamente se transforma en un método laborioso 2. Comenzar escribiendo en un archivo .R y usar los atajos de teclado de RStudio para el comando Ejecutar para llevar la línea actual, las líneas seleccionadas o líneas modificadas a la consola interactiva de R. * Esta es una manera genial de comenzar; todo tu código es guardado para más tarde * Podrás correr el archivo que has creado dentro de RStudio o usando la función R's `source()`.

source: > ## Tip: Running segments of your code
es: > ## Consejo: correr segmentos de tu código

source: > > RStudio offers you great flexibility in running code from within the editor > window. There are buttons, menu choices, and keyboard shortcuts. To run the > current line, you can > > 1. click on the `Run` button above the editor panel, or > 2. select "Run Lines" from the "Code" menu, or > 3. hit <kbd>Ctrl</kbd>+<kbd>Enter</kbd> in Windows, > <kbd>Ctrl</kbd>+<kbd>Return</kbd> in Linux, > or <kbd>&#8984;</kbd>+<kbd>Return</kbd> on OS X. > (This shortcut can also be seen by hovering > the mouse over the button). To run a block of code, select it and then `Run`. > If you have modified a line of code within a block of code you have just run, > there is no need to reselect the section and `Run`, you can use the next > button > along, `Re-run the previous region`. This will run the previous code block > including the modifications you have made.
es: > > RStudio te ofrece una gran flexibilidad para correr código dentro de la ventana del editor. > Hay botones, menúes de elección y atajos de teclado. Para correr la > línea actual, puedes > > 1. hacer clic en el botón `Run` arriba del panel de edición, o > 2. seleccionar "Run Lines" del menú "Code", o > 3. presionar <kbd>Ctrl</kbd>+<kbd>Enter</kbd> en Windows, > <kbd>Ctrl</kbd>+<kbd>Enter</kbd> en Linux, > o <kbd>&#8984;</kbd>+<kbd>Enter</kbd> en OS X. > (Este atajo también puede ser visualizado al posicionar > el ratón sobre el botón). Para correr un bloque de código, selecciónalo y luego `Run`. > Si haz modificado una línea de código dentro de un bloque de código que acabas de ejecutar, > no hay necesidad de re-seleccionar la sección y `Run`, puedes usar el siguiente > botón > por su cuenta, `Re-run the previous region`. Esto ejecutará el bloque de código anterior > incluyendo las modificaciones que hayas realizado.

source: ## Introduction to R
es: ## Introducción a R

source: Much of your time in R will be spent in the R interactive console. This is where you will run all of your code, and can be a useful environment to try out ideas before adding them to an R script file. This console in RStudio is the same as the one you would get if you typed in `R` in your command-line environment.
es: Pasarás mucho de tu tiempo en R en la consola interactiva Allí es donde ejecutarás todo tu código y puede ser un entorno útil para probar ideas antes de agregarlas a un archivo de script de R. Esta consola en RStudio es la misma que tendrías si escribieras en el entorno de línea de comandos de `R`.

source: The first thing you will see in the R interactive session is a bunch of information, followed by a ">" and a blinking cursor. In many ways this is similar to the shell environment you learned about during the shell lessons: it operates on the same idea of a "Read, evaluate, print loop": you type in commands, R tries to execute them, and then returns a result.
es: Lo primero que verás en la sesión interactiva de R es un conjunto de información, seguida de un ">" y un cursor titilante. De muchas maneras esto es similr al entorno de consola que has aprendido en las lecciones de consola: opera sobre la misma idea de un ciclo de "Lectura, evaluación y visualización": escribes comandos, R intenta ejecutarlos y luego devuelve un resultado.

source: ## Using R as a calculator
es: ## Usando R como una calculadora

source: The simplest thing you could do with R is do arithmetic:
es: Lo más simple que puedes hacer en R es aritmética:

source: And R will print out the answer, with a preceding "`[1]`". Don't worry about this for now, we'll explain that later. For now think of it as indicating output.
es: Y R va a mostrar la respuesta, con un "`[1]`" precedente. No te preocupes por esto por ahora, lo explicaremos más tarde. Por ahora piensa que eso es un indicador de un resultado.

source: Like bash, if you type in an incomplete command, R will wait for you to complete it:
es: Como bash, si escribes un comando incompleto, R esperará que tú lo completes:

source: Any time you hit return and the R session shows a "`+`" instead of a "`>`", it means it's waiting for you to complete the command. If you want to cancel a command you can simply hit "<kbd>Esc</kbd>" and RStudio will give you back the "`>`" prompt.
es: En cualquier momento que presiones Enter y la sesión de R muestre "`+`" en vez de un "`>`", significa que R está esperando que completes el comando. Si quieres cancelar un comando puedes simplemente "<kbd>Esc</kbd>" y RStudio te devolverá el indicador "`>`".

source: > ## Tip: Cancelling commands
es: > ## Sugerencia: Cancelando comandos

source: > > If you're using R from the command line instead of from within RStudio, > you need to use <kbd>Ctrl</kbd>+<kbd>C</kbd> instead of <kbd>Esc</kbd> > to cancel the command. This applies to Mac users as well! > > Cancelling a command isn't only useful for killing incomplete commands: > you can also use it to tell R to stop running code (for example if it's > taking much longer than you expect), or to get rid of the code you're > currently writing.
es: > Si estás utilizando R desde la línea de comando en lugar de RStudio, > necesitas usar <kbd>Ctrl</kbd>+<kbd>C</kbd>en lugar de <kbd>Esc</kbd> > para cancelar el comando. ¡Esto también se aplica a los usuarios de Mac! > > Cancelar un comando no solo es útil para interrumpir comandos incompletos: > también puedes usarlo para decirle a R que deje de ejecutar código (por ejemplo, si está > tardando mucho más de lo que esperas), o para deshacerte del código que estás > escribiendo en ese momento.

source: When using R as a calculator, the order of operations is the same as you would have learned back in school.
es: Cuando usas R como calculadora, el orden de las operaciones es el mismo que habrías aprendido en la escuela.

source: From highest to lowest precedence:
es: De mayor a menor precedencia:

source: * Parentheses: `(`, `)`
es: * Paréntesis: `(`, `)`

source: * Exponents: `^` or `**`
es: * Exponente: `^` o `**`

source: * Multiply: `*`
es: * Multiplica: `*`

source: * Add: `+`
es: * Suma: `+`

source: * Subtract: `-`
es: * Resta: `-`

source: Use parentheses to group operations in order to force the order of evaluation if it differs from the default, or to make clear what you intend.
es: Usa paréntesis para agrupar operaciones y forzar el orden de evaluación si difiere de la predeterminada, o para aclarar tu objetivo.

source: This can get unwieldy when not needed, but clarifies your intentions. Remember that others may later read your code.
es: Esto puede volverse incómodo cuando no es necesario, pero clarifica tus intenciones. Recuerde que otros pueden leer tu código más adelante.

source: ~~~ (3 + (5 * (2 ^ 2))) # hard to read 3 + 5 * 2 ^ 2 # clear, if you remember the rules 3 + 5 * (2 ^ 2) # if you forget some rules, this might help ~~~
es: ~~~ (3 + (5 * (2 ^ 2))) # difícil de leer 3 + 5 * 2 ^ 2 # claro, si recuerdas las reglas 3 + 5 * (2 ^ 2) # si no recuerdas algunas reglas, esto puede ayudar ~~~

source: The text after each line of code is called a "comment". Anything that follows after the hash (or octothorpe) symbol `#` is ignored by R when it executes code.
es: El texto luego de cada línea de código se llama "comentario". Cualquier cosa que siga a un signo numeral `#` es ignorado por R cuando ejecuta código.

source: Really small or large numbers get a scientific notation:
es: Números muy pequeños o muy grandes obtienen una notación científica:

source: Which is shorthand for "multiplied by `10^XX`". So `2e-4` is shorthand for `2 * 10^(-4)`.
es: Que es la versión abreviada de "multiplicado por `10^XX`". Entonces, `2e-4` es la abreviación de `2 * 10^(-4)`.

source: You can write numbers in scientific notation too:
es: También puedes escribir número en notación científica:

source: ~~~ 5e3 # Note the lack of minus here ~~~
es: ~~~ 5e3 # Note la falta de menos aquí ~~~

source: Don't worry about trying to remember every function in R. You can look them up on Google, or if you can remember the start of the function's name, use the tab completion in RStudio.
es: No te preocupes por tratar de recordar cada función en R. Puedes buscarlas en Google, o si puedes recordar el comienzo del nombre de la función, usa completar con Tab en RStudio.

source: This is one advantage that RStudio has over R on its own, it has auto-completion abilities that allow you to more easily look up functions, their arguments, and the values that they take.
es: Esta es una ventaja que RStudio tiene sobre R por sí mismo, tiene capacidades de autocompletado que te permiten buscar más fácilmente las funciones, sus argumentos y los valores que estos toman.

source: Typing a `?` before the name of a command will open the help page for that command. As well as providing a detailed description of the command and how it works, scrolling to the bottom of the help page will usually show a collection of code examples which illustrate command usage. We'll go through an example later.
es: Escribir un `?` antes del nombre de un comando abrirá la página de ayuda del mismo. Además de proporcionar una descripción detallada del comando y cómo funciona, desplazarse hasta la parte inferior de la página de ayuda generalmente mostrará una colección de ejemplos de código que ilustran el uso del comando. Veremos un ejemplo más tarde.

source: ## Comparing things
es: ## Comparando cosas

source: We can also do comparison in R:
es: También podemos realizar comparaciones en R:

source: ~~~ 1 == 1 # equality (note two equals signs, read as "is equal to") ~~~
es: ~~~ 1 == 1 # igualdad (dos signos de igual se leen como "es igual a") ~~~

source: ~~~ 1 != 2 # inequality (read as "is not equal to") ~~~
es: ~~~ 1 != 2 # distinto de ~~~

source: ~~~ 1 < 2 # less than ~~~
es: ~~~ 1 < 2 # menor que ~~~

source: ~~~ 1 <= 1 # less than or equal to ~~~
es: ~~~ 1 <= 1 # menor o igual a ~~~

source: ~~~ 1 > 0 # greater than ~~~
es: ~~~ 1 > 0 # mayor que ~~~

source: ~~~ 1 >= -9 # greater than or equal to ~~~
es: ~~~ 1 >= -9 # mayor o igual a ~~~

source: > ## Tip: Comparing Numbers
es: > ## Sugerencia: Comparando números

source: > > A word of warning about comparing numbers: you should > never use `==` to compare two numbers unless they are > integers (a data type which can specifically represent > only whole numbers). > > Computers may only represent decimal numbers with a > certain degree of precision, so two numbers which look > the same when printed out by R, may actually have > different underlying representations and therefore be > different by a small margin of error (called Machine > numeric tolerance). > > Instead you should use the `all.equal` function. > > Further reading: [http://floating-point-gui.de/](http://floating-point-gui.de/)
es: > > Una advertencia sobre la comparación de los números: nunca > deberías usar `==` para comparar dos números a menos que sean > **integers** (un tipo de datos que representa específicamente > solo números enteros). > > Las computadoras sólo pueden representar números decimales con un > cierto grado de precisión, por lo que dos números que parecen >iguales al imprimirlos en R, pueden en realidad tener > diferentes representaciones subyacentes y, por lo tanto, pueden > diferir por un pequeño margen de error (llamado > Machine numeric tolerance). > > En lugar de eso, deberías usar la función `all.equal`. > > Leer más en: [http://floating-point-gui.de/](http://floating-point-gui.de/)

source: ## Variables and assignment
es: ## Variables y asignación

source: We can store values in variables using the assignment operator `<-`, like this:
es: Podemos almacenar valores en variables usando el operador de asignación `<-`, así:

source: Notice that assignment does not print a value. Instead, we stored it for later in something called a **variable**. `x` now contains the **value** `0.025`:
es: Observa que la asignación no imprime un valor. En cambio, lo almacenamos para más tarde en algo llamado **variable**. `x` ahora contiene el **valor**` 0.025`:

source: More precisely, the stored value is a *decimal approximation* of this fraction called a [floating point number](http://en.wikipedia.org/wiki/Floating_point).
es: Más precisamente, el valor almacenado es una *aproximación decimal* de esta fracción llamada [número de coma flotante](http://en.wikipedia.org/wiki/Floating_point).

source: Look for the `Environment` tab in one of the panes of RStudio, and you will see that `x` and its value have appeared. Our variable `x` can be used in place of a number in any calculation that expects a number:
es: Busca la pestaña `Environment` en uno de los paneles de RStudio, y verás que ` x` y su valor han aparecido. Nuestra variable `x` puede usarse en lugar de un número en cualquier cálculo que espere un número:

source: Notice also that variables can be reassigned:
es: Observa también que las variables pueden ser reasignadas:

source: `x` used to contain the value 0.025 and and now it has the value 100.
es: `x` contenía el valor 0.025 y ahora tiene el valor 100.

source: Assignment values can contain the variable being assigned to:
es: Los valores de asignación pueden contener la variable a la que se asignan:

source: ~~~ x <- x + 1 #notice how RStudio updates its description of x on the top right tab y <- x * 2 ~~~
es: ~~~ x <- x + 1 #Observa como RStudio actualiza su descripción de x en la pestaña superior derecha y <- x * 2 ~~~

source: The right hand side of the assignment can be any valid R expression. The right hand side is *fully evaluated* before the assignment occurs.
es: El lado derecho de la asignación puede ser cualquier expresión válida de R. El lado derecho se *evalúa por completo* antes de que ocurra la asignación.

source: > ## Challenge 1
es: > ## Desafío 1

source: > > What will be the value of each variable after each > statement in the following program? > > > ~~~ > mass <- 47.5 > age <- 122 > mass <- mass * 2.3 > age <- age - 20 > ~~~ > {: .language-r} > > > ## Solution to challenge 1 > > > > > > ~~~ > > mass <- 47.5 > > ~~~ > > {: .language-r} > > This will give a value of 47.5 for the variable mass > > > > > > ~~~ > > age <- 122 > > ~~~ > > {: .language-r} > > This will give a value of 122 for the variable age > > > > > > ~~~ > > mass <- mass * 2.3 > > ~~~ > > {: .language-r} > > This will multiply the existing value of 47.5 by 2.3 to give a new value of > > 109.25 to the variable mass. > > > > > > ~~~ > > age <- age - 20 > > ~~~ > > {: .language-r} > > This will subtract 20 from the existing value of 122 to give a new value > > of 102 to the variable age.
es: > > ¿Cuál será el valor de cada variable después de cada > declaración en el siguiente programa? > > > ~~~ > mass (masa) <- 47.5 > age (edad) <- 122 > mass (masa) <- mass * 2.3 > age (edad) <- age - 20 > ~~~ > {: .language-r} > > > ## Solución al desafío 1 > > > > > > ~~~ > > mass (masa) <- 47.5 > > ~~~ > > {: .language-r} > > Esto dará un valor de 47.5 para la variable mass (masa) > > > > > > ~~~ > > age (edad) <- 122 > > ~~~ > > {: .language-r} > > Esto dará un valor de 122 para la variable age (edad) > > > > > > ~~~ > > mass (masa) <- mass * 2.3 > > ~~~ > > {: .language-r} > > Esto multiplicará el valor existente de 47.5 by 2.3 para dar un nuevo valor de > > 109.25 para la variable mass (masa). > > > > > > ~~~ > > age (edad) <- age - 20 > > ~~~ > > {: .language-r} > > Esto restará 20 del valor existente de 122 para dar un nuevo valor > > de 102 a la variable age (edad).

source: > ## Challenge 2
es: > ## Desafío 2
