Repository: carpentries-i18n/i18n
Catalog: po/r-intro-geospatial.*.po
Languages: es

source: ## Lesson motivation and learning objectives
es: ## Motivación de la lección y objetivos de aprendizaje

source: This lesson is designed to introduce learners to the core concepts of R that they will need in order to complete the other lessons in this workshop. It is intended for learners who have no prior experience with R. If your workshop learners have all completed another Software or Data Carpentry R workshop, or have taken courses in R, you can skip this lesson and move straight into the [Introduction to Geospatial Raster and Vector Data with R](https://datacarpentry.org/r-raster-vector-geospatial/) lesson.
es: Esta lección esta diseñada para introducir a los estudiantes conceptos básicos de R que necesitarán para completar las otras lecciones de este taller. Esta planeado para estudiantes que no tienen experiencia previa con R. Si todos los alumnos del taller han completado otro taller de Software o Data Carpentry R, o ha realizado otros cursos de R, puede saltarse esta lección y ir directamente a la lección [Introduction to Geospatial Raster and Vector Data with R](https://datacarpentry.org/r-raster-vector-geospatial/)

source: This lesson is a trimmed-down version of the [R for Reproducible Scientific Analysis](http://swcarpentry.github.io/r-novice-gapminder) SWC lesson. It does not cover visualization in detail, as the later lesson in this workshop covers visualization in the context of geospatial data.
es: Esta lección es una versión reducida de la lección SWC [R for Reproducible Scientific Analysis](http://swcarpentry.github.io/r-novice-gapminder). No cubre la visualización en detalle, ya que la última lección de este taller cubre la visualización en el contexto de los datos geospaciales.

source: ## Lesson design
es: ## Diseño de la lección

source: #### [Introduction to R and RStudio]({{ relative_root_path }}/{% link _episodes/01-rstudio-intro.md %})
es: #### [Introducción a R y RStudio]({{ relative_root_path }}/{% link _episodes/01-rstudio-intro.md %})

source: * If your workshop includes the [Introduction to Geospatial Concepts](https://datacarpentry.org/organization-geospatial/) lesson, learners will have
es: * Si el taller incluye lecciones de [Introduction to Geospatial Concepts](https://datacarpentry.org/organization-geospatial/), los estudiantes tendrán

source: just been introduced to RStudio in the context of the overall Geospatial software landscape. * Have your learners open RStudio and follow along as you explain each pane. Make sure that your RStudio environment is the default so learners can follow along. * Be sure to explain how to execute code from the script window, whether you're using the Run button or the keyboard shortcut. * Learners will be using several libraries in the next lesson, so be sure to introduce what a library is and how it is installed.
es: la introducción a RStudio en el contexto general del software geoespacial * Haga que sus alumnos abran RStudio y le sigan mientras que explica cada panel. Asegúrese de que el entorno de Rstudio sea el predeterminado para que los alumnos puedan seguirlo * Asegúrese de explicar cómo ejecutar el código desde la ventana de script, tanto si usted esta utilizando el botón Run o desde el atajo desde el teclado * Los estudiantes usarán varias biblioteca en la próxima lección, así que debe de asegurarse de introducir como introducir una biblioteca y cómo se instala.

source: * Make sure learners download the data files in Challenge 1 and move those files
es: * Asegúrese de que los alumnos descarguen los archivo de datos en el Desafío 1 y muevan esos datos

source: to their `data/` directory.
es: a su directorio `data/`

source: * Learners will work with factors in the following lesson. Be sure to
es: * Los alumnos trabajarán con factores en la siguiente lección. Asegúrate de

source: cover this concept. * If needed for time reasons, you can skip the section on lists. The learners don't use lists in the rest of the workshop.
es: cubrir este concepto. * Si por razones de tiempo es necesario, puede saltearse la sección de listas. Las estudiantes no usan listas en el resto del taller.

source: * Pay attention to and explain the errors and warnings generated from the examples in this episode.
es: * Presta atención y explica los errores y advertencias generados a partir de los ejemplos de este episodio.

source: * The episode after this one covers the `dplyr` package, which has an
es: * El episodio siguiente cubre el paquete `dplyr` , que tiene un

source: alternate subsetting mechanism. Learners do still need to learn the base R subsetting covered here, as `dplyr` won't work in all situations. However, the examples in the rest of the workshop focus on `dplyr` syntax.
es: mecanismo alternativo de extraer subconjuntos. Las estudiantes todavía tienen que aprender la extracción de subconjuntos de R base vista aquí, ya que `dplyr` no va a funcionar en todas las situaciones. Sin embargo, los ejemplos del resto del taller se centran en la sintaxis `dplyr`.

source: * Introduce the `dplyr` package as a simpler, more intuitive way of doing
es: * Introduce el paquete `dplyr` como una forma más simple, más intuitiva de

source: subsetting. * Unlike other SWC and DC R lessons, this lesson does **not** include data reshaping with `tidyr` as it isn't used in the rest of the workshop.
es: extraer subconjuntos. * A diferencia de otras lecciones de R de SWC y DC, esta lección no incluye modificación de datos con `tidyr` ya que no se usa en el resto del taller.

source: * This episode introduces `geom_col` and `geom_histogram`. These geoms are used
es: * Este episodio introduce `geom_col` y `geom_histogram`. Estas geoms se usan

source: in the rest of the workshop, along with geoms specifically for geospatial data. * Emphasize that we will go much deeper into visualization and creating publication-quality graphics later in the workshop.
es: en el resto del taller, junto con geoms específicas para datos geoespaciales. * Enfatiza que iremos mucho más profundo en la visualización y la creación de gráficos con calidad de publicación más tarde en el taller.

source: * Learners will need to have created the directory structure described in
es: * Las alumnas necesitan haber creado la estructura de directorio descrita en

source: [Project Management With RStudio]({{ relative_root_path }}{% link _episodes/02-project-intro.md %}) in order for the code in this episode to work.
es: [Project Management With RStudio]({{ relative_root_path }}{% link _episodes/02-project-intro.md %}) para que el código de este episodio funcione.

source: #### Concluding remarks
es: #### Observaciones finales

source: * Now that learners know the fundamentals of R, the rest of the workshop
es: * Ahora que las alumnas conocen los fundamentos de R, en el resto del taller

source: will apply these concepts to working with geospatial data in R. * Packages and functions specific for working with geospatial data will be the focus of the rest of the workshop. * They will have lots of changes to practice applying and expanding these skills in the next lesson.
es: aplicarán estos conceptos para trabajar con datos geoespaciales en R. * Los paquetes y funciones específicos para trabajar con datos geoespaciales serán el centro del resto del taller. * Tendrán muchos cambios para practicar aplicando y expandiendo esas habilidades en la siguiente lección.

source: ## Technical tips and tricks
es: ## Trucos y consejos técnicos

source: * Leave about 30 minutes at the start of each workshop and another 15 mins
es: * Deje unos 30 minutos al comienzo de cada taller y otros 15 minutos.

source: at the start of each session for technical difficulties like WiFi and installing things (even if you asked students to install in advance, longer if not).
es: al inicio de cada sesión por dificultades técnicas como WiFi o instalar cosas (incluso si les pediste a los estudiantes que lo instalaran con anticipación, más tiempo si no).

source: * Be sure to actually go through examples of an R help page: help files
es: * Asegúrate de revisar ejemplos de una página de ayuda de R: archivos de ayuda

source: can be intimidating at first, but knowing how to read them is tremendously useful.
es: Puede resultar intimidante al principio, pero saber leerlos es tremendamente útil.

source: * Don't worry about being correct or knowing the material back-to-front. Use
es: * No te preocupe por ser correcto o conocer el material al derecho y al revé. Úsalo

source: mistakes as teaching moments: the most vital skill you can impart is how to debug and recover from unexpected errors.
es: Errores como momentos de enseñanza: la habilidad más vital que puede impartir es cómo depurar y recuperarse de errores inesperados.

source: ## Common problems
es: ## Problemas comunes

source: TBA - Instructors please add situations you encounter here.
es: TBA - Instructores, aquí agreguen situaciones que encuentren.

source: {% comment %} As a maintainer, you don't need to edit this file. If you notice that something doesn't work, please open an issue: https://github.com/carpentries/styles/issues/new {% endcomment %}
es: {% comment %} Como mantenedor, no tienes que editar este archivo. Si notas que algo no funciona, por favor abre un *issue*: https://github.com/carpentries/styles/issues/new {% endcomment %}

source: The goal of this lesson is to provide an introduction to R for learners working with geospatial data. It is intended as a pre-requisite for the [R for Raster and Vector Data](https://datacarpentry.org/r-raster-vector-geospatial/) lesson for learners who have no prior experience using R. This lesson can be taught in approximately 4 hours and covers the following topics:
es: El objetivo de esta lección es proporcionar una introducción a R para personas trabajando con datos geoespaciales. Se pretende que sea un requisito previo para la lección [R para datos ráster y vectoriales](https://datacarpentry.org/r-raster-vector-geospatial/) para personas que no tienen experiencia previa en el uso de R. Esta lección puede dictarse en aproximadamente 4 horas y cubre los siguientes temas:

source: - Working with R in the RStudio GUI
es: - Trabajando con R en la interfaz gráfica de usuario de RStudio

source: - Project management and file organization
es: - Gestión de proyectos y organización de archivos.

source: - Importing data into R
es: - Importación de datos a R

source: - Introduction to R's core data types and data structures
es: - Introducción a los tipos de datos principales y las estructuras de datos de R

source: - Manipulation of data frames (tabular data) in R
es: - Manipulación de dataframes (datos tabulares) en R

source: - Introduction to visualization
es: - Introducción a la visualización

source: - Writing data to a file
es: - Escribiendo datos a un archivo

source: The the [R for Raster and Vector Data](https://datacarpentry.org/r-raster-vector-geospatial/) lesson provides a more in-depth introduction to visualization (focusing on geospatial data), and working with data structures unique to geospatial data.
es: La lección [R para datos ráster y vectoriales](https://datacarpentry.org/r-raster-vector-geospatial/) proporciona una introducción más profunda a la visualización (centrándose en datos geoespaciales), y el trabajo con estructuras de datos exclusivas de datos geoespaciales.

source: > ## Getting Started
es: > ## ¿Cómo empezar?

source: > > Data Carpentry's teaching is hands-on, so participants are encouraged to use > their own computers to insure the proper setup of tools for an efficient > workflow. <br>**This lesson assume no prior knowledge of R.** > > To get started, follow the directions in the "[Setup]({{ relative_root_path }}/{% link setup.md %})" tab to > download data to your computer and follow any installation instructions.
es: > > Los talleres de Data Carpentry son prácticos, por lo que a los participantes se les sugiere usar sus propias computadoras para asegurar que cuentan con la configuración adecuada y las herramientas necesarias para un trabajo eficiente. <br>**Para esta lección no asumimos ninguna experiencia previa con R.** > > Para comenzar, sigue las instrucciones en la página de "[Configuración]({{ relative_root_path }}/{% link setup.md %})" para descargar los datos a tu computadora y seguir las indicaciones de instalación.

source: ## Reference
es: ## Referencia

source: ## [Introduction to R and RStudio]({{ relative_root_path }}/{% link _episodes/01-rstudio-intro.md %})
es: ## [Introducción a R y RStudio]({{ relative_root_path }}/{% link _episodes/01-rstudio-intro.md %})

source: - Use the escape key to cancel incomplete commands or running code
es: - Use la tecla **escape** para cancelar comandos incompletos o el código en ejecución

source: (Ctrl+C) if you're using R from the shell. - Basic arithmetic operations follow standard order of precedence: - Brackets: `(`, `)` - Exponents: `^` or `**` - Divide: `/` - Multiply: `*` - Add: `+` - Subtract: `-` - Scientific notation is available, e.g: `2e-3` - Anything to the right of a `#` is a comment, R will ignore this! - Functions are denoted by `function_name()`. Expressions inside the brackets are evaluated before being passed to the function, and functions can be nested. - Comparison operators: `<`, `<=`, `>`, `>=`, `==`, `!=` - Use `all.equal` to compare numbers! - `<-` is the assignment operator. Anything to the right is evaluate, then stored in a variable named to the left. - `ls` lists all variables and functions you've created - `rm` can be used to remove them - When assigning values to function arguments, you _must_ use `=`.
es: (Ctrl+C) si está usando R desde la terminal. - Las operaciones aritméticas básicas siguen un orden estándar de precedencia: - Paréntesis: `(`, `)` - Exponentes: `^` o `**` - División: `/` - Multiplicación: `*` - Suma: `+` - Resta: `-` - La notación científica está disponible, por ejemplo: `2e-3` - Todo lo que se encuentre a la derecha de un símbolo `#` es un comentario, y R lo ignorará! - Las funciones se denotan por `function_name()`. Las expresiones dentro de los paréntesis se evalúan antes de ser pasadas a la función, y las funciones pueden estar anidadas. - Operadores de comparación: `<`, `<=`, `>`, `>=`, `==`, `!=` - Utilice `all.equal` para comparar valores numéricos! - `<-` es el operador de asignación. Todo a su derecha se evalúa, y luego es almacenado en una variable nombrada a la izquierda. - `ls` genera una lista de todas las variables y funciones creadas - `rm` se puede utilizar para eliminarlas - Al asignar valores a los argumentos de una función, debe usar `=`.

source: ## [Project management with RStudio]({{ relative_root_path }}/{% link _episodes/02-project-intro.md %})
es: ## [Gestión de proyectos con RStudio]({{ relative_root_path }}/{% link _episodes/02-project-intro.md %})

source: - To create a new project, go to File -> New Project
es: - Para crear un nuevo proyecto, diríjase a Archivo -> Nuevo Proyecto

source: - Some best practices:
es: - Algunas buenas practicas:

source: * Treat data as read-only
es: * Trate a los datos como sólo lectura

source: * Keep cleaned data separate from raw dirty data
es: * Mantenga los datos ordenados separados de los datos crudos desordenados

source: * Treat generated output as disposable
es: * Trate la salida generada como desechable

source: * Keep related data together
es: * Mantenga los datos relacionados juntos

source: * Use a consistent naming scheme
es: * Utilice un esquema consistente de nomenclatura

source: ## [Data Structures]({{ relative_root_path }}/{% link _episodes/03-data-structures-part1.md %})
es: ## [Estructura de datos]({{ relative_root_path }}/{% link _episodes/03-data-structures-part1.md %})

source: - Use `read.csv()` to import data in memory
es: - Utilice `read.csv()` para importar los datos a la memoria

source: - ` class()` gives you the data class of your object
es: - ` class()` devuelve la clase de datos de su objeto

source: - R automatic converts data types
es: - R convierte automáticamente los tipos de datos

source: - The functions: `length()`, `nrow()`, `head()`, `tail()`, and `str()` can be
es: - Las funciones: `length()`, `nrow()`, `head()`, `tail()`, y `str()` pueden ser

source: useful to explore data. - Factors are a special class to deal with categorical data. - Lists provide a flexible data type. - Data frames are a special case of lists.
es: útiles para explorar los datos. - Los **factors** (factores) son una clase especial para trabajar con datos categóricos. - Las **lists** (listas) proveen un tipo flexible de datos. - Los **data frames** son un caso especial de listas.

source: ## [Exploring Data Frames]({{ relative_root_path }}/{% link _episodes/04-data-structures-part2.md %})
es: ## [Explorando **Data Frames**]({{ relative_root_path }}/{% link _episodes/04-data-structures-part2.md %})

source: * R makes it easy to import datasets storred remotely
es: * R facilita la importación de datos almacenados en forma remota

source: - `?data.frame` is a key data structure. It is a `list` of `vectors`.
es: - `?data.frame` es una estructura de datos clave. Es una `lista` de `vectores`.

source: - `cbind()` will add a column (vector) to a data.frame.
es: - `cbind()` adicionará una columna (vector) a un **data.frame**.

source: - `rbind()` will add a row (list) to a data.frame.
es: - `rbind()` adicionará una fila (lista) a un **data.frame**.

source: **Useful functions for querying data structures:** - `?str` structure, prints out a summary of the whole data structure - `?class` what is the data structure? - `?head` print the first `n` elements (rows for two-dimensional objects) - `?tail` print the last `n` elements (rows for two-dimensional objects) - `?rownames`, `?colnames`, `?dimnames` retrieve or modify the row names and column names of an object. - `?length` get the number of elements in an atomic vector - `?nrow`, `?ncol`, `?dim` get the dimensions of a n-dimensional object (Won't work on atomic vectors or lists). * If your data frame contains factors, you need to take extra steps to add rows that contain new level values.
es: **Funciones útiles para consultar la estructura de los datos:** - `?str` estructura, imprime un resumen de la estructura de datos - `?class` indica cual es la clase de los datos - `?head` imprime los primeros `n` elementos (filas para objetos bidimensionales) - `?tail` imprime los últimos `n` elementos (filas para los objetos bidimensionales) - `?rownames`, `?colnames`, `?dimnames` recupera o modifica los nombres de filas y de columnas de un objeto. - `?length` devuelve el número de elementos en un vector atómico - `?nrow`, `?ncol`, `?dim` da las dimensiones de un objeto n-dimensional (No funciona en vectores atómicos o listas). * Si tu **data frame** contiene factores, debes seguir algunos pasos adicionales para agregar filas que contengan nuevos valores de categorías (level).

source: - `read.csv` to read in data in a regular structure
es: - `read.csv` para leer datos en una estructura regular

source: - `sep` argument to specify the separator
es: - `sep` argumento para especificar el separador

source: - "," for comma separated
es: - "," para el separador coma

source: - "\t" for tab separated
es: - "\t" para el separador tabulador

source: - Other arguments:
es: - Otros argumentos:

source: - `header=TRUE` if there is a header row
es: - `header=TRUE` si hay una fila de encabezado

source: ## [Subsetting data]({{ relative_root_path }}/{% link _episodes/05-data-subsetting.md %})
es: ## [Subconjunto de datos]({{ relative_root_path }}/{% link _episodes/05-data-subsetting.md %})

source: - Elements can be accessed by:
es: - Se puede acceder a los elementos con:

source: - Index
es: - Índice

source: - Name
es: - Nombre

source: - Logical vectors
es: - Vectores lógicos

source: - `[` single square brackets:
es: - `[` corchetes simples:

source: - *extract* single elements or *subset* vectors
es: - *extract* (extraer) elementos individuales o *subset* (subdividir) vectores

source: - e.g.`x[1]` extracts the first item from vector x.
es: - por ejemplo, `x[1]` extrae el primer elemento de un vector x.

source: - *extract* single elements of a list. The returned value will be another `list()`.
es: - *extract* elementos simples de una lista. El valor devuelto será otra `list()`.

source: - *extract* columns from a data.frame
es: - *extract* columnas de un **data.frame**

source: - `[` with two arguments to:
es: - `[` con dos argumentos para:

source: - *extract* rows and/or columns of
es: - *extract* renglones y/o columnas de

source: - e.g. `x[1,2]` will extract the value in row 1, column 2.
es: - ejemplo `x[1,2]` extraerá el valor en el renglón 1, columna 2.

source: - e.g. `x[2,:]` will extract the entire second column of values.
es: - ejemplo `x[2,:]` extraerá la segunda columna de valores completa.

source: - `[[` double square brackets to extract items from lists.
es: - `[[` dobles corchetes para extraer elementos de una lista.

source: - `$` to access columns or list elements by name
es: - `$` para acceder a las columnas o elementos lista por nombre

source: - negative indices skip elements
es: - indices negativos saltan elementos

source: ## [Data frame manipulation with dplyr]({{ relative_root_path }}/{% link _episodes/06-dplyr.md %})
es: ## [Manipulación de Data frame con dplyr]({{ relative_root_path }}/{% link _episodes/06-dplyr.md %})

source: - `?select` to extract variables by name.
es: - `?select` para extraer variables por nombre.

source: - `?filter` return rows with matching conditions.
es: - `?filter` regresa filas con condiciones que se cumplen.

source: - `?group_by` group data by one of more variables.
es: - `?group_by` agrupa los datos por una o mas variables.

source: - `?summarize` summarize multiple values to a single value.
es: - `?summarize` resume múltiples valores en un solo valor.

source: - `?mutate` add new variables to a data.frame.
es: - `?mutate` agrega nuevas variables a un **data.frame**.

source: - `?count` and `?n` to tally values in the data frame.
es: - `?count` y `?n` para contar los valores en el data frame.

source: - Combine operations using the `?"%>%"` pipe operator.
es: - Combina operadores usando el operador pipe `?"%>%"`.

source: ## [Control flow]({{ relative_root_path }}/{% link _episodes/07-plot-ggplot2.md %})
es: ## [Control del flujo]({{ relative_root_path }}/{% link _episodes/07-plot-ggplot2.md %})

source: - figures can be created with the grammar of graphics:
es: -Las figuras se pueden crear con la gramática de los gráficos:

source: - `ggplot` to create the base figure
es: - `ggplot` para crear la base de la figura

source: - `aes`thetics specify the data axes, shape, color, and data size
es: - `aes` especifica la estética de los ejes, la forma, color, y tamaño de los datos

source: - `geom`etry functions specify the type of plot, e.g. `point`, `line`, `density`, `box`
es: - `geom` funciones que especifican el tipo de gráfico, por ejemplo `point`, `line`, `density`, `box`

source: - `geom`etry functions also add statistical transforms, e.g. `geom_smooth`
es: - `geom` estas funciones también agregan transformaciones estadisticas, por ejemplo. `geom_smooth`

source: - `scale` functions change the mapping from data to aesthetics
es: - `scale` función que cambia el mapeo de datos a estética

source: - `facet` functions stratify the figure into panels
es: - `facet` función que estratifica la figura dentro de paneles

source: - `aes`thetics apply to individual layers, or can be set for the whole plot
es: - `aes` se aplica a capas individuales, o puede ser definido para la grafica completa
