Repository: carpentries-i18n/i18n
Catalog: po/r-intro-geospatial.*.po
Languages: es

source: --- layout: page title: "Contributor Code of Conduct" ---
es: --- layout: page title: "Código de Conducta del Colaborador" ---

source: As contributors and maintainers of this project, we pledge to follow the [Carpentry Code of Conduct][coc].
es: Como colaboradores y mantenedores de este proyecto nos comprometemos a seguir el [Código de Conducta de Carpentry][coc].

source: Instances of abusive, harassing, or otherwise unacceptable behavior may be reported by following our [reporting guidelines][coc-reporting].
es: Cualquier instancia de abuso, maltrato u otro comportamiento inaceptable será reportado siguiendo los [lineamientos para reportes][coc-reporting].

source: # Contributing
es: # Colaborando

source: [Software Carpentry][swc-site] and [Data Carpentry][dc-site] are open source projects, and we welcome contributions of all kinds: new lessons, fixes to existing material, bug reports, and reviews of proposed changes are all welcome.
es: [Software Carpentry][swc-site] y [Data Carpentry][dc-site] son proyectos de código abierto, y agradecemos las colaboraciones de todo tipo: nuevas lecciones, correcciones del material existente, informes de errores, y las revisiones de cambios propuestas, todas son bienvenidas.

source: ## Contributor Agreement
es: ## Acuerdo de colaboración

source: By contributing, you agree that we may redistribute your work under [our license](LICENSE.md). In exchange, we will address your issues and/or assess your change proposal as promptly as we can, and help you become a member of our community. Everyone involved in [Software Carpentry][swc-site] and [Data Carpentry][dc-site] agrees to abide by our [code of conduct](CODE_OF_CONDUCT.md).
es: Al colaborar, aceptas que podemos redistribuir tu trabajo bajo [nuestra licencia](LICENSE.md). A cambio, abordaremos tus informes de errores y/o evaluaremos tu propuesta de cambio tan pronto como podamos, y te ayudaremos a convertirte en miembro de nuestra comunidad. Todos los involucrados en [Software Carpentry][swc-site] and [Data Carpentry][dc-site] aceptan cumplir con nuestro [código de conducta](CODE_OF_CONDUCT.md).

source: ## How to Contribute
es: ## Cómo contribuir

source: The easiest way to get started is to file an issue to tell us about a spelling mistake, some awkward wording, or a factual error. This is a good way to introduce yourself and to meet some of our community members.
es: La forma más fácil de comenzar es informarnos de un problema para poder corregirlo, como un error ortográfico, algunas palabras no claras, o un error. Contribuir es una buena forma de presentarte y conocer a algunos de los miembros de nuestra comunidad.

source: 1. If you do not have a [GitHub][github] account,
es: 1. Si no tienes una cuenta de [GitHub][github],

source: you can [send us comments by email][contact]. However, we will be able to respond more quickly if you use one of the other methods described below.
es: puedes [enviarnos comentarios por correo electrónico][email]. Sin embargo, podremos responder más rápidamente si usas uno de los otros métodos descritos a continuación.

source: 2. If you have a [GitHub][github] account,
es: 2. Si tienes una cuenta de [GitHub][github],

source: or are willing to [create one][github-join], but do not know how to use Git, you can report problems or suggest improvements by [creating an issue][issues]. This allows us to assign the item to someone and to respond to it in a threaded discussion.
es: o estás dispuesto a [crear una][github-join], pero no sabes como usar Git, puedes informar de problemas o sugerir mejoras al [crear un informe de error][issues] (**issue** en inglés). Esto nos permite asignar la tarea a alguien y seguirla en un hilo de discusión.

source: 3. If you are comfortable with Git,
es: 3. Si te sientes cómodo con Git,

source: and would like to add or change material, you can submit a pull request (PR). Instructions for doing this are [included below](#using-github).
es: y te gustaría añadir o cambiar algo del material, puedes enviar una solicitud de inclusión (PR por sus siglas en inglés, **pull request**). Las instrucciones para hacerlo [se incluyen a continuación](#usando-github).

source: ## Where to Contribute
es: ## Dónde contribuir

source: 1. If you wish to change this lesson,
es: 1. Si deseas cambiar esta lección,

source: please work in <https://github.com/datacarpentry/r-intro-geospatial/>, which can be viewed at <https://datacarpentry.org/r-intro-geospatial/>.
es: por favor trabaja en <https://github.com/datacarpentry/r-intro-geospatial/>, que se puede visualizar en <https://datacarpentry.org/r-intro-geospatial/>.

source: 2. If you wish to change the example lesson,
es: 2. Si deseas cambiar la lección de ejemplo,

source: please work in <https://github.com/carpentries/lesson-example>, which documents the format of our lessons and can be viewed at <https://carpentries.github.io/lesson-example>.
es: por favor trabaja en <https://github.com/carpentries/lesson-example>, que documenta el formato de nuestras lecciones y se puede ver en <https://carpentries.github.io/lesson-example>.

source: 3. If you wish to change the template used for workshop websites,
es: 3. Si deseas cambiar la plantilla utilizada para la página web del taller,

source: please work in <https://github.com/carpentries/workshop-template>. The home page of that repository explains how to set up workshop websites, while the extra pages in <https://carpentries.github.io/workshop-template> provide more background on our design choices.
es: por favor trabaja en <https://github.com/carpentries-es/workshop-template-es>. La página de inicio de ese repositorio explica cómo configurar los sitios web de los talleres, mientras que las páginas adicionales en <https://carpentries-es.github.io/workshop-template-es> proporcionan más información sobre nuestros criterios de diseño.

source: 4. If you wish to change CSS style files, tools,
es: 4. Si deseas cambiar los archivos de estilo CSS, herramientas,

source: or HTML boilerplate for lessons or workshops stored in `_includes` or `_layouts`, please work in <https://github.com/carpentries/styles>.
es: o texto estándar HTML para lecciones o talleres almacenados en `_includes` o ` _layouts`, por favor trabaja en <https://github.com/carpentries/styles-es>.

source: ## What to Contribute
es: ## Qué aportar

source: There are many ways to contribute, from writing new exercises and improving existing ones to updating or filling in the documentation and and submitting [bug reports][issues] about things that don't work, aren't clear, or are missing. If you are looking for ideas, please see [the list of issues for this repository][issues], or the issues for [Data Carpentry][dc-issues] and [Software Carpentry][swc-issues] projects.
es: Hay muchas maneras de contribuir, desde escribir ejercicios nuevos y mejorar los existentes hasta actualizar o completar la documentación y enviando [informes de errores][issue] sobre cosas que no funcionan, no son claras o faltan. Si estás buscando ideas, por favor revisa la pestaña 'Issues' para ver la lista de problemas para este repositorio, o la de los problemas de los proyectos de [Data Carpentry][dc-issues], y [Software Carpentry][swc-issues].

source: Comments on issues and reviews of pull requests are just as welcome: we are smarter together than we are on our own. Reviews from novices and newcomers are particularly valuable: it's easy for people who have been using these lessons for a while to forget how impenetrable some of this material can be, so fresh eyes are always welcome.
es: Los comentarios sobre problemas y revisiones de solicitudes de inclusión son bienvenidos: somos más inteligentes juntos que solos. Los comentarios de principiantes y recién llegados son particularmente valiosos. Es fácil para las personas que usan estas lecciones frecuentemente olvidar lo impenetrable que pueden ser partes de este material; por lo tanto, una nueva perspectiva es siempre bienvenida.

source: ## What *Not* to Contribute
es: ## Qué *No* contribuir

source: Our lessons already contain more material than we can cover in a typical workshop, so we are usually *not* looking for more concepts or tools to add to them. As a rule, if you want to introduce a new idea, you must (a) estimate how long it will take to teach and (b) explain what you would take out to make room for it. The first encourages contributors to be honest about requirements; the second, to think hard about priorities.
es: Nuestras lecciones ya contienen más material de lo que podemos cubrir en un taller típico, por lo que normalmente *no* buscamos más conceptos o herramientas para agregarles. Como regla general, si quieres presentar una idea nueva, debes (a) estimar cuánto tiempo tomará enseñarla y (b) explicar lo que sacarías para darle espacio. El primero anima a los contribuyentes a ser honestos acerca de los requisitos; el segundo, pensar bien las prioridades.

source: We are also not looking for exercises or other material that only run on one platform. Our workshops typically contain a mixture of Windows, Mac OS X, and Linux users; in order to be usable, our lessons must run equally well on all three.
es: Tampoco buscamos ejercicios u otro material que sólo se ejecute en una plataforma. Nuestros talleres suelen contener una mezcla de usuarios de Windows, macOS y Linux; para ser utilizable, nuestras lecciones deben correr igualmente bien en las tres plataformas.

source: ## Using GitHub
es: ## Usando GitHub

source: If you choose to contribute via GitHub, you may want to look at [How to Contribute to an Open Source Project on GitHub][how-contribute]. In brief:
es: Si decides contribuir a través de GitHub, puede revisar [How to Contribute to an Open Source Project on GitHub][how-contribute]. En resumen:

source: 1. The published copy of the lesson is in the `gh-pages` branch of the repository
es: 1. La versión publicada de esta lección se encuentra en la rama `gh-pages` del repositorio.

source: (so that GitHub will regenerate it automatically). Please create all branches from that, and merge the [master repository][repo]'s `gh-pages` branch into your `gh-pages` branch before starting work. Please do *not* work directly in your `gh-pages` branch, since that will make it difficult for you to work on other contributions.
es: (para que GitHub lo regenere automáticamente). Por favor crea todas las ramas a partir de eso, y une la rama `gh-pages` del [master repository][repo] a tu rama `gh-pages` antes de comenzar a trabajar. Por favor, *no* trabajes directamente en tu rama `gh-pages`, ya que te dificultará trabajar en otras contribuciones.

source: 2. We use [GitHub flow][github-flow] to manage changes:
es: 2. Usamos [GitHub flow][github-flow] para administrar cambios:

source: Each lesson has at least two Maintainers who review issues and pull requests or encourage others to do so. The Maintainers are community volunteers, and have final say over what gets merged into the lesson.
es: Cada lección tiene mantenedores que revisan problemas y solicitudes de inclusión o invitan a otros que lo hagan. Los mantenedores son voluntarios de la comunidad y tienen la última palabra sobre qué se acepta en la lección.

source: ## Other Resources
es: ## Otros recursos

source: General discussion of [Software Carpentry][swc-site] and [Data Carpentry][dc-site] happens on the [discussion mailing list][discuss-list], which everyone is welcome to join. You can also [reach us by email][contact].
es: Discusiones generales de [Software Carpentry][swc-site] y [Data Carpentry][dc-site] están en la [lista de distribución de discusiones][discuss-list], a la cual todos son bienvenidos. También puedes [contactarnos por correo electrónico][email].

source: --- layout: page title: "Licenses" ---
es: --- layout: page title: "Licencias" ---

source: ## Instructional Material
es: ## Material didáctico

source: All Software Carpentry, Data Carpentry, and Library Carpentry instructional material is made available under the [Creative Commons Attribution license][cc-by-human]. The following is a human-readable summary of (and not a substitute for) the [full legal text of the CC BY 4.0 license][cc-by-legal].
es: Todo el material didáctico de Software Carpentry, Data Carpentry, and Library Carpentry está disponible bajo la licencia [Creative Commons Attribution license][cc-by-human]. El siguiente es un resumen de la licencia (y no un sustituto) del [texto legal completo de la licencia CC BY 4.0 license][cc-by-legal].

source: You are free:
es: Puedes libremente:

source: * to **Share**---copy and redistribute the material in any medium or format
es: * **Compartir**---copiar y redistribuir el material en cualquier medio o formato

source: * to **Adapt**---remix, transform, and build upon the material
es: * **Adaptar**---remezclar, transformar y construir el ejecutable a partir del material

source: for any purpose, even commercially.
es: para cualquier propósito, incluso comercialmente.

source: The licensor cannot revoke these freedoms as long as you follow the license terms.
es: El licenciante no puede revocar estas libertades mientras siga los términos de la licencia.

source: Under the following terms:
es: Bajo los siguientes términos:

source: * **Attribution**---You must give appropriate credit (mentioning that
es: * **Atribución**---Debes dar crédito a éste material de manera adecuada (mencionando que

source: your work is derived from work that is Copyright © Software Carpentry and, where practical, linking to http://software-carpentry.org/), provide a [link to the license][cc-by-human], and indicate if changes were made. You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.
es: tu trabajo es derivado del trabajo que es Copyright © de Software Carpentry y, donde sea práctico, agrega un enlace a http://software-carpentry.org/), proporciona un [enlace a la licencia][cc-by-human], e indica si se han realizado cambios. Puedes hacerlo en cualquier forma razonable, pero no de forma tal que sugiera que tú o su uso tienen el apoyo del licenciante.

source: **No additional restrictions**---You may not apply legal terms or technological measures that legally restrict others from doing anything the license permits. With the understanding that:
es: **No hay restricciones adicionales**---No puedes aplicar términos legales ni medidas tecnológicas que restrinjan legalmente a otros a hacer cualquier uso permitido por la licencia. Con el entendimiento de que:

source: Notices:
es: Avisos:

source: * You do not have to comply with the license for elements of the
es: * No tienes que cumplir con la licencia de los

source: material in the public domain or where your use is permitted by an applicable exception or limitation. * No warranties are given. The license may not give you all of the permissions necessary for your intended use. For example, other rights such as publicity, privacy, or moral rights may limit how you use the material.
es: materiales que estén en el dominio público o cuando su uso esté permitido por una excepción o limitación aplicable. * No se dan garantías. La licencia puede no darte todos los permisos necesarios para el uso que tengas previsto. Por ejemplo, otros derechos como publicidad, privacidad, o derechos morales pueden limitar la forma en que uses el material.

source: Except where otherwise noted, the example programs and other software provided by Software Carpentry and Data Carpentry are made available under the [OSI][osi]-approved [MIT license][mit-license].
es: Salvo que se indique lo contrario, los programas de ejemplo y otro software proporcionado por Software Carpentry y Data Carpentry están disponibles bajo el [OSI][osi]-aprobada [Licencia de MIT][mit-license].

source: Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
es: Se concede permiso, de forma gratuita, a cualquier persona que obtenga una copia de este software y los archivos de documentación asociados (el "Software"), para tratar el Software sin restricciones, incluyendo sin limitación, los derechos de uso, copia, modificación, fusión, publicación, distribución, sublicencia y/o venta de copias del Software, y permitir a las personas a quienes se les proporciona el Software que lo hagan, sujeto a las siguientes condiciones:

source: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
es: El aviso de copyright anterior y este aviso de permiso se incluirán en todas las copias o partes sustanciales del Software.

source: THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
es: EL SOFTWARE ES PROPORCIONADO "TAL CUAL", SIN GARANTÍA DE NINGÚN TIPO, EXPRESO O IMPLÍCITO, INCLUYENDO PERO NO LIMITADO A LAS GARANTÍAS DE COMERCIALIZACIÓN, APTITUD PARA UN PROPÓSITO PARTICULAR Y SIN INFRACCIÓN. EN NINGÚN CASO SERÁN LOS AUTORES O LOS TITULARES DE LOS DERECHOS DE AUTOR RESPONSABLE POR CUALQUIER RECLAMO, DAÑOS U OTRA RESPONSABILIDAD, YA SEA EN ACCIÓN DEL CONTRATO, EXTRACONTRACTUAL O DE OTRO TIPO, DERIVADOS, FUERA DE O EN CONEXIÓN CON EL SOFTWARE O EL USO U OTROS TRATOS EN EL SOFTWARE.

source: ## Trademark
es: ## Marca registrada

source: "Software Carpentry" and "Data Carpentry" and their respective logos are registered trademarks of [Community Initiatives][CI].
es: "Software Carpentry" y "Data Carpentry" y sus respectivos logos son marcas registradas de [Community Initiatives][CI].

source: [cc-by-human]: https://creativecommons.org/licenses/by/4.0/ [cc-by-legal]: https://creativecommons.org/licenses/by/4.0/legalcode [mit-license]: https://opensource.org/licenses/mit-license.html [ci]: http://communityin.org/ [osi]: https://opensource.org
es: [cc-by-human]: https://creativecommons.org/licenses/by/4.0/deed.es [cc-by-legal]: https://creativecommons.org/licenses/by/4.0/legalcode.es [mit-license]: https://opensource.org/licenses/mit-license.html [ci]: http://communityin.org/ [osi]: https://opensource.org

source: # Intro to R for Geospatial data
es: # Introducción a R para datos Geoespaciales

source: <!-- TODO: Update first pararaph of the introduction if they data changes -->
es: <!-- TODO: Actualiza el primer párrafo de la introducción si cambia los datos -->

source: An introduction to R for non-programmers using the [Gapminder][gapminder] data. Please see <https://datacarpentry.org/r-intro-geospatial> for a rendered version of this material, [the lesson template documentation][lesson-example] for instructions on formatting, building, and submitting material, or run `make` in this directory for a list of helpful commands.
es: Una introducción a R para los no programadores que usan los datos [Gapminder][gapminder]. Por favor consulta <https://datacarpentry.org/r-intro-geospatial> para obtener una versión de este material, [la documentación de la plantilla de la lección][lesson-example] para obtener instrucciones sobre formateo, construcción y envío de material, o ejecuta `make` en este directorio para obtener una lista de comandos útiles.

source: The goal of this lesson is to revise best practices for using R in data analysis. This lesson is a modification of the [Software Carpentry: Programming with R](https://swcarpentry.github.io/r-novice-gapminder), and is part of the [Data Carpentry Geospatial Curriculum](https://datacarpentry.org/geospatial-workshop/). It introduces the R skills needed in the [Introduction to Raster and Vector Geospatial Data lesson](https://datacarpentry.org/r-raster-vector-geospatial).
es: El objetivo de esta lección es revisar las mejores prácticas para usar R en el análisis de datos. Esta lección es una modificación de [Software Carpentry: Programación con R](https://swcarpentry.github.io/r-novice-gapminder), y forma parte del [Currículo Geoespacial de Data Carpentry](https://datacarpentry.org/geospatial-workshop/). El cual, introduce las habilidades R necesarias en la [Introducción a la lección de datos Geoespaciales de ráster y vector](https://datacarpentry.org/r-raster-vector-geospatial).

source: R is commonly used in many scientific disciplines for statistical analysis and its array of third-party packages. These materials are designed to provide attendees with a concise introduction in the fundamentals of R, and to introdue best practices for scientific computing: breaking down analyses into modular units, task automation, and encapsulation, before getting started with working with geospatial data.
es: R se usa comúnmente en muchas disciplinas científicas para el análisis estadístico y el conjunto de paquetes de terceros. Estos materiales están diseñados para proporcionar a los asistentes una introducción concisa en los fundamentos de R, e introducir las mejores prácticas para la computación científica: desglosar los análisis en unidades modulares, automatización de tareas y encapsulación, antes de comenzar a trabajar con datos geoespaciales.

source: Note that this workshop focuses on the fundamentals of the programming language R, and not on statistical analysis.
es: Nota que este taller se centra en los fundamentos del lenguaje de programación en R, y no en el análisis estadístico.

source: The lesson contains material than can be taught in about 4 hours. The [instructor notes page](https://datacarpentry.org/r-intro-geospatial/guide/index.html) has some suggested lesson plans suitable for a one or half day workshop.
es: La lección contiene material que se puede enseñar en aproximadamente 4 horas. La [página de notas del instructor](https://datacarpentry.org/r-intro-geospatial/guide/index.html) tiene algunos planes de lecciones sugeridas adecuadas para un taller de uno o medio día.

source: #### Maintainers:
es: #### Mantenedores:
