Repository: carpentries-i18n/i18n
Catalog: po/r-intro-geospatial.*.po
Languages: es

source: The `read.table` function is used for reading in tabular data stored in a text file where the columns of data are separated by punctuation characters such as CSV files (csv = comma-separated values). Tabs and commas are the most common punctuation characters used to separate or delimit data points in csv files. For convenience R provides 2 other versions of `read.table`. These are: `read.csv` for files where the data are separated with commas and `read.delim` for files where the data are separated with tabs. Of these three functions `read.csv` is the most commonly used. If needed it is possible to override the default delimiting punctuation marks for both `read.csv` and `read.delim`.
es: La función `read.table` se usa para leer datos tabulados guardados en un archivo de texto donde las columnas de los datos están separadas por caracteres de puntuación como sucede en los archivos CSV (csv = valores separados por comas). Tabuladores y comas son los caracteres más usados para separar o delimitar datos en archivos csv. Por comodidad R provee dos otras versiones de `read.table`. Esas son: `read.csv` para archivos donde los datos están separados por comas y `read.delim` para archivos donde los datos están separados por tabuladores. De esas tres funciones `read.csv` es la más usada. Si es necesario, es posible cambiar las el carácter por defecto delimitando las marcas de puntuación para ambos `read.csv` y `read.delim`.

source: We can begin exploring our dataset right away, pulling out columns by specifying them using the `$` operator:
es: Podemos empezar explorando nuestro conjunto de datos de inmediato, extrayendo columnas especificándolas usando el operador `$`:

source: We can do other operations on the columns. For example, if we discovered that the life expectancy is two years higher:
es: Podemos hacer otras operaciones en las columnas. Por ejemplo, si descubrimos que la esperanza de vida es dos años más alta:

source: But what about:
es: Pero qué pasa:

source: Understanding what happened here is key to successfully analyzing data in R.
es: Entender lo que sucedió aquí es clave para analizar con éxito los datos en R.

source: ## Data Types
es: ## Tipo de datos

source: If you guessed that the last command will return an error because `77.2` plus `"Denmark"` is nonsense, you're right - and you already have some intuition for an important concept in programming called *data classes*. We can ask what class of data something is:
es: Si pensaste que el último comando resultaría en un error porque `77.2` más `"Denmark"` no tiene sentido, entonces acertaste - y ya tienes una intuición para un concepto importante en programación llamado *clases de datos*. Podemos preguntar qué clase de datos es algo:

source: There are 6 main types: `numeric`, `integer`, `complex`, `logical`, `character`, and `factor`.
es: Hay 6 tipos de datos fundamentales: `numeric`, `integer`, `complex`, `logical`, `character`, y `factor`.

source: ~~~ class(1L) # The L suffix forces the number to be an integer, since by default R uses float numbers ~~~
es: ~~~ class(1L) # El sufijo L fuerza que el número sea un entero ya que R los guarda como punto flotante por defecto ~~~

source: No matter how complicated our analyses become, all data in R is interpreted a specific data class. This strictness has some really important consequences.
es: No importa cuan complicado sea nuestro análisis, todos los datos en R se convierten a una clase de datos específica. Este rigor tiene algunas consecuencias realmente importantes.

source: A user has added new details of age expectancy. This information is in the file `data/nordic-data-2.csv`.
es: Un usuario ha añadido nuevos detalles a la esperanza de vida. Dicha información está en el archivo `data/nordic-data-2.csv`.

source: Load the new nordic data as `nordic_2`, and check what class of data we find in the `lifeExp` column:
es: Carga los datos nórdicos nuevos como `nordic_2`, y comprueba que clase de datos encontramos en la columna `lifeExp`:

source: Oh no, our life expectancy lifeExp aren't the numeric type anymore! If we try to do the same math we did on them before, we run into trouble:
es: ¡Oh no, nuestra esperanza de vida lifeExp ya no es de tipo numérico! Si intentamos hacer los mismos cálculos matemáticos que hicimos con ellos antes, nos metemos en problemas:

source: What happened? When R reads a csv file into one of these tables, it insists that everything in a column be the same class; if it can't understand *everything* in the column as numeric, then *nothing* in the column gets to be numeric. The table that R loaded our nordic data into is something called a dataframe, and it is our first example of something called a *data structure* - that is, a structure which R knows how to build out of the basic data types.
es: ¿Qué ha sucedido? Cuando R lee un archivo csv en una de esas tablas, R insiste que todo en una columna sea de la misma clase. Si R no puede entender *todo* en una columna como numérico, entonces a *nada* en la columna se le asigna el tipo numérico. La tabla en la que R cargó nuestros datos nórdicos es algo conocido como marco de datos (dataframe), y es nuestro primer ejemplo de lo que se conoce como una *estructura de datos* - es decir, una estructura que R sabe como construir partiendo de tipo de datos básicos.

source: We can see that it is a dataframe by calling the `class()` function on it:
es: Podemos ver que us un marco de datos (**dataframe**) llamándo la función `class()` en ella:

source: In order to successfully use our data in R, we need to understand what the basic data structures are, and how they behave.
es: Para usar con éxito nuestros datos en R, necesitamos entender cuales son las estructuras de datos fundamentales y como se comportan.

source: ## Vectors and Type Coercion
es: ## Vectores y Tipo de Coerción

source: To better understand this behavior, let's meet another of the data structures: the vector.
es: Para mejor entender este comportamiento, conozcamos otra de las estructuras de datos: el vector.

source: A vector in R is essentially an ordered list of things, with the special condition that everything in the vector must be the same basic data type. If you don't choose the data type, it'll default to `logical`; or, you can declare an empty vector of whatever type you like.
es: Un vector en R es esencialmente un lista de cosas ordenadas, con la condición especial de que todo en el vector tiene que ser del mismo tipo de dato. Si no eliges el tipo de dato, por defecto será `lógico`; o, puedes declarar un vector vacío del tipo que quieras.

source: You can check if something is a vector:
es: Puedes revisar si algo es un vector:

source: The somewhat cryptic output from this command indicates the basic data type found in this vector - in this case `chr`, character; an indication of the number of things in the vector - actually, the indexes of the vector, in this case `[1:3]`; and a few examples of what's actually in the vector - in this case empty character strings. If we similarly do
es: El resultado un poco críptico de este comando indica el tipo básico de dato encontrado en este vector - en este caso `chr`, carácter; una indicación del numero de cosas en el vector - en realidad, los índices del vector, en este caso `[1:3]`; y unos ejemplos de lo que está realmente en el vector - en este caso cadenas de caracteres vacíos. Si lo hacemos de manera similar

source: we see that `nordic$lifeExp` is a vector, too - the columns of data we load into R data frames are all vectors, and that's the root of why R forces everything in a column to be the same basic data type.
es: vemos que `nordic$lifeExp` también es un vector - las columnas de datos que cargamos en los data frames en R, son todas vectores, y es por eso que R obliga que todo en una columna para ser del mismo tipo de dato básico.

source: > ## Discussion 1
es: > ## Discusión 1

source: > > Why is R so opinionated about what we put in our columns of data? > How does this help us? > > > ## Discussion 1 > > > > By keeping everything in a column the same, we allow ourselves to make simple > > assumptions about our data; if you can interpret one entry in the column as a > > number, then you can interpret *all* of them as numbers, so we don't have to > > check every time. This consistency is what people mean when they talk about > > *clean data*; in the long run, strict consistency goes a long way to making > > our lives easier in R.
es: > > ¿Por qué R es tan dogmático con los datos que ponemos en nuestras columnas? > ¿Cómo esto nos ayuda? > > > ## Discusión 1 > > > > Manteniendo todo en una columna igual , nos permitimos hacer simples supuestos > > sobre nuestros datos; si puedes interpretar una entrada en una columna como un > > número, entonces puedes interpretar *todas* ellas como números, así no tenemos que > > verificar todo el tiempo. Esta consistencia es a lo que se refieren las personas cuando hablan > > de *datos limpios*; a la larga, la estricta consistencia contribuye considerablemente a hacer > > nuestras vidas más fáciles en R.

source: You can also make vectors with explicit contents with the combine function:
es: También puedes crear vectores con contenido explícito usando la función combine:

source: Given what we've learned so far, what do you think the following will produce?
es: Dado lo que aprendimos hasta ahora, ¿qué crees que va a resultar de lo siguente?

source: This is something called *type coercion*, and it is the source of many surprises and the reason why we need to be aware of the basic data types and how R will interpret them. When R encounters a mix of types (here numeric and character) to be combined into a single vector, it will force them all to be the same type. Consider:
es: Esto es algo llamado *tipo coerción*, y es la fuente de muchas sorpresas y la razón por la que debemos conocer los tipos de dato básicos y cómo R los interpreta. Cuando R consigue una mezcla de tipos (aquí numéricos y de caracteres) para combinarlos en un sólo vector, los obligará a todos ser del mismo tipo. Considera:

source: The coercion rules go: `logical` -> `integer` -> `numeric` -> `complex` -> `character`, where -> can be read as *are transformed into*. You can try to force coercion against this flow using the `as.` functions:
es: Las reglas de coerción son: `logical` -> `integer` -> `numeric` -> `complex` -> `character`, donde -> puede ser leído como *se transfoman en*. Puedes intentar forzar la coerción contra este flujo usando las funciones `as.`:

source: As you can see, some surprising things can happen when R forces one basic data type into another! Nitty-gritty of type coercion aside, the point is: if your data doesn't look like what you thought it was going to look like, type coercion may well be to blame; make sure everything is the same type in your vectors and your columns of data frames, or you will get nasty surprises!
es: Como puedes ver, ¡algunas cosas sorprendentes pueden ocurrir cuando R fuerza un tipo de datos básico en otro! Dejando de lado la cuestión de la coerción de tipo, el punto es: si tus datos no se parecen a lo que pensabas que iban a ser , la coerción de tipo bien puede ser la culpable; asegúrate que todo sea del mismo tipo en tus vectores y en tus columnas del data frame , o ¡tendrás sorpresas desagradables!

source: > Given what you now know about type conversion, look at the class of
es: > Dado lo que sabe ahora sobre la conversión de tipos, observe la clase de

source: > data in `nordic_2$lifeExp` and compare it with `nordic$lifeExp`. Why are
es: > datos en `nordic_2$lifeExp` y compáralo con `nordic$lifeExp`. ¿Por qué

source: > these columns different classes?
es: > estas columnas son de diferentes clases?

source: > > ## Solution
es: > > ## Solución

source: > > The data in `nordic_2$lifeExp` is stored as factors rather than
es: > > Los datos en `nordic_2$lifeExp` son almacenados como factor en lugar de

source: > > numeric. This is because of the "or" character string in the third
es: > > numérico. Esto es por el caracter tipo texto (*string*) "or" en la tercer

source: > > data point. "Factor" is R's special term for categorical data.
es: > > punto de datos. "Factor" es el término especial de R para los datos categóricos.

source: > > We will be working more with factor data later in this workshop.
es: > > Trabajaremos más con datos de factores más adelante en este taller.

source: The combine function, `c()`, will also append things to an existing vector:
es: La función de combinación, `c()`, también agregará cosas a un vector existente:

source: You can also make series of numbers:
es: También puedes hacer series de números:

source: We can ask a few questions about vectors:
es: Puedes hacer algunas preguntas sobre vectores:

source: Finally, you can give names to elements in your vector:
es: Finalmente, puedes poner nombres a los elementos en tu vector:

source: > > Start by making a vector with the numbers 1 through 26. > Multiply the vector by 2, and give the resulting vector > names A through Z (hint: there is a built in vector called `LETTERS`) > > > ## Solution to Challenge 2 > > > > > > ~~~ > > x <- 1:26 > > x <- x * 2 > > names(x) <- LETTERS > > ~~~ > > {: .language-r}
es: > >Empieza por hacer un vector con los números 1 a 26. >Multiplica el vector por 2, y da al vector resultante los >nombres A a Z (sugerencia: hay un vector incorporado llamado `LETTERS`) > >>##Solución al Desafío 2 >> >> >>~~~ >><- 1:26 > > x <- x * 2 > > names(x) <- LETTERS >> ~~~ > > {: .language-r}

source: ## Factors
es: ## Factores

source: We said that columns in data frames were vectors:
es: Dijimos que las columnas en los **dataframes** eran vectores:

source: These make sense. But what about
es: Esto tiene sentido. Pero qué pasa con

source: Another important data structure is called a factor. Factors look like character data, but are used to represent categorical information. For example, let's make a vector of strings labeling nordic countries for all the countries in our study:
es: Otra estructura de datos importante se llama factor. Los factores se parecen a los datos de tipo carácter, pero son usados para representar información categórica. Por ejemplo, hagamos un vector de tipo **string** (cadena de caracteres) etiquetando los países nórdicos para todos los países de nuestro estudio.

source: We can turn a vector into a factor like so:
es: Podemos convertir un vector en un factor así:

source: Now R has noticed that there are 5 possible categories in our data - but it also did something surprising; instead of printing out the strings we gave it, we got a bunch of numbers instead. R has replaced our human-readable categories with numbered indices under the hood, this is necessary as many statistical calculations utilise such numerical representations for categorical data:
es: Ahora R identificó que hay 5 categorías posibles en nuestros datos - pero también realizó algo sorprendente; en vez de imprimir la secuencia de caracteres que le dimos, tenemos un montón de números en su lugar. R remplazó nuestras categorías legibles para humanos con índices numerados por detrás, esto es necesario ya que muchos cálculos estadísticos utilizan esta representación numérica para datos categóricos.

source: > ## Challenge
es: > ## Desafío

source: > > Can you guess why these numbers are used to represent these countries? > >> ## Solution >> >> They are sorted in alphabetical order
es: > > ¿Puedes adivinar por qué estos números son utilizados para representar a estos países? > >> ## Solución >> >> Están ordenados alfabéticamente.

source: > > Is there a factor in our `nordic` data frame? what is its name? Try using > `?read.csv` to figure out how to keep text columns as character vectors > instead of factors; then write a command or two to show that the factor in > `nordic` is actually a character vector when loaded in this way. > > > ## Solution to Challenge 3 > > > > One solution is use the argument `stringAsFactors`: > > > > > > ~~~ > > nordic <- read.csv(file = "data/nordic-data.csv", stringsAsFactors = FALSE) > > str(nordic$country) > > ~~~ > > {: .language-r} > > > > Another solution is use the argument `colClasses` > > that allow finer control. > > > > > > ~~~ > > nordic <- read.csv(file="data/nordic-data.csv", colClasses=c(NA, NA, "character")) > > str(nordic$country) > > ~~~ > > {: .language-r} > > > > Note: new students find the help files difficult to understand; make sure to let them know > > that this is typical, and encourage them to take their best guess based on semantic meaning, > > even if they aren't sure.
es: > > ¿Hay un factor en nuestro **dataframe** `nordic`? ¿Cual es su nombre? Trata de usar > `?read.csv` para deducir como mantener las columnas de texto como vectores de caracteres > en vez de factores; luego escribe un comando o dos para mostrar que el factor en > `nordic` es en realidad un vector de caracteres cuando está cargado de esta manera . > > > ## Solución al Desafío 3 > > > > Una solución es usar el argumento `stringAsFactors`: > > > > > > ~~~ > > nordic <- read.csv(file = "data/nordic-data.csv", stringsAsFactors = FALSE) > > str(nordic$country) > > ~~~ > > {: .language-r} > > > > Otra solución es usar el argumento `colClasses` > > que permite un control más fino. > > > > > > ~~~ > > nordic <- read.csv(file="data/nordic-data.csv", colClasses=c(NA, NA, "character")) > > str(nordic$country) > > ~~~ > > {: .language-r} > > > > Nota: nuevos estudiantes encuentran difícil de entender los archivos de ayuda ; asegúrate de hacerles saber > > que es común, y de alentarlos a hacer su mejor conjetura sobre el significado semántico, > > incluso si no están seguros.

source: When doing statistical modelling, it's important to know what the baseline levels are. This is assumed to be the first factor, but by default factors are labeled in alphabetical order. You can change this by specifying the levels:
es: Al hacer modelos estadísticos, es importante conocer cuales son los **levels** (categorías) de base. Se supone que este es el primer factor, pero por defecto los factores se etiquetan alfabéticamente. Puedes cambiar esto al especificar los **levels** (categorías):

source: In this case, we've explicitly told R that "control" should represented by 1, and "case" by 2. This designation can be very important for interpreting the results of statistical models!
es: En este caso, le dijimos a R que "control" debería ser representado con 1, y "case" con 2. ¡Esta designación puede ser muy importante para interpretar los resultados de modelos estadísticos!

source: ## Lists
es: ## Listas

source: Another data structure you'll want in your bag of tricks is the `list`. A list is simpler in some ways than the other types, because you can put anything you want in it:
es: Otra estructura de datos que querrás tener en tu bolsa de trucos es la `list`. Una lista es en de algún modo más simple que otros tipos, porque puedes poner lo quieras dentro:

source: We can now understand something a bit surprising in our data frame; what happens if we compare `str(nordic)` and `str(another_list)`:
es: Ahora podemos entender algo un poco sorprendente en nuestro **dataframe**; que ocurre si comparamos `str(nordic)` y `str(another_list)`:

source: We see that the output for these two objects look very similar. It is because data frames are lists 'under the hood'. Data frames are a special case of lists where each element (the columns of the data frame) have the same lengths.
es: Vemos que los resultados para estos dos objetos se ven parecidos. Esto es porque los dataframes son listas 'tras bambalinas'. Los **dataframes** son un caso especial de lista donde cada elemento (las columnas del **dataframe**) tiene el mismo largo.

source: In our `nordic` example, we have an integer, a double and a logical variable. As we have seen already, each column of data frame is a vector.
es: En nuestro ejemplo `nordic`, tenemos una variable **integer**, una variable **double** y una variable **logical**. Como ya vimos, cada columna del **dataframe** es un vector.

source: Each row is an *observation* of different variables, itself a data frame, and thus can be composed of elements of different types.
es: Cada fila es una *observación* de diferentes variables, en sí misma un **dataframe**, y entonces puede estar compuesto de elementos de diferentes tipos.

source: > ## Challenge 4
es: > ## Desafío 4
