Repository: carpentries-i18n/i18n
Catalog: po/r-intro-geospatial.*.po
Languages: es

source: > > There are several subtly different ways to call variables, observations and > elements from data frames: > > - `nordic[1]` > - `nordic[[1]]` > - `nordic$country` > - `nordic["country"]` > - `nordic[1, 1]` > - `nordic[, 1]` > - `nordic[1, ]` > > Try out these examples and explain what is returned by each one. > > *Hint:* Use the function `class()` to examine what is returned in each case. > > > ## Solution to Challenge 4 > > > > > > ~~~ > > nordic[1] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > country > > 1 Denmark > > 2 Sweden > > 3 Norway > > ~~~ > > {: .output} > > > > We can think of a data frame as a list of vectors. The single brace `[1]` > > returns the first slice of the list, as another list. In this case it is the > > first column of the data frame. > > > > > > ~~~ > > nordic[[1]] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > [1] "Denmark" "Sweden" "Norway" > > ~~~ > > {: .output} > > > > The double brace `[[1]]` returns the contents of the list item. In this case > > it is the contents of the first column, a _vector_ of type _factor_. > > > > > > ~~~ > > nordic$country > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > [1] "Denmark" "Sweden" "Norway" > > ~~~ > > {: .output} > > > > This example uses the `$` character to address items by name. _coat_ is the > > first column of the data frame, again a _vector_ of type _factor_. > X > > > > ~~~ > > nordic["country"] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > country > > 1 Denmark > > 2 Sweden > > 3 Norway > > ~~~ > > {: .output} > > Here we are using a single brace `["country"]` replacing the index number > > with the column name. Like example 1, the returned object is a _list_. > > > > > > ~~~ > > nordic[1, 1] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > [1] "Denmark" > > ~~~ > > {: .output} > > > > This example uses a single brace, but this time we provide row and column > coordinates. The returned object is the value in row 1, column 1. The object > is an _integer_ but because it is part of a _vector_ of type _factor_, R > displays the label "Denmark" associated with the integer value. > > > > > > ~~~ > > nordic[, 1] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > [1] "Denmark" "Sweden" "Norway" > > ~~~ > > {: .output} > > > > Like the previous example we use single braces and provide row and column > > coordinates. The row coordinate is not specified, R interprets this missing > > value as all the elements in this _column_ _vector_. > > > > > > ~~~ > > nordic[1, ] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > country year lifeExp > > 1 Denmark 2002 77.2 > > ~~~ > > {: .output} > > > > Again we use the single brace with row and column coordinates. The column > > coordinate is not specified. The return value is a _list_ containing all the > > values in the first row.
es: > > Hay varias maneras sutilmente diferentes de llamar variables, observaciones y > elementos de los **dataframes**: > > - `nordic[1]` > - `nordic[[1]]` > - `nordic$country` > - `nordic["country"]` > - `nordic[1, 1]` > - `nordic[, 1]` > - `nordic[1, ]` > > Prueba estos ejemplos y explica que se regresa en cada uno. > > *Sugerencia:* Usa la función `class()` para examinar que se devuelve en cada caso. > > > ## Solución al Desafío 4 > > > > > > ~~~ > > nordic[1] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > country > > 1 Denmark > > 2 Sweden > > 3 Norway > > ~~~ > > {: .output} > > > > Podemos pensar en un **dataframe** como una lista de vectores. El corchete simple `[1]` > > devuelve la primer parte de la lista, como otra lista. En este caso es la > > primer columna del **dataframe**. > > > > > > ~~~ > > nordic[[1]] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > [1] "Denmark" "Sweden" "Norway" > > ~~~ > > {: .output} > > > > El corchete doble `[[1]]` regresa el contenido del elemento de la lista. En este caso > > es el contenido de la primer columna, un_vector_del tipo _factor_. > > > > > > ~~~ > > nordic$country > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > [1] "Denmark" "Sweden" "Norway" > > ~~~ > > {: .output} > > > > Este ejemplo use el carácter `$` para dirigirse a elementos por su nombre. _coat_ es la > > primer columna del **dataframe**, de nuevo un _vector_ de tipo _factor_. > X > > > > ~~~ > > nordic["country"] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > country > > 1 Denmark > > 2 Sweden > > 3 Norway > > ~~~ > > {: .output} > > Aquí usamos un corchete sencillo `["country"]` remplazando el índice numérico > > con el nombre de la columna. Como en el ejemplo 1, el objeto devuelto es una _lista_. > > > > > > ~~~ > > nordic[1, 1] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > [1] "Denmark" > > ~~~ > > {: .output} > > > > Este ejemplo usa un corchete sencillo, pero esta vez brindamos las coordenadas > de fila y columna. El objeto devuelto es el valor en la fila 1, columna 1. El objeto > un _integer_ pero debido a que es parte de un _vector_ de tipo _factor_, R > muestra la etiqueta "Denmark" asociada con el valor entero (**integer**). > > > > > > ~~~ > > nordic[, 1] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > [1] "Denmark" "Sweden" "Norway" > > ~~~ > > {: .output} > > > > Como los ejemplos previos, usamos el corchete sencillos y brindamos las coordenadas de > > fila y columna. La coordenada de fila no está especificada, R interpreta este valor > > faltante como todos los elementos en esta _columna_ _vector_ > > > > > > ~~~ > > nordic[1, ] > > ~~~ > > {: .language-r} > > > > > > > > ~~~ > > country year lifeExp > > 1 Denmark 2002 77.2 > > ~~~ > > {: .output} > > > > Otra vez usamos el corchete sencillo con las coordenadas de fila y columna. La coordenada de > > columna no está especificada. El valor devuelto es una *lista* que contiene todos los > > valores en la primer fila.

source: --- # Please do not edit this file directly; it is auto generated. # Instead, please edit 04-data-structures-part2.md in _episodes_rmd/ title: "Exploring Data Frames" teaching: 20 exercises: 10 questions: - "How can I manipulate a data frame?" objectives: - "Remove rows with `NA` values." - "Append two data frames." - "Understand what a `factor` is." - "Convert a `factor` to a `character` vector and vice versa." - "Display basic properties of data frames including size and class of the columns, names, and first few rows." keypoints: - "Use `cbind()` to add a new column to a data frame." - "Use `rbind()` to add a new row to a data frame." - "Remove rows from a data frame." - "Use `na.omit()` to remove rows from a data frame with `NA` values." - "Use `levels()` and `as.character()` to explore and manipulate factors." - "Use `str()`, `nrow()`, `ncol()`, `dim()`, `colnames()`, `rownames()`, `head()`, and `typeof()` to understand the structure of a data frame." - "Read in a csv file using `read.csv()`." - "Understand what `length()` of a data frame represents." source: Rmd ---
es: --- # Please do not edit this file directly; it is auto generated. # Instead, please edit 04-data-structures-part2.md in _episodes_rmd/ title: "Explorando Dataframes" teaching: 20 exercises: 10 questions: - "¿Cómo puedo manipular un dataframe?" objectives: - "Eliminar filas con valores `NA`." - "Añadir dos dataframes." - "Entender qué es un `factor`." - "Convertir un `factor` en un vector `character` y viceversa." - "Mostrar las propiedades básicas de los dataframes, incluido el tamaño y la clase de las columnas, los nombres y las primeras filas." keypoints: - "Usar `cbind()` para agregar una nueva columna a un dataframe." - "Usar `rbind()` para agregar una nueva fila a un dataframe." - "Eliminar filas de un dataframe." - "Usar `na.omit()` para eliminar filas de un dataframe con valores `NA`. " - "Usar `levels()` y `as.character()` para explorar y manipular `factores`." - "Usar `str()`, `nrow()`, `ncol()`, `dim()`, `colnames()`, `rownames()`, `head()` y `typeof()` para comprender la estructura de un dataframe." - "Leer en un archivo csv usando `read.csv()`." - "Comprender quE representa`length()` en un dataframe." source: Rmd ---

source: At this point, you've seen it all: in the last lesson, we toured all the basic data types and data structures in R. Everything you do will be a manipulation of those tools. But most of the time, the star of the show is the data frame—the table that we created by loading information from a csv file. In this lesson, we'll learn a few more things about working with data frames.
es: Hasta aquí, lo has visto todo: en la última lección, hemos recorrido todos los tipos de datos y estructuras básicas en R. Todo lo que harás será utilizar esas herramientas. Pero la mayor parte del tiempo, la estrella del show es el data.frame—la tabla que hemos creado cargando la información desde un archivo csv. En esta lección aprenderemos algunas cosas más sobre el trabajo con `data.frames`.

source: ## Realistic example
es: ## Un ejemplo práctico

source: We already learned that the columns of a data frame are vectors, so that our data are consistent in type throughout the columns. So far, you have seen the basics of manipulating data frames with our nordic data; now let’s use those skills to digest a more extensive dataset. Let’s read in the gapminder dataset that we downloaded previously:
es: Ya hemos aprendido que las columnas de un dataframe son vectores, que permiten que nuestros datos sean consistentes con su tipo de datos en cada columna. Hasta ahora, haz visto los fundamentos de la manipulación de dataframes con nuestros datos nórdicos; ahora usaremos esas habilidades para procesar un conjunto de datos más extenso. Leamos en R el conjunto de datos de gapminder que hemos descargado anteriormente:

source: > ## Miscellaneous Tips
es: > ## Consejos Varios

source: > > * Another type of file you might encounter are tab-separated value files > (.tsv). To specify a tab as a separator, use `"\\t"` or `read.delim()`. > > * Files can also be downloaded directly from the Internet into a local folder > of your choice onto your computer using the `download.file` function. The > `read.csv` function can then be executed to read the downloaded file from the > download location, for example, > > > ~~~ > download.file("https://raw.githubusercontent.com/datacarpentry/r-intro-geospatial/master/_episodes_rmd/data/gapminder_data.csv", > destfile = "data/gapminder_data.csv") > gapminder <- read.csv("data/gapminder_data.csv") > ~~~ > {: .language-r} > > * Alternatively, you can also read in files directly into R from the Internet > by replacing the file paths with a web address in `read.csv`. One should > note that in doing this no local copy of the csv file is first saved onto > your computer. For example, > > > ~~~ > gapminder <- read.csv("https://raw.githubusercontent.com/datacarpentry/r-intro-geospatial/master/_episodes_rmd/data/gapminder_data.csv") > ~~~ > {: .language-r} > > * You can read directly from excel spreadsheets without > converting them to plain text first by using the [readxl](https://cran.r-project.org/package=readxl) package.
es: > > * Otro tipo de archivos que puedes encontrar son los archivos de valores separados por tabulaciones (.tsv). Para especificar una pestaña como separador, usa `"\\t"` o `read.delim`. > > * Los archivos también pueden ser descargados directamente de Internet a una carpeta local de tu elección en tu computadora usando la función `download.file`. La función `read.csv` se ejecuta después para leer el archivo descargado desde el lugar dónde se lo guardó , por ejemplo, > > > ~~~ > download.file("https://raw.githubusercontent.com/datacarpentry/r-intro-geospatial/master/_episodes_rmd/data/gapminder_data.csv", > destfile = "data/gapminder_data.csv") > gapminder <- read.csv("data/gapminder_data.csv") > ~~~ > {: .language-r} > > * Alternativamente, también puedes leer archivos de Internet directamente en R reemplazando en `read.csv` la ruta del archivo por su dirección web. Hay que tener en cuenta que al hacer esto no se guardará primero una copia local del archivo csv en tu computadora. Por ejemplo, > > > ~~~ > gapminder <- read.csv("https://raw.githubusercontent.com/datacarpentry/r-intro-geospatial/master/_episodes_rmd/data/gapminder_data.csv") > ~~~ > {: .language-r} > > * Puedes leer directamente las hojas de cálculo de Excel sin necesidad de convertirlas primero a texto plano usando el paquete [readxl](https://cran.r-project.org/package=readxl).

source: Let's investigate the `gapminder` data frame a bit; the first thing we should always do is check out what the data looks like with `str`:
es: Investiguemos un poco el dataframe `gapminder` ; lo primero que siempre debemos hacer es comprobar cómo se ven los datos con `str`:

source: We can also examine individual columns of the data frame with our `class` function:
es: También podemos examinar las columnas individuales del dataframe con la función `class`:

source: We can also interrogate the data frame for information about its dimensions; remembering that `str(gapminder)` said there were 1704 observations of 6 variables in gapminder, what do you think the following will produce, and why?
es: También podemos interrogar el dataframe para obtener información sobre sus dimensiones; recordando que `str(gapminder)` decía que había 1704 observaciones de 6 variables en gapminder, ¿qué crees que producirá lo siguiente, y por qué?

source: A fair guess would have been to say that the length of a data frame would be the number of rows it has (1704), but this is not the case; it gives us the number of columns.
es: Una buena suposición diría que la longitud de un dataframe sería el número de filas que tiene (1704), pero no, en éste el caso nos da el número de columnas.

source: To get the number of rows and columns in our dataset, try:
es: Para obtener el número de filas y columnas en nuestro conjunto de datos, prueba:

source: Or, both at once:
es: O, ambas a la vez:

source: We'll also likely want to know what the titles of all the columns are, so we can ask for them later:
es: También es probable que queramos saber cuáles son los nombres de todas las columnas, para que más tarde podamos consultar por nombre:

source: At this stage, it's important to ask ourselves if the structure R is reporting matches our intuition or expectations; do the basic data types reported for each column make sense? If not, we need to sort any problems out now before they turn into bad surprises down the road, using what we've learned about how R interprets data, and the importance of *strict consistency* in how we record our data.
es: En esta etapa, es importante preguntarnos si la estructura R que está informando coincide con nuestra intuición o expectativas; ¿los tipos de datos básicos informados para cada columna tienen sentido? Si no es así, tenemos que resolver cualquier problema ahora, antes de que se convierta en una mala sorpresa, usando lo que hemos aprendido sobre cómo R interpreta los datos, y la importancia de la *consistencia estricta* en la forma en que registramos nuestros datos.

source: Once we're happy that the data types and structures seem reasonable, it's time to start digging into our data proper. Check out the first few lines:
es: Una vez que estamos contentas de que los tipos y estructuras de datos se ven razonables, es hora de empezar a explorar apropiadamente nuestros datos. Mira las primeras líneas:

source: > > It's good practice to also check the last few lines of your data and some in > the middle. How would you do this? > > Searching for ones specifically in the middle isn't too hard but we could > simply ask for a few lines at random. How would you code this? > > > ## Solution to Challenge 1 > > > > To check the last few lines it's relatively simple as R already has a > > function for this: > > > > > > ~~~ > > tail(gapminder) > > tail(gapminder, n = 15) > > ~~~ > > {: .language-r} > > > > What about a few arbitrary rows just for sanity (or insanity depending on > > your view)? > > > > There are several ways to achieve this. > > > > The solution here presents one form using nested functions. i.e. a function > > passed as an argument to another function. This might sound like a new > > concept but you are already using it in fact. > > > > Remember `my_dataframe[rows, cols]` will print to screen your data frame > > with the number of rows and columns you asked for (although you might > > have asked for a range or named columns for example). How would you get the > > last row if you don't know how many rows your data frame has? R has a > > function for this. What about getting a (pseudorandom) sample? R also has a > > function for this. > > > > > > ~~~ > > gapminder[sample(nrow(gapminder), 5), ] > > ~~~ > > {: .language-r}
es: > > Es una buena práctica comprobar también las últimas líneas de los datos y algunas > del medio. ¿Cómo lo harías? > > Buscar las que están específicamente en el medio no es muy difícil pero podríamos > simplemente pedir unas pocas líneas al azar. ¿Cómo codificarías esto? > > > ## Solución al Desafío 1 > > > > Comprobar las últimas líneas es relativamente simple, ya que R tiene una > > función para esto:: > > > > > > ~~~ > > tail(gapminder) > > tail(gapminder, n = 15) > > ~~~ > > {: .language-r} > > > > ¿Qué tal si compruebas unas líneas al azar para más seguridad (o no, según tu punto de vista)? > > > > Hay varias maneras de lograr esto. > > > > La solución que se muestra aquí presenta una forma que utiliza funciones anidadas, es decir, una función que > > pasa su resultado a otra función como argumento. Esto podría parecer un concepto nuevo > > pero de hecho ya lo estás usando. > > > > Recuerda que `my_dataframe[rows, cols]` va a imprimir en pantalla tu dataframe > con el número de filas y columnas que le pediste (aunque podrías > > haber pedido un rango de columnas, por ejemplo). ¿Cómo obtendrías la > > última fila si no sabes cuántas filas tiene tu dataframe? R tiene una > > función para esto. ¿Cómo intentarías obtener una muestra (pseudo-aleatoria)? R también tiene una > > función para esto. > > > > > > ~~~ > > gapminder[sample(nrow(gapminder), 5), ] > > ~~~ > > {: .language-r}

source: > > Read the output of `str(gapminder)` again; this time, use what you've learned > about factors and vectors, as well as the output of functions like `colnames` > and `dim` to explain what everything that `str` prints out for `gapminder` > means. If there are any parts you can't interpret, discuss with your > neighbors! > > > ## Solution to Challenge 2 > > > > The object `gapminder` is a data frame with columns > > > > - `country` and `continent` are factors. > > - `year` is an integer vector. > > - `pop`, `lifeExp`, and `gdpPercap` are numeric vectors.
es: > > Lee la salida de `str(gapminder)` de nuevo; esta vez, usa lo que has aprendido > sobre factores y vectores, así como la salida de funciones como `colnames` > y `dim` para explicar todo lo que `str` imprime para `gapminder` > significa. ¡Si hay alguna parte que no puedes interpretar, discútela con tus > vecinos! > > > ## Solución al Desafío 2 > > > > El objeto `gapminder` es un dataframe con columnas > > > > - `country` y `continent` como **factores**. > > - `year` es un vector de enteros. > > - `pop`, `lifeExp`, y `gdpPercap` son vectores numéricos.

source: ## Adding columns and rows in data frames
es: ## Agregando columnas y filas en dataframes

source: We would like to create a new column to hold information on whether the life expectancy is below the world average life expectancy (70.5) or above:
es: Quisiéramos crear una nueva columna que contenga información sobre si la esperanza de vida es inferior o superior a la media mundial (70,5) :

source: We can then add this as a column via:
es: Podemos entonces añadir esto como una columna usando:

source: We probably don't want to print the entire dataframe each time, so let's put our `cbind` command within a call to `head` to return only the first six lines of the output.
es: Probablemente no vamos a querer imprimir el dataframe completo cada vez, así que ponemos nuestro `cbind` dentro de una llamada de `head` para que devuelva sólo las primeras seis líneas del resultado.

source: Note that if we tried to add a vector of `below_average` with a different number of entries than the number of rows in the dataframe, it would fail:
es: Obsérva que si tratamos de añadir un vector de `below_average` con un número diferente de entradas que el número de filas del dataframe, va a fallar:

source: Why didn't this work? R wants to see one element in our new column for every row in the table:
es: ¿Por qué no funcionó? R quiere ver un elemento en nuestra nueva columna por cada fila de la tabla:

source: So for it to work we need either to have `nrow(gapminder)` = `length(below_average)` or `nrow(gapminder)` to be a multiple of `length(below_average)`:
es: Entonces que para que funcione necesitamos o bien tener `nrow(gapminder)` = `length(below_average)` o que `nrow(gapminder)` sea multiplo de `length(below_average)`:

source: The sequence `TRUE,TRUE,FALSE` is repeated over all the gapminder rows.
es: La secuencia `TRUE,TRUE,FALSE` se repite en todas las filas de gapminder.

source: Let's overwite the content of gapminder with our new data frame.
es: Sobrescribamos el contenido de gapminder con nuestro nuevo dataframe.

source: Now how about adding rows? The rows of a data frame are lists:
es: Ahora, ¿qué tal agregar filas? Las filas de un dataframe son listas:

source: To understand why R is giving us a warning when we try to add this row, let's learn a little more about factors.
es: Para entender por qué R da una advertencia cuando intentamos añadir esta fila, aprendamos un poco más sobre factores.

source: Here is another thing to look out for: in a `factor`, each different value represents what is called a `level`. In our case, the `factor` "continent" has 5 levels: "Africa", "Americas", "Asia", "Europe" and "Oceania". R will only accept values that match one of the levels. If you add a new value, it will become `NA`.
es: Otra cosa que hay que tener en cuenta: en un `factor`, cada valor diferente representa lo que se llama un "nivel" o "categoría" (`level`). En nuestro caso, el `factor` "continente" tiene 5 niveles: "Africa", "Americas", "Asia", "Europa" y "Oceania". R sólo aceptará valores que coincidan con alguno de los niveles. Si añades un nuevo valor, se convertirá en `NA`.

source: The warning is telling us that we unsuccessfully added "Nordic" to our *continent* factor, but 2016 (a numeric), 5000000 (a numeric), 80.3 (a numeric), 49400.0 (a numeric) and `FALSE` (a logical) were successfully added to *country*, *year*, *pop*, *lifeExp*, *gdpPercap* and *below_average* respectively, since those variables are not factors. 'Norway' was also successfully added since it corresponds to an existing level. To successfully add a gapminder row with a "Nordic" *continent*, add "Nordic" as a *level* of the factor:
es: La advertencia (warning) nos dice que agregamos "nordic" sin éxito a nuestro factor *continent*, pero 2016 (un dato de tipo numeric), 5000000 (otro numeric), 80.3 (otro numeric), 49400.0 (otro numeric) y `FALSE` (un tipo de dato logic) se agregaron con éxito a *country*, *year*, *pop*, *lifeExp*, *gdpPercap* y *below_average* respectivamente, ya que esas variables no son **factores**. 'Norway' también fue agregado con éxito ya que corresponde a un nivel existente. Para agregar con éxito una nueva fila a gapminder con un *continent* "Nordic", necesitas agregar "Nordic" como *nivel* de factor en continent:
