Repository: carpentries-i18n/i18n
Catalog: po/r-intro-geospatial.*.po
Languages: es

source: inside `ggplot`. - `theme` functions change the overall look of the plot - order of layers matters! - `ggsave` to save a figure.
es: dentro de `ggplot`. - `theme` función que cambia la apariencia completa de la gráfica - ¡El orden de las capas(layers) importa! - `ggsave` para salvar una figura.

source: ## [Writing data]({{ relative_root_path }}/{% link _episodes/08-writing-data.md %})
es: ## [Escribiendo datos]({{ relative_root_path }}/{% link _episodes/08-writing-data.md %})

source: - `write.table` to write out objects in regular format
es: - `write.table` para escribir objetos en formato regular

source: ## Glossary
es: ## Glosario

source: {:auto_ids} argument : A value given to a function or program when it runs. The term is often used interchangeably (and inconsistently) with [parameter](#parameter).
es: {:auto_ids} argumentos : Un valor dado a una función o programa mientras corre. El termino es frecuentemente intercambiando (inconsistentemente) con [parámetro](#parameter).

source: assign : To give a value a name by associating a variable with it.
es: asignar : Darle un nombre a un valor al asociarlo a una variable.

source: body : (of a function): the statements that are executed when a function runs.
es: cuerpo : (de una función): las instrucciones y comandos que se ejecutan cuando se corre una función.

source: comment : A remark in a program that is intended to help human readers understand what is going on, but is ignored by the computer. Comments in Python, R, and the Unix shell start with a `#` character and run to the end of the line; comments in SQL start with `--`, and other languages have other conventions.
es: comentario : Una observación en un programa destinado a ayudar a los lectores humanos a comprender lo que está sucediendo, pero que es ignorado por la computadora. Los comentarios en Python, R y la consola de Unix comienzan con un carácter `#` y se ejecutan hasta el final de la línea; los comentarios en SQL comienzan con `--`, y otros lenguajes tienen otras convenciones.

source: comma-separated values : (CSV) A common textual representation for tables in which the values in each row are separated by commas.
es: valores separados por coma : (CSV) Una representación textual común para tablas en el que los valores en cada fila están separados por comas.

source: delimiter : A character or characters used to separate individual values, such as the commas between columns in a [CSV](#comma-separated-values) file.
es: delimitador : Un caracter o caracteres utilizados para separar valores individuales, como las comas entre columnas en un archivo [CSV](#comma-separated-values).

source: documentation : Human-language text written to explain what software does, how it works, or how to use it.
es: documentación : Texto en lenguaje humano escrito para explicar qué hace un software, cómo funciona o cómo usarlo.

source: floating-point number : A number containing a fractional part and an exponent. See also: [integer](#integer).
es: número de coma flotante : Un número que contiene una parte fraccionaria y un exponente. Ver también: [entero](#integer).

source: for loop : A loop that is executed once for each value in some kind of set, list, or range. See also: [while loop](#while-loop).
es: bucle for : Un bucle que se ejecuta una vez para cada valor que hay en un conjunto, lista o rango. Ver también: [bucle while](# while-loop).

source: index : A subscript that specifies the location of a single value in a collection, such as a single pixel in an image.
es: indice : Un subíndice que especifica la ubicación de un solo valor en una colección, como un solo píxel en una imagen.

source: integer : A whole number, such as -12343. See also: [floating-point number](#floating-point-number).
es: entero : Un número entero, como -12343. Ver también: [número de coma flotante](#floating-point-number).

source: library : In R, the directory(ies) where [packages](#package) are stored.
es: biblioteca : En R, los directorios donde los [paquetes]](#package) son almacenados.

source: package : A collection of R functions, data and compiled code in a well-defined format. Packages are stored in a [library](#library) and loaded using the library() function.
es: paquete : Una colección de funciones de R, datos y código compilado en un formato bien definido. Los paquetes se almacenan en una [biblioteca](#library) y se cargan usando la función **library()**.

source: parameter : A variable named in the function's declaration that is used to hold a value passed into the call. The term is often used interchangeably (and inconsistently) with [argument](#argument).
es: parametro : Una variable nombrada en la declaración de la función que se utiliza para contener un valor pasado durante la llamada. El término a menudo se usa indistintamente (e inconsistentemente) con [argumento](#argument).

source: return statement : A statement that causes a function to stop executing and return a value to its caller immediately.
es: sentencia de retorno : Una declaración que hace que una función deje de ejecutarse y devuelva un valor a quien la invocó de inmediato.

source: sequence : A collection of information that is presented in a specific order.
es: secuencia : Una colección de información que se presenta en un orden específico.

source: shape : An array's dimensions, represented as a vector. For example, a 5×3 array's shape is `(5,3)`.
es: forma : Dimensiones de una matriz, representadas como un vector. Por ejemplo, la forma de una matriz de 5 × 3 es `(5,3)`.

source: string : Short for "character string", a [sequence](#sequence) of zero or more characters.
es: cadena : Abreviatura de "cadena de caracteres", una [secuencia](#sequence) de cero o más caracteres.

source: syntax error : A programming error that occurs when statements are in an order or contain characters not expected by the programming language.
es: error de sintaxis : Un error de programación que ocurre cuando las declaraciones están en un orden o contienen caracteres no esperados por el lenguaje de programación.

source: type : The classification of something in a program (for example, the contents of a variable) as a kind of number (e.g. [floating-point](#float), [integer](#integer)), [string](#string), or something else. In R the command typeof() is used to query a variables type.
es: tipo : La clasificación de algo en un programa (por ejemplo, el contenido de una variable) como un tipo de número (por ejemplo [floating-point](#float), [integer](#integer)), [string](#string), o algo más. En R el comando typeof() se usa para consultar el tipo de una variable.

source: while loop : A loop that keeps executing as long as some condition is true. See also: [for loop](#for-loop).
es: while loop : Un bucle que se ejecuta siempre que una condición dada sea verdadera. Ver también: [for loop](#for-loop).

source: --- layout: page title: Setup ---
es: --- layout: page title: Configuración ---

source: This lesson is designed to be taught in conjunction with other lessons in the [Data Carpentry Geospatial workshop](http://www.datacarpentry.org/geospatial-workshop/). For information about required software, and to access the datasets used in this lesson, see the [setup instructions](http://www.datacarpentry.org/geospatial-workshop/) on the workshop homepage.
es: Esta lección está diseñada para enseñarse junto con otras lecciones en el [Taller Geoespacial de Data Carpentry](http://www.datacarpentry.org/geospatial-workshop/). Para obtener información sobre el software requerido y acceder a los conjuntos de datos utilizados en esta lección, consulta las [instrucciones de configuración](http://www.datacarpentry.org/geospatial-workshop/) en la página de inicio del taller.
