Repository: carpentries-i18n/i18n
Catalog: po/r-intro-geospatial.*.po
Languages: es

source: > > Fix each of the following common data frame subsetting errors: > > 1. Extract observations collected for the year 1957 > > > ~~~ > gapminder[gapminder$year = 1957, ] > ~~~ > {: .language-r} > > 2. Extract all columns except 1 through to 4 > > > ~~~ > gapminder[, -1:4] > ~~~ > {: .language-r} > > 3. Extract the rows where the life expectancy is longer the 80 years > > > ~~~ > gapminder[gapminder$lifeExp > 80] > ~~~ > {: .language-r} > > 4. Extract the first row, and the fourth and fifth columns > (`lifeExp` and `gdpPercap`). > > > ~~~ > gapminder[1, 4, 5] > ~~~ > {: .language-r} > > 5. Advanced: extract rows that contain information for the years 2002 > and 2007 > > > ~~~ > gapminder[gapminder$year == 2002 | 2007,] > ~~~ > {: .language-r} > > > ## Solution to challenge 3 > > > > Fix each of the following common data frame subsetting errors: > > > > 1. Extract observations collected for the year 1957 > > > > > > ~~~ > > # gapminder[gapminder$year = 1957, ] > > gapminder[gapminder$year == 1957, ] > > ~~~ > > {: .language-r} > > > > 2. Extract all columns except 1 through to 4 > > > > > > ~~~ > > # gapminder[, -1:4] > > gapminder[,-c(1:4)] > > ~~~ > > {: .language-r} > > > > 3. Extract the rows where the life expectancy is longer the 80 years > > > > > > ~~~ > > # gapminder[gapminder$lifeExp > 80] > > gapminder[gapminder$lifeExp > 80,] > > ~~~ > > {: .language-r} > > > > 4. Extract the first row, and the fourth and fifth columns > > (`lifeExp` and `gdpPercap`). > > > > > > ~~~ > > # gapminder[1, 4, 5] > > gapminder[1, c(4, 5)] > > ~~~ > > {: .language-r} > > > > 5. Advanced: extract rows that contain information for the years 2002 > > and 2007 > > > > > > ~~~ > > # gapminder[gapminder$year == 2002 | 2007,] > > gapminder[gapminder$year == 2002 | gapminder$year == 2007,] > > gapminder[gapminder$year %in% c(2002, 2007),] > > ~~~ > > {: .language-r}
es: > > Corrige cada uno de los siguientes errores para hacer subconjuntos de data frames: > > 1. Extraer observaciones colectadas en el año 1957 > > > ~~~ > gapminder[gapminder$year = 1957, ] > ~~~ > {: .language-r} > > 2. Extraer todas las columnas excepto de la 1 a la 4 > > > ~~~ > gapminder[, -1:4] > ~~~ > {: .language-r} > > 3. Extraer las filas donde la esperanza de vida es mayor de 80 años > > > ~~~ > gapminder[gapminder$lifeExp > 80] > ~~~ > {: .language-r} > > 4. Extraer la primera fila, y la cuarta y quinta columna > (`lifeExp` and `gdpPercap`). > > > ~~~ > gapminder[1, 4, 5] > ~~~ > {: .language-r} > > 5. Avanzado: extraer las filas que contienen información para los años 2002 > y 2007 > > > ~~~ > gapminder[gapminder$year == 2002 | 2007,] > ~~~ > {: .language-r} > > > ## Solución al desafío 3 > > > > Corrige cada uno de los siguientes errores para hacer subconjuntos de data frames: > > > > 1. Extraer observaciones colectadas en el año 1957 > > > > > > ~~~ > > # gapminder[gapminder$year = 1957, ] > > gapminder[gapminder$year == 1957, ] > > ~~~ > > {: .language-r} > > > > 2. Extraer todas las columnas excepto de la 1 a la 4 > > > > > > ~~~ > > # gapminder[, -1:4] > > gapminder[,-c(1:4)] > > ~~~ > > {: .language-r} > > > > 3. Extraer las filas donde la esperanza de vida es mayor de 80 años > > > > > > ~~~ > > # gapminder[gapminder$lifeExp > 80] > > gapminder[gapminder$lifeExp > 80,] > > ~~~ > > {: .language-r} > > > > 4. Extraer la primera fila, y la cuarta y quinta columna > > (`lifeExp` and `gdpPercap`). > > > > > > ~~~ > > # gapminder[1, 4, 5] > > gapminder[1, c(4, 5)] > > ~~~ > > {: .language-r} > > > > 5. Avanzado: extraer las filas que contienen información para los años 2002 > > and 2007 > > > > > > ~~~ > > # gapminder[gapminder$year == 2002 | 2007,] > > gapminder[gapminder$year == 2002 | gapminder$year == 2007,] > > gapminder[gapminder$year %in% c(2002, 2007),] > > ~~~ > > {: .language-r}

source: > > 1. Why does `gapminder[1:20]` return an error? How does it differ from > `gapminder[1:20, ]`? > > 2. Create a new `data.frame` called `gapminder_small` that only contains rows > 1 through 9 and 19 through 23. You can do this in one or two steps. > > > ## Solution to challenge 4 > > > > 1. `gapminder` is a data.frame so needs to be subsetted on two dimensions. `gapminder[1:20, ]` subsets the data to give the first 20 rows and all columns. > > > > 2. > > > > > > ~~~ > > gapminder_small <- gapminder[c(1:9, 19:23),] > > ~~~ > > {: .language-r}
es: > > 1. ¿Por qué `gapminder[1:20]` regresa un error? ¿En qué difiere de > `gapminder[1:20, ]`? > > 2. Crea un `data.frame` nuevo llamado `gapminder_small` que sólo contenga las filas > de la 1 a la 9 y de la 19 a la 23. Puedes hacerlo en uno o dos pasos. > > > ## Solución al desafío 4 > > > > 1. `gapminder` es un data frame por lo que para hacer un subconjunto necesita dos dimensiones. `gapminder[1:20, ]` genera un subconjunto de los datos de las primeras 20 filas y todas las columnas. > > > > 2. > > > > > > ~~~ > > gapminder_small <- gapminder[c(1:9, 19:23),] > > ~~~ > > {: .language-r}

source: --- # Please do not edit this file directly; it is auto generated. # Instead, please edit 06-dplyr.md in _episodes_rmd/ title: Data frame Manipulation with dplyr teaching: 30 exercises: 10 questions: - "How can I manipulate dataframes without repeating myself?" objectives: - " To be able to use the six main dataframe manipulation 'verbs' with pipes in `dplyr`." - " To understand how `group_by()` and `summarize()` can be combined to summarize datasets." - " Be able to analyze a subset of data using logical filtering." keypoints: - "Use the `dplyr` package to manipulate dataframes." - "Use `select()` to choose variables from a dataframe." - "Use `filter()` to choose data based on values." - "Use `group_by()` and `summarize()` to work with subsets of data." - "Use `mutate()` to create new variables." source: Rmd ---
es: --- # Please do not edit this file directly; it is auto generated. # Instead, please edit 06-dplyr.md in _episodes_rmd/ title: Manipulación de dataframes con dplyr teaching: 30 exercises: 10 questions: - "¿Cómo puedo manipular los dataframe sin repetirme?" objectives: - " Ser capaz de utilizar los 6 principales 'verbos' para la manipulación de dataframes con pipes en `dplyr`." - " Entender cómo `group_by()` y `summarize()` pueden combinarse para resumir datasets." - " Ser capaz de analizar un subconjunto de datos usando filtros lógicos." keypoints: - "Usar el paquete `dplyr` para manipular dataframes." - "Usar `select()` para elegir variables dentro de un dataframe." - "Usar `filter()` to elegir datos basados en valores." - "Usar `group_by()` y `summarize()` para trabajar con subconjuntos de datos." - "Usar `mutate()` para crear nuevas variables." source: Rmd ---

source: Manipulation of dataframes means many things to many researchers, we often select certain observations (rows) or variables (columns), we often group the data by a certain variable(s), or we even calculate summary statistics. We can do these operations using the normal base R operations:
es: La manipulación de dataframes significa muchas cosas para los investigadores, solemos seleccionar varias observaciones (filas) o variables (columnas), nosotros siempre agrupamos los datos por ciertas variable(s), o si incluso calculamos estadísticas de resumen. Podemos hacer esas operaciones usando operaciones de R base normal.

source: But this isn't very efficient, and can become tedious quickly because there is a fair bit of repetition. Repeating yourself will cost you time, both now and later, and potentially introduce some nasty bugs.
es: Pero esto no es muy eficiente, y puede volverse tedioso rapidamente porque hay bastante repetición. Repetirte a ti misma te va a costar tiempo, ahora y luego, y potencialmente puede introducir algunos errores.

source: ## The `dplyr` package
es: ## El paquete `dplyr`

source: Luckily, the [`dplyr`](https://dplyr.tidyverse.org) package provides a number of very useful functions for manipulating dataframes in a way that will reduce the above repetition, reduce the probability of making errors, and probably even save you some typing. As an added bonus, you might even find the `dplyr` grammar easier to read.
es: Afortunadamente, el paquete [`dplyr`](https:://dplyr.tidyverse.org) provee un número muy útil de funciones para manipular dataframes en una forma que reduce la repetición antes mencionada, asi como la probabilidad de cometer errores y posiblemente también te ahorre cierto tipeo. Como bonus, vas a encontrar la gramática de `dplyr` incluso más fácil de leer.

source: Here we're going to cover 6 of the most commonly used functions as well as using pipes (`%>%`) to combine them.
es: Vamos a cubrir 6 de las funciones más comunes usando pipes (%>%) para combinarlas.

source: If you have have not installed this package earlier, please do so:
es: Si aún no tienes instalado este paquete, por favor hazlo ahora:

source: Now let's load the package:
es: Ahora vamos a cargar el paquete:

source: ## Using `select()`
es: ## Usando `select()`

source: If, for example, we wanted to move forward with only a few of the variables in our dataframe we could use the `select()` function. This will keep only the variables you select.
es: Si, por ejemplo, queremos seguir solo con unas pocas de las variables en nuestro dataframe, podemos usar la función `select()`. Esto conservara solo las variables que seleccionas.

source: ![](../fig/13-dplyr-fig1.png)
es: ![]({{ site.baseurl }}/fig/13-dplyr-fig1.png)

source: If we open up `year_country_gdp` we'll see that it only contains the year, country and gdpPercap. Above we used 'normal' grammar, but the strengths of `dplyr` lie in combining several functions using pipes. Since the pipes grammar is unlike anything we've seen in R before, let's repeat what we've done above using pipes.
es: Si nosotros abrimos `year_country_gdp` vamos a ver que solo contiene año, país y gdpPercap. Hasta ahora hemos usado una gramática `normal`, pero las fortaleza de `dplyr` recae en combinar varias funciones usando pipes. Como la gramática de las pipes es diferente a todo lo que hemos visto en R hasta ahora, vamos a repertir que hemos hecho arriba usando pipes.

source: To help you understand why we wrote that in that way, let's walk through it step by step. First we summon the `gapminder` data frame and pass it on, using the pipe symbol `%>%`, to the next step, which is the `select()` function. In this case we don't specify which data object we use in the `select()` function since in gets that from the previous pipe. **Fun Fact**: You may have encountered pipes before in the shell. In R, a pipe symbol is `%>%` while in the shell it is `|` but the concept is the same!
es: Para ayudarte a entender por qué lo escribimos en esa forma, vamos a recorrerlo paso a paso. Primero convocamos a la base de datos `gapminder` y le pasamos, usando el símbolo pipe `%>%`, al siguiente paso, que es la función `select ()`. En este caso no le especificamos que objeto de datos usamos en la función `select ()` ya que la obtiene del pipe anterior. **Dato curioso**: Puedes haberte encontrado pipes antes en la terminal. En R, el símbolo de pipe es `%>%` mientras que en la terminal es `I` pero el concepto es el mismo!

source: ## Using `filter()`
es: ## Usando `filter()`

source: If we now wanted to move forward with the above, but only with European countries, we can combine `select` and `filter`
es: Si ahora queremos avanzar con lo anterior, pero solo los países Europeos, podemos combinar `select` y `filter`

source: > > Write a single command (which can span multiple lines and includes pipes) that > will produce a dataframe that has the African values for `lifeExp`, `country` > and `year`, but not for other Continents. How many rows does your dataframe > have and why? > > > ## Solution to Challenge 1 > > > > > >~~~ > >year_country_lifeExp_Africa <- gapminder %>% > > filter(continent=="Africa") %>% > > select(year,country,lifeExp) > >~~~ > >{: .language-r}
es: > > Escribe un solo comando (que puede abarcar varias líneas e incluir pipes) que > producirá un marco de datos que tenga los valores africanos para `lifeExp`, `country` > y `year`, pero no para los otros continentes. ¿Cuántas filas tiene tu > marco de datos y por qué? > > > ## Solución al desafío 1 > > > > > >~~~ > >year_country_lifeExp_Africa <- gapminder %>% > > filter(continent=="Africa") %>% > > select(year,country,lifeExp) > >~~~ > >{: .language-r}

source: As with last time, first we pass the gapminder dataframe to the `filter()` function, then we pass the filtered version of the gapminder data frame to the `select()` function. **Note:** The order of operations is very important in this case. If we used 'select' first, filter would not be able to find the variable continent since we would have removed it in the previous step.
es: Como la vez pasada, primero pasamos el marco de datos gapminder a la función `filter()`, luego pasamos la versión filtrada del marco de datos gapminder a la función `select()`. **Nota:** El order en las operaciones es muy importante en este caso. Si utilizamos 'select' primero, filter no podría encontrar la variable continent ya que la habríamos removido en el paso anterior.

source: ## Using `group_by()` and `summarize()`
es: ## Usando `group_by()` y `summarize()`

source: Now, we were supposed to be reducing the error prone repetitiveness of what can be done with base R, but up to now we haven't done that since we would have to repeat the above for each continent. Instead of `filter()`, which will only pass observations that meet your criteria (in the above: `continent=="Europe"`), we can use `group_by()`, which will essentially use every unique criteria that you could have used in filter.
es: Ahora, se suponía que debíamos reducir la repetición propensa a errores de lo que se puede hacer con base R, pero hasta ahora no lo hemos hecho, ya que tendríamos que repetir lo anterior para cada continente. En lugar de `filter()`, que sólo pasará observaciones que cumplan con nuestros criterios (en lo anterior: `continent=="Europe"`), podemos usar `group_by()`, que esencialmente usará todos los criterios únicos que podrías haber usado en filter.

source: You will notice that the structure of the dataframe where we used `group_by()` (`grouped_df`) is not the same as the original `gapminder` (`data.frame`). A `grouped_df` can be thought of as a `list` where each item in the `list`is a `data.frame` which contains only the rows that correspond to the a particular value `continent` (at least in the example above).
es: Notarás que la estructura del marco de datos donde usamos `group_by()` (`grouped_df`) no es igual que el (`data.frame`) `gapminder` original. `grouped_df` puede considerarse como una `lista` donde cada elemento de la `lista` es un `data.frame` que contiene solo las filas que corresponden a un valor particular de `continente` (al menos en el ejemplo anterior).

source: ![](../fig/13-dplyr-fig2.png)
es: ![]({{ site.baseurl }}/fig/13-dplyr-fig2.png)

source: ## Using `summarize()`
es: ## Usando `summarize()`

source: The above was a bit on the uneventful side but `group_by()` is much more exciting in conjunction with `summarize()`. This will allow us to create new variable(s) by using functions that repeat for each of the continent-specific data frames. That is to say, using the `group_by()` function, we split our original dataframe into multiple pieces, then we can run functions (e.g. `mean()` or `sd()`) within `summarize()`.
es: Lo anterior fue sin complicaciones, pero `group_by ()` es mucho más emocionante junto con `summarize()`. Esto nos permitirá crear nuevas variable(s) mediante el uso de funciones que se repiten para cada marco de datos específico continente. Es decir, usando la función `group_by()`, dividimos nuestro marco de datos original en varias piezas, entonces podemos ejecutar las funciones (por ejemplo, `mean()` o `sd()`) dentro de `summarize()`. (e.g. `mean()` or `sd()`) within.

source: ~~~ `summarise()` ungrouping output (override with `.groups` argument) ~~~
es: ~~~ `summarise()` desgrupa el resultado (sobreescribe el argumento `.groups` ) ~~~

source: ![](../fig/13-dplyr-fig3.png)
es: ![]({{ site.baseurl }}/fig/13-dplyr-fig3.png)

source: That allowed us to calculate the mean gdpPercap for each continent, but it gets even better.
es: Eso nos permite calcular la media de gdpPercap para cada continente, pero esto se pone mejor aún.

source: > > > Calculate the average life expectancy per country. Which has the longest average life > expectancy and which has the shortest average life expectancy? > > > ## Solution to Challenge 2 > > > > > >~~~ > > lifeExp_bycountry <- gapminder %>% > > group_by(country) %>% > > summarize(mean_lifeExp=mean(lifeExp)) > >~~~ > >{: .language-r} > > > > > > > >~~~ > >`summarise()` ungrouping output (override with `.groups` argument) > >~~~ > >{: .output} > > > > > > > >~~~ > > lifeExp_bycountry %>% > > filter(mean_lifeExp == min(mean_lifeExp) | mean_lifeExp == max(mean_lifeExp)) > >~~~ > >{: .language-r} > > > > > > > >~~~ > ># A tibble: 2 x 2 > > country mean_lifeExp > > <chr> <dbl> > >1 Iceland 76.5 > >2 Sierra Leone 36.8 > >~~~ > >{: .output} > > > > Another way to do this is to use the `dplyr` function `arrange()`, which > > arranges the rows in a data frame according to the order of one or more > > variables from the data frame. It has similar syntax to other functions > > from the `dplyr` package. You can use `desc()` inside `arrange()` to sort in > > descending order. > > > > > >~~~ > >lifeExp_bycountry %>% > > arrange(mean_lifeExp) %>% > > head(1) > >~~~ > >{: .language-r} > > > > > > > >~~~ > ># A tibble: 1 x 2 > > country mean_lifeExp > > <chr> <dbl> > >1 Sierra Leone 36.8 > >~~~ > >{: .output} > > > > > > > >~~~ > >lifeExp_bycountry %>% > > arrange(desc(mean_lifeExp)) %>% > > head(1) > >~~~ > >{: .language-r} > > > > > > > >~~~ > ># A tibble: 1 x 2 > > country mean_lifeExp > > <chr> <dbl> > >1 Iceland 76.5 > >~~~ > >{: .output}
es: > > > Calcula la esperanza de vida media por país. ¿Qué país tiene la esperanza de vida más > larga and qué país tiene la esperanza de vida más corta? > > > ## Solución al Desafío 2 > > > > > >~~~ > > lifeExp_bycountry <- gapminder %>% > > group_by(country) %>% > > summarize(mean_lifeExp=mean(lifeExp)) > >~~~ > >{: .language-r} > > > > > > > >~~~ > >`summarise()` ungrouping output (override with `.groups` argument) > >~~~ > >{: .output} > > > > > > > >~~~ > > lifeExp_bycountry %>% > > filter(mean_lifeExp == min(mean_lifeExp) | mean_lifeExp == max(mean_lifeExp)) > >~~~ > >{: .language-r} > > > > > > > >~~~ > ># A tibble: 2 x 2 > > country mean_lifeExp > > <chr> <dbl> > >1 Iceland 76.5 > >2 Sierra Leone 36.8 > >~~~ > >{: .output} > > > > Otra manera de hacer esto, es usar del paquete `dplyr` la función `arrange()`, que > > ordena las filas en un data frame según el orden de una o más > > variables del data frame. Tiene una sintaxis similar a otras funciones > > del paquete `dplyr` . Puedes usar `desc()` dentro de `arrange()` para ordenar en > > forma descendiente. > > > > > >~~~ > >lifeExp_bycountry %>% > > arrange(mean_lifeExp) %>% > > head(1) > >~~~ > >{: .language-r} > > > > > > > >~~~ > ># A tibble: 1 x 2 > > country mean_lifeExp > > <chr> <dbl> > >1 Sierra Leone 36.8 > >~~~ > >{: .output} > > > > > > > >~~~ > >lifeExp_bycountry %>% > > arrange(desc(mean_lifeExp)) %>% > > head(1) > >~~~ > >{: .language-r} > > > > > > > >~~~ > ># A tibble: 1 x 2 > > country mean_lifeExp > > <chr> <dbl> > >1 Iceland 76.5 > >~~~ > >{: .output}

source: The function `group_by()` allows us to group by multiple variables. Let's group by `year` and `continent`.
es: La función `group_by()` nos permite agrupar por múltiples variables. Vamos a agrupar por `year` y `continent`.

source: That is already quite powerful, but it gets even better! You're not limited to defining 1 new variable in `summarize()`.
es: Eso ya es bastante poderoso, ¡pero se pone aún mejor! No estás limitado a definir 1 nueva variable en `summarize()`.

source: ## `count()` and `n()`
es: ## `count()` y `n()`

source: A very common operation is to count the number of observations for each group. The `dplyr` package comes with two related functions that help with this.
es: Una operación muy común es contar el número de observaciones para cada grupo. El paquete `dplyr` tiene dos funciones relacionadas que ayudan con eso.

source: For instance, if we wanted to check the number of countries included in the dataset for the year 2002, we can use the `count()` function. It takes the name of one or more columns that contain the groups we are interested in, and we can optionally sort the results in descending order by adding `sort=TRUE`:
es: Por ejemplo, si quisiésemos verificar el number de países incluidos en el dataset para el año 2002, podríamos usar la función `count()` . Toma los nombres de una o más columnas que contienen los grupos que nos interesan, y opcionalmente podemos ordenar de manera descendente los resultados al agregar `sort=TRUE`:

source: If we need to use the number of observations in calculations, the `n()` function is useful. For instance, if we wanted to get the standard error of the life expectancy per continent:
es: Si necesitamos utilizar el número de observaciones en cálculos, la función `n()` es útil. Por ejemplo, si quisiésemos obtener el error estándar de la esperanza de vida por continente:

source: You can also chain together several summary operations; in this case calculating the `minimum`, `maximum`, `mean` and `se` of each continent's per-country life-expectancy:
es: También puedes encadenar varias operaciones de resumen; en este caso calculando el `minimum`, `maximum`, `mean` and `se` (mínimo, máximo, promedio y error estándar) de la esperanza de vida por país para cada continente:

source: ## Using `mutate()`
es: ## Usando `mutate`

source: We can also create new variables prior to (or even after) summarizing information using `mutate()`.
es: También podemos crear nuevas variables previas a (o incluso luego) de resumir información usando `mutate()`

source: ## Other great resources
es: ## Otros recursos geniales

source: * [R for Data Science](http://r4ds.had.co.nz/)
es: * [R para Ciencia de Datos](https://es.r4ds.hadley.nz/)

source: * [Data Wrangling Cheat sheet](https://www.rstudio.com/wp-content/uploads/2015/02/data-wrangling-cheatsheet.pdf)
es: * [Hoja de Referencia: Domar Datos ](https://rstudio.com/wp-content/uploads/2015/03/data-wrangling-spanish.pdf)

source: * [Introduction to dplyr](https://cran.r-project.org/web/packages/dplyr/vignettes/dplyr.html)
es: * [Introducción a dplyr](https://cran.r-project.org/web/packages/dplyr/vignettes/dplyr.html)

source: * [Data wrangling with R and RStudio](https://www.rstudio.com/resources/webinars/data-wrangling-with-r-and-rstudio/)
es: * [Domar datos "**data wrangling**" con R y RStudio - Link en Inglés](https://www.rstudio.com/resources/webinars/data-wrangling-with-r-and-rstudio/)
