Repository: carpentries-i18n/i18n
Catalog: po/shell-novice.*.po
Languages: uk

source: --- title: "Working With Files and Directories" teaching: 30 exercises: 20 questions: - "How can I create, copy, and delete files and directories?" - "How can I edit files?" objectives: - "Create a directory hierarchy that matches a given diagram." - "Create files in that hierarchy using an editor or by copying and renaming existing files." - "Delete, copy and move specified files and/or directories." keypoints: - "`cp [old] [new]` copies a file." - "`mkdir [path]` creates a new directory." - "`mv [old] [new]` moves (renames) a file or directory." - "`rm [path]` removes (deletes) a file." - "`*` matches zero or more characters in a filename, so `*.txt` matches all files ending in `.txt`." - "`?` matches any single character in a filename, so `?.txt` matches `a.txt` but not `any.txt`." - "Use of the Control key may be described in many ways, including `Ctrl-X`, `Control-X`, and `^X`." - "The shell does not have a trash bin: once something is deleted, it's really gone." - "Most files' names are `something.extension`. The extension isn't required, and doesn't guarantee anything, but is normally used to indicate the type of data in the file." - "Depending on the type of work you do, you may need a more powerful text editor than Nano." ---
uk: --- title: "Робота з файлами та каталогами" teaching: 30 exercises: 20 questions: - "Як я можу створювати, копіювати та видаляти файли і каталоги?" - "Як я можу редагувати файли?" objectives: - "Створити ієрархію каталогів, яка відповідає заданій схемі." - "Створити файли в цій ієрархії за допомогою редактора або шляхом копіювання та перейменування файлів, що вже існують." - "Видалити, скопіювати та перемістити вказані файли та/або каталоги." keypoints: - "`cp [old] [new]` копіює файл." - "`mkdir [path]` створює новий каталог." - "`mv [old] [new]` переміщує (перейменовує) файл або каталог." - "`rm [path]` вилучає (видаляє) файл." - "`*` відповідає нулю або більше символів в імені файлу, тому `*.txt` відповідає всім файлам, імена яких закінчуються на `.txt`." - "`?` відповідає будь-якому одному символу у назві файлу, тому `?.txt` відповідає `a.txt`, але не `any.txt`." - "Використання клавіші Control можна описати різними способами, зокрема `Ctrl-X`, `Control-X` та `^X`.." - "В терміналі немає корзини: як тільки щось видаляється, воно дійсно зникає." - "Більшість файлів мають назву "щось.розширення". Розширення не є обов'язковим і нічого не гарантує, але зазвичай використовується для позначення типу даних у файлі." - "Залежно від типу роботи, яку ви виконуєте, вам може знадобитися потужніший текстовий редактор, ніж Nano." ---

source: ## Creating directories
uk: ## Створення каталогів

source: We now know how to explore files and directories, but how do we create them in the first place?
uk: Тепер ми знаємо, як досліджувати файли та каталоги, але як їх створювати?

source: In this episode we will learn about creating and moving files and directories, using the `exercise-data/writing` directory as an example.
uk: На цьому уроці ми дізнаємося про створення та переміщення файлів і каталогів на прикладі каталогу `exercise-data/writing`.

source: ### Step one: see where we are and what we already have
uk: ### Крок перший: подивіться, де ми знаходимося і що вже маємо

source: We should still be in the `shell-lesson-data` directory on the Desktop, which we can check using:
uk: Ми все ще маємо бути у каталозі `shell-lesson-data` на Робочому столі (англ. Desktop), що ми можемо перевірити за допомогою:

source: Next we'll move to the `exercise-data/writing` directory and see what it contains: ~~~ $ cd exercise-data/writing/ ~~~ {: .language-bash}
uk: Далі ми перейдемо до каталогу `exercise-data/writing` і подивимося, що у ньому міститься: ~~~ $ cd exercise-data/writing/ ~~~ {: .language-bash}

source: ### Create a directory
uk: ### Створення каталогу

source: Let's create a new directory called `thesis` using the command `mkdir thesis` (which has no output):
uk: Створимо новий каталог з назвою `theis` за допомогою команди `mkdir thesis` (яка не має виводу):

source: As you might guess from its name, `mkdir` means 'make directory'. Since `thesis` is a relative path (i.e., does not have a leading slash, like `/what/ever/thesis`), the new directory is created in the current working directory:
uk: Як ви можете здогадатися з її назви, команда `mkdir` означає 'зробити каталог' (англ. 'make directory'). Оскільки `thesis` є відносним шляхом (тобто не має початкової косої риски, як `/what/ever/thesis`), новий каталог буде створено у поточному робочому каталозі:

source: Since we've just created the `thesis` directory, there's nothing in it yet:
uk: Оскільки ми щойно створили каталог `thesis`, у ньому ще нічого немає:

source: Note that `mkdir` is not limited to creating single directories one at a time. The `-p` option allows `mkdir` to create a directory with nested subdirectories in a single operation:
uk: Зауважте, що команда `mkdir` не обмежується створенням окремих каталогів по одному. Параметр `-p` дозволяє команді `mkdir` створювати каталог із вкладеними підкаталогами за одну операцію:

source: The `-R` option to the `ls` command will list all nested subdirectories within a directory. Let's use `ls -FR` to recursively list the new directory hierarchy we just created in the `project` directory:
uk: Параметр `-R` до команди `ls` покаже усі вкладені підкаталоги у каталозі. Давайте скористаємося `ls -FR` для рекурсивного відображення нової ієрархії каталогів, яку ми щойно створили у каталозі `project`:

source: > ## Two ways of doing the same thing
uk: > ## Два способи зробити одне й те саме

source: > Using the shell to create a directory is no different than using a file explorer.
uk: > Використання терміналу для створення каталогу нічим не відрізняється від використання файлового провідника.

source: > If you open the current directory using your operating system's graphical file explorer,
uk: > Якщо ви відкриваєте поточний каталог за допомогою графічного провідника файлів вашої операційної системи,

source: > the `thesis` directory will appear there too.
uk: > там також з'явиться каталог `thesis`.

source: > While the shell and the file explorer are two different ways of interacting with the files,
uk: > Хоча оболонка і файловий провідник - це два різні способи взаємодії з файлами,

source: > the files and directories themselves are the same.
uk: > файли та каталоги одні й ті ж самі.

source: > ## Good names for files and directories
uk: > ## Хороші імена для файлів і каталогів

source: > > Complicated names of files and directories can make your life painful > when working on the command line. Here we provide a few useful > tips for the names of your files and directories. > > 1. Don't use spaces. > > Spaces can make a name more meaningful, > but since spaces are used to separate arguments on the command line > it is better to avoid them in names of files and directories. > You can use `-` or `_` instead (e.g. `north-pacific-gyre/` rather than `north pacific gyre/`). > To test this out, try typing `mkdir north pacific gyre`and see what directory (or directories!) > are made when you check with `ls -F`. > > 2. Don't begin the name with `-` (dash). > > Commands treat names starting with `-` as options. > > 3. Stick with letters, numbers, `.` (period or 'full stop'), `-` (dash) and `_` (underscore). > > Many other characters have special meanings on the command line. > We will learn about some of these during this lesson. > There are special characters that can cause your command to not work as > expected and can even result in data loss. > > If you need to refer to names of files or directories that have spaces > or other special characters, you should surround the name in quotes (`""`).
uk: > > Складні назви файлів і каталогів можуть зробити ваше життя болісним > під час роботи з командним рядком. Тут ми надаємо кілька корисних > підказок щодо назв ваших файлів і каталогів. > > 1. Не використовуйте пробіли. > > Пробіли можуть зробити назву більш змістовною, > але оскільки пробіли використовуються для відокремлення аргументів у командному рядку > краще уникати їх у назвах файлів і каталогів. > Ви можете використовувати `-` або `_` (наприклад, `north-pacific-gyre/` замість `north pacific gyre/`). > Щоб перевірити це, спробуйте набрати `mkdir north pacific gyre` і подивіться, який каталог (або каталоги!) > буде створено при перевірці за допомогою `ls -F`. > > 2. Не починайте назву з `-` (тире). > > Команди розглядають назви, що починаються з `-`, як опції. > > 3. Використовуйте літери, цифри, `.` (крапка), `-` (тире) і `_` (підкреслення). > > Багато інших символів мають особливе значення у командному рядку. > Про деякі з них ми дізнаємося на цьому уроці. > Існують спеціальні символи, які можуть призвести до того, що ваша команда працюватиме не так, як > очікуваним чином і навіть призвести до втрати даних. > > Якщо вам потрібно звернутися до назв файлів або каталогів, які містять пробіли > або інші спеціальні символи, вам слід взяти назву у лапки (`""`).

source: ### Create a text file
uk: ### Створення текстового файлу

source: Let's change our working directory to `thesis` using `cd`, then run a text editor called Nano to create a file called `draft.txt`:
uk: Давайте змінимо наш робочий каталог на `thesis` за допомогою `cd`, а потім запустимо текстовий редактор Nano і створимо файл з назвою `draft.txt`:

source: > ## Which Editor?
uk: > ## Який редактор?

source: > > When we say, '`nano` is a text editor' we really do mean 'text': it can > only work with plain character data, not tables, images, or any other > human-friendly media. We use it in examples because it is one of the > least complex text editors. However, because of this trait, it may > not be powerful enough or flexible enough for the work you need to do > after this workshop. On Unix systems (such as Linux and macOS), > many programmers use [Emacs](http://www.gnu.org/software/emacs/) or > [Vim](http://www.vim.org/) (both of which require more time to learn), > or a graphical editor such as > [Gedit](http://projects.gnome.org/gedit/). On Windows, you may wish to > use [Notepad++](http://notepad-plus-plus.org/). Windows also has a built-in > editor called `notepad` that can be run from the command line in the same > way as `nano` for the purposes of this lesson. > > No matter what editor you use, you will need to know where it searches > for and saves files. If you start it from the shell, it will (probably) > use your current working directory as its default location. If you use > your computer's start menu, it may want to save files in your desktop or > documents directory instead. You can change this by navigating to > another directory the first time you 'Save As...'
uk: > > Коли ми говоримо, що "nano" - це текстовий редактор, ми дійсно маємо на увазі "текст": він може > працювати лише з простими символьними даними, а не з таблицями, зображеннями чи будь-якими іншими > зручними для людини даними. Ми використовуємо його у прикладах, тому що це один з > найменш складних текстових редакторів. Однак, через цю особливість він може бути > недостатньо потужним або гнучким для роботи, яку вам потрібно буде виконати > після завершення наших уроків. У системах Unix (таких як Linux та macOS), > багато програмістів використовують [Emacs] (http://www.gnu.org/software/emacs/) або > [Vim](http://www.vim.org/) (обидва вимагають більше часу на вивчення), > або графічний редактор, такий як > [Gedit](http://projects.gnome.org/gedit/). У Windows, можливо, ви захочете > скористатися [Notepad++] (http://notepad-plus-plus.org/). У Windows також є вбудований > редактор з назвою `notepad`, який можна запустити з командного рядка так само > чином, як і `nano` для цілей цього уроку. > > Незалежно від того, яким редактором ви користуєтеся, вам потрібно знати, де він шукає > і зберігає файли. Якщо ви запускаєте його з командної оболонки, він (ймовірно) > використовуватиме ваш поточний робочий каталог як місце за замовчуванням. Якщо ви використовуєте > меню "Пуск" вашого комп'ютера, можливо, програма захоче зберегти файли на робочому столі або > в каталозі документів (Documents) замість цього. Ви можете змінити це, перейшовши до > іншого каталогу під час першого виконання команди "Зберегти як...".

source: Let's type in a few lines of text. Once we're happy with our text, we can press <kbd>Ctrl</kbd>+<kbd>O</kbd> (press the <kbd>Ctrl</kbd> or <kbd>Control</kbd> key and, while holding it down, press the <kbd>O</kbd> key) to write our data to disk (we'll be asked what file we want to save this to: press <kbd>Return</kbd> to accept the suggested default of `draft.txt`).
uk: Давайте наберемо кілька рядків тексту. Після того, як ми будемо задоволені нашим текстом, ми можемо натиснути <kbd>Ctrl</kbd>+<kbd>O</kbd> (натисніть клавішу <kbd>Ctrl</kbd> або <kbd>Control</kbd> і, утримуючи її, натиснути клавішу <kbd>O</kbd>), щоб записати наші дані на диск (нас запитають, до якого файлу ми хочемо зберегти дані: натисніть клавішу <kbd>Return</kbd>, щоб прийняти запропоновану за замовчуванням назву `draft.txt`).

source: <div style="width:80%; margin: auto;"><img alt="screenshot of nano text editor in action" src="../fig/nano-screenshot.png"></div>
uk: <div style="width:80%; margin: auto;"><img alt="знімок екрану з редактором nano" src="../fig/nano-screenshot.png"/></div>

source: Once our file is saved, we can use <kbd>Ctrl</kbd>+<kbd>X</kbd> to quit the editor and return to the shell.
uk: Після збереження файлу ми можемо скористатися комбінацією клавіш <kbd>Ctrl</kbd>+<kbd>X</kbd>, щоб вийти з редактора і повернутися до терміналу.

source: > ## Control, Ctrl, or ^ Key
uk: > ## Клавіша Control, Ctrl або ^

source: > > The Control key is also called the 'Ctrl' key. There are various ways > in which using the Control key may be described. For example, you may > see an instruction to press the <kbd>Control</kbd> key and, while holding it down, > press the <kbd>X</kbd> key, described as any of: > > * `Control-X` > * `Control+X` > * `Ctrl-X` > * `Ctrl+X` > * `^X` > * `C-x` > > In nano, along the bottom of the screen you'll see `^G Get Help ^O WriteOut`. > This means that you can use `Control-G` to get help and `Control-O` to save your > file.
uk: > > Клавіша Control також називається клавішею Ctrl. Існує декілька способів, в які > можна описати використання клавіші Control. Наприклад, ви можете > побачити вказівку натиснути клавішу <kbd>Control</kbd> і, утримуючи її натиснутою, > натиснути клавішу <kbd>X</kbd>, описану будь-яким з наступних способом: > > * "Control-X > * `Control+X` > * "Ctrl-X > * `Ctrl+X` > * `^X` > * `C-x` > > У nano, у нижній частині екрана ви побачите `^G Отримати довідку ^O Вивести на екран`. > Це означає, що ви можете скористатися `Control-G` для отримання довідки і `Control-O` для збереження вашого > файлу.

source: `nano` doesn't leave any output on the screen after it exits, but `ls` now shows that we have created a file called `draft.txt`:
uk: Після завершення роботи команда `nano` не залишає жодних даних на екрані, але `ls` тепер показує, що ми створили файл з назвою `draft.txt`:

source: > ## Creating Files a Different Way
uk: > ## Створення файлів іншим способом

source: > > We have seen how to create text files using the `nano` editor. > Now, try the following command: > > ~~~ > $ touch my_file.txt > ~~~ > {: .language-bash} > > 1. What did the `touch` command do? > When you look at your current directory using the GUI file explorer, > does the file show up? > > 2. Use `ls -l` to inspect the files. How large is `my_file.txt`? > > 3. When might you want to create a file this way? > > > ## Solution > > 1. The `touch` command generates a new file called `my_file.txt` in > > your current directory. You > > can observe this newly generated file by typing `ls` at the > > command line prompt. `my_file.txt` can also be viewed in your > > GUI file explorer. > > > > 2. When you inspect the file with `ls -l`, note that the size of > > `my_file.txt` is 0 bytes. In other words, it contains no data. > > If you open `my_file.txt` using your text editor it is blank. > > > > 3. Some programs do not generate output files themselves, but > > instead require that empty files have already been generated. > > When the program is run, it searches for an existing file to > > populate with its output. The touch command allows you to > > efficiently generate a blank text file to be used by such > > programs.
uk: > > Ми побачили, як створювати текстові файли за допомогою редактора `nano`. > Тепер спробуйте виконати наступну команду: > > ~~~ > $ touch my_file.txt > ~~~ > {: .language-bash} > > 1. Що зробила команда `touch`? > Коли ви дивитеся на ваш поточний каталог за допомогою провідника файлів у графічному інтерфейсі, > чи відображається файл? > > 2. Використовуйте `ls -l` для перегляду файлів. Який розмір має файл `my_file.txt`? > > 3. Коли вам може знадобитися створити файл у такий спосіб? > > > Розв'язання > > 1. Команда `touch` створює новий файл з назвою `my_file.txt` у > > вашому поточному каталозі. Ви > > можете переглянути цей новостворений файл, набравши `ls` у > > командному рядку. Файл `my_file.txt` також можна переглянути у вашому > > графічному провіднику файлів. > > > > 2. Коли ви перевіряєте файл за допомогою `ls -l`, зверніть увагу, що розмір > > `my_file.txt` дорівнює 0 байт. Іншими словами, він не містить жодних даних. > > Якщо ви відкриєте `my_file.txt` за допомогою текстового редактора, він буде порожнім. > > > > 3. Деякі програми самі не створюють вихідні файли, а > > натомість вимагають, щоб порожні файли вже було створено. > > Під час запуску програма шукає існуючий файл, щоб > > заповнити його своїми даними. За допомогою команди touch можна > > ефективно створити порожній текстовий файл для подальшого використання такими > > програмами.

source: > > To avoid confusion later on, > we suggest removing the file you've just created before proceeding with the rest > of the episode, otherwise future outputs may vary from those given in the lesson. > To do this, use the following command: > > ~~~ > $ rm my_file.txt > ~~~ > {: .language-bash}
uk: > > Щоб уникнути плутанини в подальшому, > радимо видалити файл, який ви щойно створили, перед тим, як переходити до решти > епізоду, інакше майбутні результати можуть відрізнятися від наведених в уроці. > Для цього скористайтеся наступною командою: > > ~~~ > $ rm my_file.txt > ~~~ > {: .language-bash}

source: > ## What's In A Name?
uk: > ## Що ховається в імені?

source: > > You may have noticed that all of Nelle's files are named 'something dot > something', and in this part of the lesson, we always used the extension > `.txt`. This is just a convention: we can call a file `mythesis` or > almost anything else we want. However, most people use two-part names > most of the time to help them (and their programs) tell different kinds > of files apart. The second part of such a name is called the > **filename extension** and indicates > what type of data the file holds: `.txt` signals a plain text file, `.pdf` > indicates a PDF document, `.cfg` is a configuration file full of parameters > for some program or other, `.png` is a PNG image, and so on. > > This is just a convention, albeit an important one. Files contain > bytes: it's up to us and our programs to interpret those bytes > according to the rules for plain text files, PDF documents, configuration > files, images, and so on. > > Naming a PNG image of a whale as `whale.mp3` doesn't somehow > magically turn it into a recording of whale song, though it *might* > cause the operating system to try to open it with a music player > when someone double-clicks it.
uk: > > Ви, мабуть, помітили, що всі файли Неллі називаються 'щось крапка > щось", і у цій частині уроку ми завжди використовували розширення > `.txt`. Це лише умовність: ми можемо назвати файл `mythesis` або > майже як завгодно. Однак, більшість людей використовують назви, що складаються з двох частин > здебільшого для того, щоб допомогти їм (і їхнім програмам) розрізняти різні типи > файлів. Друга частина такого імені називається > **розширенням файлу** і вказує > тип даних у файлі: `.txt` вказує на звичайний текстовий файл, `.pdf` > вказує на PDF-документ, `.cfg` - це конфігураційний файл з параметрами > для тієї чи іншої програми, `.png` - зображення у форматі PNG, і так далі. > > Це лише умовність, хоча й важлива. Файли містять > байти: ми та наші програми повинні інтерпретувати ці байти > відповідно до правил для звичайних текстових файлів, PDF-документів, конфігураційних > файлів, зображень тощо. > > Якщо ви назвете зображення кита у форматі PNG як "whale.mp3", це не перетворить його якимось > чарівним чином на запис пісні кита, хоча це *може* > змусити операційну систему спробувати відкрити його за допомогою музичного плеєра. > коли хтось двічі клікне на ньому.

source: ## Moving files and directories
uk: ## Переміщення файлів і каталогів

source: Returning to the `shell-lesson-data/exercise-data/writing` directory,
uk: Повернемося до каталогу `shell-lesson-data/exercise-data/writing`,

source: In our `thesis` directory we have a file `draft.txt` which isn't a particularly informative name, so let's change the file's name using `mv`, which is short for 'move':
uk: У нашому каталозі `thesis` є файл `draft.txt`. з не надто інформативною назвою, тому давайте змінимо назву файлу за допомогою команди `mv`, що є скороченням від 'move' (з англ. - 'переміщати'):

source: The first argument tells `mv` what we're 'moving', while the second is where it's to go. In this case, we're moving `thesis/draft.txt` to `thesis/quotes.txt`, which has the same effect as renaming the file. Sure enough, `ls` shows us that `thesis` now contains one file called `quotes.txt`:
uk: Перший аргумент говорить "mv", що ми 'переміщаємо', а другий - куди саме. У цьому випадку ми переміщуємо `theis/draft.txt` до `theis/quotes.txt`, що має той самий ефект, що і перейменування файлу. Звісно, `ls` показує нам, що `thesis` тепер містить один файл з назвою `quotes.txt`:

source: One must be careful when specifying the target file name, since `mv` will silently overwrite any existing file with the same name, which could lead to data loss. An additional option, `mv -i` (or `mv --interactive`), can be used to make `mv` ask you for confirmation before overwriting.
uk: Слід бути обережним при вказівці імені цільового файлу, оскільки `mv` приховано перезапише будь-який файл, що вже існує, з такою самою назвою, а це може призвести до втрати даних. Додатковий параметр `mv -i` (або `mv --interactive`, з англ. - 'інтерактивно'), може бути використано для того, щоб змусити `mv` запитувати у вас підтвердження перед перезаписом.

source: Note that `mv` also works on directories.
uk: Зверніть увагу, що `mv` також працює з каталогами.

source: Let's move `quotes.txt` into the current working directory. We use `mv` once again, but this time we'll use just the name of a directory as the second argument to tell `mv` that we want to keep the filename but put the file somewhere new. (This is why the command is called 'move'.) In this case, the directory name we use is the special directory name `.` that we mentioned earlier.
uk: Перемістимо `quotes.txt` до поточного робочого каталогу. Знову скористаємося `mv`, але цього разу ми використаємо лише назву каталогу як другий аргумент щоб повідомити `mv`, що ми хочемо зберегти назву файлу але перемістити файл у нове місце. (Ось чому команда називається 'перемістити'). У цьому випадку ми використовуємо спеціальну назву `.` поточного каталогу, про яку ми згадували раніше.
