Repository: carpentries-i18n/i18n
Catalog: po/shell-novice.*.po
Languages: uk

source: ~~~ # Calculate stats for Site A and Site B data files. for datafile in NENE*A.txt NENE*B.txt do echo $datafile bash goostats.sh $datafile stats-$datafile done ~~~
uk: ~~~ # Обчисліть статистику для файлів даних A та B. for datafile in NENE*A.txt NENE*B.txt do echo $datafile bash goostats.sh $datafile stats-$datafile done ~~~

source: The advantage is that this always selects the right files: she doesn't have to remember to exclude the 'Z' files. The disadvantage is that it *always* selects just those files --- she can't run it on all files (including the 'Z' files), or on the 'G' or 'H' files her colleagues in Antarctica are producing, without editing the script. If she wanted to be more adventurous, she could modify her script to check for command-line arguments, and use `NENE*A.txt NENE*B.txt` if none were provided. Of course, this introduces another tradeoff between flexibility and complexity.
uk: Перевага полягає в тому, що вона завжди вибирає правильні файли: їй не потрібно пам'ятати, що потрібно виключити файли з літерою 'Z'. Недоліком є те, що вона *завжди* вибирає лише ці файли --- вона не може запустити її на всіх файлах (включно з файлами 'Z'), або на файлах 'G' чи 'H', які створюють її колеги в Антарктиді, без редагування сценарію. Якби вона хотіла бути більш сміливою, вона могла б модифікувати свій скрипт для перевірки аргументів командного рядка, і використовувати `NENE*A.txt NENE*B.txt`, якщо нічого не було передано. Звичайно, це ще один компроміс між гнучкістю і складністю.

source: > ## Variables in Shell Scripts
uk: > ## Змінні в скриптах терміналу

source: > > In the `proteins` directory, imagine you have a shell script called `script.sh` containing the > following commands: > > ~~~ > head -n $2 $1 > tail -n $3 $1 > ~~~ > {: .language-bash} > > While you are in the `proteins` directory, you type the following command: > > ~~~ > $ bash script.sh '*.pdb' 1 1 > ~~~ > {: .language-bash} > > Which of the following outputs would you expect to see? > > 1. All of the lines between the first and the last lines of each file ending in `.pdb` > in the `proteins` directory > 2. The first and the last line of each file ending in `.pdb` in the `proteins` directory > 3. The first and the last line of each file in the `proteins` directory > 4. An error because of the quotes around `*.pdb` > > > ## Solution > > The correct answer is 2. > > > > The special variables $1, $2 and $3 represent the command line arguments given to the > > script, such that the commands run are: > > > > ``` > > $ head -n 1 cubane.pdb ethane.pdb octane.pdb pentane.pdb propane.pdb > > $ tail -n 1 cubane.pdb ethane.pdb octane.pdb pentane.pdb propane.pdb > > ``` > > {: .language-bash} > > The shell does not expand `'*.pdb'` because it is enclosed by quote marks. > > As such, the first argument to the script is `'*.pdb'` which gets expanded within the > > script by `head` and `tail`.
uk: > > Уявіть, що у каталозі `proteins` у вас є скрипт терміналу з назвою `script.sh`, який містить > наступні команди:> > ~~~ > head -n $2 $1 > tail -n $3 $1 > ~~~ > {: .language-bash} > > Перебуваючи у каталозі `proteins`, ви вводите наступну команду: > > ~~~ > $ bash script.sh '*.pdb' 1 1 > ~~~ > {: .language-bash} > > Які з наведених нижче результатів ви очікуєте побачити? > > 1. Усі рядки між першим та останнім рядками кожного файлу, що закінчуються на `.pdb` > у каталозі `proteins`. > 2. Перший та останній рядок кожного файлу, що закінчується на `.pdb` у каталозі `proteins`. > 3. Перший та останній рядок кожного файлу в каталозі `proteins`. > 4. Помилка через лапки навколо `*.pdb`. > > > ## Розв'язання > > Правильна відповідь 2. > > > > Спеціальні змінні $1, $2 і $3 представляють аргументи командного рядка, що передаються > > скрипту, таким чином команди, що виконуються, виглядають так: > > > > ``` > > $ head -n 1 cubane.pdb ethane.pdb octane.pdb pentane.pdb propane.pdb > > $ tail -n 1 cubane.pdb ethane.pdb octane.pdb pentane.pdb propane.pdb > > ``` > > {: .language-bash} > > Термынал не розгортає `'*.pdb'`, оскільки його взято у лапки. > > Таким чином, першим аргументом скрипту є `'*.pdb'`, який буде розгорнуто у > > скрипті за допомогою `head` і `tail`.

source: > ## Find the Longest File With a Given Extension
uk: > ## Пошук найдовшого файлу із заданим розширенням

source: > > Write a shell script called `longest.sh` that takes the name of a > directory and a filename extension as its arguments, and prints > out the name of the file with the most lines in that directory > with that extension. For example: > > ~~~ > $ bash longest.sh shell-lesson-data/exercise-data/proteins pdb > ~~~ > {: .language-bash} > > would print the name of the `.pdb` file in `shell-lesson-data/exercise-data/proteins` that has > the most lines. > > Feel free to test your script on another directory e.g. > ~~~ > $ bash longest.sh shell-lesson-data/exercise-data/writing txt > ~~~ > {: .language-bash} > > > ## Solution > > > > ``` > > # Shell script which takes two arguments: > > # 1. a directory name > > # 2. a file extension > > # and prints the name of the file in that directory > > # with the most lines which matches the file extension. > > > > wc -l $1/*.$2 | sort -n | tail -n 2 | head -n 1 > > ``` > > {: .language-bash} > > > > The first part of the pipeline, `wc -l $1/*.$2 | sort -n`, counts > > the lines in each file and sorts them numerically (largest last). When > > there's more than one file, `wc` also outputs a final summary line, > > giving the total number of lines across _all_ files. We use `tail > > -n 2 | head -n 1` to throw away this last line. > > > > With `wc -l $1/*.$2 | sort -n | tail -n 1` we'll see the final summary > > line: we can build our pipeline up in pieces to be sure we understand > > the output.
uk: > > Напишіть сценарій терміналу з назвою `longest.sh`, який отримує в якості аргументів ім'я > каталогу і розширення імені файлу як аргументи, і виводить > назву файлу з найбільшою кількістю рядків у цьому каталозі > з цим розширенням. Наприклад: > > ~~~ > $ bash longest.sh shell-lesson-data/exercise-data/proteins pdb > ~~~ > {: .language-bash} > > виведе назву файлу `.pdb` у каталозі `shell-lesson-data/exercise-data/proteins`, який має > найбільшу кількість рядків. > > Не соромтеся тестувати свій скрипт в іншому каталозі, наприклад > ~~~ > $ bash longest.sh shell-lesson-data/exercise-data/writing txt > ~~~ > {: .language-bash} > > > ## Розв'язання > > > > ``` > > # Скрипт терміналу, який приймає два аргументи: > > # 1. ім'я каталогу > > # 2. розширення файлу > > # і виводить ім'я файлу в цьому каталозі > > # з найбільшою кількістю рядків, що відповідаює розширенню файлу. > > > > wc -l $1/*.$2 | sort -n | tail -n 2 | head -n 1 > > ``` > > {: .language-bash} > > > > Перша частина конвеєра, `wc -l $1/*.$2 | sort -n`, підраховує > рядки у кожному файлі і сортує їх за числом (найбільший в останню чергу). Якщо > > файлів більше одного, `wc` також виводить останній підсумковий рядок, > який показує загальну кількість рядків у _усіх_ файлах. Ми використовуємо `tail` > > -n 2 | head -n 1`, щоб відкинути цей останній рядок. > > > > За допомогою `wc -l $1/*.$2 | sort -n | tail -n 1` ми побачимо остаточний підсумковий > > рядок: ми можемо побудувати наш конвеєр по частинах, щоб бути впевненими, що розуміємо, > що ми отримаємо на виході.

source: > ## Script Reading Comprehension
uk: > ## Розуміння читання скрипту

source: > > For this question, consider the `shell-lesson-data/exercise-data/proteins` directory once again. > This contains a number of `.pdb` files in addition to any other files you > may have created. > Explain what each of the following three scripts would do when run as > `bash script1.sh *.pdb`, `bash script2.sh *.pdb`, and `bash script3.sh *.pdb` respectively. > > ~~~ > # Script 1 > echo *.* > ~~~ > {: .language-bash} > > ~~~ > # Script 2 > for filename in $1 $2 $3 > do > cat $filename > done > ~~~ > {: .language-bash} > > ~~~ > # Script 3 > echo $@.pdb > ~~~ > {: .language-bash} > > > ## Solutions > > In each case, the shell expands the wildcard in `*.pdb` before passing the resulting > > list of file names as arguments to the script. > > > > Script 1 would print out a list of all files containing a dot in their name. > > The arguments passed to the script are not actually used anywhere in the script. > > > > Script 2 would print the contents of the first 3 files with a `.pdb` file extension. > > `$1`, `$2`, and `$3` refer to the first, second, and third argument respectively. > > > > Script 3 would print all the arguments to the script (i.e. all the `.pdb` files), > > followed by `.pdb`. > > `$@` refers to *all* the arguments given to a shell script. > > ``` > > cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb.pdb > > ``` > > {: .output}
uk: > > Для відповіді на це запитання ще раз розглянемо каталог `shell-lesson-data/exercise-data/proteins`. > У ньому міститься низка файлів `.pdb` на додачу до інших файлів, які > ви могли створити. > Поясніть, що зробить кожен з наступних трьох скриптів, якщо його буде запущено як: > `bash script1.sh *.pdb`, `bash script2.sh *.pdb` та`bash script3.sh *.pdb` відповідно. > > ~~~ > # Скрипт 1 > echo *.* > ~~~ > {: .language-bash} > > ~~~ > # Скрипт 2 > for filename in $1 $2 $3 > do > cat $filename > done > ~~~ > {: .language-bash} > > ~~~ > # Скрипт 3 > echo $@.pdb > ~~~ > {: .language-bash} > > > ## Розв'язання > > У кожному випадку термінал розгортає символ підстановки у `*.pdb` перед тим, як передати отриманий > > список назв файлів як аргументи скрипту. > > > > Скрипт 1 виведе список усіх файлів, що містять крапку у назві. > Аргументи, що передаються скрипту, насправді ніде не використовуються у скрипті. > > > > Скрипт 2 виведе вміст перших 3 файлів з розширенням `.pdb`. > > `$1`, `$2` і `$3` відносяться до першого, другого і третього аргументу відповідно. > > > > Скрипт 3 виведе всі аргументи скрипту (тобто всі файли `.pdb`), > > за якими слідує `.pdb`. > > `$@` відноситься до *усіх* аргументів, переданих командному рядку. > > ``` > > cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb.pdb > > ``` > > {: .output}

source: > ## Debugging Scripts
uk: > ## Зневадження скриптів

source: > > Suppose you have saved the following script in a file called `do-errors.sh` > in Nelle's `north-pacific-gyre/scripts` directory: > > ~~~ > # Calculate stats for data files. > for datafile in "$@" > do > echo $datfile > bash goostats.sh $datafile stats-$datafile > done > ~~~ > {: .language-bash} > > When you run it from the `north-pacific-gyre` directory: > > ~~~ > $ bash do-errors.sh NENE*A.txt NENE*B.txt > ~~~ > {: .language-bash} > > the output is blank. > To figure out why, re-run the script using the `-x` option: > > ~~~ > $ bash -x do-errors.sh NENE*A.txt NENE*B.txt > ~~~ > {: .language-bash} > > What is the output showing you? > Which line is responsible for the error? > > > ## Solution > > The `-x` option causes `bash` to run in debug mode. > > This prints out each command as it is run, which will help you to locate errors. > > In this example, we can see that `echo` isn't printing anything. We have made a typo > > in the loop variable name, and the variable `datfile` doesn't exist, hence returning > > an empty string.
uk: > > Припустимо, ви зберегли наступний скрипт у файлі з назвою `do-errors.sh` > у каталозі Неллі `north-pacific-gyre/scripts`:> > ~~~ > # Розрахунок статистики для файлів даних. > for datafile in "$@" > do > echo $datfile > bash goostats.sh $datafile stats-$datafile > done > ~~~ > {: .language-bash} > > Якщо ви запускаєте його з каталогу `north-pacific-gyre`: > > ~~~ > $ bash do-errors.sh NENE*A.txt NENE*B.txt > ~~~ > {: .language-bash} > > програма нічого не виводить. > Щоб з'ясувати причину, перезапустіть скрипт з опцією `-x`: > > ~~~ > $ bash -x do-errors.sh NENE*A.txt NENE*B.txt > ~~~ > {: .language-bash} > > Що показує вивід? > Який рядок відповідає за помилку? > > > ## Розв'язання > > Параметр `-x` призводить до запуску `bash` у режимі відлагодження (зневадження). > > У цьому випадку кожна команда буде виводитися на екран під час виконання, що допоможе вам знайти помилки. > > У цьому прикладі ми бачимо, що команда `echo` нічого не виводить. Ми допустили друкарську помилку: > > у назві змінної циклу, а змінної `datfile` не існує, тому повертається > > порожній рядок.

source: --- title: "Finding Things" teaching: 25 exercises: 20 questions: - "How can I find files?" - "How can I find things in files?" objectives: - "Use `grep` to select lines from text files that match simple patterns." - "Use `find` to find files and directories whose names match simple patterns." - "Use the output of one command as the command-line argument(s) to another command." - "Explain what is meant by 'text' and 'binary' files, and why many common tools don't handle the latter well." keypoints: - "`find` finds files with specific properties that match patterns." - "`grep` selects lines in files that match patterns." - "`--help` is an option supported by many bash commands, and programs that can be run from within Bash, to display more information on how to use these commands or programs." - "`man [command]` displays the manual page for a given command." - "`$([command])` inserts a command's output in place." ---
uk: --- title: "Пошук речей" teaching: 25 exercises: 20 questions: - "Як я можу знайти файли?" - "Як знайти щось у файлах?" objectives: - "Використати `grep` для виділення рядків з текстових файлів, які відповідають простим шаблонам." - "Використати `find` для пошуку файлів і каталогів, назви яких відповідають простим шаблонам." - "Використати вихідні дані однієї команди як аргумент(и) командного рядка для іншої команди." - "Пояснити, що мається на увазі під 'текстовими' та 'бінарними' файлами, і чому багато поширених інструментів погано працюють з останніми." keypoints: - "`find` шукає файли з певними властивостями, які відповідають шаблонам." - "`grep` вибирає рядки з файлів, які відповідають шаблонам." - "`--help` - це опція, яка підтримується багатьма командами bash і програмами, які можна запустити з bash, для відображення додаткової інформації про те, як користуватися цими командами або програмами." - "`man [команда]` показує сторінку посібника для даної команди." - "`$([команда])` вставляє вивід команди на місце." ---

source: In the same way that many of us now use 'Google' as a verb meaning 'to find', Unix programmers often use the word 'grep'. 'grep' is a contraction of 'global/regular expression/print', a common sequence of operations in early Unix text editors. It is also the name of a very useful command-line program.
uk: Так само, як багато хто з нас зараз використовує 'Google' як дієслово, що означає 'шукати', Unix-програмісти часто використовують слово 'grep'. 'grep' - це скорочення від 'global/regular expression/print' (з англ. 'глобальний/регулярний вираз/друк'), поширеної послідовності операцій у ранніх текстових редакторах Unix. Це також назва дуже корисної програми командного рядка.

source: `grep` finds and prints lines in files that match a pattern. For our examples, we will use a file that contains three haiku taken from a [1998 competition](https://web.archive.org/web/19991201042211/http://salon.com/21st/chal/1998/01/26chal.html) in *Salon* magazine (Credit to authors Bill Torcaso, Howard Korder, and Margaret Segall, respectively. See Haiku Error Messsages archived [Page 1](https://web.archive.org/web/20000310061355/http://www.salon.com/21st/chal/1998/02/10chal2.html) and [Page 2](https://web.archive.org/web/20000229135138/http://www.salon.com/21st/chal/1998/02/10chal3.html) .). For this set of examples, we're going to be working in the writing subdirectory:
uk: `grep` шукає і виводить рядки у файлах, які відповідають шаблону. У нашому прикладі ми використаємо файл, який містить три хайку, взяті з [конкурсу 1998 року](https://web.archive.org/web/19991201042211/http://salon.com/21st/chal/1998/01/26chal.html) в журналі *Salon* (авторство належить Біллу Торкасо (Bill Torcaso), Говарду Кордеру (Howard Korder) та Маргарет Сігал (Margaret Segall), відповідно. Див. Haiku Error Messages в архіві [Сторінка 1] (https://web.archive.org/web/20000310061355/http://www.salon.com/21st/chal/1998/02/10chal2.html) та [Сторінка 2](https://web.archive.org/web/20000229135138/http://www.salon.com/21st/chal/1998/02/10chal3.html) .). Для цього набору прикладів ми будемо працювати у підкаталозі writing:

source: Let's find lines that contain the word 'not':
uk: Знайдемо рядки, які містять слово 'not':

source: Here, `not` is the pattern we're searching for. The grep command searches through the file, looking for matches to the pattern specified. To use it type `grep`, then the pattern we're searching for and finally the name of the file (or files) we're searching in.
uk: Тут `not` - це шаблон, який ми шукаємо. Команда grep шукає у файлі збіги із заданим шаблоном. Щоб скористатися нею, введіть `grep`, потім шаблон, який ми шукаємо, і нарешті ім'я файлу (або файлів), у якому (у яких) ми шукаємо.

source: The output is the three lines in the file that contain the letters 'not'.
uk: У вихідний файл виводяться три рядки, які містять літери 'not'.

source: By default, grep searches for a pattern in a case-sensitive way. In addition, the search pattern we have selected does not have to form a complete word, as we will see in the next example.
uk: За замовчуванням grep шукає шаблон з урахуванням регістру. Крім того, вибраний нами шаблон пошуку не обов'язково має бути повним словом, як ми побачимо у наступному прикладі.

source: Let's search for the pattern: 'The'.
uk: Давайте відшукаємо шаблон: 'The'.

source: This time, two lines that include the letters 'The' are outputted, one of which contained our search pattern within a larger word, 'Thesis'.
uk: Цього разу буде виведено два рядки, що містять літери 'The', один з яких містить наш шаблон пошуку у більшому слові 'Thesis'.

source: To restrict matches to lines containing the word 'The' on its own, we can give `grep` the `-w` option. This will limit matches to word boundaries.
uk: Щоб обмежити збіги до рядків, що містять слово 'The' як таке, ми можемо надати `grep` опцію `-w`. Це обмежить збіги межами слів.

source: Later in this lesson, we will also see how we can change the search behavior of grep with respect to its case sensitivity.
uk: Пізніше у цьому уроці ми також побачимо, як можна змінити поведінку пошуку grep з урахуванням чутливості до регістру.

source: Note that a 'word boundary' includes the start and end of a line, so not just letters surrounded by spaces. Sometimes we don't want to search for a single word, but a phrase. This is also easy to do with `grep` by putting the phrase in quotes.
uk: Зверніть увагу, що 'межа слова' включає початок і кінець рядка, тобто не лише літери, оточені пробілами. Іноді ми хочемо шукати не окреме слово, а фразу. Це також легко зробити за допомогою `grep`, взявши фразу в лапки.

source: We've now seen that you don't have to have quotes around single words, but it is useful to use quotes when searching for multiple words. It also helps to make it easier to distinguish between the search term or phrase and the file being searched. We will use quotes in the remaining examples.
uk: Ми вже бачили, що не обов'язково брати в лапки окремі слова, але корисно використовувати лапки під час пошуку кількох слів. Це також допомагає легше відрізнити пошуковий термін або фразу від файлу, в якому відбувається пошук. Ми будемо використовувати лапки в решті прикладів.

source: Another useful option is `-n`, which numbers the lines that match:
uk: Ще одна корисна опція - `-n`, яка нумерує рядки, що збігаються:

source: Here, we can see that lines 5, 9, and 10 contain the letters 'it'.
uk: Ми бачимо, що рядки 5, 9 і 10 містять літери 'it'.

source: We can combine options (i.e. flags) as we do with other Unix commands. For example, let's find the lines that contain the word 'the'. We can combine the option `-w` to find the lines that contain the word 'the' and `-n` to number the lines that match:
uk: Ми можемо комбінувати опції (тобто прапорці) так само, як і в інших командах Unix. Наприклад, давайте знайдемо рядки, які містять слово 'the'. Ми можемо комбінувати опцію `-w`, щоб знайти рядки, які містять слово 'the' і `-n`, щоб пронумерувати рядки, що збігаються:

source: Now we want to use the option `-i` to make our search case-insensitive:
uk: Тепер ми хочемо використати опцію `-i`, щоб зробити наш пошук нечутливим до регістру:

source: Now, we want to use the option `-v` to invert our search, i.e., we want to output the lines that do not contain the word 'the'.
uk: Тепер ми хочемо використати опцію `-v` для інвертування пошуку, тобто вивести рядки, які не містять слова 'the'.

source: If we use the `-r` (recursive) option, `grep` can search for a pattern recursively through a set of files in subdirectories.
uk: Якщо ми використовуємо опцію `-r` (recursive, з англ. - рекурсивний), `grep` може шукати шаблон рекурсивно через набір файлів у підкаталогах.

source: Let's search recursively for `Yesterday` in the `shell-lesson-data/exercise-data/writing` directory:
uk: Давайте виконаємо рекурсивний пошук `Yesterday` у каталозі `shell-lesson-data/exercise-data/writing`:

source: `grep` has lots of other options. To find out what they are, we can type:
uk: У `grep` є багато інших варіантів. Щоб дізнатися, які саме, ми можемо набрати їх:

source: ~~~ Usage: grep [OPTION]... PATTERN [FILE]... Search for PATTERN in each FILE or standard input. PATTERN is, by default, a basic regular expression (BRE). Example: grep -i 'hello world' menu.h main.c Regexp selection and interpretation: -E, --extended-regexp PATTERN is an extended regular expression (ERE) -F, --fixed-strings PATTERN is a set of newline-separated fixed strings -G, --basic-regexp PATTERN is a basic regular expression (BRE) -P, --perl-regexp PATTERN is a Perl regular expression -e, --regexp=PATTERN use PATTERN for matching -f, --file=FILE obtain PATTERN from FILE -i, --ignore-case ignore case distinctions -w, --word-regexp force PATTERN to match only whole words -x, --line-regexp force PATTERN to match only whole lines -z, --null-data a data line ends in 0 byte, not newline Miscellaneous: ... ... ... ~~~
uk: Використання: grep [ПАРАМЕТР]... ШАБЛОНИ [ФАЙЛ]... Шукати ШАБЛОНИ у кожному ФАЙЛі. Приклад: grep -i 'hello world' menu.h main.c Запис ШАБЛОНИ може містити декілька шаблонів, які відокремлено символами нового рядка. Вибір за взірцем та інтерпретація: -E, --extended-regexp ШАБЛОНИ є розширеним формальним виразом -F, --fixed-strings ШАБЛОНИ є набором рядків -G, --basic-regexp ШАБЛОНИ є звичайними формальними виразами -P, --perl-regexp ШАБЛОНИ є формальними виразами Perl -e, --regexp=ШАБЛОНИ використовувати ШАБЛОНИ для встановлення відповіднос ті -f, --file=ФАЙЛ взяти ШАБЛОНИ із ФАЙЛа -i, --ignore-case ігнорувати регістр літер у шаблонах і даних --no-ignore-case не ігнорувати регістр літер (типова поведінка) -w, --word-regexp шукати лише цілі слова -x, --line-regexp шукати лише цілі рядки -z, --null-data рядки даних закінчуються байтом "0", а не символом кінця рядка (\n)

source: > ## Using `grep`
uk: > ## Використання `grep`

source: > > Which command would result in the following output: > > ~~~ > and the presence of absence: > ~~~
uk: > > Яка команда призведе до наступного виводу: > > ~~~ > and the presence of absence: > ~~~
