Repository: carpentries-i18n/i18n
Catalog: po/shell-novice.*.po
Languages: uk

source: If the command to find out who we are is `whoami`, the command to find out where we are ought to be called `whereami`, so why is it `pwd` instead? The usual answer is that in the early 1970s, when Unix was first being developed, every keystroke counted: the devices of the day were slow, and backspacing on a teletype was so painful that cutting the number of keystrokes in order to cut the number of typing mistakes was actually a win for usability. The reality is that commands were added to Unix one by one, without any master plan, by people who were immersed in its jargon. The result is as inconsistent as the roolz uv Inglish speling, but we're stuck with it now.
uk: Якщо команда дізнатися, хто ми є, називається `whoami`, то команда дізнатися, де ми є, повинна називатися `whereami`, так чому ж тоді вона зветься `pwd` натомість? Звичайна відповідь полягає в тому, що на початку 1970-х років, коли Unix тільки розроблявся, враховувалося кожне натискання клавіш: тодішні пристрої були повільними, а переноси на телетайпі були настільки болючими, що скорочення кількості натискань клавіш, щоб зменшити кількість помилок при наборі тексту, було насправді виграшем для зручності використання. Реальність така, що команди додавалися до Unix одна за одною, без жодного генерального плану, людьми, які були занурені в його жаргон. Результат настільки ж непослідовний, як і англійський правопис 'roolz uv Inglish' але ми застрягли з цим зараз.

source: ## Job Control Codes
uk: ## Коди керування завданнями

source: The shell accepts a few special commands that allow users to interact with running processes or programs. You can enter each of these "control codes" by holding down the `Ctrl` key and then pressing one of the control characters. In other tutorials, you may see the term `Control` or the `^` used to represent the `Ctrl` key (e.g. the following are all equivalent `Ctrl-C`, `Ctrl+C`, `Control-C`, `Control+C`, `^C`).
uk: Термінал приймає кілька спеціальних команд, які дозволяють користувачам взаємодіяти з запущеними процесами або програмами. Ви можете ввести кожен з цих "кодів керування", утримуючи клавішу `Ctrl`, а потім натиснувши один з керуючих символів. В інших підручниках ви можете зустріти термін `Control` або `^`, який використовується для позначення клавіші `Ctrl` (наприклад наведені нижче комбінації є еквівалентними `Ctrl-C`, `Ctrl+C`, `Control-C`, `Control+C`, `^C`).

source: interrupts and cancels a running program. This is useful if you want to cancel a command that is taking too long to execute.
uk: перериває і скасовує запущену програму. Це корисно, якщо ви хочете скасувати команду, яка виконується надто довго.

source: indicates the end of a file or stream of characters that you are entering on the command line. For example, we saw earlier that the `wc` command counts lines, words, and characters in a file. If we just type `wc` and hit the Enter key without providing a file name, then `wc` will assume we want it to analyze all the stuff we type next. After typing our magnum opus directly into the shell prompt, we can then type Ctrl-D to tell `wc` that we're done and we'd like to see the results of the word count.
uk: вказує на кінець файлу або потоку символів, які ви вводите у командному рядку. Наприклад, раніше ми бачили, що команда `wc` підраховує рядки, слова і символи у файлі. Якщо ми просто введемо `wc` і натиснемо клавішу Enter, не вказавши назву файлу, то `wc` вважатиме, що ми хочемо, щоб вона проаналізувала все, що ми введемо далі. Після введення нашого грандіозного опусу безпосередньо у командний рядок, ми можемо натиснути Ctrl-D, щоб сказати `wc`, що ми закінчили і хочемо побачити результати підрахунку слів.

source: Suspends a process but does not terminate it. You can then use the command `fg` to restart the job in the foreground.
uk: Призупиняє процес, але не завершує його. Потім ви можете скористатися командою `fg`, щоб перезапустити завдання на передньому плані.

source: For new shell users, these control codes can all appear to have the same effect: they make things "go away." But it is helpful to understand the differences. In general, if something went wrong and you just want to get your shell prompt back, it is better to use `Ctrl-C`.
uk: Для нових користувачів терміналу всі ці контрольні коди можуть мати однаковий ефект: вони змушують все "зникнути". Але корисно розуміти відмінності. Загалом, якщо щось пішло не так і ви просто хочете повернути командний рядок, краще скористатися комбінацією `Ctrl-C`.

source: ## Other Shells
uk: ## Інші термінали

source: Before Bash became popular in the end of nineties, scientists widely used (and some still use) another shell, C-shell, or Csh. Bash and Csh have similar feature sets, but their syntax rules are different and this makes them incompatible with each other. A few other shells have appeared since, including ksh, zsh, and a number of others; they are mostly compatible with Bash, and Bash is the default shell on most modern implementations of Unix (including most packages that provide Unix-like tools for Windows) but if you get strange errors in shell scripts written by colleagues, check to see which shell they were written for.
uk: До того, як Bash став популярним наприкінці дев'яностих, вчені широко використовували (а дехто й досі використовує) інший термінал, C-термінал, або Csh. Bash і Csh мають схожі набори функцій, але їх синтаксичні правила відрізняються, і це робить їх несумісними один з одним. Кілька інших терміналів з'явилося з тих пір, включаючи ksh, zsh і ряд інших; вони здебільшого сумісні з Bash, а Bash - це термінал за замовчуванням у більшості сучасних реалізацій Unix (включаючи більшість пакунків, які надають Unix-подібні інструменти для Windows), але якщо ви отримуєте дивні помилки у скриптах, написаних колегами, перевірте, для якого терміналу вони були написані.

source: ## Bash Configurations
uk: ## Конфігурації Bash

source: Want to customize paths, environment variables, aliases, and other behaviors of your shell? This excellent blog post "[Bash Configurations Demystified][bash-demystified]" from Dalton Hubble covers tips, tricks, and how to avoid dangers.
uk: Хочете налаштувати шляхи, змінні оточення, псевдоніми, та інші параметри вашого терміналу? Ця чудова стаття в блозі "[Bash Configurations Demystified][bash-demystified]" від Далтона Хаббла містить поради, підказки та способи уникнення небезпек.

source: --- title: Figures ---
uk: --- title: Рисунки ---

source: <script> window.onload = function() { var lesson_episodes = [ {% for episode in site.episodes %} "{{ episode.url}}"{% unless forloop.last %},{% endunless %} {% endfor %} ]; var xmlHttp = []; /* Required since we are going to query every episode. */ for (i=0; i < lesson_episodes.length; i++) { xmlHttp[i] = new XMLHttpRequest(); xmlHttp[i].episode = lesson_episodes[i]; /* To enable use this later. */ xmlHttp[i].onreadystatechange = function() { if (this.readyState == 4 && this.status == 200) { var article_here = document.getElementById(this.episode); var parser = new DOMParser(); var htmlDoc = parser.parseFromString(this.responseText,"text/html"); var htmlDocArticle = htmlDoc.getElementsByTagName("article")[0]; article_here.appendChild(htmlDocArticle.getElementsByTagName("h1")[0]); for (let image of htmlDocArticle.getElementsByTagName("img")) { article_here.appendChild(image); } } } episode_url = "{{ page.root }}" + lesson_episodes[i]; xmlHttp[i].open("GET", episode_url); xmlHttp[i].send(null); } } </script>
uk: <script> window.onload = function() { var lesson_episodes = [ {% for episode in site.episodes %} "{{ episode.url}}"{% unless forloop.last %},{% endunless %} {% endfor %} ]; var xmlHttp = []; /* Необхідно, оскільки ми збираємося запитувати кожну серію. */ for (i=0; i < lesson_episodes.length; i++) { xmlHttp[i] = new XMLHttpRequest(); xmlHttp[i].episode = lesson_episodes[i]; /* Щоб використовувати це пізніше. */ xmlHttp[i].onreadystatechange = function() { if (this.readyState == 4 && this.status == 200) { var article_here = document.getElementById(this.episode); var parser = new DOMParser(); var htmlDoc = parser.parseFromString(this.responseText,"text/html"); var htmlDocArticle = htmlDoc.getElementsByTagName("article")[0]; article_here.appendChild(htmlDocArticle.getElementsByTagName("h1")[0]); for (let image of htmlDocArticle.getElementsByTagName("img")) { article_here.appendChild(image); } } } episode_url = "{{ page.root }}" + lesson_episodes[i]; xmlHttp[i].open("GET", episode_url); xmlHttp[i].send(null); } } </script>

source: --- layout: page title: "Instructor Notes" ---
uk: --- layout: page title: "Примітки інструктора" ---

source: * Why do we learn to use the shell?
uk: * Навіщо ми вчимося користуватися терміналом?

source: * Allows users to automate repetitive tasks
uk: * Дозволяє користувачам автоматизувати повторювані завдання

source: * And capture small data manipulation steps that are normally not recorded
uk: * І фіксує невеликі кроки маніпуляцій з даними, які зазвичай не записуються

source: to make research reproducible * The Problem * Running the same workflow on several samples can be unnecessarily labour intensive * Manual manipulation of data files: * is often not captured in documentation * is hard to reproduce * is hard to troubleshoot, review, or improve * The Shell * Workflows can be automated through the use of shell scripts * Built-in commands allow for easy data manipulation (e.g. sort, grep, etc.) * Every step can be captured in the shell script and allow reproducibility and easy troubleshooting
uk: для того, щоб зробити дослідження відтворюваними * Проблема * Запуск одного і того ж робочого процесу для декількох зразків може бути невиправдано трудомістким * Ручна маніпуляція з файлами даних: * часто не відображається в документації * важко відтворити * важко усунути несправності, переглянути або вдосконалити * Термінал * Робочі процеси можна автоматизувати за допомогою скриптів терміналу * Вбудовані команди дозволяють легко маніпулювати даними (наприклад, sort, grep тощо). * Кожен крок може бути зафіксований у скрипті терміналу, що забезпечує відтворюваність та легке усунення несправностей

source: ## Overall
uk: ## Загальний підсумок

source: Many people have questioned whether we should still teach the shell. After all, anyone who wants to rename several thousand data files can easily do so interactively in the Python interpreter, and anyone who's doing serious data analysis is probably going to do most of their work inside the IPython Notebook or R Studio. So why teach the shell?
uk: Багато хто ставить під сумнів, чи варто продовжувати вчити термінал. Зрештою, будь-хто, хто хоче перейменувати кілька тисяч файлів даних, може легко зробити це інтерактивно в інтерпретаторі Python, і будь-хто, хто займається серйозним аналізом даних швидше за все, буде виконувати більшу частину своєї роботи в IPython Notebook або в R Studio. Тож навіщо навчатися роботі в терміналі?

source: The first answer is, "Because so much else depends on it." Installing software, configuring your default editor, and controlling remote machines frequently assume a basic familiarity with the shell, and with related ideas like standard input and output. Many tools also use its terminology (for example, the `%ls` and `%cd` magic commands in IPython).
uk: Перша відповідь така: "Тому що від цього залежить так багато іншого". Встановлення програмного забезпечення, налаштування редактора за замовчуванням та керування віддаленими комп'ютерами часто вимагають базового знайомства з командним терміналом та пов'язаними з ним поняттями, такими як стандартний ввід та вивід. Багато інструментів також використовують його термінологію (наприклад, магічні команди `%ls` та `%cd` в IPython).

source: The second answer is, "Because it's an easy way to introduce some fundamental ideas about how to use computers." As we teach people how to use the Unix shell, we teach them that they should get the computer to repeat things (via tab completion, `!` followed by a command number, and `for` loops) rather than repeating things themselves. We also teach them to take things they've discovered they do frequently and save them for later re-use (via shell scripts), to give things sensible names, and to write a little bit of documentation (like comment at the top of shell scripts) to make their future selves' lives better.
uk: Друга відповідь така: "Тому що це простий спосіб представити деякі фундаментальні ідеї про те, як користуватися комп'ютером". Коли ми вчимо людей користуватися терміналом Unix, ми вчимо їх, що вони повинні змусити комп'ютер повторювати дії (за допомогою завершення клавішею табуляції, знаком `!`, за яким йде номер команди, та циклів "for"). замість того, щоб повторювати щось самому. Ми також вчимо їх брати речі, які, як вони виявили, вони роблять часто, і зберігати їх для подальшого використання (за допомогою скриптів терміналу), давати речам розумні назви і писати невелику документацію (наприклад, коментар у верхній частині скрипта терміналу) щоб покращити життя своїх майбутніх поколінь.

source: The third answer is, "Because it enables use of many domain-specific tools and compute resources researchers cannot access otherwise." Familiarity with the shell is very useful for remote accessing machines, using high-performance computing infrastructure, and running new specialist tools in many disciplines. We do not teach HPC or domain-specific skills here but lay the groundwork for further development of these skills. In particular, understanding the syntax of commands, flags, and help systems is useful for domain specific tools and understanding the file system (and how to navigate it) is useful for remote access.
uk: Третя відповідь така: "Тому що це дозволяє використовувати багато специфічних інструментів та обчислювальних ресурсів, до яких дослідники не можуть отримати доступ інакше". Знайомство з терміналом дуже корисне для віддаленого доступу до машин, використання високопродуктивної обчислювальної інфраструктури та запуску нових спеціалізованих інструментів у багатьох дисциплінах. Ми не навчаємо навичкам роботи з високопродуктивними обчислювальними системами або роботі в конкретних галузях, але закладаємо основу для подальшого розвитку цих навичок. Зокрема, розуміння синтаксису команд, прапорів та довідкових систем є корисним для роботи з специфічними інструментами, а розуміння файлової системи (та способів навігації по ній) корисне для віддаленого доступу.

source: Finally, and perhaps most importantly, teaching people the shell lets us teach them to think about programming in terms of function composition. In the case of the shell, this takes the form of pipelines rather than nested function calls, but the core idea of "small pieces, loosely joined" is the same.
uk: Нарешті, і, можливо, найважливіше, навчання людей терміналу дозволяє нам навчити їх думати про програмування з точки зору композиції функцій. У випадку з терміналом це має форму конвеєрів, а не вкладених викликів функцій, але основна ідея "маленьких шматочків, нещільно з'єднаних між собою" залишається тією ж самою.

source: All of this material can be covered in three hours as long as learners using Windows do not run into roadblocks such as:
uk: Весь цей матеріал можна охопити за три години за умови, що учні, які використовують Windows, не натраплять на такі перешкоди, як:

source: * not being able to figure out where their home directory is
uk: * неможливысть з'ясувати, де знаходиться їхня домашня директорія

source: (particularly if they're using Cygwin); * not being able to run a plain text editor; and * the shell refusing to run scripts that include DOS line endings.
uk: (особливо якщо вони використовують Cygwin); * невміння запустити звичайний текстовий редактор; та * відмова терміналу виконувати скрипти, які містять закінчення рядків DOS.

source: ## Preparing to Teach
uk: ## Підготовка до викладання

source: * Use the `data` directory for in-workshop exercises and live coding examples.
uk: * Використовуйте каталог `data` для вправ на семинарах та прикладів кодування в реальному часі.

source: You can clone the shell-novice directory or use the *Download ZIP* button on the right to get the entire [Git repository](https://github.com/swcarpentry/shell-novice). We also now provide a zip file of the `data` directory at the [Setup page]({{ page.root }}{% link setup.md %}).
uk: Ви можете клонувати каталог shell-novice або використати *Завантажити ZIP*. кнопку праворуч, щоб отримати увесь [Git репозиторій](https://github.com/swcarpentry/shell-novice). Також тепер ми надаємо zip-файл каталогу `data` на [Сторінці налаштування]({{ page.root }}{% link setup.md %}).

source: * Website: various practices have been used.
uk: * Веб-сайт: використовувалися різні практики.

source: * Option 1: Can give links to learners before the lesson so they can follow along,
uk: * Варіант 1: Ви можете дати учням посилання перед початком уроку, щоб вони могли слідувати за ним,

source: catch up, and see exercises (particularly if you're following the lesson content without many changes). * Option 2: Don't show the website to the learners during the lesson, as it can be distracting: students may read instead of listen, and having another window open is an additional cognitive load. * In any case, make sure to point to website as a post-workshop reference.
uk: надолужити пропущене та переглянути вправи (особливо якщо ви дотримуєтесь змісту уроку без особливих змін). * Варіант 2: Не показуйте веб-сайт учням під час уроку, оскільки це може відволікати: учні можуть читати замість того, щоб слухати, а відкрите вікно - це додаткове когнітивне навантаження. * У будь-якому випадку, не забудьте вказати на веб-сайт як на джерело інформації після воркшопу.

source: * Content:
uk: * Зміст:

source: Unless you have a truly generous amount of time (4+ hours), it is likely that you will not cover ALL the material in this lesson in a single half-day session. Plan ahead on what you might skip, what you really want to emphasize, etc.
uk: Якщо ви не маєте справді щедрої кількості часу (4+ години), швидше за все, ви не зможете охопити весь матеріал цього уроку за один урок тривалістю у половину дня. Заздалегідь сплануйте, що ви можете пропустити, на чому хочете наголосити тощо.

source: * Exercises:
uk: * Вправи:

source: Think in advance about how you might want to handle exercises during the lesson. How are you assigning them (website, slide, handout)? Do you want everyone to try it and then you show the solution? Have a learner show the solution? Have groups each do a different exercise and present their solutions?
uk: Заздалегідь продумайте, як ви будете працювати з вправами під час уроку. Як ви їх роздаєте (веб-сайт, слайд, роздатковий матеріал)? Ви хочете, щоб кожен спробував, а потім ви показали розв'язання? Чи попросити когось з учнів показати розв'язання? Доручити групам виконати різні вправи і презентувати свої рішення?

source: * The [Reference page]({{ page.root }}{% link reference.md %}) can be printed out
uk: * Сторінку [Посилання]({{ page.root }}{% link reference.md %}) можна роздрукувати

source: and given to students as a reference, your choice.
uk: і дати студентам для ознайомлення, на ваш вибір.

source: * Other preparation:
uk: * Інші приготування:

source: Feel free to add your own examples or side comments, but know that it shouldn't be necessary: the topics and commands can be taught as given on the lesson pages. If you think there is a place where the lesson is lacking, feel free to file an issue or submit a pull request.
uk: Не соромтеся додавати власні приклади чи коментарі, але знайте, що це не обов'язково: теми і команди можна викладати так, як вони подані на сторінках уроків. Якщо ви вважаєте, що в уроці чогось не вистачає, не соромтеся повідомити про проблему або створити запит на зміну матеріалу.

source: ## Teaching Notes
uk: ## Викладацькі нотатки

source: * Super cool online resource!
uk: * Супер крутий онлайн-ресурс!

source: <http://explainshell.com/> will dissect any shell command you type in and display help text for each piece. Additional nice manual tool could be <http://tldr-pages.github.io/> with short very descriptive manuals for shell commands, useful especially on Windows while using Git BASH where `man` could not work.
uk: <http://explainshell.com/> детально проаналізує будь-яку команду оболонки, яку ви введете, і покаже текст довідки для кожного фрагмента. Додатковим чудовим посібником може бути <http://tldr-pages.github.io/> з короткими дуже докладними інструкціями для команд командного рядка, особливо корисним у Windows під час використання Git Bash, де `man` не може працювати.

source: * Another super cool online resource is <http://www.shellcheck.net>,
uk: * Ще один супер крутий онлайн-ресурс - це <http://www.shellcheck.net>,

source: which will check shell scripts (both uploaded and typed in) for common errors.
uk: який перевірить скрипти оболонки (як завантажені, так і введені) на наявність типових помилок.

source: * Resources for "splitting" your shell so that recent commands
uk: * Ресурси для "розщеплення" вашої терміналу так, щоб нещодавні команди

source: remain in view: <https://github.com/rgaiacs/swc-shell-split-window>.
uk: залишалися в полі зору: <https://github.com/rgaiacs/swc-shell-split-window>.

source: * Learners can sometimes get trapped within command-line text editors such as
uk: * Іноді учні можуть потрапити в пастку в текстових редакторах командного рядка, таких як

source: Vim, Emacs, or Nano. Closing the terminal emulator and opening a new one can be frustrating as learners will have to navigate to the correct folder again. Our recommendation to mitigate this problem is that instructors should use the same text editor as the learners during workshops (in most cases Nano).
uk: Vim, Emacs або Nano. Закриття емулятора терміналу та відкриття нового може викликати розчарування оскільки учням доведеться знову переходити до потрібної папки. Для пом'якшення цієї проблеми ми радимо викладачам використовувати той самий текстовий редактор, що й учні під час семінарів (у більшості випадків Nano).

source: * Introducing and navigating the filesystem in the shell (covered in
uk: * Знайомство з файловою системою в терміналі та навігація нею (розглянуто в

source: [Navigating Files and Directories]({{ page.root }}{% link _episodes/02-filedir.md %}) section) can be confusing. You may have both terminal and GUI file explorer open side by side so learners can see the content and file structure while they're using terminal to navigate the system.
uk: секції [Навігація файлами та каталогами]({{ page.root }}{% link _episodes/02-filedir.md %})) можуть плутати. Ви можете мати відкриті термінал і графічний провідник файлів поруч, щоб учні могли бачити вміст і структуру файлів, коли вони використовують термінал для навігації системою.

source: * Tab completion sounds like a small thing: it isn't.
uk: * Завершення клавішею табуляції звучить як дрібниця: це не так.

source: Re-running old commands using `!123` or `!wc` isn't a small thing either, and neither are wildcard expansion and `for` loops. Each one is an opportunity to repeat one of the big ideas of Software Carpentry: if the computer *can* repeat it, some programmer somewhere will almost certainly have built some way for the computer *to* repeat it.
uk: Повторний запуск старих команд за допомогою `!123` або `!wc` теж не дрібниця, і також дрібницями не є розгортання підстановочних символів та цикли `for`. Кожен із них — це можливість повторити одну з великих ідей Software Carpentry: якщо комп'ютер *може* це повторити, якийсь програміст десь майже напевно створить якийсь спосіб для комп’ютера *повторити* це.

source: * Building up a pipeline with four or five stages,
uk: * Побудова конвеєру з чотирма або п'ятьма ступенями,
