Repository: carpentries-i18n/i18n
Catalog: po/shell-novice.*.po
Languages: uk

source: --- layout: base root: . permalink: 404.html title: "Page not found" ---
uk: --- layout: base root: . permalink: 404.html title: "Сторінка не знайдена" ---

source: # Oops! We cannot find that page.
uk: # Ой! Ми не можемо знайти цю сторінку.

source: > ## Our apologies!
uk: > ## Перепрошуємо!

source: > > We cannot seem to find the page you are looking for. > Try going back to the <a href="javascript:history.back()">previous page</a> or > navigate to any other page using the navigation bar above > {%- if site.kind == "lesson" -%} or the schedule below {%- endif -%}. > If you got here by clicking on a link in the > {%- if site.kind == "lesson" -%} lesson {%- else -%} workshop {%- endif -%}, > please report this link to the > {%- if site.kind == "lesson" -%} lesson developers {%- else -%} workshop organizers {%- endif -%}.
uk: > > Здається, ми не можемо знайти сторінку, яку ви шукаєте. > Спробуйте повернутися на <a href="javascript:history.back()">попередню сторінку</a> або > перейти на будь-яку іншу сторінку за допомогою панелі навігації вище > {%- if site.kind == "lesson" -%} або за розкладом нижче {%- endif -%}. > Якщо ви потрапили сюди, перейшовши за посиланням у > {%- if site.kind == "lesson" -%} уроці {%- else -%} семінарі {%- endif -%}, > будь ласка, повідомте про це посилання > {%- if site.kind == "lesson" -%} розробникам уроку {%- else -%} організаторам семінару {%- endif -%}.

source: --- layout: page title: "Contributor Code of Conduct" ---
uk: --- layout: page title: "Кодекс поведінки учасника проекту" ---

source: As contributors and maintainers of this project, we pledge to follow the [Carpentry Code of Conduct][coc].
uk: Як учасники та супровідники цього проєкту, ми зобов'язуємося дотримуватися [Кодексу поведінки Carpentry][coc].

source: Instances of abusive, harassing, or otherwise unacceptable behavior may be reported by following our [reporting guidelines][coc-reporting].
uk: Про випадки образливої, агресивної або іншої неприйнятної поведінки можна повідомити, дотримуючись наших [інструкцій щодо звітування][coc-reporting].

source: # Contributing
uk: # Внески до проєкту

source: [Software Carpentry][swc-site] and [Data Carpentry][dc-site] are open source projects, and we welcome contributions of all kinds: new lessons, fixes to existing material, bug reports, and reviews of proposed changes are all welcome.
uk: [Software Carpentry][swc-site] та [Data Carpentry][dc-site] є проєктами з відкритим вихідним кодом, і ми вітаємо будь-які внески: нові уроки, виправлення наявного матеріалу, повідомлення про помилки та рецензування запропонованих змін - все це вітається.

source: ## Contributor Agreement
uk: ## Угода про участь у проєкті

source: By contributing, you agree that we may redistribute your work under [our license](LICENSE.md). In exchange, we will address your issues and/or assess your change proposal as promptly as we can, and help you become a member of our community. Everyone involved in [Software Carpentry][swc-site] and [Data Carpentry][dc-site] agrees to abide by our [code of conduct](CONDUCT.md).
uk: Роблячи свій внесок, ви погоджуєтеся, що ми можемо розповсюджувати вашу роботу на умовах [нашої ліцензії] (LICENSE.md). В обмін на це ми розглянемо ваші зауваження та/або оцінимо вашу пропозицію щодо змін настільки швидко, наскільки це буде можливо, і допоможемо вам стати членом нашої спільноти. Кожен, хто бере участь у [Software Carpentry][swc-site] та [Data Carpentry][dc-site], погоджується дотримуватися нашого [кодексу поведінки](CONDUCT.md).

source: ## How to Contribute
uk: ## Як зробити внесок

source: The easiest way to get started is to file an issue to tell us about a spelling mistake, some awkward wording, or a factual error. This is a good way to introduce yourself and to meet some of our community members.
uk: Найпростіший спосіб почати - це подати заявку про проблему, щоб повідомити нам про орфографічну помилку, певне некоректне формулювання або фактичну помилку. Це хороший спосіб заявити про себе і познайомитися з деякими членами нашої спільноти.

source: 1. If you do not have a [GitHub][github] account,
uk: 1. Якщо у вас немає облікового запису [GitHub][github],

source: you can [send us comments by email][contact]. However, we will be able to respond more quickly if you use one of the other methods described below.
uk: ви можете [надіслати нам коментарі електронною поштою][contact]. Однак, ми зможемо відповісти швидше, якщо ви скористаєтеся одним з інших способів, описаних нижче.

source: 2. If you have a [GitHub][github] account,
uk: 2. Якщо у вас є обліковий запис [GitHub][github],

source: or are willing to [create one][github-join], but do not know how to use Git, you can report problems or suggest improvements by [creating an issue][issues]. This allows us to assign the item to someone and to respond to it in a threaded discussion.
uk: або ви хочете [створити його][github-join], але не знаєте, як користуватися Git'ом, ви можете повідомити про проблеми або запропонувати покращення, [створивши запит][issues]. Це дозволяє нам призначити цей запит комусь і відповісти на нього в потоковому обговоренні.

source: 3. If you are comfortable with Git,
uk: 3. Якщо вам зручно працювати з Git'ом,

source: and would like to add or change material, you can submit a pull request (PR). Instructions for doing this are [included below](#using-github).
uk: і ви хотіли б додати або змінити матеріал, ви можете подати запит на зміни (англ. pull request, PR). Інструкції, як це зробити, [наведені нижче](#використання-github).

source: ## Where to Contribute
uk: ## Де робити внески

source: 1. If you wish to change this lesson,
uk: 1. Якщо ви хочете змінити цей урок,

source: please work in <https://github.com/swcarpentry/shell-novice>, which can be viewed at <https://swcarpentry.github.io/shell-novice>.
uk: будь ласка, працюйте в <https://github.com/swcarpentry/shell-novice>, який можна переглянути на <https://swcarpentry.github.io/shell-novice>.

source: 2. If you wish to change the example lesson,
uk: 2. Якщо ви бажаєте змінити шаблон уроку,

source: please work in <https://github.com/carpentries/lesson-example>, which documents the format of our lessons and can be viewed at <https://carpentries.github.io/lesson-example>.
uk: будь ласка, працюйте в <https://github.com/carpentries/lesson-example>, який документує формат наших уроків, і з яким можна ознайомитись за посиланням <https://carpentries.github.io/lesson-example>.

source: 3. If you wish to change the template used for workshop websites,
uk: 3. Якщо ви бажаєте змінити шаблон, який використовується для веб-сайтів семінарів,

source: please work in <https://github.com/carpentries/workshop-template>. The home page of that repository explains how to set up workshop websites, while the extra pages in <https://carpentries.github.io/workshop-template> provide more background on our design choices.
uk: будь ласка, працюйте в <https://github.com/carpentries/workshop-template>. На головній сторінці цього репозиторію пояснюється, як налаштувати веб-сайти семінарів, а додаткові сторінки у <https://carpentries.github.io/workshop-template> надають більше інформації про наш вибір дизайну.

source: 4. If you wish to change CSS style files, tools,
uk: 4. Якщо ви хочете змінити файли стилів CSS, інструменти,

source: or HTML boilerplate for lessons or workshops stored in `_includes` or `_layouts`, please work in <https://github.com/carpentries/styles>.
uk: або HTML-шаблон для уроків чи семінарів, що зберігаються в `_includes` або `_layouts`, будь ласка, працюйте в <https://github.com/carpentries/styles>.

source: ## What to Contribute
uk: ## Які внески робити

source: There are many ways to contribute, from writing new exercises and improving existing ones to updating or filling in the documentation and submitting [bug reports][issues] about things that don't work, aren't clear, or are missing. If you are looking for ideas, please see [the list of issues for this repository][issues], or the issues for [Data Carpentry][dc-issues] and [Software Carpentry][swc-issues] projects.
uk: Існує багато способів зробити свій внесок, від написання нових вправ та покращення тих, що вже існують, до оновлення або додавання документації та подання [звітів про помилки][issues] про речі, які не працюють, незрозумілі або відсутні. Якщо ви шукаєте ідеї, будь ласка, перегляньте [перелік проблем для цього репозиторію][issues], або перелік проблем для проєктів [Data Carpentry][dc-issues] та [Software Carpentry][swc-issues].

source: Comments on issues and reviews of pull requests are just as welcome: we are smarter together than we are on our own. Reviews from novices and newcomers are particularly valuable: it's easy for people who have been using these lessons for a while to forget how impenetrable some of this material can be, so fresh eyes are always welcome.
uk: Також вітаються коментарі щодо проблем та рецензування запитів на зміни: разом ми розумніші, ніж поодинці. Особливо цінні відгуки від початковців і новоприбулих: людям, які користуються цими уроками вже деякий час, легко забути, наскільки непроникним може бути деякий матеріал, тому свіжий погляд завжди вітається.

source: ## What *Not* to Contribute
uk: ## Які внески *не слід* робити

source: Our lessons already contain more material than we can cover in a typical workshop, so we are usually *not* looking for more concepts or tools to add to them. As a rule, if you want to introduce a new idea, you must (a) estimate how long it will take to teach and (b) explain what you would take out to make room for it. The first encourages contributors to be honest about requirements; the second, to think hard about priorities.
uk: Наші уроки вже містять більше матеріалу, ніж ми можемо охопити на типовому семінарі, тому ми зазвичай *не* шукаємо більше понять чи інструментів, щоб додати до уроків. Як правило, якщо ви хочете представити нову ідею, ви повинні (а) оцінити, скільки часу знадобиться на викладання і (б) пояснити, що ви вилучите, щоб звільнити місце для цього. Перше заохочує авторів бути чесними щодо вимог; друге - добре подумати про пріоритети.

source: We are also not looking for exercises or other material that only run on one platform. Our workshops typically contain a mixture of Windows, macOS, and Linux users; in order to be usable, our lessons must run equally well on all three.
uk: Ми також не шукаємо завдання чи інші матеріали, які працюють лише на одній платформі. На наших семінарах зазвичай присутні користувачі Windows, macOS та Linux; для того, щоб бути корисними, наші уроки повинні однаково добре працювати на всіх трьох платформах.

source: ## Using GitHub
uk: ## Використання GitHub

source: If you choose to contribute via GitHub, you may want to look at [How to Contribute to an Open Source Project on GitHub][how-contribute]. In brief:
uk: Якщо ви вирішили зробити свій внесок через GitHub, вам варто ознайомитися зі статтею [Як зробити внесок у проект з відкритим вихідним кодом на GitHub][how-contribute]. Якщо коротко:

source: 1. The published copy of the lesson is in the `gh-pages` branch of the repository
uk: 1. Опублікована копія уроку знаходиться у гілці `gh-pages` репозиторію

source: (so that GitHub will regenerate it automatically). Please create all branches from that, and merge the [master repository][repo]'s `gh-pages` branch into your `gh-pages` branch before starting work. Please do *not* work directly in your `gh-pages` branch, since that will make it difficult for you to work on other contributions.
uk: (для того, щоб GitHub автоматично згенерував урок). Будь ласка, створюйте всі гілки звідти, і об'єднайте гілку `gh-pages` [головного репозиторію][repo] з вашою гілкою `gh-pages` перед початком роботи. Будь ласка, *не* працюйте безпосередньо у вашій гілці `gh-pages`, оскільки це може ускладнити вашу роботу над іншими внесками.

source: 2. We use [GitHub flow][github-flow] to manage changes:
uk: 2. Ми використовуємо [GitHub flow][github-flow] для керування змінами:

source: 1. Create a new branch in your desktop copy of this repository for each significant change. 2. Commit the change in that branch. 3. Push that branch to your fork of this repository on GitHub. 4. Submit a pull request from that branch to the [master repository][repo]. 5. If you receive feedback, make changes on your desktop and push to your branch on GitHub: the pull request will update automatically.
uk: 1. Створюйте нову гілку у вашій копії цього репозиторію для кожної значної зміни. 2. Зафіксуйте зміни у цій гілці. 3. Перенесіть цю гілку до вашого розгалуження цього репозиторію на GitHub. 4. Надішліть запит на зміни з цієї гілки до [головного репозиторію][repo]. 5. Якщо ви отримаєте зворотній зв'язок, внесіть зміни в локальній копії та перенесіть до своєї гілки на GitHub: запит на зміни буде оновлено автоматично.

source: Each lesson has two maintainers who review issues and pull requests or encourage others to do so. The maintainers are community volunteers, and have final say over what gets merged into the lesson.
uk: За кожний урок відповідають два супровідника, які переглядають проблеми і задовільняють запити на зміни або заохочують до цього інших. Супровідники є волонтерами спільноти, і мають вирішальне слово щодо того, що буде додано до уроку.

source: ## Other Resources
uk: ## Інші ресурси

source: General discussion of [Software Carpentry][swc-site] and [Data Carpentry][dc-site] happens on the [discussion mailing list][discuss-list], which everyone is welcome to join. You can also [reach us by email][contact].
uk: Загальне обговорення [Software Carpentry][swc-site] та [Data Carpentry][dc-site] відбувається у [дискусійному списку розсилки][discuss-list], до якого може приєднатися кожен охочий. Ви також можете [зв'язатися з нами електронною поштою][contact].

source: --- layout: page title: "Licenses" root: . ---
uk: --- layout: page title: "Ліцензії" root: . ---

source: ## Instructional Material
uk: ## Навчальні матеріали

source: All Software Carpentry, Data Carpentry, and Library Carpentry instructional material is made available under the [Creative Commons Attribution license][cc-by-human]. The following is a human-readable summary of (and not a substitute for) the [full legal text of the CC BY 4.0 license][cc-by-legal].
uk: Усі навчальні матеріали Software Carpentry, Data Carpentry та Library Carpentry доступні на умовах [Creative Commons Attribution ліцензії][cc-by-human]. Нижче наведено придатний для читання людиною короткий виклад (а не заміна) [повного юридичного тексту ліцензії CC BY 4.0][cc-by-legal].

source: You are free:
uk: Ви можете вільно:

source: * to **Share**---copy and redistribute the material in any medium or format
uk: * **Поширювати**---копіювати і розповсюджувати матеріал у будь-якому вигляді чи форматі

source: * to **Adapt**---remix, transform, and build upon the material
uk: * **Змінювати**---реміксувати, трансформувати, і брати матеріал за основу

source: for any purpose, even commercially.
uk: для будь-яких цілей, навіть комерційних.

source: The licensor cannot revoke these freedoms as long as you follow the license terms.
uk: Ліцензіар не може відкликати ці дозволи поки ви дотримуєтесь умов ліцензії.

source: Under the following terms:
uk: На наступних умовах:

source: * **Attribution**---You must give appropriate credit (mentioning that
uk: * **Зазначення Авторства**---Ви маєте вказати автора (зазначивши, що

source: your work is derived from work that is Copyright © Software Carpentry and, where practical, linking to http://software-carpentry.org/), provide a [link to the license][cc-by-human], and indicate if changes were made. You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.
uk: ваша робота є похідною від роботи, захищеної авторським правом © Software Carpentry, та, де це можливо, зробити посилання на http://software-carpentry.org/), розмістити [посилання на ліцензію][cc-by-human] і вказати чи було внесено зміни. Ви можете зробити це у будь-який розумний спосіб, але так, щоб не створювати враження стосовно того, що ліцензіар підтримує чи схвалює вас або ваше використання твору.

source: **No additional restrictions**---You may not apply legal terms or technological measures that legally restrict others from doing anything the license permits. With the understanding that:
uk: **Без додаткових обмежень**---Ви не можете висувати додаткові умови або застосовувати технологічні засоби захисту, що обмежують права інших на дії, дозволені ліцензією. З розумінням того, що:

source: Notices:
uk: Примітки:

source: * You do not have to comply with the license for elements of the
uk: * Ви можете не дотримуватись умов ліцензії в частині,

source: material in the public domain or where your use is permitted by an applicable exception or limitation. * No warranties are given. The license may not give you all of the permissions necessary for your intended use. For example, other rights such as publicity, privacy, or moral rights may limit how you use the material.
uk: що стосується частин матеріалу, котрі знаходяться у суспільному надбанні, або коли ваше використання дозволене застосовними виключеннями та обмеженнями авторського права. * Не надається жодних гарантій. Ліцензія може не надавати всіх необхідних дозволів, необхідних для вашого використання матеріалу. Наприклад, інші права, такі як право на зображення особи, на приватне життя або особисті немайнові права можуть обмежувати ваші можливості використовувати матеріал.

source: ## Software
uk: ## Програмне забезпечення

source: Except where otherwise noted, the example programs and other software provided by Software Carpentry and Data Carpentry are made available under the [OSI][osi]-approved [MIT license][mit-license].
uk: Якщо не зазначено інше, приклади програм та інше програмне забезпечення надані Software Carpentry та Data Carpentry, доступні відповідно до [OSI][osi]-затвердженої [ліцензії MIT][mit-license].

source: Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
uk: Дозвіл надається безкоштовно будь-якій особі, яка отримує копію цього програмного забезпечення та пов'язаних з ним файлів документації ("Програмне забезпечення"), мати справу з Програмним забезпеченням без обмежень, включаючи відсутність обмежень прав на використання, копіювання, модифікацію, об'єднання, публікацію, розповсюдження, субліцензування та/або продаж копії Програмного забезпечення, а також дозволяти особам, яким надається Програмне забезпечення, робити це, відповідно до наступних умов:

source: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
uk: Наведене вище повідомлення про авторські права і це повідомлення про дозвіл повинні бути включені до всіх копій або значних частин Програми.

source: THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
uk: ПРОГРАМНЕ ЗАБЕЗПЕЧЕННЯ НАДАЄТЬСЯ "ЯК Є", БЕЗ БУДЬ-ЯКИХ ГАРАНТІЙ, ЯВНИХ АБО НЕЯВНИХ, ВКЛЮЧАЮЧИ, АЛЕ НЕ ОБМЕЖУЮЧИСЬ ГАРАНТІЯМИ ПРИДАТНОСТІ ДЛЯ ПРОДАЖУ, ПРИДАТНОСТІ ДЛЯ ПЕВНОЇ МЕТИ ТА НЕПОРУШЕННЯ АВТОРСЬКИХ ПРАВ. ЗА ЖОДНИХ ОБСТАВИН АВТОРИ АБО ВЛАСНИКИ АВТОРСЬКИХ ПРАВ НЕ НЕСУТЬ ВІДПОВІДАЛЬНОСТІ ЗА БУДЬ-ЯКІ ПРЕТЕНЗІЇ, ЗБИТКИ АБО ІНШУ ВІДПОВІДАЛЬНІСТЬ, ЧИ ТО В РАМКАХ, ДОГОВОРУ, ДЕЛІКТУ АБО ІНШИМ ЧИНОМ, ЩО ВИНИКАЮТЬ З, ВНАСЛІДОК АБО У ЗВ'ЯЗКУ З ПРОГРАМНИМ ЗАБЕЗПЕЧЕННЯМ, ЙОГО ВИКОРИСТАННЯМ АБО ІНШИМИ ОПЕРАЦІЯМИ З ПРОГРАМНИМ ЗАБЕЗПЕЧЕННЯМ.

source: ## Trademark
uk: ## Торговельна марка

source: "Software Carpentry" and "Data Carpentry" and their respective logos are registered trademarks of [Community Initiatives][CI].
uk: «Software Carpentry» та «Data Carpentry» та їхні відповідні логотипи є зареєстрованими торговими марками [Community Initiatives][CI].

source: An introduction to the Unix shell for people who have never used the command line before. Please see <https://swcarpentry.github.io/shell-novice/> for a rendered version of this material, [the lesson template documentation][lesson-example] for instructions on formatting, building, and submitting material, or run `make` in this directory for a list of helpful commands.
uk: Знайомство з терміналом Unix для тих, хто ніколи раніше не користувався командним рядком. Будь ласка, зверніться до <https://swcarpentry.github.io/shell-novice/>, щоб переглянути візаулізовану версію цього матеріалу, [документацію до шаблону уроків][lesson-example] для отримання інструкцій щодо форматування, створення та надсилання матеріалу, або виконайте `make` у цьому каталозі для отримання списку корисних команд.

source: ## Maintainers
uk: ## Супровідники

source: ## Contributing
uk: ## Внески до проєкту

source: If you would like to contribute to the development of the lesson, you can find details in our [CONTRIBUTING guide](https://github.com/swcarpentry/shell-novice/blob/gh-pages/CONTRIBUTING.md). Contributions can come in many different forms: typo and formatting fixes, additions or subtractions of content, suggestions, clarifications, and more.
uk: Якщо ви хочете зробити свій внесок у розробку уроку, ви можете знайти деталі в нашому [Посібник для виконання внесків] (https://github.com/swcarpentry/shell-novice/blob/gh-pages/CONTRIBUTING.md). Внесок може бути у різних формах: виправлення помилок і форматування, додавання або вилучення змісту, пропозиції, роз'яснення тощо.
