Repository: carpentries-i18n/i18n
Catalog: po/shell-novice.*.po
Languages: uk

source: parent directory : The directory that "contains" the one in question. Every directory in a file system except the [root directory](#root-directory) has a parent. A directory's parent is usually referred to using the shorthand notation `..` (pronounced "dot dot").
uk: батьківський каталог : Каталог, який "містить" каталог, про який йде мова. Кожен каталог у файловій системі, окрім [кореневого каталогу] (#кореневий-каталог), має батька. На батьківський каталог зазвичай посилаються за допомогою скороченого позначення `..` (вимовляється як "крапка крапка").

source: path : A description that specifies the location of a file or directory within a [file system](#file-system). See also: [absolute path](#absolute-path), [relative path](#relative-path).
uk: шлях : Опис, який вказує місцезнаходження файлу або каталогу у [файловій системі](#файлова-система). Дивись також: [абсолютний шлях](#абсолютний-шлях), [відносний шлях](#відносний-шлях).

source: pipe : A connection from the output of one program to the input of another. When two or more programs are connected in this way, they are called a "pipeline".
uk: канал : З'єднання виходу однієї програми з входом іншої. Коли дві або більше програм з'єднані таким чином, вони називаються "конвеєром".

source: process : A running instance of a program, containing code, variable values, open files and network connections, and so on. Processes are the "actors" that the [operating system](#operating-system) manages; it typically runs each process for a few milliseconds at a time to give the impression that they are executing simultaneously.
uk: процес : Екземпляр програми, що виконується; містить код, значення змінних, відкриті файли, мережеві з'єднання тощо. Процеси - це "актори", якими керує [операційна система](#операційна-система); зазвичай вона виконує кожен процес по кілька мілісекунд за раз щоб створити враження, що вони виконуються одночасно.

source: prompt : A character or characters display by a [REPL](#read-evaluate-print-loop) to show that it is waiting for its next command.
uk: запит на введення : Символ або символи, які виводяться циклом [REPL](#цикл-read-evaluate-print), щоб показати, що він чекає на наступну команду.

source: quoting : (in the shell): Using quotation marks of various kinds to prevent the shell from interpreting special characters. For example, to pass the string `*.txt` to a program, it is usually necessary to write it as `'*.txt'` (with single quotes) so that the shell will not try to expand the `*` wildcard.
uk: цитува́ння : (в терміналі): Використання лапок різного типу для запобігання інтерпретації оболонки спеціальних символів. Наприклад, щоб передати програмі рядок `*.txt`, зазвичай потрібно записати його як `'*.txt'` (з одинарними лапками), щоб термінал не намагався розгорнути символ підстановки `*`

source: read-evaluate-print loop : (REPL): A [command-line interface](#command-line-interface) that reads a command from the user, executes it, prints the result, and waits for another command.
uk: цикл read-evaluate-print : (REPL): [інтерфейс командного рядка](#інтерфейс-командного-рядка), який читає команду від користувача, виконує її, виводить результат і чекає на наступну команду.

source: redirect : To send a command's output to a file rather than to the screen or another command, or equivalently to read a command's input from a file.
uk: перенаправляти : Надіслати вивід команди до файлу, а не на екран або іншій команді, або, еквівалентно, прочитати вхідні дані команди з файлу.

source: regular expression : A pattern that specifies a set of character strings. REs are most often used to find sequences of characters in strings.
uk: регулярний вираз : Шаблон, який визначає набір рядків символів. Найчастіше використовуються для пошуку послідовностей символів у рядках.

source: relative path : A [path](#path) that specifies the location of a file or directory with respect to the [current working directory](#current-working-directory). Any path that does not begin with a separator character ("/" or "\\") is a relative path. See also: [absolute path](#absolute-path).
uk: відносний шлях : [Шлях](#шлях), який вказує місцезнаходження файлу або каталогу відносно [поточного робочого каталогу](#поточний-робочий-каталог). Будь-який шлях, який не починається з символу-розділювача ("/" або "\\"), є відносним шляхом. Дивись також: [абсолютний шлях](#абсолютний-шлях).

source: root directory : The top-most directory in a [file system](#file-system). Its name is "/" on Unix (including Linux and macOS) and "\\" on Microsoft Windows.
uk: кореневий каталог : Найвищий каталог у [файловій системі](#файлова-система). Його назва "/" у Unix (включаючи Linux і macOS) і "\\" у Microsoft Windows.

source: shell : A [command-line interface](#cli) such as Bash (the Bourne-Again Shell) or the Microsoft Windows DOS shell that allows a user to interact with the [operating system](#operating-system).
uk: термінал : [інтерфейс командного рядка](#інтерфейс-командного-рядка), наприклад, Bash (the Bourne-Again Shell) або термінал Microsoft Windows DOS яка дозволяє користувачеві взаємодіяти з [операційною системою] (#операційна-система).

source: shell script : A set of [shell](#shell) commands stored in a file for re-use. A shell script is a program executed by the shell; the name "script" is used for historical reasons.
uk: скрипт терміналу : Набір команд [терміналу](#термінал), збережений у файлі для повторного використання. Скрипт терміналу - це програма, яку виконує термінал; назва "скрипт" використовується з історичних причин.

source: standard input : A process's default input stream. In interactive command-line applications, it is typically connected to the keyboard; in a [pipe](#pipe), it receives data from the [standard output](#standard-output) of the preceding process.
uk: стандартний ввід : Потік вводу процесу за замовчуванням. В інтерактивних програмах командного рядка, він зазвичай підключається до клавіатури; у [канал](#канал) він отримує дані зі [стандартного виводу](#стандартний-вивід) попереднього процесу.

source: standard output : A process's default output stream. In interactive command-line applications, data sent to standard output is displayed on the screen; in a [pipe](#pipe), it is passed to the [standard input](#standard-input) of the next process.
uk: стандартний вивід : Потік виведення процесу за замовчуванням. В інтерактивних програмах командного рядка, дані, надіслані на стандартний вивід, виводяться на екран; в [каналі](#канал) вони передаються до [стандартного вводу](#стандартний-ввід) наступного процесу.

source: sub-directory : A directory contained within another directory.
uk: підкаталог : Каталог, що міститься у іншому каталозі.

source: tab completion : A feature provided by many interactive systems in which pressing the Tab key triggers automatic completion of the current word or command.
uk: завершення клавішею табуляції : Функція, що надається багатьма інтерактивними системами, в яких натискання клавіші Tab запускає автоматичне завершення поточного слова або команди.

source: variable : A name in a program that is associated with a value or a collection of values.
uk: змінна : Ім'я у програмі, яке асоціюється зі значенням або колекцією значень.

source: while loop : A loop that keeps executing as long as some condition is true. See also: [for loop](#for-loop).
uk: цикл while : Цикл, який виконується до тих пір, поки істинна певна умова. Дивись також: [цикл for](#цикл-for).

source: wildcard : A character used in pattern matching. In the Unix shell, the wildcard `*` matches zero or more characters, so that `*.txt` matches all files whose names end in `.txt`.
uk: підстановочний символ : Символ, який використовується у співставленні з шаблоном. У терміналі Unix, шаблон `*` відповідає нулю або більше символів, таким чином, `*.txt` відповідає усім файлам, назви яких закінчуються на `.txt`.

source: ## External references
uk: ## Зовнішні посилання

source: ### Opening a terminal
uk: ### Відкриття терміналу

source: * [How to Use Terminal on a Mac](http://www.macworld.co.uk/feature/mac-software/how-use-terminal-on-mac-3608274/)
uk: * [Як користуватися терміналом на Mac](http://www.macworld.co.uk/feature/mac-software/how-use-terminal-on-mac-3608274/) (матеріал англійською мовою)

source: * [Git for Windows](https://git-for-windows.github.io/)
uk: * [Git для Windows](https://git-for-windows.github.io/) (матеріал англійською мовою)

source: * [How to Install Bash shell command-line tool on Windows 10](https://www.windowscentral.com/how-install-bash-shell-command-line-windows-10)
uk: * [Як встановити термінал Bash на Windows 10](https://www.windowscentral.com/how-install-bash-shell-command-line-windows-10) (матеріал англійською мовою)

source: * [Install and Use the Linux Bash Shell on Windows 10](https://www.howtogeek.com/249966/how-to-install-and-use-the-linux-bash-shell-on-windows-10/)
uk: * [Встановлення та використання терміналу Linux Bash у Windows 10](https://www.howtogeek.com/249966/how-to-install-and-use-the-linux-bash-shell-on-windows-10/) (матеріал англійською мовою)

source: * [Using the Windows 10 Bash Shell](https://www.howtogeek.com/265900/everything-you-can-do-with-windows-10s-new-bash-shell/)
uk: * [Використання Windows 10 терміналу Bash](https://www.howtogeek.com/265900/everything-you-can-do-with-windows-10s-new-bash-shell/) (матеріал англійською мовою)

source: * [Using a UNIX/Linux emulator (Cygwin) or Secure Shell (SSH) client (Putty)](http://faculty.smu.edu/reynolds/unixtut/windows.html)
uk: * [Використання емулятора UNIX/Linux (Cygwin) або клієнта Secure Shell (SSH) (Putty)](http://faculty.smu.edu/reynolds/unixtut/windows.html) (матеріал англійською мовою)

source: ### Manuals
uk: ### Посібники

source: * [GNU manuals](http://www.gnu.org/manual/manual.html)
uk: * [Керівництва з GNU](http://www.gnu.org/manual/manual.html) (матеріал англійською мовою)

source: * [Core GNU utilities](http://www.gnu.org/software/coreutils/manual/coreutils.html)
uk: * [Ключові утіліти GNU](http://www.gnu.org/software/coreutils/manual/coreutils.html) (матеріал англійською мовою)

source: ### Miscellaneous
uk: ### Різне

source: * [North Pacific Gyre](http://en.wikipedia.org/wiki/North_Pacific_Gyre)
uk: * [Північнотихоокеанська течія](https://uk.wikipedia.org/wiki/Північнотихоокеанська_течія)

source: * [Great Pacific Garbage Patch](http://en.wikipedia.org/wiki/Great_Pacific_Garbage_Patch)
uk: * [Велика тихоокеанська сміттєва пляма](https://uk.wikipedia.org/wiki/Велика_тихоокеанська_сміттєва_пляма)

source: * ['Ensuring the longevity of digital information' by Jeff Rothenberg](http://www.clir.org/pubs/archives/ensuring.pdf)
uk: * ['Забезпечення довговічності цифрової інформації', автор Jeff Rothenberg](http://www.clir.org/pubs/archives/ensuring.pdf) (матеріал англійською мовою)

source: * [Computer error haikus](http://wiki.c2.com/?ComputerErrorHaiku)
uk: * [Хайку про комп'ютерні помилки](http://wiki.c2.com/?ComputerErrorHaiku) (матеріал англійською мовою)

source: * [How to name files nicely, by Jenny Bryan](https://speakerdeck.com/jennybc/how-to-name-files)
uk: * ['Як правильно називати файли', автор Jenny Bryan](https://speakerdeck.com/jennybc/how-to-name-files) (матеріал англійською мовою)

source: --- layout: page title: Setup root: . ---
uk: --- layout: page title: Встановлення root: . ---

source: ## Download files
uk: ## Завантаження файлів

source: You need to download some files to follow this lesson.
uk: Для перегляду цього уроку вам потрібно завантажити деякі файли.

source: 1. Download [shell-lesson-data.zip][zip-file] and move the file to your Desktop.
uk: 1. Завантажте [shell-lesson-data.zip][zip-file] і перемістіть файл на робочий стіл.

source: 2. Unzip/extract the file.
uk: 2. Розархівуйте файл.

source: **Let your instructor know if you need help with this step**. You should end up with a new folder called **`shell-lesson-data`** on your Desktop.
uk: **Повідомте інструктора, якщо вам потрібна допомога на цьому етапі**. У вас має з'явитися новий каталог з назвою **`shell-lesson-data`** на робочому столі.

source: ## Install software
uk: ## Встановлення програмного забезпечення

source: If you do not already have the shell software installed, you will need to [download and install][install_shell] it.
uk: Якщо у вас ще не встановлено програму-термінал, вам потрібно [завантажити і встановити] [install_shell] її.

source: ## Open a new shell
uk: ## Відкрити новий термінал

source: After installing the software 3. Open a terminal. If you're not sure how to open a terminal on your operating system, see the instructions below. 4. In the terminal type `cd` then press the <kbd>Return</kbd> key. This step will make sure you start with your home folder as your working directory.
uk: Після встановлення програмного забезпечення 3. Відкрити термінал. Якщо ви не знаєте, як відкрити термінал у вашій операційній системі, див. інструкції нижче. 4. У терміналі введіть `cd` і натисніть клавішу <kbd>Return</kbd>. Цей крок гарантує, що ви почнете з вашого домашнього каталогу як робочого каталогу.

source: In the lesson, you will find out how to access the data files in this folder.
uk: У цьому уроці ви дізнаєтеся, як отримати доступ до файлів даних у цій папці.

source: > ## Where to type commands: How to open a new shell
uk: > ## Де вводити команди: Як відкрити новий термінал

source: > > The shell is a program that enables us to send commands to the computer and receive output. > It is also referred to as the terminal or command line. > > Some computers include a default Unix Shell program. > The steps below describe some methods for identifying and opening > a Unix Shell program if you already have one installed. > There are also options for identifying and downloading a Unix Shell program, > a Linux/UNIX emulator, or a program to access a Unix Shell on a server. > > If none of the options below address your circumstances, > try an online search for: Unix shell [your computer model] [your operating system].
uk: > > Термінал - це програма, за допомогою якої ми можемо надсилати команди комп'ютеру та отримувати результати. > Її також називають оболонкою або командним рядком. > > На деяких комп'ютерах за замовчуванням встановлено програму Unix Shell. > Нижче описано деякі способи визначення та відкриття > програми Unix Shell, якщо її вже встановлено. > Також існують способи визначення та завантаження програми Unix Shell, > емулятора Linux/UNIX або програми для доступу до оболонки Unix на сервері. > > Якщо жоден із наведених нижче варіантів не відповідає вашим обставинам, > спробуйте скористатися пошуком в Інтернеті: Unix shell [модель вашого комп'ютера] [ваша операційна система].

source: <div class="tab-content"> <article role="tabpanel" class="tab-pane active" id="windows"> Computers with Windows operating systems do not automatically have a Unix Shell program installed. In this lesson, we encourage you to use an emulator included in [Git for Windows][install_shell], which gives you access to both Bash shell commands and Git.
uk: <div class="tab-content"> <article role="tabpanel" class="tab-pane active" id="windows"> На комп'ютерах з операційною системою Windows автоматично не встановлюється програма Unix Shell У цьому уроці ми рекомендуємо вам скористатися емулятором, що входить до складу [Git for Windows][install_shell], який надає доступ як до команд оболонки Bash, так і до Git'у.

source: Once installed, you can open a terminal by running the program Git Bash from the Windows start menu.
uk: Після встановлення ви можете відкрити термінал, запустивши програму Git Bash зі стартового меню Windows.

source: **For advanced users:**
uk: **Для досвідчених користувачів:**

source: As an alternative to Git for Windows you may wish to [Install the Windows Subsystem for Linux][wsl] which gives access to a Bash shell command-line tool in Windows 10.
uk: Як альтернативу Git'у для Windows ви можете [Встановити підсистему Windows для Linux][wsl] яка надає доступ до інструменту командного рядка Bash у Windows 10.

source: Please note that commands in the Windows Subsystem for Linux (WSL) may differ slightly from those shown in the lesson or presented in the workshop. </article>
uk: Зверніть увагу, що команди у підсистемі Windows для Linux (WSL) можуть дещо відрізнятися від тих, що показані в уроці або представлені на семінарі. </article>

source: <article role="tabpanel" class="tab-pane" id="macos"> For a Mac computer running macOS Mojave or earlier releases, the default Unix Shell is Bash. For a Mac computer running macOS Catalina or later releases, the default Unix Shell is Zsh. Your default shell is available via the Terminal program within your Utilities folder.
uk: <article role="tabpanel" class="tab-pane" id="macos"> На комп'ютерах Mac з macOS Mojave або більш ранніми версіями за замовчуванням використовується Unix-термінал Bash. На комп'ютерах Mac з macOS Catalina або пізніших версій стандартним терміналом Unix є Zsh. Ваша стандартний термінал доступний за допомогою програми Terminal у каталозі Utilities.

source: To open Terminal, try one or both of the following: * In Finder, select the Go menu, then select Utilities. Locate Terminal in the Utilities folder and open it. * Use the Mac 'Spotlight' computer search function. Search for: `Terminal` and press <kbd>Return</kbd>.
uk: Щоб відкрити Термінал, спробуйте один або обидва з наведених нижче способів: * У Finder виберіть меню "Перехід", а потім виберіть "Утиліти". Знайдіть програму Terminal у папці Utilities і відкрийте її. * Використовуйте функцію пошуку на комп'ютері Mac 'Spotlight'. Знайдіть `Термінал` і натисніть <kbd>Return</kbd>.

source: To check if your machine is set up to use something other than Bash, type `echo $SHELL` in your terminal window.
uk: Щоб перевірити, чи налаштовано на вашому комп'ютері використання чогось іншого, окрім Bash, введіть `echo $SHELL` у вікні вашого терміналу.

source: If your machine is set up to use something other than Bash, you can run it by opening a terminal and typing `bash`.
uk: Щоб перевірити, чи налаштовано ваш комп'ютер на використання чогось іншого, окрім Bash, введіть `echo $SHELL` у вікні вашого терміналу.

source: [How to Use Terminal on a Mac][mac-terminal] </article>
uk: [Як користуватися терміналом на Mac][mac-terminal] </article>

source: <article role="tabpanel" class="tab-pane" id="linux"> The default Unix Shell for Linux operating systems is usually Bash. On most versions of Linux, it is accessible by running the [Gnome Terminal][gnome-terminal] or [KDE Konsole][kde-konsole] or [xterm][xterm], which can be found via the applications menu or the search bar. If your machine is set up to use something other than Bash, you can run it by opening a terminal and typing `bash`. </article> </div> </div>
uk: <article role="tabpanel" class="tab-pane" id="linux"> Терміналом Unix для операційних систем Linux за замовчуванням зазвичай є Bash. У більшості версій Linux він доступний за допомогою команд [Gnome Terminal][gnome-terminal], [KDE Konsole][kde-konsole] або [xterm][xterm], які можна знайти за допомогою меню програм або рядка пошуку. Якщо на вашому комп'ютері налаштовано використання інших програм, окрім Bash, ви можете запустити її, відкривши термінал і набравши `bash`. </div> </div>
