Repository: carpentries-i18n/i18n
Catalog: po/shell-novice.*.po
Languages: uk

source: > > Sam has a directory containing calibration data, datasets, and descriptions of > the datasets: > > ~~~ > . > ├── 2015-10-23-calibration.txt > ├── 2015-10-23-dataset1.txt > ├── 2015-10-23-dataset2.txt > ├── 2015-10-23-dataset_overview.txt > ├── 2015-10-26-calibration.txt > ├── 2015-10-26-dataset1.txt > ├── 2015-10-26-dataset2.txt > ├── 2015-10-26-dataset_overview.txt > ├── 2015-11-23-calibration.txt > ├── 2015-11-23-dataset1.txt > ├── 2015-11-23-dataset2.txt > ├── 2015-11-23-dataset_overview.txt > ├── backup > │ ├── calibration > │ └── datasets > └── send_to_bob > ├── all_datasets_created_on_a_23rd > └── all_november_files > ~~~ > {: .language-bash} > > Before heading off to another field trip, she wants to back up her data and > send some datasets to her colleague Bob. Sam uses the following commands > to get the job done: > > ~~~ > $ cp *dataset* backup/datasets > $ cp ____calibration____ backup/calibration > $ cp 2015-____-____ send_to_bob/all_november_files/ > $ cp ____ send_to_bob/all_datasets_created_on_a_23rd/ > ~~~ > {: .language-bash} > > Help Sam by filling in the blanks. > > The resulting directory structure should look like this > ``` > . > ├── 2015-10-23-calibration.txt > ├── 2015-10-23-dataset1.txt > ├── 2015-10-23-dataset2.txt > ├── 2015-10-23-dataset_overview.txt > ├── 2015-10-26-calibration.txt > ├── 2015-10-26-dataset1.txt > ├── 2015-10-26-dataset2.txt > ├── 2015-10-26-dataset_overview.txt > ├── 2015-11-23-calibration.txt > ├── 2015-11-23-dataset1.txt > ├── 2015-11-23-dataset2.txt > ├── 2015-11-23-dataset_overview.txt > ├── backup > │ ├── calibration > │ │ ├── 2015-10-23-calibration.txt > │ │ ├── 2015-10-26-calibration.txt > │ │ └── 2015-11-23-calibration.txt > │ └── datasets > │ ├── 2015-10-23-dataset1.txt > │ ├── 2015-10-23-dataset2.txt > │ ├── 2015-10-23-dataset_overview.txt > │ ├── 2015-10-26-dataset1.txt > │ ├── 2015-10-26-dataset2.txt > │ ├── 2015-10-26-dataset_overview.txt > │ ├── 2015-11-23-dataset1.txt > │ ├── 2015-11-23-dataset2.txt > │ └── 2015-11-23-dataset_overview.txt > └── send_to_bob > ├── all_datasets_created_on_a_23rd > │ ├── 2015-10-23-dataset1.txt > │ ├── 2015-10-23-dataset2.txt > │ ├── 2015-10-23-dataset_overview.txt > │ ├── 2015-11-23-dataset1.txt > │ ├── 2015-11-23-dataset2.txt > │ └── 2015-11-23-dataset_overview.txt > └── all_november_files > ├── 2015-11-23-calibration.txt > ├── 2015-11-23-dataset1.txt > ├── 2015-11-23-dataset2.txt > └── 2015-11-23-dataset_overview.txt > ``` > {: .language-bash} > > > ## Solution > > ``` > > $ cp *calibration.txt backup/calibration > > $ cp 2015-11-* send_to_bob/all_november_files/ > > $ cp *-23-dataset* send_to_bob/all_datasets_created_on_a_23rd/ > > ``` > > {: .language-bash}
uk: > > Сем має каталог, який містить дані калібрування, набори даних та описи > наборів даних: > > ~~~ > . > ├── 2015-10-23-calibration.txt > ├── 2015-10-23-dataset1.txt > ├── 2015-10-23-dataset2.txt > ├── 2015-10-23-dataset_overview.txt > ├── 2015-10-26-calibration.txt > ├── 2015-10-26-dataset1.txt > ├── 2015-10-26-dataset2.txt > ├── 2015-10-26-dataset_overview.txt > ├── 2015-11-23-calibration.txt > ├── 2015-11-23-dataset1.txt > ├── 2015-11-23-dataset2.txt > ├── 2015-11-23-dataset_overview.txt > ├── backup > │ ├── calibration > │ └── datasets > └── send_to_bob > ├── all_datasets_created_on_a_23rd > └── all_november_files > ~~~ > {: .language-bash} > > Перед тим, як вирушити на чергову екскурсію, вона хоче створити резервну копію даних і > надіслати деякі набори даних своєму колезі Бобу. Сем використовує наступні команди > щоб виконати роботу: > > ~~~ > $ cp *dataset* backup/datasets > $ cp ____calibration____ backup/calibration > $ cp 2015-____-____ send_to_bob/all_november_files/ > $ cp ____ send_to_bob/all_datasets_created_on_a_23rd/ > ~~~ > {: .language-bash} > > Допоможіть Сему, заповнивши пропуски. > > Отримана структура каталогів повинна виглядати наступним чином > ``` > . > ├── 2015-10-23-calibration.txt > ├── 2015-10-23-dataset1.txt > ├── 2015-10-23-dataset2.txt > ├── 2015-10-23-dataset_overview.txt > ├── 2015-10-26-calibration.txt > ├── 2015-10-26-dataset1.txt > ├── 2015-10-26-dataset2.txt > ├── 2015-10-26-dataset_overview.txt > ├── 2015-11-23-calibration.txt > ├── 2015-11-23-dataset1.txt > ├── 2015-11-23-dataset2.txt > ├── 2015-11-23-dataset_overview.txt > ├── backup > │ ├── calibration > │ │ ├── 2015-10-23-calibration.txt > │ │ ├── 2015-10-26-calibration.txt > │ │ └── 2015-11-23-calibration.txt > │ └── datasets > │ ├── 2015-10-23-dataset1.txt > │ ├── 2015-10-23-dataset2.txt > │ ├── 2015-10-23-dataset_overview.txt > │ ├── 2015-10-26-dataset1.txt > │ ├── 2015-10-26-dataset2.txt > │ ├── 2015-10-26-dataset_overview.txt > │ ├── 2015-11-23-dataset1.txt > │ ├── 2015-11-23-dataset2.txt > │ └── 2015-11-23-dataset_overview.txt > └── send_to_bob > ├── all_datasets_created_on_a_23rd > │ ├── 2015-10-23-dataset1.txt > │ ├── 2015-10-23-dataset2.txt > │ ├── 2015-10-23-dataset_overview.txt > │ ├── 2015-11-23-dataset1.txt > │ ├── 2015-11-23-dataset2.txt > │ └── 2015-11-23-dataset_overview.txt > └── all_november_files > ├── 2015-11-23-calibration.txt > ├── 2015-11-23-dataset1.txt > ├── 2015-11-23-dataset2.txt > └── 2015-11-23-dataset_overview.txt > ``` > {: .language-bash} > > > ## Розв'язання > > ``` > > $ cp *calibration.txt backup/calibration > > $ cp 2015-11-* send_to_bob/all_november_files/ > > $ cp *-23-dataset* send_to_bob/all_datasets_created_on_a_23rd/ > > ``` > > {: .language-bash}

source: > ## Organizing Directories and Files
uk: > ## Упорядкування каталогів і файлів

source: > > Jamie is working on a project and she sees that her files aren't very well > organized: > > ~~~ > $ ls -F > ~~~ > {: .language-bash} > ~~~ > analyzed/ fructose.dat raw/ sucrose.dat > ~~~
uk: > > Джеймі працює над проектом і бачить, що її файли не дуже добре > впорядковані: > > ~~~ > $ ls -F > ~~~ > {: .language-bash} > ~~~ > analyzed/ fructose.dat raw/ sucrose.dat > ~~~

source: > > The `fructose.dat` and `sucrose.dat` files contain output from her data > analysis. What command(s) covered in this lesson does she need to run > so that the commands below will produce the output shown? > > ~~~ > $ ls -F > ~~~ > {: .language-bash} > ~~~ > analyzed/ raw/ > ~~~
uk: > > Файли `fructose.dat` та `ucrose.dat` містять результати її > аналізу. Яку команду (команди), розглянуту (розглянуті) у цьому уроці, їй потрібно виконати, > щоб наведені нижче команди створили показані нижче результати? > > ~~~ > $ ls -F > ~~~ > {: .language-bash} > ~~~ > analyzed/ raw/ > ~~~

source: > > > ## Solution > > ``` > > mv *.dat analyzed > > ``` > > {: .language-bash} > > Jamie needs to move her files `fructose.dat` and `sucrose.dat` to the `analyzed` directory. > > The shell will expand *.dat to match all .dat files in the current directory. > > The `mv` command then moves the list of .dat files to the 'analyzed' directory.
uk: > > > Розв'язання > > ``` > > mv *.dat analyzed > > ``` > > {: .language-bash} > > Джеймі потрібно перемістити файли `fructose.dat` та `ucrose.dat` до каталогу `analyzed`. > > Термінал розширить шаблон *.dat так, щоб він відповідав усім файлам .dat у поточному каталозі. > > Команда `mv` перемістить сформований перелік файлів .dat до каталогу 'analyzed'.

source: > ## Reproduce a folder structure
uk: > ## Відтворити структуру папок

source: > > You're starting a new experiment and would like to duplicate the directory > structure from your previous experiment so you can add new data. > > Assume that the previous experiment is in a folder called `2016-05-18`, > which contains a `data` folder that in turn contains folders named `raw` and > `processed` that contain data files. The goal is to copy the folder structure > of the `2016-05-18` folder into a folder called `2016-05-20` > so that your final directory structure looks like this: > > ~~~ > 2016-05-20/ > └── data > ├── processed > └── raw > ~~~
uk: > > Ви починаєте новий експеримент і хочете продублювати структуру каталогу > з попереднього експерименту, щоб ви могли додати нові дані. > > Припустимо, що попередній експеримент знаходиться у каталозі з назвою `2016-05-18`, > який містить каталог `data`, який, у свою чергу, містить каталоги `raw` і > `processed`, які містять файли даних. Мета полягає у копіюванні структури папок > каталогу `2016-05-18` до каталогу з назвою `2016-05-20` > таким чином, щоб ваша фінальна структура каталогів виглядала наступним чином: > > ~~~ > 2016-05-20/ > └── data > ├── processed > └── raw > ~~~

source: > > Which of the following set of commands would achieve this objective? > What would the other commands do? > > ~~~ > $ mkdir 2016-05-20 > $ mkdir 2016-05-20/data > $ mkdir 2016-05-20/data/processed > $ mkdir 2016-05-20/data/raw > ~~~ > {: .language-bash} > ~~~ > $ mkdir 2016-05-20 > $ cd 2016-05-20 > $ mkdir data > $ cd data > $ mkdir raw processed > ~~~ > {: .language-bash} > ~~~ > $ mkdir 2016-05-20/data/raw > $ mkdir 2016-05-20/data/processed > ~~~ > {: .language-bash} > ~~~ > $ mkdir -p 2016-05-20/data/raw > $ mkdir -p 2016-05-20/data/processed > ~~~ > {: .language-bash} > ~~~ > $ mkdir 2016-05-20 > $ cd 2016-05-20 > $ mkdir data > $ mkdir raw processed > ~~~ > {: .language-bash} > > > > ## Solution > > The first two sets of commands achieve this objective. > > The first set uses relative paths to create the top-level directory before > > the subdirectories. > > > > The third set of commands will give an error because the default behavior of `mkdir` > > won't create a subdirectory of a non-existent directory: > > the intermediate level folders must be created first. > > > > The fourth set of commands achieve this objective. Remember, the `-p` option, > > followed by a path of one or more > > directories, will cause `mkdir` to create any intermediate subdirectories as required. > > > > The final set of commands generates the 'raw' and 'processed' directories at the same level > > as the 'data' directory.
uk: > > Який з наведених нижче наборів команд досягне цієї мети? > Що зроблять інші команди? > > ~~~ > $ mkdir 2016-05-20 > $ mkdir 2016-05-20/data > $ mkdir 2016-05-20/data/processed > $ mkdir 2016-05-20/data/raw > ~~~ > {: .language-bash} > ~~~ > $ mkdir 2016-05-20 > $ cd 2016-05-20 > $ mkdir data > $ cd data > $ mkdir raw processed > ~~~ > {: .language-bash} > ~~~ > $ mkdir 2016-05-20/data/raw > $ mkdir 2016-05-20/data/processed > ~~~ > {: .language-bash} > ~~~ > $ mkdir -p 2016-05-20/data/raw > $ mkdir -p 2016-05-20/data/processed > ~~~ > {: .language-bash} > ~~~ > $ mkdir 2016-05-20 > $ cd 2016-05-20 > $ mkdir data > $ mkdir raw processed > ~~~ > {: .language-bash} > > > > ## Розв'язання > > Перші два набори команд досягають цієї мети. > > Перший набір використовує відносні шляхи для створення каталогу верхнього рівня перед > > підкаталогами. > > > > Третій набір команд призведе до помилки, оскільки поведінка `mkdir` за замовчуванням > > не створює підкаталог в каталозі, що не існує: > > спочатку мають бути створені каталоги проміжних рівнів. > > > > Четвертий набір команд досягає цієї мети. Пам'ятайте, опція `-p`, > > за яким слідує шлях до одного або декількох > > каталогів, змусить `mkdir` створити будь-які проміжні підкаталоги за потреби. > > > > Останній набір команд створить каталоги 'raw' і 'processed' на тому ж рівні, > > що і каталог 'data'.

source: --- title: "Pipes and Filters" teaching: 25 exercises: 10 questions: - "How can I combine existing commands to do new things?" objectives: - "Redirect a command's output to a file." - "Construct command pipelines with two or more stages." - "Explain what usually happens if a program or pipeline isn't given any input to process." - "Explain the advantage of linking commands with pipes and filters." keypoints: - "`wc` counts lines, words, and characters in its inputs." - "`cat` displays the contents of its inputs." - "`sort` sorts its inputs." - "`head` displays the first 10 lines of its input." - "`tail` displays the last 10 lines of its input." - "`command > [file]` redirects a command's output to a file (overwriting any existing content)." - "`command >> [file]` appends a command's output to a file." - "`[first] | [second]` is a pipeline: the output of the first command is used as the input to the second." - "The best way to use the shell is to use pipes to combine simple single-purpose programs (filters)." ---
uk: --- title: "Канали та фільтри" teaching: 25 exercises: 10 questions: - "Як я можу комбінувати команди, що вже існують, щоб робити нові речі?" objectives: - "Перенаправити вивід команди до файлу." - "Створити конвеєри команд з двома та більше ступенями." - "Пояснити, що зазвичай відбувається, якщо програмі або конвеєру не надається жодних вхідних даних для обробки." - "Пояснити перевагу поєднання команд з каналами та фільтрами." keypoints: - "`wc` підраховує рядки, слова та символи у вхідних даних." - "cat` виводить вміст своїх вхідних даних." - "`sort` сортує вхідні дані." - "`head` виводить перші 10 рядків вхідних даних." - "`tail` виводить останні 10 рядків вхідних даних." - "`command > [file]` перенаправляє вивід команди у файл (перезаписуючи наявний вміст)." - "`command >> [file]` додає вивід команди до файлу." - "`[first] | [second]` є конвеєром: вихід першої команди використовується як вхід для другої." - "Найкращий спосіб використання терміналу - це використання каналів для об'єднання простих одноцільових програм (фільтрів)." ---

source: Now that we know a few basic commands, we can finally look at the shell's most powerful feature: the ease with which it lets us combine existing programs in new ways. We'll start with the directory `shell-lesson-data/exercise-data/proteins` that contains six files describing some simple organic molecules. The `.pdb` extension indicates that these files are in Protein Data Bank format, a simple text format that specifies the type and position of each atom in the molecule.
uk: Тепер, коли ми знаємо декілька основних команд, ми можемо нарешті розглянути найпотужнішу можливість терміналу: легкість, з якою він дозволяє нам комбінувати програми, що існують, новими способами. Ми почнемо з каталогу `shell-lesson-data/exercise-data/proteins`, який містить шість файлів, що описують деякі прості органічні молекули. Розширення `.pdb` вказує на те, що ці файли у форматі Protein Data Bank, простому текстовому форматі, який визначає тип і положення кожного атома в молекулі.

source: Let's run an example command:
uk: Запустимо приклад команди:

source: `wc` is the 'word count' command: it counts the number of lines, words, and characters in files (from left to right, in that order).
uk: `wc` - команда 'порахуй слова' (англ. 'word count'): вона підраховує кількість рядків, слів і символів у файлах (зліва направо, у такому порядку).

source: If we run the command `wc *.pdb`, the `*` in `*.pdb` matches zero or more characters, so the shell turns `*.pdb` into a list of all `.pdb` files in the current directory:
uk: Якщо ми виконаємо команду `wc *.pdb`, то `*` у `*.pdb` збігається з нулем або більшою кількістю символів, тож термінал перетворить `*.pdb` на перелік усіх `.pdb`-файлів у поточному каталозі:

source: Note that `wc *.pdb` also shows the total number of all lines in the last line of the output.
uk: Зверніть увагу, що `wc *.pdb` також показує загальну кількість усіх рядків в останньому рядку виводу.

source: If we run `wc -l` instead of just `wc`, the output shows only the number of lines per file:
uk: Якщо ми виконаємо `wc -l` замість просто `wc`, у виводі буде показано лише кількість рядків у файлі:

source: The `-m` and `-w` options can also be used with the `wc` command, to show only the number of characters or the number of words in the files.
uk: Параметри `-m` і `-w` також можна використовувати з командою `wc`, щоб показати тільки кількість символів або тільки кількість слів у файлах.

source: > ## Why Isn't It Doing Anything?
uk: > ## Чому воно нічого не робить?

source: > > What happens if a command is supposed to process a file, but we > don't give it a filename? For example, what if we type: > > ~~~ > $ wc -l > ~~~ > {: .language-bash} > > but don't type `*.pdb` (or anything else) after the command? > Since it doesn't have any filenames, `wc` assumes it is supposed to > process input given at the command prompt, so it just sits there and waits for us to give > it some data interactively. From the outside, though, all we see is it > sitting there: the command doesn't appear to do anything. > > If you make this kind of mistake, you can escape out of this state by holding down > the control key (<kbd>Ctrl</kbd>) and typing the letter <kbd>C</kbd> once and > letting go of the <kbd>Ctrl</kbd> key. > <kbd>Ctrl</kbd>+<kbd>C</kbd>
uk: > > Що станеться, якщо команда має обробити файл, але ми > не вкажемо імені файлу? Наприклад, що буде, якщо ми наберемо: > > ~~~ > $ wc -l > ~~~ > {: .language-bash} > > але не будемо вводити `*.pdb` (або щось інше) після команди? > Оскільки команда не має жодних назв файлів, `wc` вважає, що вона повинна > обробляти дані, введені у командному рядку, тож вона просто сидить і чекає, поки ми надамо їй > інтерактивно якісь дані. Ззовні, однак, все, що ми бачимо, це те, що вона, > здається, нічого не робить. > > Якщо ви припустилися такої помилки, ви можете вийти з цього стану, утримуючи > клавішу control (<kbd>Ctrl</kbd>), один раз натиснувши клавішу <kbd>C</kbd>, > відпустивши після цього клавішу <kbd>Ctrl</kbd>. > <kbd>Ctrl</kbd>+<kbd>C</kbd>

source: ## Capturing output from commands
uk: ## Перехоплення виводу з команд

source: Which of these files contains the fewest lines? It's an easy question to answer when there are only six files, but what if there were 6000? Our first step toward a solution is to run the command:
uk: Який з цих файлів містить найменше рядків? На це питання легко відповісти, коли файлів всього шість, але що, якщо їх 6000? Наш перший крок до пошуку рішеня - це запуск команди:

source: The greater than symbol, `>`, tells the shell to **redirect** the command's output to a file instead of printing it to the screen. (This is why there is no screen output: everything that `wc` would have printed has gone into the file `lengths.txt` instead.) The shell will create the file if it doesn't exist. If the file exists, it will be silently overwritten, which may lead to data loss and thus requires some caution. `ls lengths.txt` confirms that the file exists:
uk: Символ 'більше ніж', `>`, вказує терміналу **перенаправити** вивід команди до файла замість виведення його на екран. (Саме тому виведення на екран не відбувається: все, що мала вивести команда `wc`, було збережено у файлі `lengths.txt` замість цього). Термінал створить файл, якщо його не існує. Якщо файл існує, його буде буде перезаписано без будь-яких повідомлень, що може призвести до втрати даних, а отже, вимагає певної обережності. Файл `ls lengths.txt` підтверджує, що файл існує:

source: We can now send the content of `lengths.txt` to the screen using `cat lengths.txt`. The `cat` command gets its name from 'concatenate' i.e. join together, and it prints the contents of files one after another. There's only one file in this case, so `cat` just shows us what it contains:
uk: Тепер ми можемо вивести вміст файлу `lengths.txt` на екран за допомогою команди `cat lengths.txt`. Команда `cat` отримала свою назву від слова 'concatenate', тобто об'єднувати, і вона виводить вміст файлів один за одним. У цьому випадку є лише один файл, тому `cat` просто відображає нам його вміст:

source: > ## Output Page by Page
uk: > ## Виведення сторінка за сторінкою

source: > > We'll continue to use `cat` in this lesson, for convenience and consistency, > but it has the disadvantage that it always dumps the whole file onto your screen. > More useful in practice is the command `less`, > which you use with `less lengths.txt`. > This displays a screenful of the file, and then stops. > You can go forward one screenful by pressing the spacebar, > or back one by pressing `b`. Press `q` to quit.
uk: > > У цьому уроці ми продовжимо використовувати команду `cat` для зручності та послідовності, > але вона має той недолік, що завжди виводить весь файл на екран. > Більш корисною на практиці є команда `less`, > яку ви використовуєте за зразком `less lengths.txt`. > Вона виводить один екран вмісту файлу, а потім зупиняється. > Ви можете пересунутися на один екран вперед, натиснувши клавішу пробіл, > або на один екран назад натисканням клавіші `b`. Щоб вийти, натисніть `q`.

source: ## Filtering output
uk: ## Фільтрування виводу

source: Next we'll use the `sort` command to sort the contents of the `lengths.txt` file. But first we'll use an exercise to learn a little about the sort command:
uk: Далі ми скористаємося командою `sort` для сортування вмісту файлу `lengths.txt`. Але спочатку ми виконаємо вправу, щоб дізнатися більше про команду sort:

source: > ## What Does `sort -n` Do?
uk: > ## Що робить `sort -n`?

source: > > The file `shell-lesson-data/exercise-data/numbers.txt` contains the following lines: > > ~~~ > 10 > 2 > 19 > 22 > 6 > ~~~
uk: > > Файл `shell-lesson-data/exercise-data/numbers.txt` містить наступні рядки: > > ~~~ > 10 > 2 > 19 > 22 > 6 > ~~~

source: > > If we run `sort` on this file, the output is: > > ~~~ > 10 > 19 > 2 > 22 > 6 > ~~~
uk: > > Якщо ми виконаємо команду `sort` для цього файлу, то отримаємо наступне: > > ~~~ > 10 > 19 > 2 > 22 > 6 > ~~~

source: > > If we run `sort -n` on the same file, we get this instead: > > ~~~ > 2 > 6 > 10 > 19 > 22 > ~~~
uk: > > Якщо ми виконаємо команду `sort -n` для того ж файлу, то отримаємо наступне: > > ~~~ > 2 > 6 > 10 > 19 > 22 > ~~~

source: > > Explain why `-n` has this effect. > > > ## Solution > > The `-n` option specifies a numerical rather than an alphanumerical sort.
uk: > > Поясніть, чому `-n` має такий ефект. > > > ## Розв'язання > > Опція `-n` задає числове, а не алфавітно-цифрове сортування.

source: We will also use the `-n` option to specify that the sort is numerical instead of alphanumerical. This does *not* change the file; instead, it sends the sorted result to the screen:
uk: Ми також будемо використовувати опцію `-n`, щоб вказати, що сортування буде числовим, а не алфавітно-цифровим. Це *не* змінить файл; натомість відсортований результат буде виведено на екран:

source: We can put the sorted list of lines in another temporary file called `sorted-lengths.txt` by putting `> sorted-lengths.txt` after the command, just as we used `> lengths.txt` to put the output of `wc` into `lengths.txt`. Once we've done that, we can run another command called `head` to get the first few lines in `sorted-lengths.txt`:
uk: Ми можемо помістити відсортований список рядків в інший тимчасовий файл, який називається `sorted-lengths.txt`. додавши `> sorted-lengths.txt` після команди, так само, як ми використовували `> lengths.txt`, щоб помістити виведення `wc` у `lengths.txt`. Після того, як ми це зробили, ми можемо виконати іншу команду, що має назву `head`, щоб отримати перші кілька рядків у `sorted-lengths.txt`:

source: Using `-n 1` with `head` tells it that we only want the first line of the file; `-n 20` would get the first 20, and so on. Since `sorted-lengths.txt` contains the lengths of our files ordered from least to greatest, the output of `head` must be the file with the fewest lines.
uk: Використання `-n 1` з `head` говорить команді, що нам потрібен лише перший рядок файлу; `-n 20` отримає перші 20, і так далі. Оскільки файл `sorted-lengths.txt` містить довжини наших файлів, впорядковані від найменшої до найбільшої, виведенням `head` має бути файл з найменшою кількістю рядків.

source: > ## Redirecting to the same file
uk: > ## Перенаправлення у той самий файл
