Repository: carpentries-i18n/i18n
Catalog: po/shell-novice.*.po
Languages: uk

source: The effect is to move the file from the directory it was in to the current working directory. `ls` now shows us that `thesis` is empty:
uk: Наслідком цього буде переміщення файла з каталогу, у якому він знаходився, до поточного робочого каталогу. Тепер `ls` показує нам, що `thesis` порожній:

source: Alternatively, we can confirm the file `quotes.txt` is no longer present in the `thesis` directory by explicitly trying to list it:
uk: Крім того, ми можемо переконатися, що файл `quotes.txt` більше не присутній у каталозі `thesis`, явно спробувавши показати інформацію про нього:

source: `ls` with a filename or directory as an argument only lists the requested file or directory. If the file given as the argument doesn't exist, the shell returns an error as we saw above. We can use this to see that `quotes.txt` is now present in our current directory:
uk: Команда `ls` з ім'ям файлу або каталогу в якості аргументу виводить лише список запитуваних файлів або каталогів. Якщо файл, вказаний як аргумент, не існує, термінал поверне помилку, як ми бачили вище. Ми можемо скористатися цим, щоб побачити, що файл `quotes.txt` знаходиться у нашому поточному каталозі:

source: > ## Moving Files to a new folder
uk: > ## Переміщення файлів до нової папки

source: > > After running the following commands, > Jamie realizes that she put the files `sucrose.dat` and `maltose.dat` into the wrong folder. > The files should have been placed in the `raw` folder. > > ~~~ > $ ls -F > analyzed/ raw/ > $ ls -F analyzed > fructose.dat glucose.dat maltose.dat sucrose.dat > $ cd analyzed > ~~~ > {: .language-bash} > > Fill in the blanks to move these files to the `raw/` folder > (i.e. the one she forgot to put them in) > > ~~~ > $ mv sucrose.dat maltose.dat ____/____ > ~~~ > {: .language-bash} > > ## Solution > > ``` > > $ mv sucrose.dat maltose.dat ../raw > > ``` > > {: .language-bash} > > Recall that `..` refers to the parent directory (i.e. one above the current directory) > > and that `.` refers to the current directory.
uk: > > Після виконання наступних команд > Джеймі зрозуміла, що поклала файли `sucrose.dat` та `maltose.dat` не до того каталогу. > Файли потрібно було покласти у каталог `raw`. > > ~~~ > $ ls -F > analyzed/ raw/ > $ ls -F analyzed > fructose.dat glucose.dat maltose.dat sucrose.dat > $ cd analyzed > ~~~ > {: .language-bash} > > Заповніть пропуски, щоб перемістити ці файли до теки `raw/`. > (тобто туди, куди вона забула їх покласти) > > ~~~ > $ mv sucrose.dat maltose.dat ____/____ > ~~~ > {: .language-bash} > > ## Рішення > > ``` > > $ mv sucrose.dat maltose.dat ../raw > > ``` > > {: .language-bash} > > Пам'ятайте, що `..` вказує на батьківський каталог (тобто на каталог, розташований вище поточного) > > і що `.` вказує на поточний каталог.

source: ## Copying files and directories
uk: ## Копіювання файлів і каталогів

source: The `cp` command works very much like `mv`, except it copies a file instead of moving it. We can check that it did the right thing using `ls` with two paths as arguments --- like most Unix commands, `ls` can be given multiple paths at once:
uk: Команда `cp` працює дуже схоже на команду `mv`, за винятком того, що вона копіює файл, а не переміщує його. Ми можемо перевірити правильність її роботи за допомогою `ls` з двома шляхами в якості аргументів --- як і більшості команд Unix, команді `ls` можна вказати одразу декілька шляхів:

source: We can also copy a directory and all its contents by using the [recursive](https://en.wikipedia.org/wiki/Recursion) option `-r`, e.g. to back up a directory:
uk: Ми також можемо скопіювати каталог і весь його вміст за допомогою [рекурсивної](https://uk.wikipedia.org/wiki/Рекурсія) опції `-r`, наприклад, для створення резервної копії каталогу:

source: We can check the result by listing the contents of both the `thesis` and `thesis_backup` directory:
uk: Ми можемо перевірити результат, переглянувши вміст каталогів `thesis` та `thesis_backup`:

source: > ## Renaming Files
uk: > ## Перейменування файлів

source: > > Suppose that you created a plain-text file in your current directory to contain a list of the > statistical tests you will need to do to analyze your data, and named it: `statstics.txt` > > After creating and saving this file you realize you misspelled the filename! You want to > correct the mistake, which of the following commands could you use to do so? > > 1. `cp statstics.txt statistics.txt` > 2. `mv statstics.txt statistics.txt` > 3. `mv statstics.txt .` > 4. `cp statstics.txt .` > > > ## Solution > > 1. No. While this would create a file with the correct name, > > the incorrectly named file still exists in the directory > > and would need to be deleted. > > 2. Yes, this would work to rename the file. > > 3. No, the period(.) indicates where to move the file, but does not provide a new file name; > > identical file names > > cannot be created. > > 4. No, the period(.) indicates where to copy the file, but does not provide a new file name; > > identical file names cannot be created.
uk: > > Припустімо, що ви створили у поточному каталозі файл простого тексту, який містить список статистичних тестів, які > вам знадобляться для аналізу ваших даних, і назвали його: `statstics.txt`. > > Після створення і збереження цього файлу ви зрозуміли, що неправильно написали назву файлу! Ви хочете > виправити помилку, яку з наведених нижче команд ви можете використати для цього? > > 1. `cp statstics.txt статистика.txt > 2. `mv statstics.txt статистика.txt > 3. `mv statstics.txt .` > 4. `cp statstics.txt .` > > > ## Розв'язок > > 1. Ні. Хоча це створить файл з правильною назвою, > > неправильно названий файл все одно існуватиме у каталозі, > > і його потрібно буде видалити. > > 2. Так, це допоможе перейменувати файл. > > 3. Ні, крапка (.) вказує, куди перемістити файл, але не надає нового імені файлу; > > однакові назви файлів > > не можуть бути створені. > > 4. Ні, крапка (.) вказує, куди скопіювати файл, але не надає нового імені файлу; > > не можна створювати однакові імена файлів.

source: > ## Moving and Copying
uk: > ## Переміщення та копіювання

source: > > What is the output of the closing `ls` command in the sequence shown below? > > ~~~ > $ pwd > ~~~ > {: .language-bash} > ~~~ > /Users/jamie/data > ~~~
uk: > > Що виводить остання команда `ls` у наведеній нижче послідовності? > > ~~~ > $ pwd > ~~~ > {: .language-bash} > ~~~ > /Users/jamie/data > ~~~

source: > > > 1. `proteins-saved.dat recombined` > 2. `recombined` > 3. `proteins.dat recombined` > 4. `proteins-saved.dat` > > > ## Solution > > We start in the `/Users/jamie/data` directory, and create a new folder called `recombined`. > > The second line moves (`mv`) the file `proteins.dat` to the new folder (`recombined`). > > The third line makes a copy of the file we just moved. > > The tricky part here is where the file was copied to. > > Recall that `..` means 'go up a level', so the copied file is now in `/Users/jamie`. > > Notice that `..` is interpreted with respect to the current working > > directory, **not** with respect to the location of the file being copied. > > So, the only thing that will show using ls (in `/Users/jamie/data`) is the recombined folder. > > > > 1. No, see explanation above. `proteins-saved.dat` is located at `/Users/jamie` > > 2. Yes > > 3. No, see explanation above. `proteins.dat` is located at `/Users/jamie/data/recombined` > > 4. No, see explanation above. `proteins-saved.dat` is located at `/Users/jamie`
uk: > > > 1. `proteins-saved.dat рекомбіновано > 2. `recombined` > 3. `proteins.dat recombined`. > 4. `proteins-saved.dat`. > > > ## Рішення > > Ми розпочинаємо в каталозі `/Users/jamie/data` і створюємо нову папку з назвою `recombined`. > > Другий рядок переміщує (`mv`) файл `proteins.dat` до нового каталогу (`recombined`). > > Третій рядок робить копію файлу, який ми щойно перемістили. > > Складність полягає у тому, куди саме було скопійовано файл. > > Нагадаємо, що `..` означає "піднятися на рівень вище", тому скопійований файл тепер знаходиться у `/Users/jamie`. > > Зверніть увагу, що `..` інтерпретується відносно поточного робочого > > каталогу, а **не** відносно розташування файла, який копіюється. > > Отже, єдине, що буде показано за допомогою команди `ls` (у `/Users/jamie/data`) - це каталог `recombined`. > > > > 1. Ні, див. пояснення вище. Каталог `proteins-saved.dat` розташовано у каталозі `/Users/jamie`. > > 2. Так > > 3. Ні, див. пояснення вище. Файл `proteins.dat` знаходиться в каталозі `/Users/jamie/data/recombined`. > > 4. Ні, див. пояснення вище. Файл `proteins-saved.dat` знаходиться в каталозі `/Users/jamie`.

source: ## Removing files and directories
uk: ## Видалення файлів і каталогів

source: Returning to the `shell-lesson-data/exercise-data/writing` directory, let's tidy up this directory by removing the `quotes.txt` file we created. The Unix command we'll use for this is `rm` (short for 'remove'):
uk: Повертаючись до каталогу `shell-lesson-data/exercise-data/writing`, давайте почистимо цей каталог, видаливши створений нами файл `quotes.txt`. Для цього ми скористаємося командою Unix `rm` (скорочення від англ. `remove` - видаляти):

source: We can confirm the file has gone using `ls`:
uk: Ми можемо підтвердити, що файл був видалений, за допомогою `ls`:

source: > ## Deleting Is Forever
uk: > ## Команда `ls` видаляє назавжди

source: > > The Unix shell doesn't have a trash bin that we can recover deleted > files from (though most graphical interfaces to Unix do). Instead, > when we delete files, they are unlinked from the file system so that > their storage space on disk can be recycled. Tools for finding and > recovering deleted files do exist, but there's no guarantee they'll > work in any particular situation, since the computer may recycle the > file's disk space right away.
uk: > > В терміналу Unix немає кошика, з якого можна було б відновити видалені > файли (хоча у більшості графічних інтерфейсів Unix він є). Замість цього > коли ми видаляємо файли, вони від'єднуються від файлової системи, щоб > їх місце на диску можна було використовувати повторно. Інструменти для пошуку та > відновлення видалених файлів існують, але немає жодних гарантій, що вони > працюватимуть у кожній конкретній ситуації, оскільки комп'ютер може повторно використати > місце на диску, яке займав файл, одразу ж.

source: > ## Using `rm` Safely
uk: > ## Безпечне використання `rm`

source: > > What happens when we execute `rm -i thesis_backup/quotations.txt`? > Why would we want this protection when using `rm`? > > > ## Solution > > ``` > > rm: remove regular file 'thesis_backup/quotations.txt'? y > > ``` > > {: .output} > > The `-i` option will prompt before (every) removal (use <kbd>Y</kbd> to confirm deletion > > or <kbd>N</kbd> to keep the file). > > The Unix shell doesn't have a trash bin, so all the files removed will disappear forever. > > By using the `-i` option, we have the chance to check that we are deleting only the files > > that we want to remove.
uk: > > Що відбувається, коли ми виконуємо `rm -i thesis_backup/quotations.txt`? > Навіщо нам потрібен цей захист при використанні `rm`? > > > ## Рішення > > ``` > > rm: видалити звичайний файл 'thesis_backup/quotations.txt'? y > > ``` > > {: .output} > > Параметр `-i` буде запитуватися перед (кожним) вилученням (використовуйте <kbd>Y</kbd> для підтвердження вилучення > > або <kbd>N</kbd>, щоб зберегти файл). > > У командному терміналі Unix немає кошика для сміття, тому всі вилучені файли зникнуть назавжди. > > За допомогою опції `-i` ми можемо перевірити, що видаляємо лише ті файли, > які ми хочемо видалити.

source: If we try to remove the `thesis` directory using `rm thesis`, we get an error message:
uk: Якщо ми спробуємо видалити каталог `thesis` за допомогою `rm thesis`, ми отримаємо повідомлення про помилку:

source: This happens because `rm` by default only works on files, not directories.
uk: Це відбувається тому, що команда `rm` за замовчуванням працює лише з файлами, а не з каталогами.

source: `rm` can remove a directory *and all its contents* if we use the recursive option `-r`, and it will do so *without any confirmation prompts*:
uk: Команда `rm` може видалити каталог *і весь його вміст*, якщо ми використаємо рекурсивний параметр `-r`, і вона зробить це *без жодних запитів на підтвердження*:

source: Given that there is no way to retrieve files deleted using the shell, `rm -r` *should be used with great caution* (you might consider adding the interactive option `rm -r -i`).
uk: Враховуючи, що немає можливості відновити файли, видалені за допомогою терміналу, `rm -r` *слід використовувати з великою обережністю*. (ви можете розглянути можливість додавання інтерактивного параметра `rm -r -i`).

source: ## Operations with multiple files and directories
uk: ## Операції з декількома файлами та каталогами

source: Oftentimes one needs to copy or move several files at once. This can be done by providing a list of individual filenames, or specifying a naming pattern using wildcards.
uk: Часто потрібно скопіювати або перемістити кілька файлів одночасно. Це можна зробити, надавши список імен окремих файлів, або вказати шаблон імен за допомогою підстановочних знаків.

source: > ## Copy with Multiple Filenames
uk: > ## Копіювання з кількома іменами файлів

source: > > For this exercise, you can test the commands in the `shell-lesson-data/exercise-data` directory. > > In the example below, what does `cp` do when given several filenames and a directory name? > > ~~~ > $ mkdir backup > $ cp creatures/minotaur.dat creatures/unicorn.dat backup/ > ~~~ > {: .language-bash} > > In the example below, what does `cp` do when given three or more file names? > > ~~~ > $ cd creatures > $ ls -F > ~~~ > {: .language-bash} > ~~~ > basilisk.dat minotaur.dat unicorn.dat > ~~~
uk: > > Для цієї вправи ви можете протестувати команди з каталогу `shell-lesson-data/exercise-data`. > > Що робить команда `cp` у наведеному нижче прикладі, коли їй задано декілька імен файлів і назву каталогу? > > ~~~ > $ mkdir backup > $ cp creatures/minotaur.dat creatures/unicorn.dat backup/ > ~~~ > {: .language-bash} > > Що робить команда `cp` у наведеному нижче прикладі, коли їй задано три або більше імен файлів? > > ~~~ > $ cd creatures > $ ls -F > ~~~ > {: .language-bash} > ~~~ > basilisk.dat minotaur.dat unicorn.dat > ~~~

source: > > > ## Solution > > If given more than one file name followed by a directory name > > (i.e. the destination directory must be the last argument), > > `cp` copies the files to the named directory. > > > > If given three file names, `cp` throws an error such as the one below, > > because it is expecting a directory name as the last argument. > > > > ``` > > cp: target 'basilisk.dat' is not a directory > > ``` > > {: .error}
uk: > > > ## Розв'язання > Якщо задано більше одного імені файлу, за яким наведене ім'я каталогу, > > (тобто, каталог призначення має бути останнім аргументом), > > команда `cp` копіює файли до вказаного каталогу. > > > > Якщо задано три імені файлів, `cp` видасть помилку, подібну до наведеної нижче, > > оскільки очікує отримати ім'я каталогу як останній аргумент. > > > > ``` > > cp: target 'basilisk.dat' не є каталогом > > ``` > > {: .error}

source: ### Using wildcards for accessing multiple files at once
uk: ### Використання підстановочних знаків для доступу до кількох файлів одночасно

source: > ## Wildcards
uk: > ## Підстановочні символи

source: > > `*` is a **wildcard**, which matches zero or more characters. > Let's consider the `shell-lesson-data/exercise-data/proteins` directory: > `*.pdb` matches `ethane.pdb`, `propane.pdb`, and every > file that ends with '.pdb'. On the other hand, `p*.pdb` only matches > `pentane.pdb` and `propane.pdb`, because the 'p' at the front only > matches filenames that begin with the letter 'p'. > > `?` is also a wildcard, but it matches exactly one character. > So `?ethane.pdb` would match `methane.pdb` whereas > `*ethane.pdb` matches both `ethane.pdb`, and `methane.pdb`. > > Wildcards can be used in combination with each other > e.g. `???ane.pdb` matches three characters followed by `ane.pdb`, > giving `cubane.pdb ethane.pdb octane.pdb`. > > When the shell sees a wildcard, it expands the wildcard to create a > list of matching filenames *before* running the command that was > asked for. As an exception, if a wildcard expression does not match > any file, Bash will pass the expression as an argument to the command > as it is. For example, typing `ls *.pdf` in the `proteins` directory > (which contains only files with names ending with `.pdb`) results in > an error message that there is no file called `*.pdf`. > However, generally commands like `wc` and `ls` see the lists of > file names matching these expressions, but not the wildcards > themselves. It is the shell, not the other programs, that deals with > expanding wildcards.
uk: > > Символ `*` - це **підстановочний символ**, який відповідає нулю або більшій кількості будь-яких символів. > Розглянемо каталог `shell-lesson-data/exercise-data/proteins`: > `*.pdb` відповідає `ethane.pdb`, `propane.pdb` і кожному > файлу, який закінчується на '.pdb'. З іншого боку, `p*.pdb` співпадає лише з > `pentane.pdb` і `propane.pdb`, оскільки "p" спереду лише > співпадає з назвами файлів, які починаються з літери 'p'. > > Символ `?` також є подстановочним символом, але він відповідає рівно одному будь-якому символу. > Отже, `?ethane.pdb` буде відповідати `methane.pdb`, тоді як > `*ethane.pdb` відповідає як `ethane.pdb`, так і `methane.pdb`. > > Підставні символи можна використовувати у поєднанні один з одним > наприклад, `???ane.pdb` відповідає трьом символам, за якими слідує `ane.pdb`, > що дає `cubane.pdb ethane.pdb octane.pdb`. > > Коли термінал бачить підстановочний символ, він розгортає його для створення > списку відповідних імен файлів *до* запуску команди, яку. > було введено. Як виняток, якщо вираз підстановки не відповідає > жодному файлу, Bash передасть вираз як аргумент до команди, > як є. Наприклад, введення `ls *.pdf` у каталозі `proteins` > (який містить лише файли з іменами, що закінчуються на `.pdb`) призведе до > повідомлення про те, що не існує файла з назвою `*.pdf`. > Втім, зазвичай команди на кшталт `wc` і `ls` показують списки > імен файлів, які відповідають цим виразам, > але не самим підстановочним символам. > Саме термінал, а не інші програми, виконує > розкриття підстановочних символів.

source: > ## List filenames matching a pattern
uk: > ## Отримання переліку імен файлів, що відповідають шаблону

source: > > When run in the `proteins` directory, which `ls` command(s) will > produce this output? > > `ethane.pdb methane.pdb` > > 1. `ls *t*ane.pdb` > 2. `ls *t?ne.*` > 3. `ls *t??ne.pdb` > 4. `ls ethane.*` > > > ## Solution >> The solution is `3.` >> >> `1.` shows all files whose names contain zero or more characters (`*`) >> followed by the letter `t`, >> then zero or more characters (`*`) followed by `ane.pdb`. >> This gives `ethane.pdb methane.pdb octane.pdb pentane.pdb`. >> >> `2.` shows all files whose names start with zero or more characters (`*`) followed by >> the letter `t`, >> then a single character (`?`), then `ne.` followed by zero or more characters (`*`). >> This will give us `octane.pdb` and `pentane.pdb` but doesn't match anything >> which ends in `thane.pdb`. >> >> `3.` fixes the problems of option 2 by matching two characters (`??`) between `t` and `ne`. >> This is the solution. >> >> `4.` only shows files starting with `ethane.`.
uk: > > При виконанні в каталозі `proteins`, яка з команд `ls` видасть > наступний результат? > > `ethane.pdb methane.pdb` > > 1. `ls *t*ane.pdb` > 2. `ls *t?ne.*` > 3. `ls *t??ne.pdb` > 4. `ls ethane.*` > > Розв'язок >> Розв'язком є `3`. >> >> `1.` показує всі файли, назви яких містять нуль або більше символів (`*`) >> далі йде літера `t`, >> потім нуль або більше символів (`*`) і далі `ane.pdb`. >> Це дасть `ethane.pdb methane.pdb octane.pdb pentane.pdb`. >> >> `2.` показує всі файли, назви яких починаються з нуля або більше символів (`*`), за якими йде >> літера `t`, >> потім один будь-який символ (`?`), потім `ne.` і далі нуль або більше символів (`*`). >> Це дасть нам `octane.pdb` і `pentane.pdb`, але не збігається ні з чим, >> що закінчується на `thane.pdb`. >> >> `3.` виправляє проблеми варіанта 2, зіставляючи два символи (`??`) між `t` і `ne`. >> Це і є рішення. >> >> `4.` показує лише файли, що починаються з `ethane.`.

source: > ## More on Wildcards
uk: > ## Більше про підстановочні символи
