Repository: carpentries-i18n/i18n
Catalog: po/shell-novice.*.po
Languages: uk

source: We know that our current working directory `/Users/nelle` is stored inside `/Users` because `/Users` is the first part of its name. Similarly, we know that `/Users` is stored inside the root directory `/` because its name begins with `/`.
uk: Ми знаємо, що наш поточний робочий каталог `/Users/nelle` зберігається всередині каталогу `/Users`, тому що `/Users` є першою частиною його імені. Відповідно, ми знаємо, що каталог `/Users` зберігається всередині кореневої директорії `/`, бо його ім'я розпочинається з `/`.

source: > ## Slashes
uk: > ## Символи скісної риски

source: > > Notice that there are two meanings for the `/` character. > When it appears at the front of a file or directory name, > it refers to the root directory. When it appears *inside* a path, > it's just a separator.
uk: > > Зверніть увагу, що символ `/` має два значення. > Коли він з’являється на початку назви файлу чи каталогу, > це посилання на кореневу директорію. Коли він використовується *всередині* шляху, > це лише роздільник.

source: Underneath `/Users`, we find one directory for each user with an account on Nelle's machine, her colleagues *imhotep* and *larry*.
uk: Під `/Users` ми знайдемо по одній директорії для кожного користувача на машині Неллі: її колег *imhotep* та *larry*.

source: ![Like other directories, home directories are sub-directories underneath "/Users" like "/Users/imhotep", "/Users/larry" or "/Users/nelle"](../fig/home-directories.svg)
uk: ![Як і інші каталоги, домашні каталоги є підкаталогами "/Users", наприклад "/Users/imhotep", "/Users/larry" або "/Users/nelle"](../fig/home-directories.svg)

source: The user *imhotep*'s files are stored in `/Users/imhotep`, user *larry*'s in `/Users/larry`, and Nelle's in `/Users/nelle`. Nelle is the user in our examples here, therefore we get `/Users/nelle` as our home directory. Typically, when you open a new command prompt, you will be in your home directory to start.
uk: Файли користувача *imhotep* зберігаються в директорії `/Users/imhotep`, користувача *larry* - в `/Users/larry`, і Неллі - в `/Users/nelle`. Оскільки саме Неллі є користувачем у наших прикладах, тому ми отримуємо `/Users/nelle` як наш домашній каталог. Як правило, коли ви відкриваєте новий командний рядок, ви опиняєтесь в вашому домашньому каталозі.

source: Now let's learn the command that will let us see the contents of our own filesystem. We can see what's in our home directory by running `ls`:
uk: Тепер давайте вивчимо команду, яка дозволить нам бачити вміст нашої власної файлової системи. Ми можемо побачити, що знаходиться в нашому домашньому каталозі, запустивши `ls`:

source: (Again, your results may be slightly different depending on your operating system and how you have customized your filesystem.)
uk: (Знову ж таки, ваші результати можуть дещо відрізнятися залежно від вашої операційної системи та того, як ви налаштували свою файлову систему.)

source: `ls` prints the names of the files and directories in the current directory. We can make its output more comprehensible by using the `-F` **option** which tells `ls` to classify the output by adding a marker to file and directory names to indicate what they are: - a trailing `/` indicates that this is a directory - `@` indicates a link - `*` indicates an executable
uk: `ls` друкує назви файлів і каталогів у поточному каталозі. Ми можемо зробити його вивід більш зрозумілим, використовуючи **опцію** `-F` який повідомляє `ls` про необхідність класифікації виводу шляхом додавання маркера до імен файлів і каталогів, щоб вказати, що вони собою представляють: - символ `/` наприкінці назви вказує на те, що це каталог - `@` вказує на посилання - `*` вказує на виконуваний файл

source: Depending on your shell's default settings, the shell might also use colors to indicate whether each entry is a file or directory.
uk: Залежно від налаштувань терміналу за замовчуванням, в терміналі також можуть бути використані кольори, щоб вказати, чи є кожен елемент файлом або каталогом.

source: Here, we can see that our home directory contains only **sub-directories**. Any names in our output that don't have a classification symbol are plain old **files**.
uk: В наведеному прикладі ми бачимо, що наш домашній каталог містить лише **підкаталоги**. Будь-які імена в наших результатах, які не мають символу класифікації відповідають звичайним старим **файлам**.

source: > ## Clearing your terminal
uk: > ## Очищення терміналу

source: > > If your screen gets too cluttered, you can clear your terminal using the > `clear` command. You can still access previous commands using <kbd>↑</kbd> > and <kbd>↓</kbd> to move line-by-line, or by scrolling in your terminal.
uk: > > Якщо екран стає занадто захаращеним, ви можете очистити термінал за допомогою > команди `clear`. Ви все ще можете отримати доступ до попередніх команд за допомогою клавіш <kbd>↑</kbd> > та <kbd>↓</kbd> щоб переміщатися рядок за рядком, або за допомогою прокрутки у вашому терміналі.

source: ### Getting help
uk: ### Отримання допомоги

source: `ls` has lots of other **options**. There are two common ways to find out how to use a command and what options it accepts --- **depending on your environment, you might find that only one of these ways works:**
uk: У `ls` є багато інших **опцій**. Існує два поширених способи дізнатися, як використовувати команду і які параметри вона приймає --- **залежно від вашого середовища, ви можете виявити, що працює лише один із цих способів:**.

source: 1. We can pass a `--help` option to the command (available on Linux and Git Bash), such as:
uk: 1. Ми можемо передати команді опцію `--help` (доступну в Linux і Git Bash), наприклад:

source: 2. We can read its manual with `man` (available on Linux and macOS), such as:
uk: 2. Ми можемо прочитати інструкцію до використання команди за допомогою `man` (доступно на Linux і macOS), наприклад:

source: We'll describe both ways next.
uk: Далі ми опишемо обидва способи.

source: #### The `--help` option
uk: #### Опція `--help'

source: Most bash commands and programs that people have written to be run from within bash, support a `--help` option that displays more information on how to use the command or program.
uk: Більшість команд bash і програм, які люди написали для того, щоб їх можна було запускати з bash, підтримують опцію `--help`, яка виводить додаткову інформацію про те, як користуватися відповідною командою або програмою.

source: ~~~ Usage: ls [OPTION]... [FILE]... List information about the FILEs (the current directory by default). Sort entries alphabetically if neither -cftuvSUX nor --sort is specified. Mandatory arguments to long options are mandatory for short options, too. -a, --all do not ignore entries starting with . -A, --almost-all do not list implied . and .. --author with -l, print the author of each file -b, --escape print C-style escapes for nongraphic characters --block-size=SIZE scale sizes by SIZE before printing them; e.g., '--block-size=M' prints sizes in units of 1,048,576 bytes; see SIZE format below -B, --ignore-backups do not list implied entries ending with ~ -c with -lt: sort by, and show, ctime (time of last modification of file status information); with -l: show ctime and sort by name; otherwise: sort by ctime, newest first -C list entries by columns --color[=WHEN] colorize the output; WHEN can be 'always' (default if omitted), 'auto', or 'never'; more info below -d, --directory list directories themselves, not their contents -D, --dired generate output designed for Emacs' dired mode -f do not sort, enable -aU, disable -ls --color -F, --classify append indicator (one of */=>@|) to entries ... ... ... ~~~
uk: ~~~ Використання: ls [ПАРАМЕТР]... [ФАЙЛ]... Виводить дані щодо ФАЙЛів (типово у поточному каталозі). Впорядковує у алфавітному порядку, якщо не вказано ні --sort, ні один з параметрів -cftuSUX. Обов'язкові аргументи для довгих форм запису параметрів є обов'язковими і для ск орочених форм. -a, --all не ігнорувати записи, що починаються з . A, --almost-all не виводити неявні . і .. --author разом з -l, виводити автора кожного файла -b, --escape виводити вісімкові керівні послідовності замість неграфічних знаків --block-size=РОЗМІР якщо вкзаано -l, використовувати блоки розміром РОЗМІР. Наприклад, «--block-size=M». Формат РОЗМІРу наведено нижче. -B, --ignore-backups не виводити файли, що закінчуються на ~ -c з -lt: сортувати за часом зміни; з -l: виводити час зміни та впорядкувати за назвою, у іншому випадку впорядкувати за часом зміни, найновіші — перші -C виводити список у декілька колонок --color[=КОЛИ] вказує, чи позначати типи файлів кольором. КОЛИ може бути «never», «auto» або «always» (типовий, якщо не вказано) -d, --directory виводити назви каталогів, а не їх зміст, а також не слідувати за символічним посиланням -D, --dired створити виведені дані у режимі Emacs dired -f не сортувати, вмикає -aU, вимикає -lst -F, --classify додавати до назви індикатор (один з */=>@|)... ... ... ~~~

source: > ## Unsupported command-line options
uk: > ## Непідтримувані параметри командного рядка

source: > If you try to use an option that is not supported, `ls` and other commands
uk: > Якщо ви спробуєте використати параметр, який не підтримується, `ls` та інші команди

source: > will usually print an error message similar to:
uk: > зазвичай виводитимуть повідомлення про помилку, схоже на:

source: #### The `man` command
uk: #### Команда `man`

source: The other way to learn about `ls` is to type ~~~ $ man ls ~~~ {: .language-bash}
uk: Інший спосіб дізнатися про `ls` -- це ввести ~~~ $ man ls ~~~ {: .language-bash}

source: This command will turn your terminal into a page with a description of the `ls` command and its options.
uk: Ця команда перетворить ваш термінал на сторінку з описом команди `ls` та її параметрів.

source: To navigate through the `man` pages, you may use <kbd>↑</kbd> and <kbd>↓</kbd> to move line-by-line, or try <kbd>B</kbd> and <kbd>Spacebar</kbd> to skip up and down by a full page. To search for a character or word in the `man` pages, use <kbd>/</kbd> followed by the character or word you are searching for. Sometimes a search will result in multiple hits. If so, you can move between hits using <kbd>N</kbd> (for moving forward) and <kbd>Shift</kbd>+<kbd>N</kbd> (for moving backward).
uk: Для навігації по сторінках `man`, ви можете використовувати <kbd>↑</kbd> і <kbd>↓</kbd> для переміщення рядок за рядком, або клавіші <kbd>B</kbd> та <kbd>Пробіл</kbd> для переходу вгору і вниз на цілу сторінку. Для пошуку символу або слова на сторінках `man`, використовуйте клавішу <kbd>/</kbd>, за фкою введіть символ або слово, яке ви шукаєте. Іноді пошук може призвести до кількох результатів. У такому випадку ви можете переміщатися між результатами за допомогою клавіш <kbd>N</kbd> (для переміщення вперед) та <kbd>Shift</kbd>+<kbd>N</kbd> (для переходу назад).

source: To **quit** the `man` pages, press <kbd>Q</kbd>.
uk: Для **виходу** зі сторінок `man` натисніть <kbd>Q</kbd>.

source: > ## Manual pages on the web
uk: ## Сторінки з інструкціями в Інтернеті

source: > > Of course, there is a third way to access help for commands: > searching the internet via your web browser. > When using internet search, including the phrase `unix man page` in your search > query will help to find relevant results. > > GNU provides links to its > [manuals](http://www.gnu.org/manual/manual.html) including the > [core GNU utilities](http://www.gnu.org/software/coreutils/manual/coreutils.html), > which covers many commands introduced within this lesson.
uk: > > Звісно, є й третій спосіб отримати доступ до довідки до команд: > пошук в інтернеті за допомогою веб-браузера. > Якщо ви скористаєтеся пошуком у Інтернеті, додання до запиту фрази `unix man page` > дозволить отримати більш відповідні результати. > GNU надає посилання на свої > [посібники].(http://www.gnu.org/manual/manual.html), в тому числі на > [основні утиліти GNU](http://www.gnu.org/software/coreutils/manual/coreutils.html), > які охоплюють багато команд, представлених у цьому уроці.

source: > ## Exploring More `ls` Flags
uk: > ## Вивчення більше `ls` опцій

source: > > You can also use two options at the same time. What does the command `ls` do when used > with the `-l` option? What about if you use both the `-l` and the `-h` option? > > Some of its output is about properties that we do not cover in this lesson (such > as file permissions and ownership), but the rest should be useful > nevertheless. > > > ## Solution > > The `-l` option makes `ls` use a **l**ong listing format, showing not only > > the file/directory names but also additional information, such as the file size > > and the time of its last modification. If you use both the `-h` option and the `-l` option, > > this makes the file size '**h**uman readable', i.e. displaying something like `5.3K` > > instead of `5369`.
uk: > > Ви також можете використовувати декілька опцій одночасно. Що робить команда `ls` при використанні > з опцією `-l`? А якщо ви використовуєте і `-l`, і `-h`? > > Деякі з результатів виконання команди стосуються властивостей, які ми не розглядаємо у цьому уроці (наприклад, > права доступу до файлів і права власності), але решта має бути корисною > тим не менш. > > > ## Розв'язання > > Опція `-l` змушує `ls` використовувати довгий (англ. **l**ong) формат лістингу, показуючи не лише > > назви файлів/директорій, але й додаткову інформацію, таку як розмір файлу > > і час його останньої модифікації. Якщо ви використовуєте як `-h`, так і `-l`, > > це зробить виведення розміру файлу у більш зрозумілому людині вигляді ("**h**uman readable"), тобто покаже щось на кшталт `5.3K`. > > замість `5369`.

source: > ## Listing in Reverse Chronological Order
uk: > ## Виведення у зворотному хронологічному порядку

source: > > By default, `ls` lists the contents of a directory in alphabetical > order by name. The command `ls -t` lists items by time of last > change instead of alphabetically. The command `ls -r` lists the > contents of a directory in reverse order. > Which file is displayed last when you combine the `-t` and `-r` options? > Hint: You may need to use the `-l` option to see the > last changed dates. > > > ## Solution > > The most recently changed file is listed last when using `-rt`. This > > can be very useful for finding your most recent edits or checking to > > see if a new output file was written.
uk: > > За замовчуванням `ls` виводить вміст каталогу в алфавітному > порядку за іменами елементів. Команда `ls -t` перелічує елементи за часом останньої > зміни, а не за алфавітом. Команда `ls -r` виводить > вміст каталогу у зворотному порядку. > Який файл буде показано останнім при комбінації команд `-t` і `-r`? > Підказка: Вам може знадобитися скористатися опцією `-l`, щоб переглянути > дати останніх змін. > > > ## Рішення > > При використанні `-rt` останній змінений файл відображається останнім у списку. Це > > може бути дуже корисним для пошуку ваших останніх редагувань або перевірки > > чи було створено новий вихідний файл.

source: ### Exploring Other Directories
uk: ### Огляд інших каталогів

source: Not only can we use `ls` on the current working directory, but we can use it to list the contents of a different directory. Let's take a look at our `Desktop` directory by running `ls -F Desktop`, i.e., the command `ls` with the `-F` **option** and the [**argument**][Arguments] `Desktop`. The argument `Desktop` tells `ls` that we want a listing of something other than our current working directory:
uk: Ми можемо використовувати `ls` не лише у поточному робочому каталозі, але ми також можемо використовувати його для виведення вмісту іншого каталогу. Давайте подивимося на наш каталог `Desktop` (робочий стіл), виконавши `ls -F Desktop`, тобто, команду `ls` з `-F` **опцією** і [**аргументом**] [Arguments] `Desktop`. Аргумент `Desktop` повідомляє `ls`, що ми хочемо отримати список чогось іншого, ніж наш поточний робочий каталог:

source: Note that if a directory named `Desktop` does not exist in your current working directory, this command will return an error. Typically, a `Desktop` directory exists in your home directory, which we assume is the current working directory of your bash shell.
uk: Зауважте, що якщо у вашому поточному робочому каталозі не існує каталогу з назвою `Desktop`, ця команда поверне помилку. Зазвичай, каталог `Desktop` існує у вашому домашньому каталозі, який ми вважаємо поточним робочим каталогом вашого терміналу bash.

source: Your output should be a list of all the files and sub-directories in your Desktop directory, including the `shell-lesson-data` directory you downloaded at the [setup for this lesson]({{ page.root }}{% link setup.md %}). On many systems, the command line Desktop directory is the same as your GUI Desktop. Take a look at your Desktop to confirm that your output is accurate.
uk: На виході ви маєте отримати список усіх файлів і підкаталогів у вашому каталозі Desktop, включно з каталогом `shell-lesson-data`, який ви завантажили за посиланням під час [налаштування цього уроку]({{ page.root }}{% link setup.md %}). У багатьох системах каталог Desktop командного рядка збігається з каталогом Desktop вашого графічного інтерфейсу. Подивіться на свій робочий стіл, щоб переконатися у правильності виведених даних.

source: As you may now see, using a bash shell is strongly dependent on the idea that your files are organized in a hierarchical file system. Organizing things hierarchically in this way helps us keep track of our work: it's possible to put hundreds of files in our home directory, just as it's possible to pile hundreds of printed papers on our desk, but it's a self-defeating strategy.
uk: Як ви тепер бачите, використання терміналу bash сильно залежить від того, що ваші файли організовано в ієрархічній файловій системі. Ієрархічна організація речей таким чином допомагає нам відстежувати нашу роботу: у нашому домашньому каталозі можуть бути сотні файлів, так само, як можна скласти сотні роздрукованих паперів на столі, але це самогубна стратегія.

source: Now that we know the `shell-lesson-data` directory is located in our Desktop directory, we can do two things.
uk: Тепер, коли ми знаємо, що каталог `shell-lesson-data` розташовано у каталозі Desktop, ми можемо зробити дві речі.

source: First, we can look at its contents, using the same strategy as before, passing a directory name to `ls`:
uk: По-перше, ми можемо переглянути його вміст, використовуючи ту ж стратегію, що і раніше, передавши ім'я каталогу в `ls`:

source: Second, we can actually change our location to a different directory, so we are no longer located in our home directory.
uk: По-друге, ми можемо фактично змінити наше місцезнаходження на інший каталог, щоб ми більше не знаходилися в в нашому домашньому каталозі.

source: The command to change locations is `cd` followed by a directory name to change our working directory. `cd` stands for 'change directory', which is a bit misleading: the command doesn't change the directory; it changes the shell's current working directory. In other words it changes the shell's idea of what directory we are in. The `cd` command is akin to double-clicking a folder in a graphical interface to get into a folder.
uk: Команда зміни розташування в файловій системі має вигляд `cd`, за якою зазначається ім'я каталогу, на який треба змінити наш робочий каталог. `cd` означає 'змінити каталог' (англ. 'change directory'), що трохи вводить в оману: команда не змінює каталог; вона змінює поточний робочий каталог терміналу. Іншими словами, вона змінює уявлення терміналу про те, у якому каталозі ми перебуваємо. Команда `cd` подібна до подвійного кліку на каталозі у графічному інтерфейсі, щоб потрапити до нього.

source: Let's say we want to move into the `exercise-data` directory we saw above. We can use the following series of commands to get there:
uk: Припустимо, ми хочемо перейти до каталогу `exercise-data`, який ми бачили вище. Ми можемо скористатися наступною серією команд, щоб дістатися туди:

source: These commands will move us from our home directory into our Desktop directory, then into the `shell-lesson-data` directory, then into the `exercise-data` directory. You will notice that `cd` doesn't print anything. This is normal. Many shell commands will not output anything to the screen when successfully executed. But if we run `pwd` after it, we can see that we are now in `/Users/nelle/Desktop/shell-lesson-data/exercise-data`.
uk: Ці команди перемістять нас з домашнього каталогу до каталогу Desktop, потім до каталогу `shell-lesson-data`, а потім до каталогу `exercise-data`. Ви помітите, що команда `cd` нічого не виводить. Це нормально. Багато команд терміналу нічого не виводять на екран у разі успішного виконання. Але якщо ми виконаємо `pwd` після неї, то побачимо, що зараз ми знаходимося у `/Users/nelle/Desktop/shell-lesson-data/exercise-data`.

source: If we run `ls -F` without arguments now, it lists the contents of `/Users/nelle/Desktop/shell-lesson-data/exercise-data`, because that's where we now are:
uk: Якщо ми зараз виконаємо команду `ls -F` без аргументів, вона виведе вміст `/Users/nelle/Desktop/shell-lesson-data/exercise-data`, тому що саме там ми зараз знаходимося:

source: We now know how to go down the directory tree (i.e. how to go into a subdirectory), but how do we go up (i.e. how do we leave a directory and go into its parent directory)? We might try the following:
uk: Тепер ми знаємо, як спускатися вниз по дереву каталогів (тобто, як увійти до підкаталогу), але як піднятися вгору (тобто як вийти з каталогу і перейти до його батьківського каталогу)? Ми можемо спробувати наступне:

source: But we get an error! Why is this?
uk: Але ми отримуємо помилку! Чому?

source: With our methods so far, `cd` can only see sub-directories inside your current directory. There are different ways to see directories above your current location; we'll start with the simplest.
uk: За допомогою наших методів, використовуваних до цього, `cd` може бачити лише підкаталоги у вашому поточному каталозі. Існують різні способи перегляду каталогів над вашим поточним розташуванням; ми почнемо з найпростішого.

source: There is a shortcut in the shell to move up one directory level that looks like this:
uk: В терміналі є скорочення для переходу на один рівень каталогу вгору, який виглядає так:

source: `..` is a special directory name meaning "the directory containing this one", or more succinctly, the **parent** of the current directory. Sure enough, if we run `pwd` after running `cd ..`, we're back in `/Users/nelle/Desktop/shell-lesson-data`:
uk: `..` -- це спеціальне ім'я каталогу, що означає "каталог, що містить цей", або більш стисло, **батько** поточного каталогу. Звичайно, якщо ми запустимо `pwd` після виконання `cd ..`, ми знову у `/Users/nelle/Desktop/shell-lesson-data`:

source: The special directory `..` doesn't usually show up when we run `ls`. If we want to display it, we can add the `-a` option to `ls -F`:
uk: Спеціальний каталог `..` зазвичай не з'являється, коли ми запускаємо `ls`. Якщо ми хочемо відобразити його, ми можемо додати опцію `-a` до `ls -F`:
