Repository: carpentries-i18n/i18n
Catalog: po/shell-novice.*.po
Languages: uk

source: > > Also in the `shell-lesson-data/exercise-data/proteins` directory, > what would be the output of the following loop? > > ~~~ > for datafile in *.pdb > do > cat $datafile >> all.pdb > done > ~~~ > {: .language-bash} > > 1. All of the text from `cubane.pdb`, `ethane.pdb`, `methane.pdb`, `octane.pdb`, and > `pentane.pdb` would be concatenated and saved to a file called `all.pdb`. > 2. The text from `ethane.pdb` will be saved to a file called `all.pdb`. > 3. All of the text from `cubane.pdb`, `ethane.pdb`, `methane.pdb`, `octane.pdb`, `pentane.pdb` > and `propane.pdb` would be concatenated and saved to a file called `all.pdb`. > 4. All of the text from `cubane.pdb`, `ethane.pdb`, `methane.pdb`, `octane.pdb`, `pentane.pdb` > and `propane.pdb` would be printed to the screen and saved to a file called `all.pdb`. > > > ## Solution > > 3 is the correct answer. `>>` appends to a file, rather than overwriting it with the redirected > > output from a command. > > Given the output from the `cat` command has been redirected, nothing is printed to the screen.
uk: > > Також у каталозі `shell-lesson-data/exercise-data/proteins`, > що буде виведено у наступному циклі?> > ~~~ > for datafile in *.pdb > do > cat $datafile >> all.pdb > done > ~~~ > {: .language-bash} > > 1. Весь текст з файлів `cubane.pdb`, `ethane.pdb`, `methane.pdb`, `octane.pdb` та > `pentane.pdb` буде об'єднано і збережено у файлі з назвою `all.pdb`. > 2. Текст з файлу `ethane.pdb` буде збережено до файлу з назвою `all.pdb`. > 3. Весь текст з файлів `cubane.pdb`, `ethane.pdb`, `methane.pdb`, `octane.pdb`, `pentane.pdb` > та `propane.pdb` буде об'єднано та збережено у файл з назвою `all.pdb`. > 4. Весь текст з файлів `cubane.pdb`, `ethane.pdb`, `methane.pdb`, `octane.pdb`, `pentane.pdb` > і `propane.pdb` буде виведено на екран і збережено у файлі з назвою `all.pdb`. > > > ## Розв'язання > > 3 - правильна відповідь. Оператор `>>` додає вміст до файлу, а не перезаписує його перенаправленим > > виводом команди. > > Оскільки вивід команди `cat` було перенаправлено, на екран нічого не буде виведено.

source: Let's continue with our example in the `shell-lesson-data/exercise-data/creatures` directory. Here's a slightly more complicated loop:
uk: Давайте продовжимо наш приклад у каталозі `shell-lesson-data/exercise-data/creatures`. Тут цикл трохи складніший:

source: The shell starts by expanding `*.dat` to create the list of files it will process. The **loop body** then executes two commands for each of those files. The first command, `echo`, prints its command-line arguments to standard output. For example:
uk: Термінал розпочинає роботу з розгортання `*.dat` для створення списку файлів, які він буде обробляти. **Тіло циклу** виконує дві команди для кожного з цих файлів. Перша команда, `echo`, виводить аргументи командного рядка у стандартний вивід. Наприклад:

source: prints:
uk: виводить:

source: In this case, since the shell expands `$filename` to be the name of a file, `echo $filename` prints the name of the file. Note that we can't write this as:
uk: У цьому випадку, оскільки термінал розширює `$filename` до імені файлу, `echo $filename` виводить ім'я файлу. Зауважте, що ми не можемо написати це як:

source: because then the first time through the loop, when `$filename` expanded to `basilisk.dat`, the shell would try to run `basilisk.dat` as a program. Finally, the `head` and `tail` combination selects lines 81-100 from whatever file is being processed (assuming the file has at least 100 lines).
uk: тому що при першому проходженні через цикл, коли `$filename` розшириться до `basilisk.dat`, оболонка спробує запустити `basilisk.dat` як програму. Нарешті, комбінація `head` і `tail` виділить рядки 81-100 з будь-якого файлу, який обробляється (за умови, що у відповідному файлі є принаймні 100 рядків).

source: > ## Spaces in Names
uk: > ## Пробіли в іменах

source: > > Spaces are used to separate the elements of the list > that we are going to loop over. If one of those elements > contains a space character, we need to surround it with > quotes, and do the same thing to our loop variable. > Suppose our data files are named: > > ~~~ > red dragon.dat > purple unicorn.dat > ~~~
uk: > > Пробіли використовуються для відокремлення елементів списку > які ми будемо перебирати у циклі. Якщо один з цих елементів > містить пробіл, нам потрібно взяти його в > лапки і зробити те ж саме зі змінною циклу. > Припустимо, що наші файли даних мають імена: > > ~~~ > red dragon.dat > purple unicorn.dat > ~~~

source: > > To loop over these files, we would need to add double quotes like so: > > ~~~ > $ for filename in "red dragon.dat" "purple unicorn.dat" > > do > > head -n 100 "$filename" | tail -n 20 > > done > ~~~ > {: .language-bash} > > It is simpler to avoid using spaces (or other special characters) in filenames. > > The files above don't exist, so if we run the above code, the `head` command will be unable > to find them, however the error message returned will show the name of the files it is > expecting: > > ~~~ > head: cannot open ‘red dragon.dat’ for reading: No such file or directory > head: cannot open ‘purple unicorn.dat’ for reading: No such file or directory > ~~~
uk: > > Щоб виконати цикл над цими файлами, нам потрібно додати подвійні лапки, ось так: > > ~~~ > $ for filename in "red dragon.dat" "purple unicorn.dat" > > do > > head -n 100 "$filename" | tail -n 20 > > done > ~~~ > {: .language-bash} > > Простіше уникати використання пробілів (або інших спеціальних символів) у назвах файлів. > > Вищевказані файли не існують, тому якщо ми виконаємо вищенаведений код, команда `head` не зможе > знайти їх, однак у повідомленні про помилку буде показано назви цих файлів, > що очікувалися: > > ~~~ > head: cannot open ‘red dragon.dat’ for reading: No such file or directory > head: cannot open ‘purple unicorn.dat’ for reading: No such file or directory > ~~~

source: > > Try removing the quotes around `$filename` in the loop above to see the effect of the quote > marks on spaces. Note that we get a result from the loop command for unicorn.dat > when we run this code in the `creatures` directory: > > ~~~ > head: cannot open ‘red’ for reading: No such file or directory > head: cannot open ‘dragon.dat’ for reading: No such file or directory > head: cannot open ‘purple’ for reading: No such file or directory > CGGTACCGAA > AAGGGTCGCG > CAAGTGTTCC > ... > ~~~
uk: > > Спробуйте видалити лапки навколо `$filename` у наведеному вище циклі, щоб побачити ефект лапок > позначки на пробілах. Зверніть увагу, що ми отримуємо результат команди циклу для unicorn.dat > коли ми запускаємо цей код у каталозі `creatures`: > > ~~~ > head: cannot open ‘red’ for reading: No such file or directory > head: cannot open ‘dragon.dat’ for reading: No such file or directory > head: cannot open ‘purple’ for reading: No such file or directory > CGGTACCGAA > AAGGGTCGCG > CAAGTGTTCC > ... > ~~~

source: We would like to modify each of the files in `shell-lesson-data/exercise-data/creatures`, but also save a version of the original files, naming the copies `original-basilisk.dat` and `original-unicorn.dat`. We can't use:
uk: Ми б хотіли змінити кожен з файлів у `shell-lesson-data/exercise-data/creatures`, але також зберегти версію оригінальних файлів, назвавши копії `original-basilisk.dat` і `original-unicorn.dat`. Ми не можемо використовувати:

source: because that would expand to:
uk: тому що це буде розширено до:

source: This wouldn't back up our files, instead we get an error:
uk: Це не створить резервну копію наших файлів, натомість ми отримаємо помилку:

source: This problem arises when `cp` receives more than two inputs. When this happens, it expects the last input to be a directory where it can copy all the files it was passed. Since there is no directory named `original-*.dat` in the `creatures` directory we get an error.
uk: Ця проблема виникає, коли команда `cp` отримує більше двох входів. Коли це відбувається, вона очікує, що останнім вхідним параметром буде каталог, куди вона зможе скопіювати всі файли, які їй було передано. Оскільки у каталозі `creatures` немає каталогу з назвою `original-*.dat`, ми отримаємо помилку.

source: Instead, we can use a loop: ~~~ $ for filename in *.dat > do > cp $filename original-$filename > done ~~~ {: .language-bash}
uk: Замість цього ми можемо використати цикл: ~~~ $ for filename in *.dat > do > cp $filename original-$filename > done ~~~ {: .language-bash}

source: This loop runs the `cp` command once for each filename. The first time, when `$filename` expands to `basilisk.dat`, the shell executes:
uk: Цей цикл виконує команду `cp` один раз для кожного імені файлу. Перший раз, коли змінна `$filename` має значення до `basilisk.dat`, термінал виконає:

source: The second time, the command is:
uk: У другий раз команда наступна:

source: The third and last time, the command is:
uk: В третій, останній раз, команда буде такою:

source: Since the `cp` command does not normally produce any output, it's hard to check that the loop is doing the correct thing. However, we learned earlier how to print strings using `echo`, and we can modify the loop to use `echo` to print our commands without actually executing them. As such we can check what commands *would be* run in the unmodified loop.
uk: Оскільки команда `cp` зазвичай не виводить нічого, важко перевірити що цикл працює правильно. Однак раніше ми дізналися, як виводити рядки за допомогою `echo`, і ми можемо модифікувати цикл щоб використовувати `echo` для виведення наших команд без їхнього виконання. Таким чином, ми можемо перевірити, які команди виконувалися *би* у немодифікованому циклі.

source: The following diagram shows what happens when the modified loop is executed, and demonstrates how the judicious use of `echo` is a good debugging technique.
uk: Наступна діаграма показує, що відбувається при виконанні модифікованого циклу, і демонструє, як розумне використання `echo` є гарною технікою зневадження.

source: ![The for loop "for filename in *.dat; do echo cp $filename original-$filename; done" will successively assign the names of all "*.dat" files in your current directory to the variable "$filename" and then execute the command. With the files "basilisk.dat", "minotaur.dat" and "unicorn.dat" in the current directory the loop will successively call the echo command three times and print three lines: "cp basislisk.dat original-basilisk.dat", then "cp minotaur.dat original-minotaur.dat" and finally "cp unicorn.dat original-unicorn.dat"](../fig/shell_script_for_loop_flow_chart.svg)
uk: ![Цикл for "for filename in *.dat; do echo cp $filename original-$filename; done" послідовно присвоїть змінній "$filename" імена всіх "*.dat" файлів у вашому поточному каталозі змінній "$filename" та після цього виконає команду. Для файлів "basilisk.dat", "minotaur.dat" та "unicorn.dat" в поточному каталозі цикл тричі послідовно викличе команду echo і виведе три рядки: "cp basislisk.dat original-basilisk.dat", потім "cp minotaur.dat original-minotaur.dat" та нарешті "cp unicorn.dat original-unicorn.dat"](../fig/shell_script_for_loop_flow_chart.svg)

source: ## Nelle's Pipeline: Processing Files
uk: ## Конвеєр Неллі: Обробка файлів

source: Nelle is now ready to process her data files using `goostats.sh` --- a shell script written by her supervisor. This calculates some statistics from a protein sample file, and takes two arguments:
uk: Тепер Неллі готова обробити свої файли даних за допомогою `goostats.sh` --- скрипта терміналу, написаного її керівником. Він обчислює деякі статистичні дані з файлу зразка білка і приймає два аргументи:

source: 1. an input file (containing the raw data)
uk: 1. вхідний файл (що містить вихідні дані)

source: 2. an output file (to store the calculated statistics)
uk: 2. вихідний файл (для збереження розрахованої статистики)

source: Since she's still learning how to use the shell, she decides to build up the required commands in stages. Her first step is to make sure that she can select the right input files --- remember, these are ones whose names end in 'A' or 'B', rather than 'Z'. Starting from her home directory, Nelle types:
uk: Оскільки вона все ще вчиться користуватися терміналом, вона вирішує створювати необхідні команди поетапно. Першим кроком буде переконатися, що вона може вибирати правильні вхідні файли - запам'ятайте, це ті, назви яких закінчуються на 'A' або 'B', а не на 'Z'. Починаючи з домашнього каталогу, Неллі набирає:

source: Her next step is to decide what to call the files that the `goostats.sh` analysis program will create. Prefixing each input file's name with 'stats' seems simple, so she modifies her loop to do that:
uk: Наступним кроком буде вирішити як назвати файли, які створить програма аналізу `goostats.sh`. Додавання до імені кожного вхідного файлу префікса "stats" здається простим, тому вона модифікує свій цикл для цього:

source: She hasn't actually run `goostats.sh` yet, but now she's sure she can select the right files and generate the right output filenames.
uk: Насправді, вона ще не запускала `goostats.sh`, але тепер вона впевнена, що може вибрати правильні файли і згенерувати правильні назви вихідних файлів.

source: Typing in commands over and over again is becoming tedious, though, and Nelle is worried about making mistakes, so instead of re-entering her loop, she presses <kbd>↑</kbd>. In response, the shell redisplays the whole loop on one line (using semi-colons to separate the pieces):
uk: Введення команд знову і знову стає нудним, і Неллі хвилюється через можливі помилки, тож замість того, щоб перенабирати свій цикл, вона натискає <kbd>↑</kbd>. У відповідь оболонка відобразить весь цикл в одному рядку (використовуючи крапку з комою для розділення частин):

source: Using the left arrow key, Nelle backs up and changes the command `echo` to `bash goostats.sh`:
uk: За допомогою клавіші зі стрілкою ліворуч, Неллі створює резервну копію і змінює команду `echo` на `bash goostats.sh`:

source: When she presses <kbd>Enter</kbd>, the shell runs the modified command. However, nothing appears to happen --- there is no output. After a moment, Nelle realizes that since her script doesn't print anything to the screen any longer, she has no idea whether it is running, much less how quickly. She kills the running command by typing <kbd>Ctrl</kbd>+<kbd>C</kbd>, uses <kbd>↑</kbd> to repeat the command, and edits it to read:
uk: Коли вона натискає <kbd>Enter</kbd>, термінал виконає змінену команду. Однак, здається, нічого не відбувається - немає ніякого виводу. За мить Неллі розуміє, що оскільки її скрипт більше нічого не виводить на екран, вона не має жодного уявлення про те, чи виконується він, а тим паче, як швидко. Вона перериває команду виконання, набравши <kbd>Ctrl</kbd>+<kbd>C</kbd>, використовує <kbd>↑</kbd> для повтору команди, і редагує її, щоб читати:

source: > ## Beginning and End
uk: > ## Початок і кінець

source: > > We can move to the beginning of a line in the shell by typing <kbd>Ctrl</kbd>+<kbd>A</kbd> > and to the end using <kbd>Ctrl</kbd>+<kbd>E</kbd>.
uk: > > Перехід на початок рядка в оболонці здійснюється за допомогою комбінації клавіш <kbd>Ctrl</kbd>+<kbd>A</kbd> > і в кінець рядка - за допомогою <kbd>Ctrl</kbd>+<kbd>E</kbd>.

source: When she runs her program now, it produces one line of output every five seconds or so:
uk: Коли вона запускає свою програму зараз, програма виводить один рядок кожні п'ять секунд або близько того:

source: 1518 times 5 seconds, divided by 60, tells her that her script will take about two hours to run. As a final check, she opens another terminal window, goes into `north-pacific-gyre`, and uses `cat stats-NENE01729B.txt` to examine one of the output files. It looks good, so she decides to get some coffee and catch up on her reading.
uk: Значення 1518, помножене на 5 секунд, поділене на 60, каже їй, що її сценарій буде виконуватися близько двох годин. Для остаточної перевірки вона відкриває інше вікно терміналу, переходить в `north-pacific-gyre`, і використовує `cat stats-NENE01729B.txt`. для перевірки одного з вихідних файлів. Виглядає добре, тож вона вирішує випити кави і продовжити читання.

source: > ## Those Who Know History Can Choose to Repeat It
uk: > ## Хто знає історію, той може її повторити

source: > > Another way to repeat previous work is to use the `history` command to > get a list of the last few hundred commands that have been executed, and > then to use `!123` (where '123' is replaced by the command number) to > repeat one of those commands. For example, if Nelle types this: > > ~~~ > $ history | tail -n 5 > ~~~ > {: .language-bash} > ~~~ > 456 ls -l NENE0*.txt > 457 rm stats-NENE01729B.txt.txt > 458 bash goostats.sh NENE01729B.txt stats-NENE01729B.txt > 459 ls -l NENE0*.txt > 460 history > ~~~
uk: > > Інший спосіб повторити попередню роботу - скористатися командою `history`, щоб > отримати список останніх кількох сотень команд, які було виконано, і > потім скористатися командою `!123` (де "123" замінено на номер команди), щоб > повторити одну з цих команд. Наприклад, якщо Неллі набере наступне: > > ~~~ > $ history | tail -n 5 > ~~~ > {: .language-bash} > ~~~ > 456 ls -l NENE0*.txt > 457 rm stats-NENE01729B.txt.txt > 458 bash goostats.sh NENE01729B.txt stats-NENE01729B.txt > 459 ls -l NENE0*.txt > 460 history > ~~~

source: > > then she can re-run `goostats.sh` on `NENE01729B.txt` simply by typing > `!458`.
uk: > > тоді вона може перезапустити `goostats.sh` на `NENE01729B.txt`, просто набравши > `!458`.

source: > ## Other History Commands
uk: > ## Інші команди історії

source: > > There are a number of other shortcut commands for getting at the history. > > - <kbd>Ctrl</kbd>+<kbd>R</kbd> enters a history search mode 'reverse-i-search' and finds the > most recent command in your history that matches the text you enter next. > Press <kbd>Ctrl</kbd>+<kbd>R</kbd> one or more additional times to search for earlier matches. > You can then use the left and right arrow keys to choose that line and edit > it then hit <kbd>Return</kbd> to run the command. > - `!!` retrieves the immediately preceding command > (you may or may not find this more convenient than using <kbd>↑</kbd>) > - `!$` retrieves the last word of the last command. > That's useful more often than you might expect: after > `bash goostats.sh NENE01729B.txt stats-NENE01729B.txt`, you can type > `less !$` to look at the file `stats-NENE01729B.txt`, which is > quicker than doing <kbd>↑</kbd> and editing the command-line.
uk: > > Існує ряд інших команд швидкого доступу до історії. > > - <kbd>Ctrl</kbd>+<kbd>R</kbd> переходить у режим "зворотного пошуку" в історіїі і знаходить > останню команду у вашому журналі, яка відповідає тексту, що ви введете далі. > Натисніть<kbd>Ctrl</kbd>+<kbd>R</kbd> ще один або кілька додаткових разів для пошуку більш ранніх збігів. > За допомогою клавіш зі стрілками вліво і вправо виберіть цей рядок і відредагуйте > його, потім натисніть <kbd>Return</kbd> щоб виконати команду. > - `!!` повертає безпосередньо попередню команду > (ви можете знайти це більш зручним, ніж використання <kbd>↑</kbd>) > - `!$` повертає останнє слово останньої команди. > Це корисно частіше, ніж ви можете собі уявити: після > `bash goostats.sh NENE01729B.txt stats-NENE01729B.txt`, ви можете ввести > `less !$` для перегляду файлу `stats-NENE01729B.txt`, що > швидше, ніж набирати <kbd>↑</kbd> і редагувати командний рядок.

source: > ## Doing a Dry Run
uk: > ## Виконання пробного запуску

source: > > A loop is a way to do many things at once --- or to make many mistakes at > once if it does the wrong thing. One way to check what a loop *would* do > is to `echo` the commands it would run instead of actually running them. > > Suppose we want to preview the commands the following loop will execute > without actually running those commands: > > ~~~ > $ for datafile in *.pdb > > do > > cat $datafile >> all.pdb > > done > ~~~ > {: .language-bash} > > What is the difference between the two loops below, and which one would we > want to run? > > ~~~ > # Version 1 > $ for datafile in *.pdb > > do > > echo cat $datafile >> all.pdb > > done > ~~~ > {: .language-bash} > > ~~~ > # Version 2 > $ for datafile in *.pdb > > do > > echo "cat $datafile >> all.pdb" > > done > ~~~ > {: .language-bash} > > > ## Solution > > The second version is the one we want to run. > > This prints to screen everything enclosed in the quote marks, expanding the > > loop variable name because we have prefixed it with a dollar sign. > > It also *does not* modify nor create the file `all.pdb`, as the `>>` > > is treated literally as part of a string rather than as a > > redirection instruction. > > > > The first version appends the output from the command `echo cat $datafile` > > to the file, `all.pdb`. This file will just contain the list; > > `cat cubane.pdb`, `cat ethane.pdb`, `cat methane.pdb` etc. > > > > Try both versions for yourself to see the output! Be sure to open the > > `all.pdb` file to view its contents.
uk: > > Цикл - це спосіб зробити багато речей одночасно --- або зробити багато помилок > одночасно, якщо він робить неправильні речі. Один зі способів перевірити, що *робив би* цикл > це за допомогою `echo` виводити команди, які він виконуватиме, замість того, щоб виконувати їх насправді. > > Припустимо, ми хочемо переглянути команди, які виконає наступний цикл > без виконання цих команд: > > ~~~ > $ for datafile in *.pdb > > do > > cat $datafile >> all.pdb > > done > ~~~ > {: .language-bash} > > У чому різниця між двома наведеними нижче циклами, і який з них ми > хочемо запустити? > > ~~~ > # Варіант 1 > $ for datafile in *.pdb > > do > > echo cat $datafile >> all.pdb > > done > ~~~ > {: .language-bash} > > ~~~ > # Варіант 2 > $ for datafile in *.pdb > > do > > echo "cat $datafile >> all.pdb" > > done > ~~~ > {: .language-bash} > > > ## Розв'язання > > Друга версія - це та, яку ми хочемо запустити. > > Вона виводить на екран усе, що укладено у лапки, розширюючи > > назву змінної циклу, оскільки ми додали до неї знак долара. > > Він також *не* змінює і не створює файл `all.pdb`, оскільки оператор `>>` > > розглядається буквально як частина рядка, а не як > > інструкція перенаправлення. > > > > Перша версія додає вивід команди `echo cat $datafile` > > до файлу `all.pdb`. Цей файл міститиме лише список > > `cat cubane.pdb`, `cat ethane.pdb`, `cat methane.pdb` тощо. > > > > Спробуйте обидві версії, щоб побачити результат! Обов'язково відкрийте > > файл `all.pdb`, щоб переглянути його вміст.

source: > ## Nested Loops
uk: > ## Вкладені цикли
