Repository: carpentries-i18n/i18n
Catalog: po/shell-novice.*.po
Languages: uk

source: --- title: "Introducing the Shell" teaching: 5 exercises: 0 questions: - "What is a command shell and why would I use one?" objectives: - "Explain how the shell relates to the keyboard, the screen, the operating system, and users' programs." - "Explain when and why command-line interfaces should be used instead of graphical interfaces." keypoints: - "A shell is a program whose primary purpose is to read commands and run other programs." - "This lesson uses Bash, the default shell in many implementations of Unix." - "Programs can be run in Bash by entering commands at the command-line prompt." - "The shell's main advantages are its high action-to-keystroke ratio, its support for automating repetitive tasks, and its capacity to access networked machines." - "The shell's main disadvantages are its primarily textual nature and how cryptic its commands and operation can be." ---
uk: --- title: "Знайомство з терміналом" teaching: 5 exercises: 0 questions: - "Що таке командний термінал і навіщо його використовувати?" objectives: - "Пояснити, як термінал пов'язаний з клавіатурою, екраном, операційною системою та програмами користувача". - "Пояснити, коли і чому інтерфейси командного рядка слід використовувати замість графічних інтерфейсів". keypoints: - "Термінал - це програма, основним призначенням якої є читання команд і запуск інших програм". - "У цьому уроці використовується Bash, термінал за замовчуванням у багатьох реалізаціях Unix". - "Програми можна запускати у Bash, вводячи команди у вікні командного рядка". - "Основними перевагами терміналу є високе співвідношення кількості дій до кількості натискань клавіш, підтримка автоматизації повторюваних завдань а також можливість доступу до мережевих машин". - "Основними недоліками терміналу є його переважно текстова природа, а також наскільки складними можуть бути її команди та робота". ---

source: ### Background
uk: ### Попередні знання

source: Humans and computers commonly interact in many different ways, such as through a keyboard and mouse, touch screen interfaces, or using speech recognition systems. The most widely used way to interact with personal computers is called a **graphical user interface** (GUI). With a GUI, we give instructions by clicking a mouse and using menu-driven interactions.
uk: Люди та комп’ютери зазвичай взаємодіють багатьма різними способами, наприклад за допомогою клавіатури та миші, сенсорного екрану або системи розпізнавання мови. Найбільш поширений спосіб взаємодії з персональними комп’ютерами називається **графічний інтерфейс користувача** (GUI - graphical user interface). За допомогою такого інтерфейсу ми надаємо комп’ютеру інструкції, обираючи дію у меню за допомогою миші.

source: While the visual aid of a GUI makes it intuitive to learn, this way of delivering instructions to a computer scales very poorly. Imagine the following task: for a literature search, you have to copy the third line of one thousand text files in one thousand different directories and paste it into a single file. Using a GUI, you would not only be clicking at your desk for several hours, but you could potentially also commit an error in the process of completing this repetitive task. This is where we take advantage of the Unix shell. The Unix shell is both a **command-line interface** (CLI) and a scripting language, allowing such repetitive tasks to be done automatically and fast. With the proper commands, the shell can repeat tasks with or without some modification as many times as we want. Using the shell, the task in the literature example can be accomplished in seconds.
uk: Хоча візуальна допомога графічного інтерфейсу користувача робить інтуітивним його вивчення, такий спосіб надсилання інструкцій до комп'ютера дуже погано масштабується. Уявіть наступну задачу: для бібліографічного пошуку вам необхідно скопіювати третю строку з тисячі вхідних файлів з тисячі різних директорій та вставити в один файл. Використовуючи графічний інтерфейс, ви б не тільки клікали на свому робочому місці декілька годин, але й могли б потенційно також внести помилку в процесі виконання монотоної задачі. Ось де ми скористаємося перевагами терміналу Unix. Термінал Unix - це одночасно **інтерфейс командного рядка** (англ. "Command-Line Interface", CLI) та скриптова мова програмування, яка дозволяє подібні повторювальні задачі виконувати автоматично та швидко. За допомогою відповідних команд термінал може повторювати задачі із певними змінами або без них стільки разів, скільки ми бажаємо. Із використанням терміналу приклад задачі з бібліографічним пошуком може бути вирішений за секунди.

source: ### The Shell
uk: ### Термінал

source: The shell is a program where users can type commands. With the shell, it's possible to invoke complicated programs like climate modeling software or simple commands that create an empty directory with only one line of code. The most popular Unix shell is Bash (the Bourne Again SHell --- so-called because it's derived from a shell written by Stephen Bourne). Bash is the default shell on most modern implementations of Unix and in most packages that provide Unix-like tools for Windows.
uk: Термінал - це програма, де користувач може вводити команди. За допомогою терміналу можна запускати як складні програми, такі як програмне забезпечення для моделювання клімату, так і прості команди, які створюють пустий каталог, лише одним рядком коду. Найбільш популярним терміналом є Bash (the Bourne Again SHell, який отримав таку назву, тому що був розроблений на основі терміналу, написаного Стівеном Борном). Bash є терміналом за замовчуванням в більшості сучасних реалізацій Unix та в більшості пакетів, що надають Unix-подібні інструменти для Windows.

source: Using the shell will take some effort and some time to learn. While a GUI presents you with choices to select, CLI choices are not automatically presented to you, so you must learn a few commands like new vocabulary in a language you're studying. However, unlike a spoken language, a small number of "words" (i.e. commands) gets you a long way, and we'll cover those essential few today.
uk: Використання оболонки потребує певних зусиль і часу для вивчення. У той час як графічний інтерфейс надає вам можливість вибору, команди терміналу не надаються автоматично, тому вам доведеться вивчити кілька команд, як нову лексику у мові, яку ви вивчаєте. Однак, на відміну від розмовної мови, невелика кількість "слів" (тобто команд) допоможе вам пройти довгий шлях, і сьогодні ми розглянемо кілька найважливіших з них.

source: The grammar of a shell allows you to combine existing tools into powerful pipelines and handle large volumes of data automatically. Sequences of commands can be written into a *script*, improving the reproducibility of workflows.
uk: Граматика терміналу дозволяє комбінувати наявні інструменти у потужні конвеєри та автоматично обробляти великі обсяги даних. Послідовності команд можуть бути записані у "скрипт", покращуючи відтворюваність послідовностей дій.

source: In addition, the command line is often the easiest way to interact with remote machines and supercomputers. Familiarity with the shell is near essential to run a variety of specialized tools and resources including high-performance computing systems. As clusters and cloud computing systems become more popular for scientific data crunching, being able to interact with the shell is becoming a necessary skill. We can build on the command-line skills covered here to tackle a wide range of scientific questions and computational challenges.
uk: На додаток, командний рядок часто є найпростішим способом взаємодії з віддаленими машинами та суперкомп'ютерами. Ознайомлення з терміналом є майже необхідним для запуску різноманітних спеціалізованих інструментів і ресурсів в тому числі надпродуктивних комп'ютерних систем. Оскільки кластери та хмарні обчислювальні системи стають все більш популярними для обробки наукових даних, вміння взаємодіяти з терміналом стає необхідною навичкою. Ми можемо розвивати навички роботи з командним рядком, описані тут, для вирішення широкого кола наукових питань і обчислювальних проблем.

source: Let's get started.
uk: Отже, почнемо.

source: When the shell is first opened, you are presented with a **prompt**, indicating that the shell is waiting for input.
uk: Коли термінал тільки відкрито, вам пропонується **запрошення** (англ. "prompt"), яке вказує на те, що термінал очікує на введення команд.

source: The shell typically uses `$ ` as the prompt, but may use a different symbol. In the examples for this lesson, we'll show the prompt as `$ `. Most importantly: when typing commands, either from these lessons or from other sources, *do not type the prompt*, only the commands that follow it. Also note that after you type a command, you have to press the <kbd>Enter</kbd> key to execute it.
uk: Термінал зазвичай використовує символ `$ ` як запрошення, але може використовувати й інші символи. У прикладах до цього уроку ми використовуватимемо запрошення `$ `. Найважливіше: під час введення команд з цих уроків або з інших джерел, *запрошення вводити не треба*, а треба вводити тільки команди, що йдуть за ним. Також зауважте, що після введення команди вам потрібно натиснути клавішу <kbd>Enter</kbd> для її виконання.

source: The prompt is followed by a **text cursor**, a character that indicates the position where your typing will appear. The cursor is usually a flashing or solid block, but it can also be an underscore or a pipe. You may have seen it in a text editor program, for example.
uk: За запрошенням йде **текстовий курсор** - символ, який позначає позицію, де з'являться наступні введені вами символи. Курсор зазвичай блимає або є суцільним блоком, але він також може бути підкресленням або вертикальною рискою. Ви могли його бачити, наприклад, в текстових редакторах.

source: So let's try our first command, `ls` which is short for listing. This command will list the contents of the current directory:
uk: Давайте спробуємо нашу першу команду, `ls` (походить від англійського слова "listing"). Ця команда покаже зміст поточного каталогу:

source: > ## Command not found
uk: > ## Команду не знайдено

source: > If the shell can't find a program whose name is the command you typed, it
uk: > Якщо термінал не може знайти програму, назву якої ви ввели, він

source: > will print an error message such as:
uk: > виведе на екран наступну помилку:

source: > > This might happen if the command was mis-typed or if the program corresponding to that command > is not installed.
uk: > > Це може трапитися, якщо при наборі команди була допущена помилка або якщо програма, що відповідає набраній команді, > не встановлена.

source: ## Nelle's Pipeline: A Typical Problem
uk: ## Конвеєр Неллі: Типова Проблема

source: Nelle Nemo, a marine biologist, has just returned from a six-month survey of the [North Pacific Gyre](http://en.wikipedia.org/wiki/North_Pacific_Gyre), where she has been sampling gelatinous marine life in the [Great Pacific Garbage Patch](http://en.wikipedia.org/wiki/Great_Pacific_Garbage_Patch). She has 1520 samples that she's run through an assay machine to measure the relative abundance of 300 proteins. She needs to run these 1520 files through an imaginary program called `goostats.sh` she inherited. On top of this huge task, she has to write up results by the end of the month so her paper can appear in a special issue of *Aquatic Goo Letters*.
uk: Неллі Немо (Nelle Nemo), морський біолог, тільки повернулась з шостимісячного дослідження [Північнотихоокеанської течії (North Pacific Gyre)](https://uk.wikipedia.org/wiki/Північнотихоокеанська_течія), де вона брала зразки желатинового морського життя у [Великій тихоокеанській сміттєвій плямі](https://uk.wikipedia.org/wiki/Велика_тихоокеанська_сміттєва_пляма). Вона має 1520 зразків, які вона пропускає через аналізатор, щоб виміряти відносну кількість 300 білків. Їй потрібно запустити ці 1520 файлів через уявну програму `goostats.sh`, яку вона успадкувала. Окрім цього величезного завдання, вона має написати результати до кінця місяця, щоб її робота могла з’явитися у спеціальному випуску *Aquatic Goo Letters*.

source: The bad news is that if she has to run `goostats.sh` by hand using a GUI, she'll have to select and open a file 1520 times. If `goostats.sh` takes 30 seconds to run each file, the whole process will take more than 12 hours of Nelle's attention. With the shell, Nelle can instead assign her computer this mundane task while she focuses her attention on writing her paper.
uk: Погані новини полягають у тому, що якщо вона має запускати `goostats.sh` вручну за допомогою графічного інтерфейсу користувача, вона буде змущена обирати та відкривати файли 1520 разів. Якщо обробка одного файлу програмою `goostats.sh` триватиме 30 секунд, загальний процес вимагатиме більше ніж 12 годин уваги Неллі. За допомогою терміналу Неллі може замість цього доручити своєму комп’ютеру це буденне завдання в той час, коли вона фокусує свою увагу на написанні статті.

source: The next few lessons will explore the ways Nelle can achieve this. More specifically, they explain how she can use a command shell to run the `goostats.sh` program, using loops to automate the repetitive steps of entering file names, so that her computer can work while she writes her paper.
uk: У наступних кількох уроках будуть розглянуті шляхи, яким чином Неллі може цього досягти. Більш конкретно, ці шляхи пояснюють, як вона може використовувати термінал для запуску програми `goostats.sh`, використовуючи цикли для автоматизації повторюваних кроків введення імен, отже її комп'ютер може працювати в той час, коли вона пише свою статтю.

source: As a bonus, once she has put a processing pipeline together, she will be able to use it again whenever she collects more data.
uk: В якості бонуса, як тільки вона налаштує конвеєр, вона буде взмозі використати його повторно в будь-який час, коли вона збере більше даних.

source: In order to achieve her task, Nelle needs to know how to: - navigate to a file/directory - create a file/directory - check the length of a file - chain commands together - retrieve a set of files - iterate over files - run a shell script containing her pipeline
uk: Для того, щоб досягти своєї мети, Неллі необхідно знати, як: - перейти до файла/каталогу - створити файл/каталог - перевірити довжину файлу - з'єднати команди разом - отримати множину файлів - перебрати файли - запустити скрипт, що містить розроблений нею конвеєр

source: --- title: "Navigating Files and Directories" teaching: 30 exercises: 10 questions: - "How can I move around on my computer?" - "How can I see what files and directories I have?" - "How can I specify the location of a file or directory on my computer?" objectives: - "Explain the similarities and differences between a file and a directory." - "Translate an absolute path into a relative path and vice versa." - "Construct absolute and relative paths that identify specific files and directories." - "Use options and arguments to change the behaviour of a shell command." - "Demonstrate the use of tab completion and explain its advantages." keypoints: - "The file system is responsible for managing information on the disk." - "Information is stored in files, which are stored in directories (folders)." - "Directories can also store other directories, which then form a directory tree." - "`pwd` prints the user's current working directory." - "`ls [path]` prints a listing of a specific file or directory; `ls` on its own lists the current working directory." - "`cd [path]` changes the current working directory." - "Most commands take options that begin with a single `-`." - "Directory names in a path are separated with `/` on Unix, but `\\` on Windows." - "`/` on its own is the root directory of the whole file system." - "An absolute path specifies a location from the root of the file system." - "A relative path specifies a location starting from the current location." - "`.` on its own means 'the current directory'; `..` means 'the directory above the current one'." ---
uk: --- title: "Навігація файлами та каталогами" teaching: 30 exercises: 10 questions: - "Як я можу переміщатися на моєму комп'ютері?" - "Як я можу побачити, які файли та каталоги у мене є?" - "Як вказати місцезнаходження файлу або каталогу на комп'ютері?" objectives: - "Пояснити подібності та відмінності між файлом і каталогом". - "Перетворити абсолютний шлях у відносний і навпаки". - "Створити абсолютні та відносні шляхи, які ідентифікують певні файли та каталоги". - "Використати опції та аргументи для зміни поведінки команди оболонки". - "Продемонструвати використання завершення вкладки та пояснити його переваги". keypoints: - "Файлова система відповідає за керування інформацією на диску". - "Інформація зберігається у файлах, які зберігаються в каталогах (папках)". - "У каталогах також можуть зберігатися інші каталоги, які потім утворюють дерево каталогів". - "Команда `pwd` виводить поточний робочий каталог користувача." - "Команда `ls [шлях]` виводить список певного файлу або каталогу; Команда `ls` сама по собі виводить список поточного робочого каталогу." - "Команда `cd [шлях]` змінює поточний робочий каталог." - "Більшість команд приймають параметри, які починаються з одного символу `-`." - "Назви каталогів у шляху розділяються символами `/` у Unix, але `\\` у Windows." - "Символ `/` сам по собі є кореневим каталогом усієї файлової системи." - "Абсолютний шлях вказує на розташування від кореня файлової системи." - "Відносний шлях вказує на розташування, починаючи з поточного розташування." - "Символ `.` сам по собі означає "поточний каталог"; `..` означає "каталог вище поточного", "батьківський каталог". ---

source: The part of the operating system responsible for managing files and directories is called the **file system**. It organizes our data into files, which hold information, and directories (also called 'folders'), which hold files or other directories.
uk: Частина операційної системи, яка відповідає за роботу з файлами та директоріями, називається **файлова система**. Вона організує наші дані у вигляді файлів, які містять інформацію, та директорій (їх ще називають 'каталогами'), які містять файли або інші директорії.

source: Several commands are frequently used to create, inspect, rename, and delete files and directories. To start exploring them, we'll go to our open shell window.
uk: Декілька команд часто використовуються для створення, перевірки, перейменування та видалення файлів та директорій. Для початку їх огляду, перейдемо до нашого відкритого вікна терміналу.

source: First, let's find out where we are by running a command called `pwd` (which stands for 'print working directory'). Directories are like *places* — at any time while we are using the shell, we are in exactly one place called our **current working directory**. Commands mostly read and write files in the current working directory, i.e. 'here', so knowing where you are before running a command is important. `pwd` shows you where you are:
uk: По-перше, давайте дізнаємося, де ми знаходимося, шляхом виконання команди `pwd` (англ. 'print working directory' - надрукувати робочу директорію). Директорії — це немов *місця* — будь-коли під час використання терміналу ми знаходимось в якомусь одному конкретному місці, яке називається нашою **поточною робочою директорією**. Команди здебільшого читають вміст файлів та пишуть до них в поточній робочій директорії, тобто 'тут', отже розуміння того, де ви знаходитесь, перед запуском команди є важливим. Команда `pwd` покаже вам, де ви знаходитесь:

source: Here, the computer's response is `/Users/nelle`, which is Nelle's **home directory**:
uk: У наведеному прикладі комп'ютер відповів `/Users/nelle`, що є **домашньою директорією** Неллі:

source: > ## Home Directory Variation
uk: > ## Варіації домашнього каталогу

source: > > The home directory path will look different on different operating systems. > On Linux, it may look like `/home/nelle`, > and on Windows, it will be similar to `C:\Documents and Settings\nelle` or > `C:\Users\nelle`. > (Note that it may look slightly different for different versions of Windows.) > In future examples, we've used Mac output as the default - Linux and Windows > output may differ slightly but should be generally similar. > > We will also assume that your `pwd` command returns your user's home directory. > If `pwd` returns something different, you may need to navigate there using `cd` > or some commands in this lesson will not work as written. > See [Exploring Other Directories](#exploring-other-directories) for more details > on the `cd` command.
uk: > > Розташування домашньої директорії виглядає по-різному в різних операційних системах. > В Linux воно може виглядати як `/home/nelle`, > а у Windows воно буде схоже на `C:\Documents and Settings\nelle` чи > `C:\Users\nelle`. > (Зауважте, що воно може виглядати дещо інакше для різних версій Windows.) > У майбутніх прикладах ми використовували формат виводу Mac як стандартний – формати виводу Linux та Windows > можуть дещо відрізнятися, але загалом мають бути подібними. > Ми також припустимо, що ваша команда `pwd` повертає вашу домашню директорію користувача. > Якщо команда `pwd` повертає щось інше, вам може знадобитися перейти туди за допомогою команди `cd`, > інакше деякі команди в цьому уроці не будуть працювати як описано. > Дивись [Огляд інших каталогів](#exploring-other-directories), щоб дізнатися більше > про команду `cd`.

source: To understand what a 'home directory' is, let's have a look at how the file system as a whole is organized. For the sake of this example, we'll be illustrating the filesystem on our scientist Nelle's computer. After this illustration, you'll be learning commands to explore your own filesystem, which will be constructed in a similar way, but not be exactly identical.
uk: Для того, щоб зрозуміти, що таке 'домашній каталог', давайте подивимось, як організована файлова система в цілому. Для цього прикладу ми проілюструємо файлову систему на комп’ютері нашої вченої Неллі. Після цієї ілюстрації ви вивчатимете команди для дослідження власної файлової системи, яка буде побудовані подібним чином, але не буде абсолютно ідентичною.

source: On Nelle's computer, the filesystem looks like this:
uk: На комп’ютері Неллі файлова система виглядає так:

source: ![The file system is made up of a root directory that contains sub-directories titled bin, data, users, and tmp](../fig/filesystem.svg)
uk: ![Файлова система складається з кореневого каталогу, який містить підкаталоги під назвами bin, data, users та tmp](../fig/filesystem.svg)

source: At the top is the **root directory** that holds everything else. We refer to it using a slash character, `/`, on its own; this character is the leading slash in `/Users/nelle`.
uk: У верхній частині знаходиться **кореневий каталог**, який містить усе інше. Ми виконуємо посилання на нього за допомогою символу косої риски, `/`; цей символ - це перший (лівий) символ у рядку `/Users/nelle`.

source: Inside that directory are several other directories: `bin` (which is where some built-in programs are stored), `data` (for miscellaneous data files), `Users` (where users' personal directories are located), `tmp` (for temporary files that don't need to be stored long-term), and so on.
uk: Усередині цього каталогу є кілька інших каталогів: `bin` (в якому зберігаються певні вбудовані програми), `data` (для різноманітних файлів даних), `Users` (де знаходяться особисті директорії користувачів), `tmp` (для файлів тимчасового зберігання) та інші.
