Repository: carpentries-i18n/i18n
Catalog: po/shell-novice.*.po
Languages: uk

source: then putting it in a shell script for re-use and calling that script inside a `for` loop, is a great opportunity to show how "seven plus or minus two" connects to programming. Once we have figured out how to do something moderately complicated, we make it re-usable and give it a name so that it only takes up one slot in working memory rather than several. It is also a good opportunity to talk about exploratory programming: rather than designing a program up front, we can do a few useful things and then retroactively decide which are worth encapsulating for future re-use.
uk: з подальшим розміщенням його в скрипт терміналу для повторного використання і виклик цього сценарію всередині циклу `for`, це чудова можливість показати, як "сім плюс-мінус два" пов'язано з програмуванням. Коли ми з’ясували, як зробити щось помірно складне, ми робимо його придатним для повторного використання та даємо йому назву так що він займає лише один слот у робочій пам’яті, а не кілька Це також гарна можливість поговорити про пошукове програмування: замість того, щоб розробляти програму заздалегідь, ми можемо зробити кілька корисних речей а потім заднім числом вирішити, які варті інкапсуляції для майбутнього повторного використання.

source: * If everything is going well, you can drive home the point that file
uk: * Якщо все йде добре, ви можете переконати, що розширення файлів

source: extensions are essentially there to help computers (and human readers) understand file content and are not a requirement of files (covered briefly in [Navigating Files and Directories]({{ page.root }}{% link _episodes/02-filedir.md %})). This can be done in the [Pipes and Filters]({{ page.root }}{% link _episodes/04-pipefilter.md %}) section by showing that you can redirect standard output to a file without the .txt extension (e.g., lengths), and that the resulting file is still a perfectly usable text file. Make the point that if double-clicked in the GUI, the computer will probably ask you what you want to do.
uk: по суті існують, щоб допомогти комп’ютерам (і людям- читачам) зрозуміти вміст файлів, і не є вимогою для файлів (коротко висвітлено в секції [Навігація файлами та каталогами]({{ page.root }}{% link _episodes/02-filedir.md %})). Це можна зробити в секції [Канали та фільтри]({{ page.root }}{% link _episodes/04-pipefilter.md %}) шляхом демонстрації що ви можете перенаправити стандартний вихід у файл без розширення .txt (наприклад, lengths), і що отриманий файл все ще є цілком придатним для використання текстовим файлом. Зауважте, що у разі подвійного кліку в графічному інтерфейсі комп’ютер буде, напевно, запитувати вас, що ви хочете зробити.

source: * We have to leave out many important things because of time constraints,
uk: * Через брак часу нам доводиться пропускати багато важливих речей,

source: including file permissions, job control, and SSH. If learners already understand the basic material, this can be covered instead using the online lessons as guidelines. These limitations also have follow-on consequences:
uk: включаючи дозволи на файли, керування завданнями та SSH. Якщо учні вже розуміють базовий матеріал, цей матеріал можна розглянути, використовуючи онлайн-уроки як орієнтири. Ці обмеження також мають подальші наслідки:

source: * It's hard to discuss `#!` (shebang) without first discussing
uk: * Важко обговорювати `#!` (шебанг), не обговоривши попередньо

source: permissions, which we don't do. `#!` is also [pretty complicated][shebang], so even if we did discuss permissions, we probably still wouldn't want to discuss `#!`.
uk: дозволів, чого ми не робимо. `#!` також [доволі складний][shebang], тож навіть якби ми обговорювали дозволи, ми, мабуть, все одно б не захотіли обговорювати `#!`.

source: * Installing Bash and a reasonable set of Unix commands on Windows
uk: * Встановлення Bash та доцільного набору команд Unix на Windows

source: always involves some fiddling and frustration. Please see the latest set of installation guidelines for advice, and try it out yourself *before* teaching a class.
uk: завжди пов'язане з деякими клопотами та розчаруваннями. Будь ласка, зверніться до останнього набору інструкцій щодо встановлення для отримання порад, і спробуйте самі, перш ніж викладати у класі.

source: * On Windows machines
uk: * На машинах Windows

source: if `nano` hasn't been properly installed with the [Software Carpentry Windows Installer][windows-installer] it is possible to use `notepad` as an alternative. There will be a GUI interface and line endings are treated differently, but otherwise, for the purposes of this lesson, `notepad` and `nano` can be used almost interchangeably.
uk: якщо `nano` не було належним чином встановлено за допомогою [Software Carpentry Windows Installer][windows-installer] можна скористатися `notepad` як альтернативою. У цьому випадку буде використано графічний інтерфейс і закінчення рядків обробляються по-різному, але для цілей цього уроку `notepad` і `nano` можна використовувати майже як взаємозамінні.

source: * On Windows, it appears that:
uk: * На машинах Windows, виявляється, наступні команди:

source: will always put someone on their desktop (unless their machine is backed up using enterprise OneDrive, see next point). Have them create the example directory for the shell exercises there so that they can find it easily and watch it evolve.
uk: завжди відправлять когось у каталог свого робочого столу (якщо на їхньому комп'ютері не створено резервну копію за допомогою корпоративного OneDrive, див. наступний пункт). Попросіть їх створити там каталог прикладів для вправ у командному рядку щоб вони могли легко його знайти і спостерігати за його розвитком.

source: * If a Windows machine is backed up with enterprise OneDrive, their GUI desktop may
uk: * Якщо на комп'ютері з Windows створено резервну копію корпоративного OneDrive, його робочий стіл із графічним інтерфейсом може

source: be rendered from a folder within OneDrive, which will not match the contents of `~/Desktop`. The OneDrive desktop should be accessible using one of the following commands (if the name of the enterprise isn't clear, look through the output of `ls` to find the right folder):
uk: буде відображено з каталогу у OneDrive, який не збігатиметься із вмістом `~/Desktop`. Доступ до робочого столу OneDrive має бути забезпечено за допомогою однієї з наведених нижче команд (якщо назва підприємства незрозуміла, перегляньте виведення `ls`, щоб знайти потрібний каталог):

source: One way to spot if the computer is using this kind of configuration is to look at files, folders or links on the desktop. Usually the icon contains a shortcut/arrow symbol if it is a link, or just the plain icon if the file is just saved in the `Desktop` folder. Files synced with OneDrive contain an additional symbol indicating the sync status (typically blue arrows for 'sync pending' or a green tick for 'synced').
uk: Один із способів визначити, чи використовує комп'ютер таку конфігурацію, - це переглянути файли, каталоги або посилання на робочому столі. Зазвичай піктограма містить символ ярлика/стрілки, якщо це посилання, або просто піктограму, якщо файл просто збережено в папці "Робочий стіл". Файли, синхронізовані зі службою OneDrive, містять додатковий символ, що вказує на стан синхронізації (зазвичай сині стрілки для "очікує синхронізації" або зелена галочка для "синхронізовано").

source: * Stay within POSIX-compliant commands, as all the teaching materials do.
uk: * Дотримуйтесь POSIX-сумісних команд, як і в усіх навчальних матеріалах.

source: Your particular shell may have extensions beyond POSIX that are not available on other machines, especially the default macOS bash and Windows bash emulators. For example, POSIX `ls` does not have an `--ignore=` or `-I` option, and POSIX `head` takes `-n 10` or `-10`, but not the long form of `--lines=10`.
uk: Ваша конкретна оболонка може мати розширення за межами POSIX, які недоступні на інших машинах, особливо у типових емуляторах bash для macOS і bash для Windows. Наприклад, POSIX `ls` не має опції `--ignore=` або `-I`, а POSIX `head` приймає `-n 10` або `-10`, але не довгу форму `--lines=10`.

source: Installing Bash and a reasonable set of Unix commands on Windows always involves some fiddling and frustration. Please see the latest set of installation guidelines for advice, and try it out yourself *before* teaching a class. Options we have explored include:
uk: Встановлення Bash та доцільного набору команд Unix на Windows завжди пов'язане з деякими клопотами та розчаруваннями. Будь ласка, зверніться до останнього набору інструкцій щодо встановлення для отримання порад, і спробуйте самі, перш ніж викладати у класі. Ми розглянули такі варіанти:

source: 1. [msysGit](http://msysgit.github.io/) (also called "Git Bash"),
uk: 1. [msysGit](http://msysgit.github.io/) (також відомий як "Git Bash"),

source: 3. using a desktop virtual machine, and
uk: 3. використання віртуальної машини, та

source: 4. having learners connect to a remote Unix machine (typically a VM in the cloud).
uk: 4. підключення учнів до віддаленої Unix-машини (як правило, віртуальної машини в хмарі).

source: Cygwin was the preferred option until mid-2013, but once we started teaching Git, msysGit proved to work better. Desktop virtual machines and cloud-based VMs work well for technically sophisticated learners, and can reduce installation and configuration at the start of the workshop, but:
uk: Cygwin був найкращим варіантом до середини 2013 року, але як тільки ми почали викладати Git, msysGit виявився кращим. Настільні віртуальні машини та хмарні віртуальні машини добре підходять для технічно-підкованих учнів і можуть скоротити час на встановлення та налаштування на початку семінару, але:

source: 1. they don't work well on underpowered machines,
uk: 1. вони погано працюють на малопотужних машинах,

source: 2. they're confusing for novices (because simple things like copy and paste work differently),
uk: 2. вони збивають з пантелику новачків (тому що такі прості речі, як копіювання та вставка, працюють по-різному),

source: 3. learners leave the workshop without a working environment on their operating system of choice,
uk: 3. учні залишають семінар без робочого середовища на обраній ними операційній системі,

source: and 4. learners may show up without having downloaded the VM or the wireless will go down (or become congested) during the lesson.
uk: та 4. учні можуть з'явитися, не завантаживши віртуальну машину, або бездротовий зв'язок зникне (або стане перевантаженим) під час уроку.

source: Whatever you use, please *test it yourself* on a Windows machine *before* your workshop: things may always have changed behind your back since your last workshop. And please also make use of our [Software Carpentry Windows Installer][windows-installer].
uk: Що б ви не використовували, будь ласка, *протестуйте його власноруч* на комп'ютері з Windows *до* початку семінару: з часу вашого останнього семінару все могло змінитися за вашою спиною. І, будь ласка, також скористайтеся нашим [Software Carpentry Windows Installer][windows-installer].

source: {% comment %} As a maintainer, you do not need to edit this file. If you notice that something does not work, please open an issue: https://github.com/carpentries/styles/issues/new {% endcomment %}
uk: {% comment %} Як супровідник, вам не потрібно редагувати цей файл. Якщо ви помітили, що щось не працює, будь ласка створіть заявку про проблему: https://github.com/carpentries/styles/issues/new {% endcomment %}

source: The Unix shell has been around longer than most of its users have been alive. It has survived because it's a powerful tool that allows users to perform complex and powerful tasks, often with just a few keystrokes or lines of code. It helps users automate repetitive tasks and easily combine smaller tasks into larger, more powerful workflows.
uk: Термінал Unix існує довше, ніж більшість її користувачів живуть на світі. Вона вижила, тому що це потужний інструмент, який дозволяє користувачам виконувати складні та потужні завдання, часто за допомогою лише кількох натискань клавіш або кількох рядків коду. Він допомагає користувачам автоматизувати завдання, що повторюються, і легко об'єднувати менші завдання у більші та потужніші робочі процеси.

source: Use of the shell is fundamental to a wide range of advanced computing tasks, including high-performance computing. These lessons will introduce you to this powerful tool.
uk: Використання терміналу є фундаментальним для широкого спектру сучасних обчислювальних завдань, включаючи високопродуктивні обчислення. Ці уроки познайомлять вас з цим потужним інструментом.

source: > ## Prerequisites
uk: > ## Передумови

source: > > This lesson guides you through the basics of file systems and the > shell. If you have stored files on a computer at all and recognize > the word "file" and either "directory" or "folder" (two common words > for the same thing), you're ready for this lesson. > > If you're already comfortable manipulating files and directories, > searching for files with `grep` and `find`, and writing simple loops > and scripts, you probably want to explore the next lesson: > [shell-extras](https://carpentries-incubator.github.io/shell-extras/).
uk: > > У цьому уроці ви дізнаєтеся про основи файлових систем та > термінал. Якщо ви коли-небудь зберігали файли на комп'ютері і розпізнаєте > слово "файл" і "каталог" або "тека" (два загальновживаних слова, > що позначають одне й те саме), ви готові до цього уроку. > > Якщо ви вже впевнено маніпулюєте файлами та каталогами, > шукаєте файли за допомогою команд `grep` і `find`, а також пишете прості цикли > та скрипти, вам, ймовірно, буде цікаво перейти до наступного уроку: > [shell-додаток](https://carpentries-incubator.github.io/shell-extras/).

source: ## Summary of Basic Commands
uk: ## Короткий опис основних команд

source: | Action | Files | Folders | |-------------|-------|--------------| | Inspect | ls | ls | | View content| cat | ls | | Navigate to | | cd | | Move | mv | mv | | Copy | cp | cp -r | | Create | nano | mkdir | | Delete | rm | rmdir, rm -r |
uk: | Операція | Файли | Каталоги | |------------------|-------|--------------| | Перелічити | ls | ls | | Проглянути вміст | cat | ls | | Перейти до ... | | cd | | Перемістити | mv | mv | | Копіювати | cp | cp -r | | Створити | nano | mkdir | | Видалити | rm | rmdir, rm -r |

source: ## Filesystem hierarchy
uk: ## Ієрархія файлової системи

source: The following is an overview of a standard Unix filesystem. The exact hierarchy depends on the platform. Your file/directory structure may differ slightly:
uk: Нижче наведено огляд стандартної файлової системи Unix. Точна ієрархія залежить від платформи. Ваша структура файлів/каталогу може дещо відрізнятися:

source: ![Linux filesystem hierarchy](fig/standard-filesystem-hierarchy.svg)
uk: ![Ієрархія файлової системи Linux](fig/standard-filesystem-hierarchy.svg)

source: ## Glossary
uk: ## Словник

source: {:auto_ids} absolute path : A [path](#path) that refers to a particular location in a file system. Absolute paths are usually written with respect to the file system's [root directory](#root-directory), and begin with either "/" (on Unix) or "\\" (on Microsoft Windows). See also: [relative path](#relative-path).
uk: {:auto_ids} абсолютний шлях : [Шлях](#шлях), який посилається на певне місце у файловій системі. Абсолютні шляхи зазвичай записуються відносно [кореневого каталогу](#кореневий-каталог) файлової системи і починаються з символів "/" (у Unix) або "\\" (у Microsoft Windows). Дивись також: [відносний шлях](#відносний-шлях).

source: argument : A value given to a function or program when it runs. The term is often used interchangeably (and inconsistently) with [parameter](#parameter).
uk: аргумент : Значення, яке передається до функції або програми під час її запуску. Цей термін часто використовується як взаємозамінний (і неузгоджено) з [параметр](#параметр).

source: command shell : See [shell](#shell)
uk: командна оболонка : Дивись [термінал](#термінал)

source: command-line interface : A user interface based on typing commands, usually at a [REPL](#read-evaluate-print-loop). See also: [graphical user interface](#graphical-user-interface).
uk: інтерфейс командного рядка : Інтерфейс користувача, заснований на введенні команд, зазвичай у циклі [REPL](#цикл-read-evaluate-print). Дивись також: [графічний інтерфейс користувача](#графічний-інтерфейс-користувача).

source: comment : A remark in a program that is intended to help human readers understand what is going on, but is ignored by the computer. Comments in Python, R, and the Unix shell start with a `#` character and run to the end of the line; comments in SQL start with `--`, and other languages have other conventions.
uk: коментар : Зауваження в програмі, яке має на меті допомогти людині-читачеві зрозуміти, що відбувається, але ігнорується комп'ютером. Коментарі у мовах Python, R та в терміналі Unix починаються з символу `#' та йдуть до кінця відповідного рядка коментарі в SQL починаються з `--`, а в інших мовах існують інші домовленості.

source: current working directory : The directory that [relative paths](#relative-path) are calculated from; equivalently, the place where files referenced by name only are searched for. Every [process](#process) has a current working directory. The current working directory is usually referred to using the shorthand notation `.` (pronounced "dot").
uk: поточний робочий каталог : Каталог, з якого обчислюються [відносні шляхи](#відносний-шлях); еквівалентно, місце, де шукаються файли, на які посилаються лише за іменами. Кожен [процес](#процес) має поточний робочий каталог. На поточний робочий каталог зазвичай посилаються за допомогою скороченого позначення `.` (вимовляється як "крапка").

source: file system : A set of files, directories, and I/O devices (such as keyboards and screens). A file system may be spread across many physical devices, or many file systems may be stored on a single physical device; the [operating system](#operating-system) manages access.
uk: файлова система : Набір файлів, каталогів та пристроїв вводу/виводу (таких як клавіатури та екрани). Файлова система може бути розподілена на багатьох фізичних пристроях, або багато файлових систем можуть зберігатися на одному фізичному пристрої; [операційна система](#операційна-система) керує доступом.

source: filename extension : The portion of a file's name that comes after the final "." character. By convention this identifies the file's type: `.txt` means "text file", `.png` means "Portable Network Graphics file", and so on. These conventions are not enforced by most operating systems: it is perfectly possible (but confusing!) to name an MP3 sound file `homepage.html`. Since many applications use filename extensions to identify the [MIME type](#mime-type) of the file, misnaming files may cause those applications to fail.
uk: розширення імені файлу : Частина імені файлу, яка йде після останнього символу ".". За домовленістю це визначає тип файлу: `.txt` означає "текстовий файл" (від англ. "TeXT"), `.png` означає "файл портативної мережевої графіки" (від англ. "Portable Network Graphics file"), і так далі. Більшість операційних систем не дотримуються цих домовленостей: цілком можливо (але заплутано!) назвати звуковий файл MP3 `homepage.html`. Оскільки багато програм використовують розширення назв файлів для ідентифікації [MIME типу](#mime-тип) файлу, неправильне називання файлів може призвести до збою у роботі відповідних програм.

source: filter : A program that transforms a stream of data. Many Unix command-line tools are written as filters: they read data from [standard input](#standard-input), process it, and write the result to [standard output](#standard-output).
uk: фільтр : Програма, яка перетворює потік даних. Багато інструментів командного рядка Unix написано у вигляді фільтрів: вони зчитують дані зі [стандартного вводу](#стандартний-ввод), обробляють їх і записують результат у [стандартний вивід](#стандартний-вивід).

source: for loop : A loop that is executed once for each value in some kind of set, list, or range. See also: [while loop](#while-loop).
uk: цикл FOR : Цикл, який виконується один раз для кожного значення в деякому наборі, списку або діапазоні. Дивись також: [цикл while] (#цикл-while).

source: graphical user interface : A user interface based on selecting items and actions from a graphical display, usually controlled by using a mouse. See also: [command-line interface](#command-line-interface).
uk: графічний інтерфейс користувача : Інтерфейс користувача, заснований на виборі елементів і дій з графічного дисплея, зазвичай керований за допомогою миші. Дивись також: [інтерфейс командного рядка](#інтерфейс-командного-рядка).

source: home directory : The default directory associated with an account on a computer system. By convention, all of a user's files are stored in or below her home directory.
uk: домашній каталог : Каталог за замовчуванням, пов'язаний з обліковим записом у комп'ютерній системі. За домовленістю усі файли користувача зберігаються у домашньому каталозі або нижче нього.

source: loop : A set of instructions to be executed multiple times. Consists of a [loop body](#loop-body) and (usually) a condition for exiting the loop. See also [for loop](#for-loop) and [while loop](#while-loop).
uk: цикл : Набір інструкцій, що виконується декілька разів. Складається з [тіла циклу](#тіло-циклу) і (зазвичай) умови виходу з циклу. Дивись також: [цикл for](#цикл-for) та [цикл while](#цикл-while).

source: loop body : The set of statements or commands that are repeated inside a [for loop](#for-loop) or [while loop](#while-loop).
uk: тіло циклу : Набір операторів або команд, які повторюються всередині [циклу for](#цикл-for) чи [циклу while](#цикл-while).

source: MIME type : MIME (Multi-Purpose Internet Mail Extensions) types describe different file types for exchange on the Internet, for example, images, audio, and documents.
uk: MIME тип : Типи MIME (Multi-Purpose Internet Mail Extensions, з англ. багатоцільові розширення інтернет-пошти) описують різні типи файлів для обміну в Інтернеті, наприклад, зображення, аудіо та документи.

source: operating system : Software that manages interactions between users, hardware, and software [processes](#process). Common examples are Linux, macOS, and Windows.
uk: операційна система : Програмне забезпечення, яке керує взаємодією між користувачами, обладнанням та [процесами] (#процес) програмного забезпечення. Поширеними прикладами є Linux, macOS та Windows.

source: option : A way to specify an argument or setting to a command-line program. By convention Unix applications use a dash followed by a single letter, such as `-v`, or two dashes followed by a word, such as `--verbose`, while DOS applications use a slash, such as `/V`. Depending on the application, an option may be followed by a single argument, as in `-o /tmp/output.txt`.
uk: опція : Спосіб вказати аргумент або параметр у програмі командного рядка. Зазвичай у Unix-програмах використовується тире, за яким слідує одна літера, наприклад, `-v`, або два тире з наступним словом, наприклад, `--verbose`, у той час як програми для DOS використовують косу риску, наприклад `/V`. Залежно від програми, опція може супроводжуватися одним аргументом, як у `-o /tmp/output.txt`.

source: parameter : A variable named in a function's declaration that is used to hold a value passed into the call. The term is often used interchangeably (and inconsistently) with [argument](#argument).
uk: параметр : Змінна, названа в оголошенні функції, яка використовується для зберігання значення, переданого у виклик. Цей термін часто використовується як взаємозамінний (і неузгоджено) з [аргумент](#аргумент).
