Repository: carpentries-i18n/i18n
Catalog: po/shell-novice.*.po
Languages: uk

source: > > 1. `grep "of" haiku.txt` > 2. `grep -E "of" haiku.txt` > 3. `grep -w "of" haiku.txt` > 4. `grep -i "of" haiku.txt` > > > ## Solution > > The correct answer is 3, because the `-w` option looks only for whole-word matches. > > The other options will also match 'of' when part of another word.
uk: > > 1. `grep "of" haiku.txt` > 2. `grep -E "of" haiku.txt` > 3. `grep -w "of" haiku.txt` > 4. `grep -i "of" haiku.txt` > > > ## Розв'язання > > Правильна відповідь 3, тому що опція `-w` шукає збіги лише між цілими словами. > Інші варіанти також шукатимуть збіги зі словом 'of', якщо воно є частиною іншого слова.

source: > > `grep`'s real power doesn't come from its options, though; it comes from > the fact that patterns can include wildcards. (The technical name for > these is **regular expressions**, which > is what the 're' in 'grep' stands for.) Regular expressions are both complex > and powerful; if you want to do complex searches, please look at the lesson > on [our website](http://v4.software-carpentry.org/regexp/index.html). As a taster, we can > find lines that have an 'o' in the second position like this: > > ~~~ > $ grep -E "^.o" haiku.txt > ~~~ > {: .language-bash} > > ~~~ > You bring fresh toner. > Today it is not working > Software is like that. > ~~~
uk: > > Проте справжня сила `grep` полягає не у його опціях, а у тому, > що шаблони можуть містити підстановочні символи. (Технічна назва для > цього - **регулярні вирази**, для чого > скорочення 're' у 'grep'). Регулярні вирази є складними > і потужніми; якщо ви хочете робити складні пошуки, будь ласка, перегляньте урок > на [нашому сайті] (http://v4.software-carpentry.org/regexp/index.html). Для початку ми можемо > знайти рядки, які містять "o" у другій позиції, наприклад, так: > > ~~~ > $ grep -E "^.o" haiku.txt > ~~~ > {: .language-bash} > > ~~~ > You bring fresh toner. > Today it is not working > Software is like that. > ~~~

source: > > We use the `-E` option and put the pattern in quotes to prevent the shell > from trying to interpret it. (If the pattern contained a `*`, for > example, the shell would try to expand it before running `grep`.) The > `^` in the pattern anchors the match to the start of the line. The `.` > matches a single character (just like `?` in the shell), while the `o` > matches an actual 'o'.
uk: > > Ми використовуємо опцію `-E` і беремо шаблон у лапки, щоб запобігти спробам терміналу > інтерпретувати його. (Якщо шаблон містить `*`, > наприклад, оболонка спробує розгорнути його перед запуском `grep`). Символ > `^` у шаблоні прив'язує збіг до початку рядка. Символ `.` > відповідає одному символу (подібно до `?` у командному рядку), тоді як `o` > відповідає власне 'o'.

source: > ## Tracking a Species
uk: > ## Відстеження видів

source: > > Leah has several hundred > data files saved in one directory, each of which is formatted like this: > > ~~~ > 2012-11-05,deer,5 > 2012-11-05,rabbit,22 > 2012-11-05,raccoon,7 > 2012-11-06,rabbit,19 > 2012-11-06,deer,2 > 2012-11-06,fox,4 > 2012-11-07,rabbit,16 > 2012-11-07,bear,1 > ~~~
uk: > > Лея має кілька сотень > файлів даних, збережених в одному каталозі, кожен з яких відформатовано таким чином: > > ~~~ > 2012-11-05,deer,5 > 2012-11-05,rabbit,22 > 2012-11-05,raccoon,7 > 2012-11-06,rabbit,19 > 2012-11-06,deer,2 > 2012-11-06,fox,4 > 2012-11-07,rabbit,16 > 2012-11-07,bear,1 > ~~~

source: > > She wants to write a shell script that takes a species as the first command-line argument > and a directory as the second argument. The script should return one file called `<species>.txt` > containing a list of dates and the number of that species seen on each date. > For example using the data shown above, `rabbit.txt` would contain: > > ~~~ > 2012-11-05,22 > 2012-11-06,19 > 2012-11-07,16 > ~~~
uk: > > Вона хоче написати командний скрипт, який приймає вид як перший аргумент командного рядка > і каталог як другий аргумент. Скрипт повинен повернути один файл з назвою `<вид>.txt', > який містить список дат і кількість особин цього виду, які були помічені у кожну дату. > Наприклад, використовуючи дані, показані вище, `rabbit.txt` буде містити: > > ~~~ > 2012-11-05,22 > 2012-11-06,19 > 2012-11-07,16 > ~~~

source: > > Below, each line contains an individual command, or pipe. Arrange their > sequence in one command in order to achieve Leah's goal: > > ~~~ > cut -d : -f 2 > > > | > grep -w $1 -r $2 > | > $1.txt > cut -d , -f 1,3 > ~~~ > {: .language-bash} > > Hint: use `man grep` to look for how to grep text recursively in a directory > and `man cut` to select more than one field in a line. > > An example of such a file is provided in > `shell-lesson-data/exercise-data/animal-counts/animals.csv` > > > ## Solution > > > > ``` > > grep -w $1 -r $2 | cut -d : -f 2 | cut -d , -f 1,3 > $1.txt > > ``` > > {: .source} > > > > Actually, you can swap the order of the two cut commands and it still works. At the > > command line, try changing the order of the cut commands, and have a look at the output > > from each step to see why this is the case. > > > > You would call the script above like this: > > > > ``` > > $ bash count-species.sh bear . > > ``` > > {: .language-bash}
uk: > > Нижче кожен рядок містить окрему команду або канал. Впорядкуйте їх > послідовність в одну команду, щоб досягти мети Леї: > > ~~~ > cut -d : -f 2 > > > | > grep -w $1 -r $2 > | > $1.txt > cut -d , -f 1,3 > ~~~ > {: .language-bash} > > Підказка: використовуйте `man grep` для пошуку того, як виконувати рекурсивний пошук тексту у каталозі > і `man cut` для виділення декількох полів у рядку. > > Приклад такого файлу наведено в > `shell-lesson-data/exercise-data/animal-counts/animals.csv` > > > ## Розв'язання > > > > ``` > > grep -w $1 -r $2 | cut -d : -f 2 | cut -d , -f 1,3 > $1.txt > > ``` > > {: .source} > > > > Насправді, ви можете поміняти місцями порядок двох команд вирізання, і це все одно буде працювати. У командному рядку > > спробуйте змінити порядок команд вирізання і подивіться на вивід > > на кожному кроці, щоб зрозуміти, чому це відбувається. > > > > Ви можете визвати наведений вище скрипт так: > > > > ``` > > $ bash count-species.sh bear . > > ``` > > {: .language-bash}

source: > ## Little Women
uk: > ## Маленькі жінки

source: > > You and your friend, having just finished reading *Little Women* by > Louisa May Alcott, are in an argument. Of the four sisters in the > book, Jo, Meg, Beth, and Amy, your friend thinks that Jo was the > most mentioned. You, however, are certain it was Amy. Luckily, you > have a file `LittleWomen.txt` containing the full text of the novel > (`shell-lesson-data/exercise-data/writing/LittleWomen.txt`). > Using a `for` loop, how would you tabulate the number of times each > of the four sisters is mentioned? > > Hint: one solution might employ > the commands `grep` and `wc` and a `|`, while another might utilize > `grep` options. > There is often more than one way to solve a programming task, so a > particular solution is usually chosen based on a combination of > yielding the correct result, elegance, readability, and speed. > > > ## Solutions > > ``` > > for sis in Jo Meg Beth Amy > > do > > echo $sis: > > grep -ow $sis LittleWomen.txt | wc -l > > done > > ``` > > {: .source} > > > > Alternative, slightly inferior solution: > > ``` > > for sis in Jo Meg Beth Amy > > do > > echo $sis: > > grep -ocw $sis LittleWomen.txt > > done > > ``` > > {: .source} > > > > This solution is inferior because `grep -c` only reports the number of lines matched. > > The total number of matches reported by this method will be lower if there is more > > than one match per line. > > > > Perceptive observers may have noticed that character names sometimes appear in all-uppercase > > in chapter titles (e.g. 'MEG GOES TO VANITY FAIR'). > > If you wanted to count these as well, you could add the `-i` option for case-insensitivity > > (though in this case, it doesn't affect the answer to which sister is mentioned > > most frequently).
uk: > > Ви з другом щойно закінчили читати "Маленьких жінок" > Луїзи Мей Елкотт і сперечаєтеся. З чотирьох сестер у книзі, > Джо, Мег, Бет та Емі, ваш друг вважає, що про Джо > найчастіше згадується. Ви, однак, впевнені, що це була Емі. На щастя, у вас > є файл `LittleWomen.txt`, який містить повний текст роману > (`shell-lesson-data/exercise-data/writing/LittleWomen.txt`). > Використовуючи цикл `for`, як ви виведете в таблицю кількість разів, коли кожна > з чотирьох сестер згадується? > > Підказка: одне рішення може використовувати > команди `grep`, `wc` та `|`, а інше може використовувати > опції `grep`. > Часто існує більше ніж один спосіб розв'язання задачі програмування, тому > конкретний спосіб зазвичай обирається на основі комбінації > отримання правильного результату, елегантності, читабельності та швидкості. > > > ## Розв'язання > > ``` > > for sis in Jo Meg Beth Amy > > do > > echo $sis: > > grep -ow $sis LittleWomen.txt | wc -l > > done > > ``` > > {: .source} > > > > Альтернативне, трохи гірше рішення: > > ``` > > for sis in Jo Meg Beth Amy > > do > > echo $sis: > > grep -ocw $sis LittleWomen.txt > > done > > ``` > > {: .source} > > > > Це рішення є гіршим, оскільки `grep -c` повідомляє лише про кількість знайдених рядків. > > Загальна кількість збігів, отриманих за допомогою цього методу, буде меншою, якщо на один рядок припадає більше, > > ніж один збіг. > > > > Уважні спостерігачі могли помітити, що імена персонажів іноді з'являються з великої літери > > у назвах розділів (наприклад, "MEG GOES TO VANITY FAIR"). > > Якщо ви хочете врахувати і ці випадки, ви можете додати опцію `-i` для нечутливості до регістру. > > (хоча в цьому випадку це не впливає на відповідь, яка сестра згадується > > найчастіше).

source: While `grep` finds lines in files, the `find` command finds files themselves. Again, it has a lot of options; to show how the simplest ones work, we'll use the `shell-lesson-data/exercise-data` directory tree shown below.
uk: У той час як `grep` знаходить рядки у файлах, команда `find` знаходить самі файли. Знову ж таки, у неї є багато опцій; щоб показати, як працюють найпростіші з них, ми скористаємося деревом каталогів `shell-lesson-data/exercise-data`, що наведено нижче.

source: The `exercise-data` directory contains one file, `numbers.txt` and four directories: `animal-counts`, `creatures`, `proteins` and `writing` containing various files.
uk: Каталог `exercise-data` містить один файл `numbers.txt` та чотири каталоги: `animal-counts`, `creatures`, `proteins` і `writing`, які містять різні файли.

source: For our first command, let's run `find .` (remember to run this command from the `shell-lesson-data/exercise-data` folder).
uk: Для нашої першої команди давайте виконаємо `find .` (не забудьте запустити цю команду з каталогу `shell-lesson-data/exercise-data`).

source: As always, the `.` on its own means the current working directory, which is where we want our search to start. `find`'s output is the names of every file **and** directory under the current working directory. This can seem useless at first but `find` has many options to filter the output and in this lesson we will discover some of them.
uk: Як завжди, символ `.` сам по собі означає поточний робочий каталог, з якого ми хочемо почати пошук. Результатом роботи `find` буде перелік імен усіх файлів **та** каталогів у поточному робочому каталозі. Спочатку це може здатися марним, але `find` має багато можливостей для фільтрації результатів, і у цьому уроці ми розглянемо деякі з них.

source: The first option in our list is `-type d` that means 'things that are directories'. Sure enough, `find`'s output is the names of the five directories (including `.`):
uk: Перший варіант у нашому списку `-type d`, що означає 'елементи, які є каталогами'. Звісно, команда `find` виведе назви п'яти каталогів (включно з `.`):

source: Notice that the objects `find` finds are not listed in any particular order. If we change `-type d` to `-type f`, we get a listing of all the files instead:
uk: Зверніть увагу, що об'єкти, які знаходить `find`, не перераховано у певному порядку. Якщо ми змінимо `-type d` на `-type f`, ми отримаємо список усіх файлів:

source: Now let's try matching by name:
uk: Тепер спробуємо зіставити за іменами:

source: We expected it to find all the text files, but it only prints out `./numbers.txt`. The problem is that the shell expands wildcard characters like `*` *before* commands run. Since `*.txt` in the current directory expands to `./numbers.txt`, the command we actually ran was:
uk: Ми очікували, що будуть знайдені усі текстові файли, але було виведено лише `./numbers.txt`. Проблема полягає у тому, що перед виконанням команд оболонка розширює символи підстановки, такі як `*`. Оскільки `*.txt` у поточному каталозі розширюється до `./numbers.txt`, команда, яку ми виконали, була такою:

source: `find` did what we asked; we just asked for the wrong thing.
uk: Команда `find` зробила те, що ми просили; ми просто просили не те, що треба.

source: To get what we want, let's do what we did with `grep`: put `*.txt` in quotes to prevent the shell from expanding the `*` wildcard. This way, `find` actually gets the pattern `*.txt`, not the expanded filename `numbers.txt`:
uk: Щоб отримати те, що ми хочемо, давайте зробимо те, що ми зробили з `grep`: візьмемо `*.txt` у лапки, щоб оболонка не змогла розкрити шаблон `*`. Таким чином, `find` отримає шаблон `*.txt`, а не розширене ім'я файлу `numbers.txt`:

source: > ## Listing vs. Finding
uk: > ## Порівняння результатів `ls` та `find`

source: > > `ls` and `find` can be made to do similar things given the right options, > but under normal circumstances, > `ls` lists everything it can, > while `find` searches for things with certain properties and shows them.
uk: > > `ls` і `find` можна змусити робити подібні речі за допомогою правильних параметрів, > але за звичайних обставин, > `ls` перелічує все, що може, > тоді як `find` шукає речі з певними властивостями і показує їх.

source: As we said earlier, the command line's power lies in combining tools. We've seen how to do that with pipes; let's look at another technique. As we just saw, `find . -name "*.txt"` gives us a list of all text files in or below the current directory. How can we combine that with `wc -l` to count the lines in all those files?
uk: Як ми вже говорили раніше, сила командного рядка полягає у комбінуванні інструментів. Ми бачили, як це можна зробити з каналами; давайте подивимося на іншу техніку. Як ми щойно бачили, `find . -name "*.txt"` дає нам список усіх текстових файлів у поточному каталозі або нижче. Як ми можемо поєднати це з `wc -l`, щоб порахувати рядки у всіх цих файлах?

source: The simplest way is to put the `find` command inside `$()`:
uk: Найпростіший спосіб - помістити команду `find` всередину `$()`:

source: When the shell executes this command, the first thing it does is run whatever is inside the `$()`. It then replaces the `$()` expression with that command's output. Since the output of `find` is the three filenames `./writing/LittleWomen.txt`, `./writing/haiku.txt`, and `./numbers.txt`, the shell constructs the command:
uk: Коли термінал виконуватиме цю команду, перше, що він зробить, це виконає все, що міститься у виразі `$()`. Потім він замінить вираз `$()` на результати виконання цієї команди. Оскільки результатом команди `find` є три файли `./writing/LittleWomen.txt`, `./writing/haiku.txt` і `./numbers.txt`, термінал сконструює команду:

source: which is what we wanted. This expansion is exactly what the shell does when it expands wildcards like `*` and `?`, but lets us use any command we want as our own 'wildcard'.
uk: що ми і хотіли. Таке розширення виконує саме те, що робить термінал, коли розширює такі символи, як `*` та `?`, але дозволяє нам використовувати будь-яку команду як власну "шаблонну".

source: It's very common to use `find` and `grep` together. The first finds files that match a pattern; the second looks for lines inside those files that match another pattern. Here, for example, we can find txt files that contain the word "searching" by looking for the string 'searching' in all the `.txt` files in the current directory:
uk: Дуже часто `find` і `grep` використовують разом. Перша знаходить файли, які відповідають певному шаблону; другий шукає рядки всередині цих файлів, які відповідають іншому шаблону. Наприклад, ми можемо знайти txt-файли, які містять слово "searching" шляхом пошуку рядка 'searching' у всіх файлах `.txt` у поточному каталозі:

source: > ## Matching and Subtracting
uk: > ## Порівняння та віднімання

source: > > The `-v` option to `grep` inverts pattern matching, so that only lines > which do *not* match the pattern are printed. Given that, which of > the following commands will find all .dat files in `creatures` > except `unicorn.dat`? > Once you have thought about your answer, you can test the commands in the > `shell-lesson-data/exercise-data` directory. > > 1. `find creatures -name "*.dat" | grep -v unicorn` > 2. `find creatures -name *.dat | grep -v unicorn` > 3. `grep -v "unicorn" $(find creatures -name "*.dat")` > 4. None of the above. > > > ## Solution > > Option 1. is correct. Putting the match expression in quotes prevents the shell > > expanding it, so it gets passed to the `find` command. > > > > Option 2 is also works in this instance because the shell tries to expand `*.dat` > > but there are no `*.dat` files in the current directory, > > so the wildcard expression gets passed to `find`. > > We first encountered this in > > [episode 3]({{ page.root }}{% link _episodes/03-create.md %}/#wildcards). > > > > Option 3 is incorrect because it searches the contents of the files for lines which > > do not match 'unicorn', rather than searching the file names.
uk: > > Параметр `-v` до `grep` інвертує відповідність шаблону, щоб виводилися лише рядки, > які *не* збігаються з шаблоном. Враховуючи це, яка з > наступних команд знайде усі файли .dat у `creatures` > окрім `unicorn.dat`? > Після того, як ви обміркуєте свою відповідь, ви можете протестувати команди у > каталогу `shell-lesson-data/exercise-data`. > > 1. `find creatures -name "*.dat" | grep -v unicorn`. > 2. `find creatures -name *.dat | grep -v unicorn` > 3. `grep -v "unicorn" $(find creatures -name "*.dat")` > 4. Нічого з перерахованого вище. > > > ## Розв'язання > > Варіант 1 правильний. Взяття виразу збігу у лапки запобігає тому, щоб термінал > > розгортав його перед передачею команді `find`. > > > > Варіант 2 також працює у цьому випадку, оскільки термінал намагається розгорнути `*.dat`. > > але у поточному каталозі немає файлів `*.dat`, > > тому вираз підстановки буде передано до `find`. > > Вперше ми зіткнулися з цим у > > [епізоді 3] ({{ page.root }}{% link _episodes/03-create.md %}/#підстановочні-символи). > > > > Варіант 3 є неправильним, оскільки він шукає у вмісті файлів рядки, які > > не збігаються зі словом 'unicorn', а не імена файлів.

source: > ## Binary Files
uk: > ## Двійкові файли

source: > > We have focused exclusively on finding patterns in text files. What if > your data is stored as images, in databases, or in some other format? > > A handful of tools extend `grep` to handle a few non text formats. But a > more generalizable approach is to convert the data to text, or > extract the text-like elements from the data. On the one hand, it makes simple > things easy to do. On the other hand, complex things are usually impossible. For > example, it's easy enough to write a program that will extract X and Y > dimensions from image files for `grep` to play with, but how would you > write something to find values in a spreadsheet whose cells contained > formulas? > > A last option is to recognize that the shell and text processing have > their limits, and to use another programming language. > When the time comes to do this, don't be too hard on the shell: many > modern programming languages have borrowed a lot of > ideas from it, and imitation is also the sincerest form of praise.
uk: > > Ми зосередилися виключно на пошуку шаблонів у текстових файлах. Що робити, якщо > ваші дані зберігаються у вигляді зображень, баз даних або в іншому форматі? > > Кілька утиліт розширюють `grep` для роботи з деякими нетекстовими форматами. Але > більш узагальненим підходом є перетворення даних у текст, або > вилучення текстових елементів з даних. З одного боку, це робить прості > речі легкими для виконання. З іншого боку, складні речі, як правило, неможливі. Наприклад, > досить легко написати програму, яка буде витягувати > розміри X та Y з файлів зображень, щоб `grep` міг погратися з ними, але як би ви > написати щось для пошуку значень у електронній таблиці, клітинки якої містять > формули? > > Останній варіант - визнати, що термінал і обробка тексту мають > свої межі, і використовувати іншу мову програмування. > Коли прийде час це зробити, не будьте надто суворими до терміналу: багато > сучасних мов програмування запозичили багато > ідей з нього, а наслідування також є найщирішою формою похвали.

source: The Unix shell is older than most of the people who use it. It has survived so long because it is one of the most productive programming environments ever created --- maybe even *the* most productive. Its syntax may be cryptic, but people who have mastered it can experiment with different commands interactively, then use what they have learned to automate their work. Graphical user interfaces may be easier to use at first, but once learned, the productivity in the shell is unbeatable. And as Alfred North Whitehead wrote in 1911, 'Civilization advances by extending the number of important operations which we can perform without thinking about them.'
uk: Термінал Unix старіший за більшість людей, які нею користуються. Він проіснував так довго, тому що це одне з найпродуктивніших середовищ для програмування, коли-небудь створених - можливо, навіть *найпродуктивнішим*. Його синтаксис може бути незрозумілим, але люди, які його опанували, можуть експериментувати з різними командами в інтерактивному режимі, а потім використовувати те, чого вони навчилися, для автоматизації своєї роботи. Графічні інтерфейси користувача можуть бути простішими у використанні спочатку, але після того, як після опанування терміналу, продуктивність роботи в ньому буде неперевершеною. І як писав Альфред Норт Уайтхед у 1911 році: "Цивілізація розвивається шляхом збільшення кількості важливих операцій, які ми можемо виконувати, не замислюючись про них".

source: > ## `find` Pipeline Reading Comprehension
uk: > ## Розуміння читання конвеєру `find`

source: > Write a short explanatory comment for the following shell script:
uk: > Напишіть короткий пояснювальний коментар до наступного скрипту термінала:

source: > > ~~~ > wc -l $(find . -name "*.dat") | sort -n > ~~~ > {: .language-bash} > > > ## Solution > > 1. Find all files with a `.dat` extension recursively from the current directory > > 2. Count the number of lines each of these files contains > > 3. Sort the output from step 2. numerically
uk: > > ~~~ > wc -l $(find . -name "*.dat") | sort -n > ~~~ > {: .language-bash} > > > ## Розв'язання > > 1. Рекурсивно знайти всі файли з розширенням `.dat` у поточному каталозі > > 2. Підрахувати кількість рядків у кожному з цих файлів > > 3. Відсортувати вивід з пункту 2. за числовим значенням

source: --- layout: page title: About ---
uk: --- layout: page title: Про курс ---

source: --- layout: page title: "Discussion" ---
uk: --- layout: page title: "Обговорення" ---

source: ## Alphabet Soup
uk: ## Алфавітний суп
