Repository: carpentries-i18n/i18n
Catalog: po/shell-novice.*.po
Languages: uk

source: `-a` stands for 'show all' (including hidden files); it forces `ls` to show us file and directory names that begin with `.`, such as `..` (which, if we're in `/Users/nelle`, refers to the `/Users` directory). As you can see, it also displays another special directory that's just called `.`, which means 'the current working directory'. It may seem redundant to have a name for it, but we'll see some uses for it soon.
uk: `-a` означає 'показати все' (англ. show all) (включно з прихованими файлами); опція змушує `ls` показувати нам імена файлів і каталогів, які починаються з `.`, наприклад, `..` (яке, якщо ми знаходимося у `/Users/nelle`, вказує на каталог `/Users`). Як ви можете бачити, команда також показує ще один спеціальний каталог, який називається `.`, що означає 'поточний робочий каталог'. Може здатися, що це дещо надлишково - мати для нього ім'я, але незабаром ми побачимо, як воно може бути використано.

source: Note that in most command line tools, multiple options can be combined with a single `-` and no spaces between the options: `ls -F -a` is equivalent to `ls -Fa`.
uk: Зауважте, що у більшості інструментів командного рядка можна комбінувати декілька параметрів за допомогою одного `-` і без пробілів між параметрами: `ls -F -a` є еквівалентним до `ls -Fa`.

source: > ## Other Hidden Files
uk: > ## Інші приховані файли

source: > > In addition to the hidden directories `..` and `.`, you may also see a file > called `.bash_profile`. This file usually contains shell configuration > settings. You may also see other files and directories beginning > with `.`. These are usually files and directories that are used to configure > different programs on your computer. The prefix `.` is used to prevent these > configuration files from cluttering the terminal when a standard `ls` command > is used.
uk: > > Крім прихованих каталогів `..` і `.`, ви також можете побачити файл > який називається `.bash_profile`. Цей файл зазвичай містить конфігурацію терміналу > Ви також можете побачити інші файли і каталоги, що починаються > з `.`. Зазвичай це файли і каталоги, які використовуються для налаштування > різних програм на вашому комп'ютері. Префікс `.` використовується для того, щоб ці > конфігураційні файли не захаращували термінал, коли використовується стандартна команда `ls`.

source: These three commands are the basic commands for navigating the filesystem on your computer: `pwd`, `ls`, and `cd`. Let's explore some variations on those commands. What happens if you type `cd` on its own, without giving a directory?
uk: Ці три команди є основними командами для навігації по файловій системі на вашому комп'ютері: `pwd`, `ls` і `cd`. Давайте розглянемо деякі варіації цих команд. Що станеться якщо ви введете команду `cd` саму по собі, без зазначення каталогу?

source: How can you check what happened? `pwd` gives us the answer!
uk: Як ви можете перевірити, що сталося? Команда `pwd` дає нам відповідь!

source: It turns out that `cd` without an argument will return you to your home directory, which is great if you've got lost in your own filesystem.
uk: Виявляється, `cd` без аргументу поверне вас до домашнього каталогу, що дуже зручно, якщо ви загубилися у власній файловій системі.

source: Let's try returning to the `exercise-data` directory from before. Last time, we used three commands, but we can actually string together the list of directories to move to `exercise-data` in one step:
uk: Спробуємо повернутися до каталогу `exercise-data` з попереднього. Минулого разу ми використовували три команди, але насправді ми можемо поєднати перелік каталогів для переходу до каталогу `exercise-data` за один крок:

source: Check that we've moved to the right place by running `pwd` and `ls -F`.
uk: Переконайтеся, що ми перемістилися в потрібне місце, виконавши `pwd` і `ls -F`.

source: If we want to move up one level from the data directory, we could use `cd ..`. But there is another way to move to any directory, regardless of your current location.
uk: Якщо ми хочемо перейти на один рівень вище від каталогу даних, ми можемо використати `cd ..`. Але існує інший спосіб переміщення до будь-якого каталогу, незалежно від вашого поточного розташування.

source: So far, when specifying directory names, or even a directory path (as above), we have been using **relative paths**. When you use a relative path with a command like `ls` or `cd`, it tries to find that location from where we are, rather than from the root of the file system.
uk: Дотепер, коли ми вказували імена каталогів або навіть шлях до каталогів (як описано вище), ми використовували **відносні шляхи**. Коли ви використовуєте відносний шлях за допомогою команди на кшталт `ls` або `cd`, вона намагається знайти це місце з того місця, де ми перебуваємо, а не з кореня файлової системи.

source: However, it is possible to specify the **absolute path** to a directory by including its entire path from the root directory, which is indicated by a leading slash. The leading `/` tells the computer to follow the path from the root of the file system, so it always refers to exactly one directory, no matter where we are when we run the command.
uk: Втім, можна зазначити **абсолютний шлях** до каталогу за допомогою включивши до нього повний шлях від кореневого каталогу, який позначається символом скісної риски (слешу). Символ `/` на початку абсолютного шляху вказує комп'ютеру йти за шляхом від кореня файлової системи, тому він завжди вказує лише на один і той самий каталог, незалежно від того, де ми знаходимося під час виконання команди.

source: This allows us to move to our `shell-lesson-data` directory from anywhere on the filesystem (including from inside `exercise-data`). To find the absolute path we're looking for, we can use `pwd` and then extract the piece we need to move to `shell-lesson-data`.
uk: Це дає змогу перейти до каталогу `shell-lesson-data` з будь-якого місця у файловій системі файлової системи (у тому числі з каталогу `exercise-data`). Щоб знайти абсолютний шлях ми можемо скористатися `pwd`, а потім витягти потрібний нам фрагмент, шоб перейти до `shell-lesson-data`.

source: Run `pwd` and `ls -F` to ensure that we're in the directory we expect.
uk: Виконайте `pwd` і `ls -F`, щоб переконатися, що ми знаходимося в потрібному каталозі.

source: > ## Two More Shortcuts
uk: > ## Ще два скорочення

source: > > The shell interprets a tilde (`~`) character at the start of a path to > mean "the current user's home directory". For example, if Nelle's home > directory is `/Users/nelle`, then `~/data` is equivalent to > `/Users/nelle/data`. This only works if it is the first character in the > path: `here/there/~/elsewhere` is *not* `here/there/Users/nelle/elsewhere`. > > Another shortcut is the `-` (dash) character. `cd` will translate `-` into > *the previous directory I was in*, which is faster than having to remember, > then type, the full path. This is a *very* efficient way of moving > *back and forth between two directories* -- i.e. if you execute `cd -` twice, > you end up back in the starting directory. > > The difference between `cd ..` and `cd -` is > that the former brings you *up*, while the latter brings you *back*. > > ---- > Try it! > First navigate to `~/Desktop/shell-lesson-data` (you should already be there). > ~~~ > $ cd ~/Desktop/shell-lesson-data > ~~~ > {: .language-bash} > > Then `cd` into the `exercise-data/creatures` directory > ~~~ > $ cd exercise-data/creatures > ~~~ > {: .language-bash} > > Now if you run > ~~~ > $ cd - > ~~~ > {: .language-bash} > you'll see you're back in `~/Desktop/shell-lesson-data`. > Run `cd -` again and you're back in `~/Desktop/shell-lesson-data/exercise-data/creatures`
uk: > > Термінал інтерпретує символ тильди (`~`) на початку шляху як > "домашній каталог поточного користувача". Наприклад, якщо домашнім каталогом користувача Неллі > є каталог `/Users/nelle`, то `~/data` еквівалентно > `/Users/nelle/data`. Це працює лише у випадку, якщо це перший символ у > шляху: `here/there/~/elsewhere` *не* дорівнює `here/there/Users/nelle/elsewhere`. > > Іншим скороченням є символ `-` (тире). `cd` транслює `-` у > *попередній каталог, у якому я був*, що швидше, ніж запам'ятовувати, > а потім набирати повний шлях. Це *дуже* ефективний спосіб переміщення > *вперед і назад між двома каталогами* - тобто, якщо ви виконаєте `cd -` двічі, > ви повернетесь до початкового каталогу. > > Різниця між `cd ..` і `cd -` полягає в тому, > що перший повертає вас *вгору*, тоді як другий повертає вас *назад*. > > ---- > Спробуйте! > Спочатку перейдіть до `~/Desktop/shell-lesson-data` (ви вже маєте бути там). > ~~~ > $ cd ~/Desktop/shell-lesson-data > ~~~ > {: .language-bash} > > Потім `cd` у каталог `exercise-data/creatures`. > ~~~ > $ cd exercise-data/creatures > ~~~ > {: .language-bash} > > Тепер, якщо ви виконаєте > ~~~ > $ cd - > ~~~ > {: .language-bash} > ви побачите, що повернулися до `~/Desktop/shell-lesson-data`. > Запустіть `cd -` ще раз і ви повернетесь до `~/Desktop/shell-lesson-data/exercise-data/creatures`.

source: > ## Absolute vs Relative Paths
uk: > ## Абсолютні та відносні шляхи

source: > > Starting from `/Users/amanda/data`, > which of the following commands could Amanda use to navigate to her home directory, > which is `/Users/amanda`? > > 1. `cd .` > 2. `cd /` > 3. `cd /home/amanda` > 4. `cd ../..` > 5. `cd ~` > 6. `cd home` > 7. `cd ~/data/..` > 8. `cd` > 9. `cd ..` > > > ## Solution > > 1. No: `.` stands for the current directory. > > 2. No: `/` stands for the root directory. > > 3. No: Amanda's home directory is `/Users/amanda`. > > 4. No: this command goes up two levels, i.e. ends in `/Users`. > > 5. Yes: `~` stands for the user's home directory, in this case `/Users/amanda`. > > 6. No: this command would navigate into a directory `home` in the current directory > > if it exists. > > 7. Yes: unnecessarily complicated, but correct. > > 8. Yes: shortcut to go back to the user's home directory. > > 9. Yes: goes up one level.
uk: > > Починаючи з `/Users/amanda/data`, > яку з наведених нижче команд Аманда може використати для переходу до свого домашнього каталогу, > тобто `/Users/amanda`? > > 1. `cd .` > 2. `cd /` > 3. `cd /home/amanda`. > 4. `cd ../..` > 5. `cd ~` > 6. `cd home` > 7. `cd ~/data/..` > 8. `cd` > 9. `cd ..` > > > ## Розв'язання > > 1. Ні: скорочення `.` означає поточний каталог. > > 2. Ні: скорочення `/` означає кореневий каталог. > > 3. Ні: домашнім каталогом Аманди є `/Users/amanda`. > > 4. Ні: ця команда піднімається на два рівні, тобто закінчується на `/Users`. > > 5. Так: скорочення `~` позначає домашній каталог користувача, у цьому випадку `/Users/amanda`. > > 6. Ні: ця команда виконає перехід до каталогу `home` у поточному каталозі > > якщо він існує. > > 7. Так: надмірно складна, але правильна. > > 8. Так: комбінація клавіш для повернення до домашнього каталогу користувача. > > 9. Так: піднімається на один рівень.

source: > ## Relative Path Resolution
uk: > ## Розв'язання відносного шляху

source: > > Using the filesystem diagram below, if `pwd` displays `/Users/thing`, > what will `ls -F ../backup` display? > > 1. `../backup: No such file or directory` > 2. `2012-12-01 2013-01-08 2013-01-27` > 3. `2012-12-01/ 2013-01-08/ 2013-01-27/` > 4. `original/ pnas_final/ pnas_sub/` > > ![A directory tree below the Users directory where "/Users" contains the directories "backup" and "thing"; "/Users/backup" contains "original", "pnas_final" and "pnas_sub"; "/Users/thing" contains "backup"; and "/Users/thing/backup" contains "2012-12-01", "2013-01-08" and "2013-01-27"](../fig/filesystem-challenge.svg) > > > ## Solution > > 1. No: there *is* a directory `backup` in `/Users`. > > 2. No: this is the content of `Users/thing/backup`, > > but with `..`, we asked for one level further up. > > 3. No: see previous explanation. > > 4. Yes: `../backup/` refers to `/Users/backup/`.
uk: > > Використовуючи наведену нижче схему файлової системи, якщо `pwd` показує `/Users/thing`, > що покаже команда `ls -F ../backup`? > > 1. `../backup: Не існує такого файлу або каталогу` > 2. `2012-12-01 2013-01-08 2013-01-27` > 3. `2012-12-01/ 2013-01-08/ 2013-01-27/` > 4. `original/ pnas_final/ pnas_sub/` > > ![Дерево каталогів під каталогом Users, де "/Users" містить каталоги "backup" і "thing"; "/Users/backup" містить "original", "pnas_final" та "pnas_sub"; "/Users/thing" містить "backup"; та "/Users/thing/backup" містить "2012-12-01", "2013-01-08" та "2013-01-27"](../fig/filesystem-challenge.svg) > > > Розв'язання > > 1. Ні: у каталозі `/Users` існує каталог `backup`. > > 2. Ні: це вміст каталогу `Users/thing/backup`, > > але за допомогою `..` ми просили піднятися на один рівень вище. > > 3. Ні: див. попереднє пояснення. > > 4. Так: `../backup/` вказує на `/Users/backup/`.

source: > ## `ls` Reading Comprehension
uk: > ## Розуміння прочитаного про команду `ls`

source: > > Using the filesystem diagram below, > if `pwd` displays `/Users/backup`, > and `-r` tells `ls` to display things in reverse order, > what command(s) will result in the following output: > > ~~~ > pnas_sub/ pnas_final/ original/ > ~~~
uk: > > Використовуючи схему файлової системи, наведену нижче, > якщо `pwd` показує `/Users/backup`, > а `-r` каже `ls` виводити все у зворотному порядку, > яка команда (команди) призведе до наступного виводу: > > ~~~ > pnas_sub/ pnas_final/ original/ > ~~~

source: > > ![A directory tree below the Users directory where "/Users" contains the directories "backup" and "thing"; "/Users/backup" contains "original", "pnas_final" and "pnas_sub"; "/Users/thing" contains "backup"; and "/Users/thing/backup" contains "2012-12-01", "2013-01-08" and "2013-01-27"](../fig/filesystem-challenge.svg) > > 1. `ls pwd` > 2. `ls -r -F` > 3. `ls -r -F /Users/backup` > > > ## Solution > > 1. No: `pwd` is not the name of a directory. > > 2. Yes: `ls` without directory argument lists files and directories > > in the current directory. > > 3. Yes: uses the absolute path explicitly.
uk: > > ![Дерево каталогів під каталогом Users, де "/Users" містить каталоги "backup" та "thing"; "/Users/backup" містить "original", "pnas_final" та "pnas_sub"; "/Users/thing" містить "backup"; та "/Users/thing/backup" містить "2012-12-01", "2013-01-08" та "2013-01-27"](../fig/filesystem-challenge.svg) > > 1. `ls pwd` > 2. `ls -r -F` > 3. `ls -r -F /Users/backup` > > > ## Рішення > > 1. Ні: `pwd` не є назвою каталогу. > > 2. Так: команда `ls` без аргументу каталогу перелічує файли і каталоги > > у поточному каталозі. > > 3. Так: явно використовує абсолютний шлях.

source: ## General Syntax of a Shell Command
uk: ## Загальний синтаксис команди терміналу

source: We have now encountered commands, options, and arguments, but it is perhaps useful to formalise some terminology.
uk: Ми вже познайомилися з командами, опціями та аргументами, але, можливо, буде корисно формалізувати деяку термінологію.

source: Consider the command below as a general example of a command, which we will dissect into its component parts:
uk: Розглянемо команду нижче як загальний приклад команди, яку ми розберемо на складові частини:

source: ![General syntax of a shell command](../fig/shell_command_syntax.svg)
uk: ![Загальний синтаксис команди терміналу](../fig/shell_command_syntax.svg)

source: `ls` is the **command**, with an **option** `-F` and an **argument** `/`. We've already encountered options which either start with a single dash (`-`) or two dashes (`--`), and they change the behavior of a command. [Arguments] tell the command what to operate on (e.g. files and directories). Sometimes options and arguments are referred to as **parameters**. A command can be called with more than one option and more than one argument, but a command doesn't always require an argument or an option.
uk: `ls` - це **команда**, з **опцією** `-F` та **аргументом** `/`. Ми вже зустрічалися з опціями, які починаються з одного тире (`-`) або двох тире (`--`), і вони змінюють поведінку команди. [Аргументи] вказують команді, з чим працювати (наприклад, з файлами і каталогами). Іноді опції та аргументи називають **параметрами**. Команду можна викликати з більш ніж одним параметром і більш ніж одним аргументом, але команда не завжди вимагає наявності аргументу або параметра.

source: You might sometimes see options being referred to as **switches** or **flags**, especially for options that take no argument. In this lesson we will stick with using the term *option*.
uk: Іноді ви можете побачити, що опції називають **перемикачами** або **прапорами**, особливо для параметрів, які не потребують аргументації. У цьому уроці ми будемо дотримуватися терміну *опція*.

source: Each part is separated by spaces: if you omit the space between `ls` and `-F` the shell will look for a command called `ls-F`, which doesn't exist. Also, capitalization can be important. For example, `ls -s` will display the size of files and directories alongside the names, while `ls -S` will sort the files and directories by size, as shown below:
uk: Кожна частина відокремлюється пробілами: якщо ви пропустите пробіл між `ls` і `-F`, термінал шукатиме команду з назвою `ls-F`, якої не існує. Також може бути важливим написання великої літери. Наприклад, `ls -s` покаже розмір файлів і каталогів поряд з назвами, а `ls -S` відсортує файли і каталоги за розміром, як показано нижче:

source: Note that the sizes returned by `ls -s` are in *blocks*. As these are defined differently for different operating systems, you may not obtain the same figures as in the example.
uk: Зверніть увагу, що розміри, які повертає команда `ls -s`, подано у *блоках*. Оскільки вони визначаються по-різному для різних операційних систем, ви можете отримати не такі значення, як у прикладі.

source: Putting all that together, our command above gives us a listing of files and directories in the root directory `/`. An example of the output you might get from the above command is given below:
uk: Зібравши все це разом, наша команда вище дасть нам список файлів і каталогів у кореневому каталозі `/`. Приклад результату, який ви можете отримати за допомогою наведеної вище команди, наведено нижче:

source: ### Nelle's Pipeline: Organizing Files
uk: ### Конвеєр Неллі: Організація файлів

source: Knowing this much about files and directories, Nelle is ready to organize the files that the protein assay machine will create.
uk: Знаючи так багато про файли та каталоги, Неллі готова впорядкувати файли, які створить машина для аналізу білків.

source: She creates a directory called `north-pacific-gyre` (to remind herself where the data came from), which will contain the data files from the assay machine, and her data processing scripts.
uk: Вона створює каталог під назвою `north-pacific-gyre`. (щоб нагадати собі, звідки взялися дані), яка міститиме файли даних з аналітичної машини, та її скрипти для обробки даних.

source: Each of her physical samples is labelled according to her lab's convention with a unique ten-character ID, such as 'NENE01729A'. This ID is what she used in her collection log to record the location, time, depth, and other characteristics of the sample, so she decides to use it as part of each data file's name. Since the assay machine's output is plain text, she will call her files `NENE01729A.txt`, `NENE01812A.txt`, and so on. All 1520 files will go into the same directory.
uk: Кожен її фізичний зразок маркується згідно з прийнятими в лабораторії правилами з унікальним десятисимвольним ідентифікатором, наприклад, "NENE01729A". Цей ідентифікатор вона використовує у своєму журналі збору зразків для запису місця, часу, глибини та інших характеристик зразка, тому вона вирішила використовувати його як частину імені кожного файлу даних. Оскільки результат роботи аналізатора є звичайним текстом, вона назве свої файли `NENE01729A.txt`, `NENE01812A.txt` і так далі. Усі 1520 файлів буде збережено в одному каталозі.

source: Now in her current directory `shell-lesson-data`, Nelle can see what files she has using the command:
uk: Тепер у її поточному каталозі `shell-lesson-data`, Нелл може побачити, які файли вона має за допомогою цієї команди:

source: This command is a lot to type, but she can let the shell do most of the work through what is called **tab completion**. If she types:
uk: Для введення цієї команди потрібно багато набирати на клавіатурі, але вона може дозволити терміналу виконати більшу частину роботи за допомогою так званого **завершення табуляції**. Якщо вона небере:

source: and then presses <kbd>Tab</kbd> (the tab key on her keyboard), the shell automatically completes the directory name for her:
uk: а потім натискає клавішу <kbd>Tab</kbd> (клавішу табуляції на її клавіатурі), оболонка автоматично доповнить назву каталогу для неї:

source: Pressing <kbd>Tab</kbd> again does nothing, since there are multiple possibilities; pressing <kbd>Tab</kbd> twice brings up a list of all the files.
uk: Повторне натискання клавіші <kbd>Tab</kbd> нічого не дасть, оскільки існує декілька варіантів; якщо натиснути <kbd>Tab</kbd> двічі, буде показано список усіх файлів.

source: If Nelle adds <kbd>G</kbd> and presses <kbd>Tab</kbd> again, the shell will append 'goo' since all files that start with 'g' share the first three characters 'goo'.
uk: Якщо Неллі додасть <kbd>G</kbd> і знову натисне <kbd>Tab</kbd>, оболонка додасть 'goo', оскільки всі файли, що починаються з 'g', мають спільні перші три символи 'goo'.

source: To see all of those files, she can press <kbd>Tab</kbd> twice more. ~~~ ls north-pacific-gyre/goo goodiff.sh goostats.sh ~~~ {: .language-bash}
uk: Щоб побачити всі ці файли, вона може натиснути клавішу <kbd>Tab</kbd> ще двічі. ~~~ ls north-pacific-gyre/goo goodiff.sh goostats.sh ~~~ {: .language-bash}

source: This is called **tab completion**, and we will see it in many other tools as we go on.
uk: Це називається **завершення табуляції**, і ми побачимо його у багатьох інших інструментах.

source: [Arguments]: https://swcarpentry.github.io/shell-novice/reference.html#argument
uk: [Аргументи]: https://swcarpentry.github.io/shell-novice/reference.html#argument
