Repository: carpentries-i18n/i18n
Catalog: po/shell-novice.*.po
Languages: uk

source: > > Suppose we want to set up a directory structure to organize > some experiments measuring reaction rate constants with different compounds > *and* different temperatures. What would be the > result of the following code: > > ~~~ > $ for species in cubane ethane methane > > do > > for temperature in 25 30 37 40 > > do > > mkdir $species-$temperature > > done > > done > ~~~ > {: .language-bash} > > > ## Solution > > We have a nested loop, i.e. contained within another loop, so for each species > > in the outer loop, the inner loop (the nested loop) iterates over the list of > > temperatures, and creates a new directory for each combination. > > > > Try running the code for yourself to see which directories are created!
uk: > > Припустімо, що ми хочемо створити структуру каталогів для організації > певних експериментів з вимірювання констант швидкості реакції з різними сполуками > *та* різними температурами. Яким буде > результат виконання наступного коду: > > ~~~ > $ for species in cubane ethane methane > > do > > for temperature in 25 30 37 40 > > do > > mkdir $species-$temperature > > done > > done > ~~~ > {: .language-bash} > > > ## Розв'язання > > Ми маємо вкладений цикл, тобто такий, що міститься в іншому циклі, тому для кожного значення змінної species > > у зовнішньому циклі внутрішній цикл (вкладений цикл) перебирає список > > температур і створює новий каталог для кожної комбінації. > > > > Спробуйте запустити код самостійно, щоб побачити, які каталоги буде створено!

source: --- title: "Shell Scripts" teaching: 30 exercises: 15 questions: - "How can I save and re-use commands?" objectives: - "Write a shell script that runs a command or series of commands for a fixed set of files." - "Run a shell script from the command line." - "Write a shell script that operates on a set of files defined by the user on the command line." - "Create pipelines that include shell scripts you, and others, have written." keypoints: - "Save commands in files (usually called shell scripts) for re-use." - "`bash [filename]` runs the commands saved in a file." - "`$@` refers to all of a shell script's command-line arguments." - "`$1`, `$2`, etc., refer to the first command-line argument, the second command-line argument, etc." - "Place variables in quotes if the values might have spaces in them." - "Letting users decide what files to process is more flexible and more consistent with built-in Unix commands." ---
uk: --- title: "Скрипти терміналу" teaching: 30 exercises: 15 questions: - "Як я можу зберігати і повторно використовувати команди?" objectives: - "Написати сценарій терміналу, який виконує команду або серію команд для фіксованого набору файлів." - "Запустити сценарій терміналу з командного рядка." - "Написати сценарій терміналу, який оперує набором файлів, заданих користувачем у командному рядку." - "Створити конвеєри, які включають написані вами та іншими користувачами скрипти терміналу." keypoints: - "Зберігайте команди у файлах (зазвичай їх називають скриптами терміналу) для повторного використання." - "`bash [ім'я файлу]` виконує команди, збережені у відповідному файлі." - "`$@` посилається на всі аргументи командного рядка скрипта терміналу." - "`$1`, `$2`, і т.д., посилаються на перший аргумент командного рядка, другий аргумент командного рядка і т.д." - "Беріть змінні в лапки, якщо значення можуть містити пробіли." - "Дозвіл користувачам вирішувати, які файли обробляти, є більш гнучким і більш узгодженим з вбудованими командами Unix." ---

source: We are finally ready to see what makes the shell such a powerful programming environment. We are going to take the commands we repeat frequently and save them in files so that we can re-run all those operations again later by typing a single command. For historical reasons, a bunch of commands saved in a file is usually called a **shell script**, but make no mistake: these are actually small programs.
uk: Нарешті ми готові побачити, що робить термінал таким потужним середовищем програмування. Ми збираємося взяти команди, які ми часто повторюємо, і зберегти їх у файлах, щоб згодом ми могли повторно виконати всі ці операції, набравши одну команду. З історичних причин набір команд, збережених у файлі, зазвичай називають **скриптом терміналу**, але не помиліться: насправді це невеликі програми.

source: Not only will writing shell scripts make your work faster --- you won't have to retype the same commands over and over again --- it will also make it more accurate (fewer chances for typos) and more reproducible. If you come back to your work later (or if someone else finds your work and wants to build on it) you will be able to reproduce the same results simply by running your script, rather than having to remember or retype a long list of commands.
uk: Написання командних скриптів не тільки прискорить вашу роботу --- вам не доведеться передруковувати ті самі команди знову і знову --- це також зробить її більш точною (менше шансів на друкарські помилки) і більш відтворюваною. Якщо ви повернетеся до своєї роботи пізніше (або якщо хтось інший знайде вашу роботу і захоче її використати) ви зможете відтворити ті самі результати, просто запустивши ваш скрипт, замість того, щоб запам'ятовувати або передруковувати довгий список команд.

source: Let's start by going back to `proteins/` and creating a new file, `middle.sh` which will become our shell script:
uk: Давайте почнемо з того, що повернемося до каталогу `proteins/` і створимо новий файл `middle.sh`, який стане нашим скриптом терміналу:

source: The command `nano middle.sh` opens the file `middle.sh` within the text editor 'nano' (which runs within the shell). If the file does not exist, it will be created. We can use the text editor to directly edit the file -- we'll simply insert the following line:
uk: Команда `nano middle.sh` відкриває файл `middle.sh` у текстовому редакторі nano (який запускається у терміналі). Якщо файл не існує, його буде створено. Ми можемо скористатися текстовим редактором для безпосереднього редагування файлу - просто вставте наступний рядок:

source: This is a variation on the pipe we constructed earlier: it selects lines 11-15 of the file `octane.pdb`. Remember, we are *not* running it as a command just yet: we are putting the commands in a file.
uk: Це варіація на тему каналу, яку ми побудували раніше: вона вибирає рядки 11-15 файлу `octane.pdb`. Пам'ятайте, що ми поки що *не* запускаємо її як команду: ми записуємо команди у файл.

source: Then we save the file (`Ctrl-O` in nano), and exit the text editor (`Ctrl-X` in nano). Check that the directory `proteins` now contains a file called `middle.sh`.
uk: Потім ми зберігаємо файл (`Ctrl-O` в nano), і виходимо з текстового редактора (`Ctrl-X` у nano). Переконайтеся, що в каталозі `proteins` тепер міститься файл з назвою `middle.sh`.

source: Once we have saved the file, we can ask the shell to execute the commands it contains. Our shell is called `bash`, so we run the following command:
uk: Після того, як ми зберегли файл, ми можемо попросити термінал виконати команди, які у ньому містяться. Наша термінал називається `bash`, тому ми виконаємо наступну команду:

source: Sure enough, our script's output is exactly what we would get if we ran that pipeline directly.
uk: Звісно, вихідні дані нашого скрипта є саме тими, які ми отримали б, якби запустили цей конвеєр напряму.

source: > ## Text vs. Whatever
uk: > ## Текст проти Будь-чого іншого

source: > > We usually call programs like Microsoft Word or LibreOffice Writer "text > editors", but we need to be a bit more careful when it comes to > programming. By default, Microsoft Word uses `.docx` files to store not > only text, but also formatting information about fonts, headings, and so > on. This extra information isn't stored as characters and doesn't mean > anything to tools like `head`: they expect input files to contain > nothing but the letters, digits, and punctuation on a standard computer > keyboard. When editing programs, therefore, you must either use a plain > text editor, or be careful to save files as plain text.
uk: > > Зазвичай ми називаємо такі програми, як Microsoft Word або LibreOffice Writer, "текстовими > редакторами", але потрібно бути трохи обережнішими, коли йдеться про > програмування. За замовчуванням, Microsoft Word використовує файли `.docx` для зберігання не лише > тексту, але й інформації про форматування. > лише тексту, але й інформації про форматування: шрифти, заголовки > тощо. Ця додаткова інформація не зберігається у вигляді символів і не означає > нічого для інструментів типу `head`: вони очікують, що вхідні файли не міститимуть > нічого, окрім літер, цифр і розділових знаків зі стандартної комп'ютерної > клавіатури. Отже, при редагуванні програм вам слід або користуватися звичайним > текстовий редактор, або обережно зберігати файли як звичайний текст.

source: What if we want to select lines from an arbitrary file? We could edit `middle.sh` each time to change the filename, but that would probably take longer than typing the command out again in the shell and executing it with a new file name. Instead, let's edit `middle.sh` and make it more versatile:
uk: А якщо ми хочемо вибрати рядки з довільного файлу? Ми могли б редагувати `middle.sh` кожного разу, щоб змінити назву файлу, але це, ймовірно, займе більше часу, ніж набрати команду знову у командному рядку і виконати її з новим ім'ям файлу. Замість цього давайте відредагуємо `middle.sh` і зробимо його більш універсальним:

source: Now, within "nano", replace the text `octane.pdb` with the special variable called `$1`:
uk: Тепер всередині "nano" замініть текст `octane.pdb` на спеціальну змінну з назвою `$1`:

source: Inside a shell script, `$1` means 'the first filename (or other argument) on the command line'. We can now run our script like this:
uk: Усередині скрипта терміналу `$1` означає 'перше ім'я файлу (або інший аргумент) у командному рядку'. Тепер ми можемо запустити наш скрипт таким чином:

source: or on a different file like this:
uk: або передавши ім'я іншого файлу наступним чином:

source: > ## Double-Quotes Around Arguments
uk: > ## Подвійні лапки навколо аргументів

source: > > For the same reason that we put the loop variable inside double-quotes, > in case the filename happens to contain any spaces, > we surround `$1` with double-quotes.
uk: > > З тієї ж причини, з якої ми взяли змінну циклу у подвійні лапки, > на випадок, якщо ім'я файлу містить пробіли, > ми беремо `$1` у подвійні лапки.

source: Currently, we need to edit `middle.sh` each time we want to adjust the range of lines that is returned. Let's fix that by configuring our script to instead use three command-line arguments. After the first command-line argument (`$1`), each additional argument that we provide will be accessible via the special variables `$1`, `$2`, `$3`, which refer to the first, second, third command-line arguments, respectively.
uk: Наразі нам потрібно редагувати `middle.sh` кожного разу, коли ми хочемо змінити діапазон рядків, які повертаються. Давайте виправимо це, налаштувавши наш скрипт на використання трьох аргументів командного рядка. Після першого аргументу командного рядка (`$1`), кожен наступний аргумент, який ми надаємо, буде доступний через спеціальні змінні `$1`, `$2`, `$3`, які посилаються на перший, другий і третій аргументи командного рядка відповідно.

source: Knowing this, we can use additional arguments to define the range of lines to be passed to `head` and `tail` respectively:
uk: Знаючи це, ми можемо використовувати додаткові аргументи для визначення діапазону рядків, які передавати до `head` та `tail` відповідно:

source: We can now run:
uk: Тепер ми можемо запустити:

source: By changing the arguments to our command we can change our script's behaviour:
uk: Змінюючи аргументи нашої команди, ми можемо змінювати поведінку нашого скрипта:

source: This works, but it may take the next person who reads `middle.sh` a moment to figure out what it does. We can improve our script by adding some **comments** at the top:
uk: Це працює, але наступній людині, яка прочитає `middle.sh`, може знадобитися деякий час, щоб зрозуміти, що він робить. Ми можемо покращити наш скрипт, додавши деякі **коментарі** зверху:

source: ~~~ # Select lines from the middle of a file. # Usage: bash middle.sh filename end_line num_lines head -n "$2" "$1" | tail -n "$3" ~~~
uk: ~~~ # Виділення рядків з середини файлу. # Використання: bash middle.sh filename end_line num_lines head -n "$2" "$1" | tail -n "$3" ~~~

source: A comment starts with a `#` character and runs to the end of the line. The computer ignores comments, but they're invaluable for helping people (including your future self) understand and use scripts. The only caveat is that each time you modify the script, you should check that the comment is still accurate: an explanation that sends the reader in the wrong direction is worse than none at all.
uk: Коментар починається з символу `#` і продовжується до кінця рядка. Комп'ютер ігнорує коментарі, але вони безцінні, оскільки допомагають людям (у тому числі і вам самим у майбутньому) розуміти і використовувати скрипти. Єдине застереження полягає у тому, що кожного разу, коли ви змінюєте скрипт, ви повинні перевіряти, що коментар все ще правильний: Пояснення, яке спрямовує читача в неправильному напрямку, гірше, ніж його відсутність.

source: What if we want to process many files in a single pipeline? For example, if we want to sort our `.pdb` files by length, we would type:
uk: Що робити, якщо ми хочемо обробити багато файлів в одному конвеєрі? Наприклад, якщо ми хочемо відсортувати наші `.pdb`-файли за довжиною, ми введемо:

source: because `wc -l` lists the number of lines in the files (recall that `wc` stands for 'word count', adding the `-l` option means 'count lines' instead) and `sort -n` sorts things numerically. We could put this in a file, but then it would only ever sort a list of `.pdb` files in the current directory. If we want to be able to get a sorted list of other kinds of files, we need a way to get all those names into the script. We can't use `$1`, `$2`, and so on because we don't know how many files there are. Instead, we use the special variable `$@`, which means, 'All of the command-line arguments to the shell script'. We also should put `$@` inside double-quotes to handle the case of arguments containing spaces (`"$@"` is special syntax and is equivalent to `"$1"` `"$2"` ...).
uk: оскільки `wc -l` виводить кількість рядків у файлах (нагадаю, що `wc` означає 'підрахунок слів', додавання опції `-l` означає 'підрахунок рядків') і `sort -n` сортує речі числовим способом. Ми можемо записати це у файл, але тоді він сортуватиме лише список файлів `.pdb` у поточному каталозі. Якщо ми хочемо отримати відсортований список інших типів файлів, нам потрібен спосіб вставити всі ці імена у скрипт. Ми не можемо використовувати `$1`, `$2` і так далі тому що ми не знаємо, скільки файлів існує. Замість цього ми використовуємо спеціальну змінну `$@`, що означає, "Всі аргументи командного рядка для скрипта терміналу". Ми також повинні взяти `$@` у подвійні лапки щоб врахувати випадок, коли аргументи містять пробіли (`"$@"` є спеціальним синтаксисом і він еквівалентний `"$1"` `"$2"` ...).

source: Here's an example:
uk: Ось приклад:

source: ~~~ # Sort files by their length. # Usage: bash sorted.sh one_or_more_filenames wc -l "$@" | sort -n ~~~
uk: ~~~ # Сортує файли за їх розміром. # Використання: bash sorted.sh one_or_more_filenames wc -l "$@" | sort -n ~~~

source: > ## List Unique Species
uk: > ## Перелік унікальних видів

source: > > Leah has several hundred data files, each of which is formatted like this: > > ~~~ > 2013-11-05,deer,5 > 2013-11-05,rabbit,22 > 2013-11-05,raccoon,7 > 2013-11-06,rabbit,19 > 2013-11-06,deer,2 > 2013-11-06,fox,1 > 2013-11-07,rabbit,18 > 2013-11-07,bear,1 > ~~~
uk: > > Лія має кілька сотень файлів даних, кожен з яких відформатований наступним чином: > > ~~~ > 2013-11-05,deer,5 > 2013-11-05,rabbit,22 > 2013-11-05,raccoon,7 > 2013-11-06,rabbit,19 > 2013-11-06,deer,2 > 2013-11-06,fox,1 > 2013-11-07,rabbit,18 > 2013-11-07,bear,1 > ~~~

source: > > An example of this type of file is given in > `shell-lesson-data/exercise-data/animal-counts/animals.csv`. > > We can use the command `cut -d , -f 2 animals.csv | sort | uniq` to produce > the unique species in `animals.csv`. > In order to avoid having to type out this series of commands every time, > a scientist may choose to write a shell script instead. > > Write a shell script called `species.sh` that takes any number of > filenames as command-line arguments, and uses a variation of the above command > to print a list of the unique species appearing in each of those files separately. > > > ## Solution > > > > ``` > > # Script to find unique species in csv files where species is the second data field > > # This script accepts any number of file names as command line arguments > > > > # Loop over all files > > for file in $@ > > do > > echo "Unique species in $file:" > > # Extract species names > > cut -d , -f 2 $file | sort | uniq > > done > > ``` > > {: .language-bash}
uk: > > Приклад файлу такого типу наведено у > `shell-lesson-data/exercise-data/animal-counts/animals.сcsv`. > > Ми можемо скористатися командою `cut -d , -f 2 animals.csv | sort | uniq`, щоб отримати > унікальні види у файлі `animals.csv`. > Щоб уникнути необхідності кожного разу вводити цю серію команд, > науковець може замість цього написати скрипт командного інтерпретатора. > > Напишіть сценарій командного рядка з назвою `species.sh`, який приймає довільну кількість > імен файлів як аргументи командного рядка і використовує варіацію наведеної вище команди > для виведення списку унікальних видів, що з'являються у кожному з цих файлів окремо. > > > > ## Розв'язання > > > > ``` > > # Скрипт для пошуку унікальних видів у csv-файлах, де вид є другим полем даних > > # Цей скрипт приймає будь-яку кількість імен файлів як аргументи командного рядка > > > > # Перебір всіх файлів > > for file in $@ > > do > > echo "Unique species in $file:" > > # Отримати назви видів > > cut -d , -f 2 $file | sort | uniq > > done > > ``` > > {: .language-bash}

source: Suppose we have just run a series of commands that did something useful --- for example, that created a graph we'd like to use in a paper. We'd like to be able to re-create the graph later if we need to, so we want to save the commands in a file. Instead of typing them in again (and potentially getting them wrong) we can do this:
uk: Припустимо, ми щойно виконали низку команд, які зробили щось корисне --- наприклад, створили графік, який ми хотіли б використати у роботі. Ми хотіли б мати можливість відновити графік пізніше, якщо це буде потрібно, тому ми хочемо зберегти команди у файлі. Замість того, щоб вводити їх знову (і, можливо, зробити помилки) ми можемо зробити так:

source: The file `redo-figure-3.sh` now contains:
uk: Файл `redo-figure-3.sh` тепер містить наступне:

source: After a moment's work in an editor to remove the serial numbers on the commands, and to remove the final line where we called the `history` command, we have a completely accurate record of how we created that figure.
uk: Після невеликої роботи в редакторі з прибирання послідовних номерів на командах і видалення останнього рядка, де ми викликали команду `history`, ми отримаємо абсолютно точний запис того, як ми створили цю фігуру.

source: > ## Why Record Commands in the History Before Running Them?
uk: > ## Навіщо записувати команди в історію перед виконанням?

source: > > If you run the command: > > ~~~ > $ history | tail -n 5 > recent.sh > ~~~ > {: .language-bash} > > the last command in the file is the `history` command itself, i.e., > the shell has added `history` to the command log before actually > running it. In fact, the shell *always* adds commands to the log > before running them. Why do you think it does this? > > > ## Solution > > If a command causes something to crash or hang, it might be useful > > to know what that command was, in order to investigate the problem. > > Were the command only be recorded after running it, we would not > > have a record of the last command run in the event of a crash.
uk: > > Якщо виконати команду: > > ~~~ > $ history | tail -n 5 > recent.sh > ~~~ > {: .language-bash} > > останньою командою у файлі є сама команда `history`, тобто, > термінал додав `history` до журналу команд перед тим, як фактично > її виконав. Насправді, термінал *завжди* додає команди до журналу > перед їх виконанням. Як ви гадаєте, чому він це робить? > > > ## Розв'язання > > Якщо якась команда спричинила збій або зависання, може бути корисно > > знати, що це була за команда, щоб дослідити проблему. > > Якби команда записувалася лише після запуску, ми б > > не мали запису останньої запущеної команди у випадку аварійного завершення роботи.

source: In practice, most people develop shell scripts by running commands at the shell prompt a few times to make sure they're doing the right thing, then saving them in a file for re-use. This style of work allows people to recycle what they discover about their data and their workflow with one call to `history` and a bit of editing to clean up the output and save it as a shell script.
uk: На практиці більшість людей розробляють скрипти терміналу, запускаючи команди в командному рядку кілька разів, щоб переконатися, що вони роблять все правильно, а потім зберігають їх у файлі для повторного використання. Такий стиль роботи дозволяє людям переробляти те, що вони дізнаються про свої дані і робочий процес, одним викликом команди `history` і невеликим редагуванням, щоб очистити результат і зберегти його як скрипт терміналу.

source: ## Nelle's Pipeline: Creating a Script
uk: ## Конвеєр Неллі: Створення скрипту

source: Nelle's supervisor insisted that all her analytics must be reproducible. The easiest way to capture all the steps is in a script.
uk: Керівник Неллі наполягав на тому, що вся її аналітика має бути відтворюваною. Найпростіший спосіб зафіксувати всі кроки - написати сценарій.

source: First we return to Nelle's project directory: ``` $ cd ../../north-pacific-gyre/ ``` {: .language-bash}
uk: Спочатку повернемося до каталогу проектів Неллі: ``` $ cd ../../north-pacific-gyre/ ``` {: .language-bash}

source: She creates a file using `nano` ...
uk: Вона створює файл з використанням `nano` ...

source: ...which contains the following:
uk: ...який містить наступне:

source: ~~~ # Calculate stats for data files. for datafile in "$@" do echo $datafile bash goostats.sh $datafile stats-$datafile done ~~~
uk: ~~~ # Розрахунок статистики для файлів даних. for datafile in "$@" do echo $datafile bash goostats.sh $datafile stats-$datafile done ~~~

source: She saves this in a file called `do-stats.sh` so that she can now re-do the first stage of her analysis by typing:
uk: Вона зберігає його у файлі з назвою `do-stats.sh`. щоб тепер вона могла повторити перший етап аналізу шляхом введення:

source: She can also do this:
uk: Вона також може зробити наступне:

source: so that the output is just the number of files processed rather than the names of the files that were processed.
uk: щоб вивести лише кількість оброблених файлів а не імена файлів, які було оброблено.

source: One thing to note about Nelle's script is that it lets the person running it decide what files to process. She could have written it as:
uk: У скрипті Неллі є одна особливість, яку слід відзначити, він дозволяє користувачеві, який його запускає, вирішувати, які файли обробляти. Вона могла б написати його так:
