Repository: carpentries-i18n/i18n
Catalog: po/shell-novice.*.po
Languages: uk

source: > > It's a very bad idea to try redirecting > the output of a command that operates on a file > to the same file. For example: > > ~~~ > $ sort -n lengths.txt > lengths.txt > ~~~ > {: .language-bash} > > Doing something like this may give you > incorrect results and/or delete > the contents of `lengths.txt`.
uk: > > Це дуже погана ідея - намагатися перенаправити > вихідні дані команди, яка оперує з файлом, > у той самий файл. Наприклад: > > ~~~ > $ sort -n lengths.txt > lengths.txt > ~~~ > {: .language-bash} > > Виконання таких дій може надати вам > некоректні результати та/або видалити > вміст файлу `lengths.txt`.

source: > ## What Does `>>` Mean?
uk: > ## Що означає `>>`?

source: > > We have seen the use of `>`, but there is a similar operator `>>` > which works slightly differently. > We'll learn about the differences between these two operators by printing some strings. > We can use the `echo` command to print strings e.g. > > ~~~ > $ echo The echo command prints text > ~~~ > {: .language-bash} > ~~~ > The echo command prints text > ~~~
uk: > > Ми бачили використання оператору `>`, але існує схожий оператор `>>`, > який працює дещо по-іншому. > Ми дізнаємося про відмінності між цими двома операторами, надрукувавши кілька рядків. > Ми можемо скористатися командою `echo` для виведення рядків, наприклад > > ~~~ > $ echo Команда echo виводить текст > ~~~ > {: .language-bash} > ~~~ > Команда echo виводить текст > ~~~

source: > > Now test the commands below to reveal the difference between the two operators: > > ~~~ > $ echo hello > testfile01.txt > ~~~ > {: .language-bash} > > and: > > ~~~ > $ echo hello >> testfile02.txt > ~~~ > {: .language-bash} > > Hint: Try executing each command twice in a row and then examining the output files. > > > ## Solution > > In the first example with `>`, the string 'hello' is written to `testfile01.txt`, > > but the file gets overwritten each time we run the command. > > > > We see from the second example that the `>>` operator also writes 'hello' to a file > > (in this case`testfile02.txt`), > > but appends the string to the file if it already exists > > (i.e. when we run it for the second time).
uk: > > Тепер протестуйте наведені нижче команди, щоб виявити різницю між цими двома операторами: > > ~~~ > $ echo hello > testfile01.txt > ~~~ > {: .language-bash} > > та: > > ~~~ > $ echo hello >> testfile02.txt > ~~~ > {: .language-bash} > > Підказка: Спробуйте виконати кожну команду двічі поспіль, а потім переглянути вихідні файли. > > > ## Розв'язання > > У першому прикладі з `>` рядок 'hello' записується до файлу `testfile01.txt`, > > але файл перезаписується кожного разу, коли ми запускаємо команду. > > > > З другого прикладу ми бачимо, що оператор `>>` також записує рядок 'hello' у файл > > (у цьому випадку `testfile02.txt`), > > але додає рядок до файлу, якщо останній вже існує > > (тобто, коли ми запускаємо його вдруге).

source: > ## Appending Data
uk: > ## Додавання даних

source: > > We have already met the `head` command, which prints lines from the start of a file. > `tail` is similar, but prints lines from the end of a file instead. > > Consider the file `shell-lesson-data/exercise-data/animal-counts/animals.csv`. > After these commands, select the answer that > corresponds to the file `animals-subset.csv`: > > ~~~ > $ head -n 3 animals.csv > animals-subset.csv > $ tail -n 2 animals.csv >> animals-subset.csv > ~~~ > {: .language-bash} > > 1. The first three lines of `animals.csv` > 2. The last two lines of `animals.csv` > 3. The first three lines and the last two lines of `animals.csv` > 4. The second and third lines of `animals.csv` > > > ## Solution > > Option 3 is correct. > > For option 1 to be correct we would only run the `head` command. > > For option 2 to be correct we would only run the `tail` command. > > For option 4 to be correct we would have to pipe the output of `head` into `tail -n 2` > > by doing `head -n 3 animals.csv | tail -n 2 > animals-subset.csv`
uk: > > Ми вже зустрічалися з командою `head`, яка друкує рядки з початку файлу. > Команда `tail` схожа на неї, але друкує рядки з кінця файлу. > > Розглянемо файл `shell-lesson-data/exercise-data/animal-counts/animals.csv`. > Після виконання цих команд виберіть відповідь, яка > відповідає файлу `animals-subset.csv`: > > ~~~ > $ head -n 3 animals.csv > animals-subset.csv > $ tail -n 2 animals.csv >> animals-subset.csv > ~~~ > {: .language-bash} > > 1. Перші три рядки файлу `animals.csv' > 2. Останні два рядки файлу `animals.csv`. > 3. Перші три рядки та останні два рядки файлу `animals.csv`. > 4. Другий і третій рядки файлу `animals.csv`. > > > Розв'язання > > Варіант 3 є правильним. > > Щоб варіант 1 був правильним, потрібно виконати лише команду `head`. > > Щоб варіант 2 був правильним, нам слід виконати лише команду `tail`. > > Щоб варіант 4 був коректним, нам слід передати вивід команди `head` у команду `tail -n 2` > > виконавши `head -n 3 animals.csv | tail -n 2 > animals-subset.csv`.

source: ## Passing output to another command
uk: ## Передача виводу іншій команді

source: In our example of finding the file with the fewest lines, we are using two intermediate files `lengths.txt` and `sorted-lengths.txt` to store output. This is a confusing way to work because even once you understand what `wc`, `sort`, and `head` do, those intermediate files make it hard to follow what's going on. We can make it easier to understand by running `sort` and `head` together:
uk: У нашому прикладі ми шукаємо файл з найменшою кількістю рядків, ми використовуємо два проміжні файли `lengths.txt` і `sorted-lengths.txt` для зберігання результатів. Це заплутаний спосіб роботи, оскільки навіть після того, як ви зрозумієте, що роблять `wc`, `sort` і `head`, ці проміжні файли ускладнюють розуміння того, що відбувається. Ми можемо полегшити розуміння, запустивши `sort` і `head` разом:

source: The vertical bar, `|`, between the two commands is called a **pipe**. It tells the shell that we want to use the output of the command on the left as the input to the command on the right.
uk: Вертикальна риска `|` між двома командами називається **каналом**. Він вказує терміналу, що ми хочемо використовувати вивід команди ліворуч як вхідні дані для команди праворуч.

source: This has removed the need for the `sorted-lengths.txt` file.
uk: Це усунуло необхідність у файлі `sorted-lengths.txt`.

source: ## Combining multiple commands
uk: ## Поєднання декількох команд

source: Nothing prevents us from chaining pipes consecutively. We can for example send the output of `wc` directly to `sort`, and then the resulting output to `head`. This removes the need for any intermediate files.
uk: Ніщо не заважає нам з'єднувати канали послідовно. Ми можемо, наприклад, надсилати вивід `wc` безпосередньо до `sort`, а потім отриманий результат - до `head`. Це усуває необхідність у будь-яких проміжних файлах.

source: We'll start by using a pipe to send the output of `wc` to `sort`:
uk: Ми почнемо з використання каналу для відправки виводу `wc` до `sort`:

source: We can then send that output through another pipe, to `head`, so that the full pipeline becomes:
uk: Потім ми можемо відправити цей вивід через інший канал в `head`, отже конвеєр стає наступним:

source: This is exactly like a mathematician nesting functions like *log(3x)* and saying 'the log of three times *x*'. In our case, the calculation is 'head of sort of line count of `*.pdb`'.
uk: Це точно так само, як математик вкладає функції на кшталт *log(3x)* і каже 'логарифм трьох, помноженого на *x*'. У нашому випадку, обчислюється 'head від sort від підрахунку кількості рядків у файлах `*.pdb`'.

source: The redirection and pipes used in the last few commands are illustrated below:
uk: Перенаправлення та канали, використані в останніх кількох командах, проілюстровано нижче:

source: ![Redirects and Pipes of different commands: "wc -l *.pdb" will direct the output to the shell. "wc -l *.pdb > lengths" will direct output to the file "lengths". "wc -l *.pdb | sort -n | head -n 1" will build a pipeline where the output of the "wc" command is the input to the "sort" command, the output of the "sort" command is the input to the "head" command and the output of the "head" command is directed to the shell](../fig/redirects-and-pipes.svg)
uk: ![Перенаправлення та канали різних команд: "wc -l *.pdb" перенаправить виведення до терміналу. "wc -l *.pdb > lengths" спрямує вивід до файлу "lengths". "wc -l *.pdb | sort -n | head -n 1" побудує конвеєр, де вихід команди "wc" є входом для команди "sort", вихід команди команди "sort" є входом для команди "head", а вихід команди "head" буде спрямовано до терміналу](../fig/redirects-and-pipes.svg)

source: > ## Piping Commands Together
uk: > ## З'єднання команд у конвеєр

source: > > In our current directory, we want to find the 3 files which have the least number of > lines. Which command listed below would work? > > 1. `wc -l * > sort -n > head -n 3` > 2. `wc -l * | sort -n | head -n 1-3` > 3. `wc -l * | head -n 3 | sort -n` > 4. `wc -l * | sort -n | head -n 3` > > > ## Solution > > Option 4 is the solution. > > The pipe character `|` is used to connect the output from one command to > > the input of another. > > `>` is used to redirect standard output to a file. > > Try it in the `shell-lesson-data/exercise-data/proteins` directory!
uk: > > У нашому поточному каталозі ми хочемо знайти 3 файли, які мають найменшу кількість > рядків. Яка з наведених нижче команд підійде для цього? > > 1. `wc -l * > sort -n > head -n 3`. > 2. `wc -l * | sort -n | head -n 1-3`. > 3. `wc -l * | head -n 3 | sort -n` > 4. `wc -l * | sort -n | head -n 3`. > > > Розв'язання > > Варіант 4 є рішенням. > > Символ каналу `|` використовується для під'єднання виводу однієї команди > > до входу іншої. > > Символ `>` використовується для перенаправлення стандартного виводу до файлу. > > Спробуйте у каталозі `shell-lesson-data/exercise-data/proteins`!

source: ## Tools designed to work together
uk: ## Інструменти, розроблені для спільної роботи

source: This idea of linking programs together is why Unix has been so successful. Instead of creating enormous programs that try to do many different things, Unix programmers focus on creating lots of simple tools that each do one job well, and that work well with each other. This programming model is called 'pipes and filters'. We've already seen pipes; a **filter** is a program like `wc` or `sort` that transforms a stream of input into a stream of output. Almost all of the standard Unix tools can work this way: unless told to do otherwise, they read from standard input, do something with what they've read, and write to standard output.
uk: Ця ідея зв'язування програм разом є причиною успіху Unix. Замість того, щоб створювати величезні програми, які намагаються робити багато різних речей, програмісти Unix зосереджуються на створенні великої кількості простих інструментів, кожен з яких добре виконує одну роботу, і які добре працюють один з іншим. Ця модель програмування називається "канали та фільтри". Ми вже бачили канали; а **фільтр** - це програма на кшталт `wc` або `sort`. яка перетворює потік вхідних даних у потік вихідних даних. Майже всі стандартні інструменти Unix можуть працювати таким чином: якщо їм не наказано робити інакше, вони читають зі стандартного вводу, роблять щось з прочитаним, і записують у стандартний вивід.

source: The key is that any program that reads lines of text from standard input and writes lines of text to standard output can be combined with every other program that behaves this way as well. You can *and should* write your programs this way so that you and other people can put those programs into pipes to multiply their power.
uk: Ключовим моментом є те, що будь-яка програма, яка зчитує рядки тексту зі стандартного вводу і записує рядки тексту у стандартний вивід, може бути об'єднана з будь-якою іншою програмою, яка поводиться так само. Ви можете *і повинні* писати свої програми у такий спосіб, щоб ви та інші люди могли об'єднати ці програми у канали, щоб примножити їхню потужність.

source: > ## Pipe Reading Comprehension
uk: > ## Розуміння читання каналу

source: > > A file called `animals.csv` (in the `shell-lesson-data/exercise-data/animal-counts` folder) > contains the following data: > > ~~~ > 2012-11-05,deer,5 > 2012-11-05,rabbit,22 > 2012-11-05,raccoon,7 > 2012-11-06,rabbit,19 > 2012-11-06,deer,2 > 2012-11-06,fox,4 > 2012-11-07,rabbit,16 > 2012-11-07,bear,1 > ~~~
uk: > > Файл з назвою `animals.csv` (у папці `shell-lesson-data/exercise-data/animal-counts`) > містить наступні дані: > > ~~~ > 2012-11-05,deer,5 > 2012-11-05,rabbit,22 > 2012-11-05,raccoon,7 > 2012-11-06,rabbit,19 > 2012-11-06,deer,2 > 2012-11-06,fox,4 > 2012-11-07,rabbit,16 > 2012-11-07,bear,1 > ~~~

source: > > What text passes through each of the pipes and the final redirect in the pipeline below? > Note, the `sort -r` command sorts in reverse order. > > ~~~ > $ cat animals.csv | head -n 5 | tail -n 3 | sort -r > final.txt > ~~~ > {: .language-bash} > Hint: build the pipeline up one command at a time to test your understanding > > ## Solution > > The `head` command extracts the first 5 lines from `animals.csv`. > > Then, the last 3 lines are extracted from the previous 5 by using the `tail` command. > > With the `sort -r` command those 3 lines are sorted in reverse order and finally, > > the output is redirected to a file `final.txt`. > > The content of this file can be checked by executing `cat final.txt`. > > The file should contain the following lines: > > ``` > > 2012-11-06,rabbit,19 > > 2012-11-06,deer,2 > > 2012-11-05,raccoon,7 > > ``` > > {: .source}
uk: > > Який текст проходить через кожен з каналів і кінцеве перенаправлення у конвеєрі нижче? > Зауважте, що команда `sort -r` сортує у зворотному порядку. > > ~~~ > $ cat animals.csv | head -n 5 | tail -n 3 | sort -r > final.txt > ~~~ > {: .language-bash} > Підказка: створюйте конвеєр по одній команді за раз, щоб перевірити своє розуміння > > ## Розв'язання > > Команда `head` витягує перші 5 рядків з файлу `animals.csv`. > > Потім останні 3 рядки витягуються з попередніх 5 за допомогою команди `tail`. > > За допомогою команди `sort -r` ці 3 рядки сортуються у зворотному порядку і нарешті, > > виведення перенаправляється до файлу `final.txt`. > > Вміст цього файлу можна перевірити, виконавши команду `cat final.txt`. > > Файл повинен містити наступні рядки: > > ``` > > 2012-11-06,rabbit,19 > > 2012-11-06,олень,2 > > 2012-11-05,єнот,7 > > ``` > > {: .source}

source: > ## Pipe Construction
uk: > ## Конструювання каналу

source: > > For the file `animals.csv` from the previous exercise, consider the following command: > > ~~~ > $ cut -d , -f 2 animals.csv > ~~~ > {: .language-bash} > > The `cut` command is used to remove or 'cut out' certain sections of each line in the file, > and `cut` expects the lines to be separated into columns by a <kbd>Tab</kbd> character. > A character used in this way is a called a **delimiter**. > In the example above we use the `-d` option to specify the comma as our delimiter character. > We have also used the `-f` option to specify that we want to extract the second field (column). > This gives the following output: > > ~~~ > deer > rabbit > raccoon > rabbit > deer > fox > rabbit > bear > ~~~
uk: > > Для файлу `animals.csv` з попередньої завдання розглянемо наступну команду:> > ~~~ > $ cut -d , -f 2 animals.csv > ~~~ > {: .language-bash} > > Команда `cut` використовується для видалення або 'вирізання' певних частин кожного рядка у файлі, > і `cut` очікує, що рядки буде розділено на стовпчики символом <kbd>Tab</kbd>. > Символ, який використовується таким чином, називається **відокремлювальним символом**. > У наведеному вище прикладі ми використовуємо опцію `-d`, щоб вказати кому як відокремлювальний символ. > Ми також використали опцію `-f`, щоб вказати, що ми хочемо вилучити друге поле (стовпчик). > Це призведе до наступного результату: > > ~~~ > deer > rabbit > raccoon > rabbit > deer > fox > rabbit > bear > ~~~

source: > > The `uniq` command filters out adjacent matching lines in a file. > How could you extend this pipeline (using `uniq` and another command) to find > out what animals the file contains (without any duplicates in their > names)? > > > ## Solution > > ``` > > $ cut -d , -f 2 animals.csv | sort | uniq > > ``` > > {: .language-bash}
uk: > > Команда `uniq` відфільтровує сусідні однакові рядки у файлі. > Як можна розширити цей конвеєр (за допомогою `uniq` та іншої команди), щоб > з'ясувати, які тварини містяться у файлі (без повторень у їхніх > назвах)? > > > ## Розв'язання > > ``` > > $ cut -d , -f 2 animals.csv | sort | uniq > > ``` > > {: .language-bash}

source: > ## Which Pipe?
uk: > ## Який канал?

source: > > The file `animals.csv` contains 8 lines of data formatted as follows: > > ~~~ > 2012-11-05,deer,5 > 2012-11-05,rabbit,22 > 2012-11-05,raccoon,7 > 2012-11-06,rabbit,19 > ... > ~~~
uk: > > Файл `animals.csv` містить 8 рядків даних, відформатованих наступним чином: > > ~~~ > 2012-11-05,deer,5 > 2012-11-05,rabbit,22 > 2012-11-05,raccoon,7 > 2012-11-06,rabbit,19 > ... > ~~~

source: > > The `uniq` command has a `-c` option which gives a count of the > number of times a line occurs in its input. Assuming your current > directory is `shell-lesson-data/exercise-data/animal-counts`, > what command would you use to produce a table that shows > the total count of each type of animal in the file? > > 1. `sort animals.csv | uniq -c` > 2. `sort -t, -k2,2 animals.csv | uniq -c` > 3. `cut -d, -f 2 animals.csv | uniq -c` > 4. `cut -d, -f 2 animals.csv | sort | uniq -c` > 5. `cut -d, -f 2 animals.csv | sort | uniq -c | wc -l` > > > ## Solution > > Option 4. is the correct answer. > > If you have difficulty understanding why, try running the commands, or sub-sections of > > the pipelines (make sure you are in the `shell-lesson-data/exercise-data/animal-counts` > > directory).
uk: > > Команда `uniq` має опцію `-c`, яка дає > кількість входжень рядка у вхідних даних. Припустимо, що ваш поточний > каталог має назву `shell-lesson-data/exercise-data/animal-counts`, > яку команду слід використати, щоб створити таблицю, яка показує > загальну кількість тварин кожного типу у файлі? > > 1. `sort animals.csv | uniq -c`. > 2. `sort -t, -k2,2 animals.csv | uniq -c`. > 3. `cut -d, -f 2 animals.csv | uniq -c` > 4. `cut -d, -f 2 animals.csv | sort | uniq -c`. > 5. `cut -d, -f 2 animals.csv | sort | uniq -c | wc -l` > > > ## Розв'язання > > Варіант 4 є правильною відповіддю. > > Якщо вам важко зрозуміти, чому, спробуйте виконати команди або фрагменти > > конвеєрів (переконайтеся, що ви перебуваєте у каталозі `shell-lesson-data/exercise-data/animal-counts`).

source: ## Nelle's Pipeline: Checking Files
uk: ### Конвеєр Неллі: Перевірка файлів

source: Nelle has run her samples through the assay machines and created 17 files in the `north-pacific-gyre` directory described earlier. As a quick check, starting from the `shell-lesson-data` directory, Nelle types:
uk: Неллі пропустила свої зразки через аналізатори і створила 17 файлів у каталозі `north-pacific-gyre`, описаному раніше. Для швидкої перевірки, починаючи з каталогу `shell-lesson-data`, Неллі набирає:

source: The output is 18 lines that look like this:
uk: На виході вона отримує 18 рядків, які виглядають наступним чином:

source: Now she types this:
uk: Тепер вона набирає наступне:

source: Whoops: one of the files is 60 lines shorter than the others. When she goes back and checks it, she sees that she did that assay at 8:00 on a Monday morning --- someone was probably in using the machine on the weekend, and she forgot to reset it. Before re-running that sample, she checks to see if any files have too much data:
uk: Упс: один з файлів на 60 рядків коротший за інші. Коли вона повертається і перевіряє його, вона бачить, що зробила цей аналіз о 8:00 ранку в понеділок --- хтось, можливо, користувався машиною на вихідних, і вона забула її перезавантажити. Перед тим, як повторно проаналізувати цей зразок, вона перевіряє, чи є файли, що містять забагато даних:

source: Those numbers look good --- but what's that 'Z' doing there in the third-to-last line? All of her samples should be marked 'A' or 'B'; by convention, her lab uses 'Z' to indicate samples with missing information. To find others like it, she does this:
uk: Ці цифри виглядають добре --- але що робить ця 'Z' у передостанньому рядку? Всі її зразки мають бути позначені 'A' або 'B'; за попередньою домовленістю її лабораторія використовує 'Z' для позначення зразків з недостатньою інформацією. Щоб знайти подібні зразки, вона робить наступне:

source: Sure enough, when she checks the log on her laptop, there's no depth recorded for either of those samples. Since it's too late to get the information any other way, she must exclude those two files from her analysis. She could delete them using `rm`, but there are actually some analyses she might do later where depth doesn't matter, so instead, she'll have to be careful later on to select files using the wildcard expressions `NENE*A.txt NENE*B.txt`.
uk: Звісно, коли вона перевіряє журнал на своєму ноутбуці, глибина не записана для жодного з цих зразків. Оскільки вже занадто пізно отримати інформацію в інший спосіб, вона повинна виключити ці два файли з аналізу. Вона може видалити їх за допомогою `rm`, але насправді є деякі аналізи, які вона може зробити пізніше, де глибина не має значення, тож натомість, пізніше їй доведеться бути обережною і вибирати файли за допомогою підстановочних виразів `NENE*A.txt NENE*B.txt`.

source: > ## Removing Unneeded Files
uk: > ## Видалення непотрібних файлів

source: > > Suppose you want to delete your processed data files, and only keep > your raw files and processing script to save storage. > The raw files end in `.dat` and the processed files end in `.txt`. > Which of the following would remove all the processed data files, > and *only* the processed data files? > > 1. `rm ?.txt` > 2. `rm *.txt` > 3. `rm * .txt` > 4. `rm *.*` > > > ## Solution > > 1. This would remove `.txt` files with one-character names > > 2. This is the correct answer > > 3. The shell would expand `*` to match everything in the current directory, > > so the command would try to remove all matched files and an additional > > file called `.txt` > > 4. The shell would expand `*.*` to match all files with any extension, > > so this command would delete all files
uk: > > Припустимо, ви хочете видалити файли оброблених даних і зберегти лише > сирі файли і скрипт обробки для економії місця у сховищі. > Вихідні файли закінчуються на `.dat`, а оброблені файли закінчуються на `.txt`. > Яка з наведених нижче команд видалить усі оброблені файли даних, > і *лише* оброблені файли даних? > > 1. `rm ?.txt` > 2. `rm *.txt` > 3. `rm * .txt` > 4. `rm *.*` > > > Розв'язання > > 1. Це призведе до вилучення файлів `.txt` з односимвольними назвами > > 2. Це правильна відповідь > > 3. Термінал розширить підстановочний символ `*` так, щоб він відповідав усім файлам у поточному каталозі, > > таким чином, команда спробує видалити всі знайдені файли і додатковий > > файл з назвою `.txt'. > > 4. Термінал розширить `*.*`, щоб знайти всі файли з будь-яким розширенням, > > таким чином, ця команда видалить усі файли.
