Repository: carpentries-i18n/i18n
Catalog: po/shell-novice.*.po
Languages: uk

source: --- title: "Loops" teaching: 40 exercises: 10 questions: - "How can I perform the same actions on many different files?" objectives: - "Write a loop that applies one or more commands separately to each file in a set of files." - "Trace the values taken on by a loop variable during execution of the loop." - "Explain the difference between a variable's name and its value." - "Explain why spaces and some punctuation characters shouldn't be used in file names." - "Demonstrate how to see what commands have recently been executed." - "Re-run recently executed commands without retyping them." keypoints: - "A `for` loop repeats commands once for every thing in a list." - "Every `for` loop needs a variable to refer to the thing it is currently operating on." - "Use `$name` to expand a variable (i.e., get its value). `${name}` can also be used." - "Do not use spaces, quotes, or wildcard characters such as '*' or '?' in filenames, as it complicates variable expansion." - "Give files consistent names that are easy to match with wildcard patterns to make it easy to select them for looping." - "Use the up-arrow key to scroll up through previous commands to edit and repeat them." - "Use <kbd>Ctrl</kbd>+<kbd>R</kbd> to search through the previously entered commands." - "Use `history` to display recent commands, and `![number]` to repeat a command by number." ---
uk: --- title: "Цикли" teaching: 40 exercises: 10 questions: - "Як виконати одні й ті ж дії над різними файлами?" objectives: - "Написати цикл, який застосовує одну або декілька команд окремо до кожного файлу в наборі файлів". - "Простежити, яких значень набуває змінна циклу під час виконання циклу". - "Пояснити різницю між ім'ям змінної та її значенням". - "Пояснити, чому в іменах файлів не можна використовувати пробіли та деякі розділові знаки". - "Продемонструвати, як побачити, які команди були виконані останнім часом". - "Повторно запустити нещодавно виконані команди без повторного введення". keypoints: - "Цикл `for` повторює команди один раз для кожного елемента списку." - "Кожному циклу `for` потрібна змінна для посилання на об'єкт, над яким він зараз працює." - "Використовуйте `$name` для розкриття змінної (тобто отримання її значення). Також можна використовувати `${name}`." - "Не використовуйте у назвах файлів пробіли, лапки або символи підстановки, такі як '*' або '?', оскільки це ускладнює розширення змінних." - "Надавайте файлам однакові імена, які легко співпадають із шаблонами підстановок, щоб полегшити їх вибір для циклів". - "Використовуйте клавішу зі стрілкою вгору для прокрутки попередніх команд, щоб редагувати та повторювати їх." - "Використовуйте <kbd>Ctrl</kbd>+<kbd>R</kbd> для пошуку попередньо введених команд." - "Використовуйте `history` для відображення останніх команд і `![номер]` для повторення команди за номером." ---

source: **Loops** are a programming construct which allow us to repeat a command or set of commands for each item in a list. As such they are key to productivity improvements through automation. Similar to wildcards and tab completion, using loops also reduces the amount of typing required (and hence reduces the number of typing mistakes).
uk: **Цикли** - це конструкція програмування, яка дозволяє повторювати команду або набір команд для кожного елемента у списку. Таким чином, вони є ключем до підвищення продуктивності за рахунок автоматизації. Подібно до підстановочних символів і завершення клавішею табуляції, використання циклів також зменшує кількість необхідного набору тексту (а отже, зменшує кількість помилок).

source: Suppose we have several hundred genome data files named `basilisk.dat`, `minotaur.dat`, and `unicorn.dat`. For this example, we'll use the `exercise-data/creatures` directory which only has three example files, but the principles can be applied to many many more files at once.
uk: Припустимо, у нас є кілька сотень файлів геномних даних з іменами `basilisk.dat`, `minotaur.dat` та `unicorn.dat`. Для цього прикладу ми використаємо каталог `exercise-data/creatures`, який містить лише три файли з прикладами, але ці принципи можна застосувати до набагато більшої кількості файлів одночасно.

source: The structure of these files is the same: the common name, classification, and updated date are presented on the first three lines, with DNA sequences on the following lines. Let's look at the files:
uk: Структура цих файлів однакова: загальна назва, класифікація та дата оновлення у перших трьох рядках, а в наступних - послідовності ДНК. Давайте подивимось на файли:

source: We would like to print out the classification for each species, which is given on the second line of each file. For each file, we would need to execute the command `head -n 2` and pipe this to `tail -n 1`. We’ll use a loop to solve this problem, but first let’s look at the general form of a loop, using the pseudo-code below:
uk: Ми хотіли б роздрукувати класифікацію для кожного виду, яка наведена у другому рядку кожного файлу. Для кожного файлу нам потрібно виконати команду `head -n 2` і з'єднати її каналом з командою `tail -n 1`. Для вирішення цієї задачі ми скористаємося циклом, але спочатку розглянемо загальну форму циклу, використовуючи псевдокод нижче:

source: ``` for thing in list_of_things do operation_using $thing # Indentation within the loop is not required, but aids legibility done ```
uk: ``` for thing in list_of_things do operation_using $thing # Відступ усередині циклу не є обов'язковим, але полегшує читабельність done ```

source: and we can apply this to our example like this:
uk: і ми можемо застосувати це до нашого прикладу наступним чином:

source: > ## Follow the Prompt
uk: > ## Слідкуйте за підказкою

source: > > The shell prompt changes from `$` to `>` and back again as we were > typing in our loop. The second prompt, `>`, is different to remind > us that we haven't finished typing a complete command yet. A semicolon, `;`, > can be used to separate two commands written on a single line.
uk: > > Запрошення до введення в терміналі змінюється з `$` на `>` і назад, коли ми > вводили команди всередині нашого циклу. Друге запрошення до введення, `>`, відрізняється, щоб нагадати > нам, що ми ще не закінчили введення повної команди. Крапка з комою `;` > використовується для розділення двох команд, написаних в одному рядку.

source: When the shell sees the keyword `for`, it knows to repeat a command (or group of commands) once for each item in a list. Each time the loop runs (called an iteration), an item in the list is assigned in sequence to the **variable**, and the commands inside the loop are executed, before moving on to the next item in the list. Inside the loop, we call for the variable's value by putting `$` in front of it. The `$` tells the shell interpreter to treat the variable as a variable name and substitute its value in its place, rather than treat it as text or an external command.
uk: Коли термінал бачить ключове слово `for`, він знає, що потрібно повторити команду (або групу команд) один раз для кожного елемента списку. Кожного разу, коли вміст циклу виконується (одне виконання команд всередині циклу називається ітерацією), елемент списку послідовно присвоюється **змінній**, і команди всередині циклу виконуються, перш ніж перейти до наступного елементу списку. Усередині циклу ми звертаємося до значення змінної, ставлячи `$` перед ї іменем. Символ `$` вказує інтерпретатору командного рядка розглядати змінну як ім'я змінної і підставити замість неї її значення, замість того, щоб розглядати її як текст або зовнішню команду.

source: In this example, the list is three filenames: `basilisk.dat`, `minotaur.dat`, and `unicorn.dat`. Each time the loop iterates, it will assign a file name to the variable `filename` and run the `head` command. The first time through the loop, `$filename` is `basilisk.dat`. The interpreter runs the command `head` on `basilisk.dat` and pipes the first two lines to the `tail` command, which then prints the second line of `basilisk.dat`. For the second iteration, `$filename` becomes `minotaur.dat`. This time, the shell runs `head` on `minotaur.dat` and pipes the first two lines to the `tail` command, which then prints the second line of `minotaur.dat`. For the third iteration, `$filename` becomes `unicorn.dat`, so the shell runs the `head` command on that file, and `tail` on the output of that. Since the list was only three items, the shell exits the `for` loop.
uk: У цьому прикладі список складається з трьох файлів: `basilisk.dat`, `minotaur.dat` та `unicorn.dat`. Кожного разу, коли виконанується цикл, він присвоює чергове ім'я файлу змінній `filename` і виконає команду `head`. При першому проходженні циклу `$filename` дорівнює `basilisk.dat`. Інтерпретатор виконує команду `head` на `basilisk.dat` і передає перші два рядки команді `tail`, яка виводить другий рядок файлу `basilisk.dat`. Для другої ітерації `$filename` стає `minotaur.dat`. Цього разу термінал виконує команду `head` на `minotaur.dat` і передає перші два рядки команді `tail`, яка виводить другий рядок `minotaur.dat`. На третій ітерації `$filename` стає `unicorn.dat`, тому термінал виконує команду `head` для цього файлу, і `tail` на виході цього. Оскільки у списку було лише три елементи, термінал вийде з циклу `for`.

source: > ## Same Symbols, Different Meanings
uk: > ## Однакові символи, різні значення

source: > > Here we see `>` being used as a shell prompt, whereas `>` is also > used to redirect output. > Similarly, `$` is used as a shell prompt, but, as we saw earlier, > it is also used to ask the shell to get the value of a variable. > > If the *shell* prints `>` or `$` then it expects you to type something, > and the symbol is a prompt. > > If *you* type `>` or `$` yourself, it is an instruction from you that > the shell should redirect output or get the value of a variable.
uk: > > Тут ми бачимо, що символ `>` використовується як запрошення командного рядка, тоді як `>` також > використовується для перенаправлення виводу. > Аналогічно, символ `$` використовується як запрошення до командного рядка, але, як ми бачили раніше, > він також використовується для запиту до оболонки про значення змінної. > > Якщо *термінал* виводить `>` або `$`, то він очікує, що ви щось введете, > і цей символ є підказкою. > > Якщо *ви* вводите `>` або `$` самостійно, це є вашою вказівкою про те, що > оболонці перенаправити вивід або отримати значення змінної.

source: When using variables it is also possible to put the names into curly braces to clearly delimit the variable name: `$filename` is equivalent to `${filename}`, but is different from `${file}name`. You may find this notation in other people's programs.
uk: При використанні змінних також можна брати імена у фігурні дужки, щоб чітко розмежувати імена змінних: `$filename` еквівалентно `${filename}`, але відрізняється від `${file}name`. Ви можете зустріти таку форму запису у програмах інших людей.

source: We have called the variable in this loop `filename` in order to make its purpose clearer to human readers. The shell itself doesn't care what the variable is called; if we wrote this loop as:
uk: Ми назвали змінну у цьому циклі `filename` (ім'я файлу) для того, щоб зробити її призначення більш зрозумілим для читачів-людей. Самій оболонці байдуже, як називається змінна; якщо ми напишемо цей цикл наступним чином:

source: or:
uk: чи:

source: it would work exactly the same way. *Don't do this.* Programs are only useful if people can understand them, so meaningless names (like `x`) or misleading names (like `temperature`) increase the odds that the program won't do what its readers think it does.
uk: це спрацювало б точно так само. *Не роби цього.* Програми корисні лише тоді, коли люди можуть їх розуміти, тому беззмістовні назви (наприклад, `x`) або назви, що вводять в оману (наприклад, `temperature`) збільшують ймовірність того, що програма не буде робити те, що читачі думають, що вона робить.

source: In the above examples, the variables (`thing`, `filename`, `x` and `temperature`) could have been given any other name, as long as it is meaningful to both the person writing the code and the person reading it.
uk: У наведених вище прикладах змінним (`thing`, `filename`, `x` та `temperature`) можна було б назвати будь-якою іншою назвою, аби вона була зрозумілою як для того, хто пише код, так і для того, хто його читає.

source: Note also that loops can be used for other things than filenames, like a list of numbers or a subset of data.
uk: Зауважте також, що цикли можна використовувати для інших речей, окрім імен файлів, наприклад, для списку чисел або підмножини даних.

source: > ## Write your own loop
uk: > ## Напишіть власний цикл

source: > > How would you write a loop that echoes all 10 numbers from 0 to 9? > > > ## Solution > > > > ~~~ > > $ for loop_variable in 0 1 2 3 4 5 6 7 8 9 > > > do > > > echo $loop_variable > > > done > > ~~~ > > {: .language-bash} > > > > ``` > > 0 > > 1 > > 2 > > 3 > > 4 > > 5 > > 6 > > 7 > > 8 > > 9 > > ``` > > {: .output}
uk: > > Як би ви написали цикл, який виводить всі 10 чисел від 0 до 9? > > > ## Розв'язання > > > > ~~~ > > $ for loop_variable in 0 1 2 3 4 5 6 7 8 9 > > > do > > > echo $loop_variable > > > done > > ~~~ > > {: .language-bash} > > > > ``` > > 0 > > 1 > > 2 > > 3 > > 4 > > 5 > > 6 > > 7 > > 8 > > 9 > > ``` > > {: .output}

source: > ## Variables in Loops
uk: > ## Змінні в циклах

source: > > This exercise refers to the `shell-lesson-data/exercise-data/proteins` directory. > `ls *.pdb` gives the following output: > > ~~~ > cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > ~~~
uk: > > Ця вправа звертається до каталогу `shell-lesson-data/exercise-data/proteins`. > `ls *.pdb` видає наступний результат: > > ~~~ > cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > ~~~

source: > > What is the output of the following code? > > ~~~ > $ for datafile in *.pdb > > do > > ls *.pdb > > done > ~~~ > {: .language-bash} > > Now, what is the output of the following code? > > ~~~ > $ for datafile in *.pdb > > do > > ls $datafile > > done > ~~~ > {: .language-bash} > > Why do these two loops give different outputs? > > > ## Solution > > The first code block gives the same output on each iteration through > > the loop. > > Bash expands the wildcard `*.pdb` within the loop body (as well as > > before the loop starts) to match all files ending in `.pdb` > > and then lists them using `ls`. > > The expanded loop would look like this: > > ``` > > $ for datafile in cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > > > do > > > ls cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > > > done > > ``` > > {: .language-bash} > > > > ``` > > cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > > cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > > cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > > cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > > cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > > cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > > ``` > > {: .output} > > > > The second code block lists a different file on each loop iteration. > > The value of the `datafile` variable is evaluated using `$datafile`, > > and then listed using `ls`. > > > > ``` > > cubane.pdb > > ethane.pdb > > methane.pdb > > octane.pdb > > pentane.pdb > > propane.pdb > > ``` > > {: .output}
uk: > > Що виводить наступний код? > > ~~~ > $ for datafile in *.pdb > > do > > ls *.pdb > > done > ~~~ > {: .language-bash} > > Тепер, що виводить наступний код? > > ~~~ > $ for datafile in *.pdb > > do > > ls $datafile > > done > ~~~ > {: .language-bash} > > Чому ці два цикли дають різні результати? > > > ## Розв'язання > > Перший блок коду дає однаковий результат на кожній ітерації > > циклу. > > Bash розширює шаблон `*.pdb` в тілі циклу (а також > > перед початком циклу), щоб знайти всі файли, що закінчуються на `.pdb`. > > а потім перераховує їх за допомогою `ls`. > > Розширений цикл матиме такий вигляд: > > ``` > > $ for datafile in cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > > > do > > > ls cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > > > done > > ``` > > {: .language-bash} > > > > ``` > > cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > > cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > > cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > > cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > > cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > > cubane.pdb ethane.pdb methane.pdb octane.pdb pentane.pdb propane.pdb > > ``` > > {: .output} > > > > Другий блок коду перераховує різні файли на кожній ітерації циклу. > > Значення змінної `datafile` обчислюється за допомогою `$datafile`, > > а потім перераховується за допомогою `ls`. > > > > ``` > > cubane.pdb > > ethane.pdb > > methane.pdb > > octane.pdb > > pentane.pdb > > propane.pdb > > ``` > > {: .output}

source: > ## Limiting Sets of Files
uk: > ## Обмеження набору файлів

source: > > What would be the output of running the following loop in the > `shell-lesson-data/exercise-data/proteins` directory? > > ~~~ > $ for filename in c* > > do > > ls $filename > > done > ~~~ > {: .language-bash} > > 1. No files are listed. > 2. All files are listed. > 3. Only `cubane.pdb`, `octane.pdb` and `pentane.pdb` are listed. > 4. Only `cubane.pdb` is listed. > > > ## Solution > > 4 is the correct answer. `*` matches zero or more characters, so any file name starting with > > the letter c, followed by zero or more other characters will be matched.
uk: > > Що буде виведено у результаті виконання наступного циклу в каталозі > `shell-lesson-data/exercise-data/proteins`?> > ~~~ > $ for filename in c* > > do > > ls $filename > > done > ~~~ > {: .language-bash} > > 1. Жодної назви файлу не буде виведено. > 2. Будуть перелічені всі файли. > 3. Будуть перелічені лише `cubane.pdb`, `octane.pdb` та `pentane.pdb`. > 4. Буде виведено лише `cubane.pdb`. > > > ## Розв'язання > > 4 - правильна відповідь. Підстановочний символ `*` відповідає нулю або більшій кількості символів, тому будь-яке ім'я файлу, що починається з > > літери 'c', за якою йдуть нуль або більша кількість символів, підійде.

source: > > How would the output differ from using this command instead? > > ~~~ > $ for filename in *c* > > do > > ls $filename > > done > ~~~ > {: .language-bash} > > 1. The same files would be listed. > 2. All the files are listed this time. > 3. No files are listed this time. > 4. The files `cubane.pdb` and `octane.pdb` will be listed. > 5. Only the file `octane.pdb` will be listed. > > > ## Solution > > 4 is the correct answer. `*` matches zero or more characters, so a file name with zero or more > > characters before a letter c and zero or more characters after the letter c will be matched.
uk: > > Як зміниться результат, якщо замість неї використати цю команду? > > ~~~ > $ for filename in *c* > > do > > ls $filename > > done > ~~~ > {: .language-bash} > > 1. Будуть перераховані ті ж файли. > 2. Цього разу перераховані всі файли. > 3. Цього разу не виведено жодного файла. > 4. Будуть перераховані файли `cubane.pdb` і `octane.pdb`. > 5. Буде перераховано лише файл `octane.pdb`. > > > ## Розв'язання > > 4 - правильна відповідь. Підстановочний символ `*` відповідає нулю або більшій кількості символів, тому всі імена файлів з нулем або більшою кількістю > > символів перед літерою 'c' і нулем або більшою кількістю символів після літери 'c' підійдуть.

source: > ## Saving to a File in a Loop - Part One
uk: > ## Збереження у файл в циклі - Частина перша

source: > > In the `shell-lesson-data/exercise-data/proteins` directory, what is the effect of this loop? > > ~~~ > for alkanes in *.pdb > do > echo $alkanes > cat $alkanes > alkanes.pdb > done > ~~~ > {: .language-bash} > > 1. Prints `cubane.pdb`, `ethane.pdb`, `methane.pdb`, `octane.pdb`, `pentane.pdb` and > `propane.pdb`, and the text from `propane.pdb` will be saved to a file called `alkanes.pdb`. > 2. Prints `cubane.pdb`, `ethane.pdb`, and `methane.pdb`, and the text from all three files > would be concatenated and saved to a file called `alkanes.pdb`. > 3. Prints `cubane.pdb`, `ethane.pdb`, `methane.pdb`, `octane.pdb`, and `pentane.pdb`, > and the text from `propane.pdb` will be saved to a file called `alkanes.pdb`. > 4. None of the above. > > > ## Solution > > 1. The text from each file in turn gets written to the `alkanes.pdb` file. > > However, the file gets overwritten on each loop iteration, so the final content of > > `alkanes.pdb` > > is the text from the `propane.pdb` file.
uk: > > В каталозі `shell-lesson-data/exercise-data/proteins`, який результат роботи цього циклу? > > ~~~ > for alkanes in *.pdb > do > echo $alkanes > cat $alkanes > alkanes.pdb > done > ~~~ > {: .language-bash} > > 1. Буде виведено `cubane.pdb`, `ethane.pdb`, `methane.pdb`, `octane.pdb`, `pentane.pdb` і > `propane.pdb`, а текст з `propane.pdb` буде збережено у файлі з назвою `alkanes.pdb`. > 2. Буде виведено `cubane.pdb`, `ethane.pdb` і `methane.pdb`, і текст з усіх трьох файлів > буде об'єднано і збережено у файл з назвою `alkanes.pdb`. > 3. Буде виведено `cubane.pdb`, `ethane.pdb`, `methane.pdb`, `octane.pdb` і `pentane.pdb`, > а текст з `propane.pdb` буде збережено до файлу з назвою `alkanes.pdb`. > 4. Нічого з перерахованого вище. > > > ## Розв'язання > > 1. Текст з кожного файлу по черзі записується у файл `alkanes.pdb`. > Однак, файл перезаписується на кожній ітерації циклу, тому кінцевий вміст > > `alkanes.pdb' > > буде дорівнювати тексту з файлу `propane.pdb`.

source: > ## Saving to a File in a Loop - Part Two
uk: > ## Збереження у файл в циклі - Частина друга
