Repository: carpentries-i18n/i18n
Catalog: transifex/git-novice/*/06__02-setup.md.po
Languages: uk

source: --- title: Setting Up Git teaching: 5 exercises: 0 questions: - "How do I get set up to use Git?" objectives: - "Configure `git` the first time it is used on a computer." - "Understand the meaning of the `--global` configuration flag." keypoints: - "Use `git config` with the `--global` option to configure a user name, email address, editor, and other preferences once per machine." ---
uk: --- title: Налаштування Git teaching: 5 exercises: 0 questions: - "Як налаштувати Git для використання?" objectives: - "Налаштування `git` під час його першого використання на комп'ютері." - "Розуміння значення конфігураційного параметра `--global`." keypoints: - "Користування `git config` з параметром ` -- global` для налаштування імені користувача, адреси електронної пошти, редактора та інших параметрів раз на комп'ютер." ---

source: When we use Git on a new computer for the first time, we need to configure a few things. Below are a few examples of configurations we will set as we get started with Git:
uk: Коли ми користуємося Git на новому комп'ютері вперше, нам потрібно налаштувати декілька речей. Нижче наведено кілька прикладів з налаштувань, які ми встановимо, коли почнемо працювати з Git:

source: * our name and email address,
uk: * ваше ім'я та адреса електронної пошти,

source: * what our preferred text editor is,
uk: * ваш основний текстовий редактор,

source: * and that we want to use these settings globally (i.e. for every project).
uk: * і що ми хочемо використовувати ці параметри глобально (тобто для кожного проєкту).

source: On a command line, Git commands are written as `git verb options`, where `verb` is what we actually want to do and `options` is additional optional information which may be needed for the `verb`. So here is how Dracula sets up his new laptop:
uk: В командному рядку (command line), команди Git виглядають як `git verb options`, де `verb` - це те що ми фактично хочемо зробити, та `options` - це додаткова інформація, яка може бути потрібна для `verb`. Ось як Dracula налаштовує свій новий ноутбук:

source: Please use your own name and email address instead of Dracula's. This user name and email will be associated with your subsequent Git activity, which means that any changes pushed to [GitHub](https://github.com/), [BitBucket](https://bitbucket.org/), [GitLab](https://gitlab.com/) or another Git host server after this lesson will include this information.
uk: Будь ласка, використовуйте своє власне ім'я та електронну пошту замість "Dracula". Ці ім'я користувача та електронна пошта будуть асоційовані з вашою подальшою діяльністю Git, а це означає, що будь-які зміни надіслані в [GitHub](https://github.com/), [BitBucket](https://bitbucket.org/), [GitLab](https://gitlab.com/) або інший Git хост-сервер після цього уроку будуть містити цю інформацію.

source: For this lesson, we will be interacting with [GitHub](https://github.com/) and so the email address used should be the same as the one used when setting up your GitHub account. If you are concerned about privacy, please review [GitHub's instructions for keeping your email address private][git-privacy].
uk: В цьому уроці ми будемо працювати з [GitHub](https://github.com/), тож використовувана електронна пошта повинна бути такою ж, як і та, яка використовується для налаштування вашого GitHub акаунту. Якщо вас турбує конфіденційнйсть вашої електронної адреси, будь ласка перегляньте [GitHub's instructions for keeping your email address private][git-privacy].

source: >## Keeping your email private > >If you elect to use a private email address with GitHub, then use that same email address for the `user.email` value, e.g. `username@users.noreply.github.com` replacing `username` with your GitHub one.
uk: >## Збереження конфіденційності вашої електронної адреси > >Якщо ви вирішили приховати власну електронну адресу на GitHub, тоді використовуйте для `user.email` електронну адресу у вигляді `username@users.noreply.github.com` замінивши `username` вашим ім'ям користувача GitHub.

source: > ## Line Endings
uk: > ## Закінчення рядків

source: > > As with other keys, when you hit <kbd>Enter</kbd> or <kbd>↵</kbd> or on Macs, <kbd>Return</kbd> on your keyboard, > your computer encodes this input as a character. > Different operating systems use different character(s) to represent the end of a line. > (You may also hear these referred to as newlines or line breaks.) > Because Git uses these characters to compare files, > it may cause unexpected issues when editing a file on different machines. > Though it is beyond the scope of this lesson, you can read more about this issue > [in the Pro Git book](https://www.git-scm.com/book/en/v2/Customizing-Git-Git-Configuration#_core_autocrlf). > > You can change the way Git recognizes and encodes line endings > using the `core.autocrlf` command to `git config`. > The following settings are recommended: > > On macOS and Linux: > > ~~~ > $ git config --global core.autocrlf input > ~~~ > {: .language-bash} > > And on Windows: > > ~~~ > $ git config --global core.autocrlf false > ~~~ > {: .language-bash}
uk: > > Як і з іншими ключами, коли ви вводите <kbd>Enter</kbd> або <kbd> </kbd>, або <kbd>Return</kbd> на Macs на вашій клавіатурі, > ваш комп'ютер кодує це як символ. > Різні операційні системи використовують різні символ(и) для репрезентації кінця рядку. > (Ви також можете почути про це як "нові рядки" або "розриви рядків".) > Тому що Git використовує ці символи для порівняння файлів, > це може спричинити несподівані проблеми під час редагування файлу на різних машинах. > Хоча це поза межами цього уроку, ви можете більше прочитати про це питання > [у посібнику "Pro Git"](https://www.git-scm.com/book/en/v2/Customizing-Git-Git-Configuration#_core_autocrlf). > > Ви можете змінити спосіб розпізнавання закінчень рядків в Git > використовуючи `core.autocrlf` команду до `git config`. > Рекомендовані такі параметри: > > Для macOS та Linux: > > ~~~ > $ git config --global core.autocrlf input > ~~~ > {: .language-bash} > > Для Windows: > > ~~~ > $ git config --global core.autocrlf false > ~~~ > {: .language-bash}

source: Dracula also has to set his favorite text editor, following this table:
uk: Dracula також повинен налаштувати його улюблений текстовий редактор, як наведено в таблиці нижче:

source: | Editor | Configuration command | |:-------------------|:-------------------------------------------------| | Atom | `$ git config --global core.editor "atom --wait"`| | nano | `$ git config --global core.editor "nano -w"` | | BBEdit (Mac, with command line tools) | `$ git config --global core.editor "bbedit -w"` | | Sublime Text (Mac) | `$ git config --global core.editor "/Applications/Sublime\ Text.app/Contents/SharedSupport/bin/subl -n -w"` | | Sublime Text (Win, 32-bit install) | `$ git config --global core.editor "'c:/program files (x86)/sublime text 3/sublime_text.exe' -w"` | | Sublime Text (Win, 64-bit install) | `$ git config --global core.editor "'c:/program files/sublime text 3/sublime_text.exe' -w"` | | Notepad (Win) | `$ git config --global core.editor "c:/Windows/System32/notepad.exe"`| | Notepad++ (Win, 32-bit install) | `$ git config --global core.editor "'c:/program files (x86)/Notepad++/notepad++.exe' -multiInst -notabbar -nosession -noPlugin"`| | Notepad++ (Win, 64-bit install) | `$ git config --global core.editor "'c:/program files/Notepad++/notepad++.exe' -multiInst -notabbar -nosession -noPlugin"`| | Kate (Linux) | `$ git config --global core.editor "kate"` | | Gedit (Linux) | `$ git config --global core.editor "gedit --wait --new-window"` | | Scratch (Linux) | `$ git config --global core.editor "scratch-text-editor"` | | Emacs | `$ git config --global core.editor "emacs"` | | Vim | `$ git config --global core.editor "vim"` | | VS Code | `$ git config --global core.editor "code --wait"` |
uk: | Редактор | Команда для налаштування | |:-------------------|:-------------------------------------------------| | Atom | `$ git config --global core.editor "atom --wait"`| | nano | `$ git config --global core.editor "nano -w"` | | BBEdit (Mac, with command line tools) | `$ git config --global core.editor "bbedit -w"` | | Sublime Text (Mac) | `$ git config --global core.editor "/Applications/Sublime\ Text.app/Contents/SharedSupport/bin/subl -n -w"` | | Sublime Text (Win, 32-bit install) | `$ git config --global core.editor "'c:/program files (x86)/sublime text 3/sublime_text.exe' -w"` | | Sublime Text (Win, 64-bit install) | `$ git config --global core.editor "'c:/program files/sublime text 3/sublime_text.exe' -w"` | | Notepad (Win) | `$ git config --global core.editor "c:/Windows/System32/notepad.exe"`| | Notepad++ (Win, 32-bit install) | `$ git config --global core.editor "'c:/program files (x86)/Notepad++/notepad++.exe' -multiInst -notabbar -nosession -noPlugin"`| | Notepad++ (Win, 64-bit install) | `$ git config --global core.editor "'c:/program files/Notepad++/notepad++.exe' -multiInst -notabbar -nosession -noPlugin"`| | Kate (Linux) | `$ git config --global core.editor "kate"` | | Gedit (Linux) | `$ git config --global core.editor "gedit --wait --new-window"` | | Scratch (Linux) | `$ git config --global core.editor "scratch-text-editor"` | | Emacs | `$ git config --global core.editor "emacs"` | | Vim | `$ git config --global core.editor "vim"` | | VS Code | `$ git config --global core.editor "code --wait"` |

source: It is possible to reconfigure the text editor for Git whenever you want to change it.
uk: Ви можете переналаштувати текстовий редактор для Git у будь-який момент.

source: > ## Exiting Vim
uk: > ## Вихід з Vim

source: > > Note that Vim is the default editor for many programs. If you haven't used Vim before and wish to exit a session without saving your changes, press <kbd>Esc</kbd> then type `:q!` and hit <kbd>Enter</kbd> or <kbd>↵</kbd> or on Macs, <kbd>Return</kbd>. > If you want to save your changes and quit, press <kbd>Esc</kbd> then type `:wq` and hit <kbd>Enter</kbd> or <kbd>↵</kbd> or on Macs, <kbd>Return</kbd>.
uk: > > Зауважте, що Vim є стандартним редактором для багатьох програм. Якщо ви до цього не користувалися Vim і хочете вийти з сесії не зберігаючи ваших змін, натисніть <kbd>Esc</kbd> потім надрукуйте `:q!` та натисніть <kbd>Enter</kbd> або <kbd> </kbd>, або <kbd>Return</kbd> на Macs. > Якщо ви хочете зберегти свої зміни та вийти, натисніть<kbd>Esc</kbd> потім надрукуйте `:wq` та натисніть <kbd>Enter</kbd> або <kbd> </kbd>, або <kbd>Return</kbd> на Macs.

source: Git (2.28+) allows configuration of the name of the branch created when you initialize any new repository. Dracula decides to use that feature to set it to `main` so it matches the cloud service he will eventually use.
uk: Git (2.28+) надає вам змогу обрати назву гілки, яку буде створено під час ініціалізації будь-якої нової репозиторії. Dracula вирішив використати цю можливість, щоб назвати її `main`, щоб це відповідало хмарному сервісу, який він в кінцевому підсумку використовуватиме.

source: > ## Default Git branch naming
uk: > ## Найменування гілки Git за замовчуванням

source: > > Source file changes are associated with a "branch." > For new learners in this lesson, it's enough to know that branches exist, and this lesson uses one branch. > By default, Git will create a branch called `master` > when you create a new repository with `git init` (as explained in the next Episode). This term evokes > the racist practice of human slavery and the > [software development community](https://github.com/github/renaming) has moved to adopt > more inclusive language. > > In 2020, most Git code hosting services transitioned to using `main` as the default > branch. As an example, any new repository that is opened in GitHub and GitLab default > to `main`. However, Git has not yet made the same change. As a result, local repositories > must be manually configured have the same main branch name as most cloud services. > > For versions of Git prior to 2.28, the change can be made on an individual repository level. The > command for this is in the next episode. Note that if this value is unset in your local Git > configuration, the `init.defaultBranch` value defaults to `master`.
uk: > > Зміни у змісті репозиторію пов’язані з "гілкою". > Для початківців у цьому уроці буде достатньо знати, що гілки існують, і що в цьому уроці використовується тільки одна гілка. > За замовчуванням, Git створить гілку під назвою `master` > коли ви створюєте нову репозиторію за допомогою `git init` (пояснено в наступному Епізоді). Цей термін нагадує про > расистську практику людського рабства, тому у > [спільноті розробників програмного забезпечення](https://github.com/github/renaming) вирішили використовувати > більш інклюзивну мову. > > В 2020, більшість сервісів хостингу коду Git перейшли до використання `main` як стандартної > гілки. Наприклад, будь-яка нова репозиторія створена у GitHub та GitLab за замовчуванням буде мати назву > `main`. Однак в Git такої ж зміни ще не було застосовано. В результаті локальні репозиторії > повинні бути налаштовані вручну, мати ту саму назву головної гілки як і більшість хмарних сервісів. > > Для версій Git до 2.28, зміну можна зробити на індивідуальному рівні репозиторії. > Команду для цього можна знайти в наступному епізоді. Зауважте, якщо це значення не встановлено у вашій локальній системі Git, > то `init.defaultBranch` за замовчуванням буде `master`.

source: The five commands we just ran above only need to be run once: the flag `--global` tells Git to use the settings for every project, in your user account, on this computer.
uk: П'ять команд, які ми щойно запускаємо вище, потрібно запускати лише один раз: параметр `--global` каже Git використовувати ці налаштування для кожного проєкту у вашому обліковому записі користувача на цьому комп'ютері.

source: You can check your settings at any time:
uk: Ви можете перевірити ваші налаштування у будь-яку мить:

source: You can change your configuration as many times as you want: use the same commands to choose another editor or update your email address.
uk: Ви можете змінити ваші налаштування стільки разів, скільки забажаєте: використовуйте ті ж самі команди, щоб обрати інший текстовий редактор або оновити вашу електронну адресу.

source: > ## Proxy
uk: > ## Проксі-сервер

source: > > In some networks you need to use a > [proxy](https://en.wikipedia.org/wiki/Proxy_server). If this is the case, you > may also need to tell Git about the proxy: > > ~~~ > $ git config --global http.proxy proxy-url > $ git config --global https.proxy proxy-url > ~~~ > {: .language-bash} > > To disable the proxy, use > > ~~~ > $ git config --global --unset http.proxy > $ git config --global --unset https.proxy > ~~~ > {: .language-bash}
uk: > > В деяких мережах потрібно використовувати > [проксі-сервер](https://en.wikipedia.org/wiki/Proxy_server). Якщо це так, > вам також може знадобитися повідомити про це Git: > > ~~~ > $ git config --global http.proxy proxy-url > $ git config --global https.proxy proxy-url > ~~~ > {: .language-bash} > > Щоб вимкнути проксі, скористайтеся > > ~~~ > $ git config --global --unset http.proxy > $ git config --global --unset https.proxy > ~~~ > {: .language-bash}

source: > ## Git Help and Manual
uk: > ## Довідка про Git та посібник користувача

source: > > Always remember that if you forget the subcommands or options of a `git` command, you can access the > relevant list of options typing `git <command> -h` or access the corresponding Git manual by typing > `git <command> --help`, e.g.: > > ~~~ > $ git config -h > $ git config --help > ~~~ > {: .language-bash} > > While viewing the manual, remember the `:` is a prompt waiting for commands and you can press <kbd>Q</kbd> to exit the manual. > > More generally, you can get the list of available `git` commands and further resources of the Git manual typing: > > ~~~ > $ git help > ~~~ > {: .language-bash}
uk: > > Завжди пам'ятайте: якщо ви забули підкоманди або параметри команди `git`, ви можете отримати > відповідний список параметрів, надрукувавши `git <command> -h` або подивитись у документації Git, ввівши > `git <command> --help`, e.g.: > > ~~~ > $ git config -h > $ git config --help > ~~~ > {: .language-bash} > > Під час перегляду документації запам’ ятайте, що `:` — це підказка, яка очікує на команди, і ви можете натиснути кнопку <kbd>Q</kbd> щоб вийти з посібника. > > Більш загально можна отримати список доступних `git` команд і подальші ресурси за допомогою цієї команди: > > ~~~ > $ git help > ~~~ > {: .language-bash}
