Repository: carpentries-i18n/i18n
Catalog: transifex/git-novice/*/08__04-changes.md.po
Languages: uk

source: --- title: Tracking Changes teaching: 20 exercises: 0 questions: - "How do I record changes in Git?" - "How do I check the status of my version control repository?" - "How do I record notes about what changes I made and why?" objectives: - "Go through the modify-add-commit cycle for one or more files." - "Explain where information is stored at each stage of that cycle." - "Distinguish between descriptive and non-descriptive commit messages." keypoints: - "`git status` shows the status of a repository." - "Files can be stored in a project's working directory (which users see), the staging area (where the next commit is being built up) and the local repository (where commits are permanently recorded)." - "`git add` puts files in the staging area." - "`git commit` saves the staged content as a new commit in the local repository." - "Write a commit message that accurately describes your changes." ---
uk: --- title: Відстеження змін teaching: 20 exercises: 0 questions: - "Як записати зміни в Git?" - "Як перевірити стан контролю версій свого репозиторію?" - "Як записати нотатки про те, які зміни було внесено і чому?" objectives: - "Пройти цикл зміни-додавання-коміту для одного або декількох файлів." - "Пояснити де зберігається інформація на кожному етапі цього циклу." - "Пояснити різницю між інформативними та неінформативними повідомленнями комітів." keypoints: - "`git status` показує стан репозиторію." - "Файли можуть зберігатися в робочій директорії проєкту (яку бачать користувачі), зоні стейджингу (де будується наступний коміт) і локальному репозиторії (де коміти постійно зберігаються)." - "`git add` додає файли до зони стейджингу." - "`git commit` зберігає все, що міститься у зоні стейджингу, як новий коміт у локальному репозиторії." - "Складайте повідомлення коміту так, щоб воно акуратно описувало ваші зміни." ---

source: First let's make sure we're still in the right directory. You should be in the `planets` directory.
uk: Спочатку переконайтеся, що ми все ще в правильній директорії. Ви повинні знаходитися у директорії `planets`.

source: Let's create a file called `mars.txt` that contains some notes about the Red Planet's suitability as a base. We'll use `nano` to edit the file; you can use whatever editor you like. In particular, this does not have to be the `core.editor` you set globally earlier. But remember, the bash command to create or edit a new file will depend on the editor you choose (it might not be `nano`). For a refresher on text editors, check out ["Which Editor?"](https://swcarpentry.github.io/shell-novice/03-create/) in [The Unix Shell](https://swcarpentry.github.io/shell-novice/) lesson.
uk: Давайте створимо файл під назвою `mars.txt`, який буде містити деякі нотатки про придатність Червоної Планети як бази. Ми будемо використовувати редактор `nano` для редагування файлу; ви можете використовувати будь-який редактор, який вам подобається. Зокрема, це не обовʼязково повинен бути `core.editor`, який ви вказали глобально. Але пам'ятайте, що команда bash для створення або редагування нового файлу буде залежати від редактора, який ви оберете (це може бути не `nano`). Для довідки щодо текстових редакторів, дивіться ["Which Editor?"](https://swcarpentry.github.io/shell-novice/03-create/) в уроці [The Unix Shell](https://swcarpentry.github.io/shell-novice/).

source: Type the text below into the `mars.txt` file:
uk: Надрукуйте нижче наведений текст у файлі `mars.txt`:

source: Let's first verify that the file was properly created by running the list command (`ls`):
uk: Давайте спочатку перевіримо, що файл був правильно створений, запустивши команду `ls`:

source: `mars.txt` contains a single line, which we can see by running:
uk: `mars.txt` містить тільки один рядок, який ми можемо побачити, запустивши:

source: If we check the status of our project again, Git tells us that it's noticed the new file:
uk: Якщо ми знову перевіримо статус нашого проєкту, Git повідомляє нам, що він помітив новий файл:

source: The "untracked files" message means that there's a file in the directory that Git isn't keeping track of. We can tell Git to track a file using `git add`:
uk: Повідомлення "untracked files" означає, що в директорії існує файл, який Git не відстежує. Ми можемо повідомити Git, що цей файл треба відстежувати за допомогою команди `git add`:

source: and then check that the right thing happened:
uk: та згодом переконатися, що все виглядає правильно:

source: Git now knows that it's supposed to keep track of `mars.txt`, but it hasn't recorded these changes as a commit yet. To get it to do that, we need to run one more command:
uk: Git тепер знає, що він повинен стежити за файлом "mars.txt', але він ще не зафіксував зміни у цьому файлі. Щоб зробити це, нам потрібно запустити ще одну команду:

source: When we run `git commit`, Git takes everything we have told it to save by using `git add` and stores a copy permanently inside the special `.git` directory. This permanent copy is called a [commit]({{ page.root }}{% link reference.md %}#commit) (or [revision]({{ page.root }}{% link reference.md %}#revision)) and its short identifier is `f22b25e`. Your commit may have another identifier.
uk: Коли ми запускаємо `git commit`, Git бере все, що ми раніше запросили його зберегти, використовуючи `git add`, та зберігає постійну копію цих змін у спеціальній директорії `.git`. Ця постійна копія називається [коміт]({{ page.root }}{% link reference.md %}#commit) (commit) (або [revision]({{ page.root }}{% link reference.md %}#revision)). У цьому прикладі коміт має скорочений ідентифікатор `f22b25e`. Ваш коміт може мати інший ідентифікатор.

source: We use the `-m` flag (for "message") to record a short, descriptive, and specific comment that will help us remember later on what we did and why. If we just run `git commit` without the `-m` option, Git will launch `nano` (or whatever other editor we configured as `core.editor`) so that we can write a longer message.
uk: Ми використовуємо команду `-m` (від "message") щоб надати короткий, інформативний та конкретний коментар, який допоможе нам згадати пізніше про те, що ми зробили і чому. Якщо ми просто запустимо `git commit` без опції `-m`, Git запустить `nano` (або будь-який інший редактор, який ми вказали як `core.editor`), щоб ми могли написати довше повідомлення.

source: [Good commit messages][commit-messages] start with a brief (<50 characters) statement about the changes made in the commit. Generally, the message should complete the sentence "If applied, this commit will" <commit message here>. If you want to go into more detail, add a blank line between the summary line and your additional notes. Use this additional space to explain why you made changes and/or what their impact will be.
uk: [Гарні повідомлення комітів][commit-messages] починаються з короткого (< 50 символів) твердження про зміни, внесені в коміт. Загалом, повідомлення має завершити речення "If applied, this commit will" <commit message here>. Якщо ви хочете вдатися більше в деталі, додайте порожній рядок між першим рядком та вашими додатковими нотатками. Використовуйте додаткові нотатки, щоб пояснити, чому ви внесли зміни та/або яким буде їх вплив.

source: If we run `git status` now:
uk: Якщо ми тепер запустимо `git status`:

source: it tells us everything is up to date. If we want to know what we've done recently, we can ask Git to show us the project's history using `git log`:
uk: Git говорить нам, що поточний стан файлів відповідає їх стану, який збережений у репозиторїї. Якщо ми хочемо знати, що саме ми зробили нещодавно - ми можемо попросити Git показати нам історію проєкту, використовуючи `git log`:

source: `git log` lists all commits made to a repository in reverse chronological order. The listing for each commit includes the commit's full identifier (which starts with the same characters as the short identifier printed by the `git commit` command earlier), the commit's author, when it was created, and the log message Git was given when the commit was created.
uk: `git log` виводить перелік усіх комітів, які були внесені до репозиторію, у зворотному хронологічному порядку. Для кожного коміту буде надруковано повний ідентифікатор коміту (який починається з тих же символів, що і скорочений ідентифікатор, попередньо надрукований командою `git commit`), автор коміту, дата його створення, і повідомлення Git, яке було додано під час запису коміту.

source: > ## Where Are My Changes?
uk: > ## Де зберігаються мої зміни?

source: > > If we run `ls` at this point, we will still see just one file called `mars.txt`. > That's because Git saves information about files' history > in the special `.git` directory mentioned earlier > so that our filesystem doesn't become cluttered > (and so that we can't accidentally edit or delete an old version).
uk: > > Якщо ми в цей момент запустимо `ls`, ми все одно побачимо лише один файл, який називається `mars.txt`. > Це відбувається тому, що Git зберігає інформацію про історію файлів > у спеціальній директорії `.git`, згаданій раніше, > щоб наша файлова система не засмічувалася > (і щоб ми випадково не могли змінити або видалити стару версію).

source: Now suppose Dracula adds more information to the file. (Again, we'll edit with `nano` and then `cat` the file to show its contents; you may use a different editor, and don't need to `cat`.)
uk: Тепер уявімо, що Dracula додає нову інформацію до файлу. (Знову ж таки, ми будемо редагувати його за допомогою `nano`, і потім перевіряти його зміст за допомогою `cat`; ви можете користуватися іншим редактором, та можете не використовувати `cat`.)

source: When we run `git status` now, it tells us that a file it already knows about has been modified:
uk: Тепер, коли ми запускаємо `git status`, Git повідомляє нам, що файл, про який він вже знає, був змінений:

source: The last line is the key phrase: "no changes added to commit". We have changed this file, but we haven't told Git we will want to save those changes (which we do with `git add`) nor have we saved them (which we do with `git commit`). So let's do that now. It is good practice to always review our changes before saving them. We do this using `git diff`. This shows us the differences between the current state of the file and the most recently saved version:
uk: Ключова фраза - це останній рядок: "no changes added to commit". Ми змінили цей файл, але ми не сказали Git, що ми маємо намір зберегти ці зміни у майбутньому (за допомогою `git add`) або, що ми хочемо зберегти їх зараз (за допомогою `git commit`). Давайте зробимо це зараз. Хорошою практикою є перегляд наших змін кожного разу перед їх збереженням. Ми робимо це за допомогою `git diff`. Це показує нам відмінності між поточним станом файлу і останньою збереженою версією:

source: The output is cryptic because it is actually a series of commands for tools like editors and `patch` telling them how to reconstruct one file given the other. If we break it down into pieces:
uk: Результат цієї команди важко зрозуміти, тому що це насправді серія команд для таких інструментів, як редактори або `patch`, яка вказує як змінити один файл за допомогою іншого. Якщо розділити цей результат на фрагменти:

source: 1. The first line tells us that Git is producing output similar to the Unix `diff` command
uk: 1. Перший рядок вказує нам на те, що результат цієї команди у Git подібен до Unix команди `diff`,

source: comparing the old and new versions of the file. 2. The second line tells exactly which versions of the file Git is comparing; `df0654a` and `315bf3a` are unique computer-generated labels for those versions. 3. The third and fourth lines once again show the name of the file being changed. 4. The remaining lines are the most interesting, they show us the actual differences and the lines on which they occur. In particular, the `+` marker in the first column shows where we added a line.
uk: яка порівнює стару та нову версії файлу. 2. Другий рядок повідомляє які саме версії файлу Git порівнює; `df0654a` та `315bf3a` є унікальними ідентифікаторами цих версій. 3. Третій та четвертий рядки ще раз показують назву файлу, що змінюється. 4. Решта рядків найцікавіші, вони показують нам фактичні відмінності і рядки, у яких вони відбуваються. Зокрема, значок `+` в першому стовпці вказує де ми додали рядок.

source: After reviewing our change, it's time to commit it:
uk: Після того, як ми переглянули наші зміни, прийшов час зберегти їх:

source: Whoops: Git won't commit because we didn't use `git add` first. Let's fix that:
uk: Але це не спрацює: Git не буде додавати зміни, тому що ми не використали спочатку `git add`. Давайте виправимо це:

source: Git insists that we add files to the set we want to commit before actually committing anything. This allows us to commit our changes in stages and capture changes in logical portions rather than only large batches. For example, suppose we're adding a few citations to relevant research to our thesis. We might want to commit those additions, and the corresponding bibliography entries, but *not* commit some of our work drafting the conclusion (which we haven't finished yet).
uk: Git наполягає, щоб ми додали файли до набору змін, які ми хочемо записати, перед тим як ми зробимо коміт. Це дозволяє зберігати зміни поступово та обʼєднувати їх у логічні блоки, аніж у великі набори змін. Наприклад, припустимо, ми робимо коміт кількох цитат відповідних досліджень у нашій дисертації. Можливо, ми бажаємо зберегти ці зміни, та відповідні записи у бібліографії, але *не* зберігати деякі інші зміни в нашій роботі (наприклад, висновок, який ми ще не закінчили).

source: To allow for this, Git has a special *staging area* where it keeps track of things that have been added to the current [changeset]({{ page.root }}{% link reference.md %}#changeset) but not yet committed.
uk: Щоб це було можливо зробити, Git має спеціальну *зону стейджингу* *staging area* де він відстежує речі, які були додані до поточного [набору змін]({{ page.root }}{% link reference.md %}#changeset) проте, ще не були збережені.

source: > ## Staging Area
uk: > ## Зона стейджингу

source: > > If you think of Git as taking snapshots of changes over the life of a project, > `git add` specifies *what* will go in a snapshot > (putting things in the staging area), > and `git commit` then *actually takes* the snapshot, and > makes a permanent record of it (as a commit). > If you don't have anything staged when you type `git commit`, > Git will prompt you to use `git commit -a` or `git commit --all`, > which is kind of like gathering *everyone* to take a group photo! > However, it's almost always better to > explicitly add things to the staging area, because you might > commit changes you forgot you made. (Going back to the group photo simile, > you might get an extra with incomplete makeup walking on > the stage for the picture because you used `-a`!) > Try to stage things manually, > or you might find yourself searching for "git undo commit" more > than you would like!
uk: > > Якщо ви будете уявляти, ніби Git робить знімки змін протягом життя проєкту, то > `git add` вказує *що* буде на знімку > (додаючи речі в зоні стейждингу), > а `git commit` після того *насправді робить* знімок, та > назавжди зберігає його (як коміт). > Якщо у зоні стейджингу нічого немає, то коли ви введете `git commit`, > Git запропонує вам використати `git commit -a` або `git commit --all`, > який ніби збирає разом *всіх*, щоб зробити групове фото! > Однак майже завжди краще > явним чином додати речі до зони стейджингу, тому без цього ви можете > випадково зберегти інші зміни, про які ви забули. (Повертаючись до порівняння з груповим фото, > якщо ви використали команду "-а", > до вашої фотографії може потрапити зайва людина!) > Тому додавайте речі в зону стейджингу власноруч - > у іншому випадку вам може знадобитися шукати допомоги з "git undo commit" частіше, ніж > вам хотілося б!

source: ![The Git Staging Area](../fig/git-staging-area.svg)
uk: ![Зона стейджингу Git](../fig/git-staging-area.svg)

source: Let's watch as our changes to a file move from our editor to the staging area and into long-term storage. First, we'll add another line to the file:
uk: Давайте подивимося, як наші зміни у файлі проходять шлях від текстового редактора до зони стейджингу і далі у довгострокове зберігання. Спочатку, ми додамо новий рядок у наш файл:

source: So far, so good: we've added one line to the end of the file (shown with a `+` in the first column). Now let's put that change in the staging area and see what `git diff` reports:
uk: Поки що все добре: ми додали один рядок в кінці файлу (що зазначає `+` у першій колонці). Тепер давайте помістимо цю зміну у зону стейджингу та подивимося що після цього звітує `git diff`:

source: There is no output: as far as Git can tell, there's no difference between what it's been asked to save permanently and what's currently in the directory. However, if we do this:
uk: Результату немає: це виглядає ніби для Git немає різниці між тим, що вже було збережено назавжди і тим, що зараз міститься у робочій директорії. Проте, якщо ми зробимо наступне:

source: it shows us the difference between the last committed change and what's in the staging area. Let's save our changes:
uk: то ми побачимо різницю між останніми збереженими змінами і тими, які знаходяться в зоні стейджингу. Давайте збережемо наші зміни:

source: check our status:
uk: перевіримо наш статус:

source: and look at the history of what we've done so far:
uk: і подивимося на історію попередніх змін:

source: > ## Word-based diffing
uk: > ## Порівняння з підсвіткою змінених слів у рядках

source: > > Sometimes, e.g. in the case of the text documents a line-wise > diff is too coarse. That is where the `--color-words` option of > `git diff` comes in very useful as it highlights the changed > words using colors.
uk: > > Інколи, наприклад, у випадку текстових документів, результат > `diff` дуже важко зрозуміти. Саме тут `--color-words` опція для > `git diff` є надзвичайно зручною, бо вона виділяє кольором змінені слова.

source: > ## Paging the Log
uk: ## Перегляд історії змін за сторінками

source: > > When the output of `git log` is too long to fit in your screen, > `git` uses a program to split it into pages of the size of your screen. > When this "pager" is called, you will notice that the last line in your > screen is a `:`, instead of your usual prompt. > > * To get out of the pager, press <kbd>Q</kbd>. > * To move to the next page, press <kbd>Spacebar</kbd>. > * To search for `some_word` in all pages, > press <kbd>/</kbd> > and type `some_word`. > Navigate through matches pressing <kbd>N</kbd>.
uk: Коли розмір результату `git log` перевищує розмір вашого екрану, `git` використовує спеціальну програму "пейджер", щоб поділити результат між сторінками. Після виклику "пейджера", ви помітите, що останній рядок вашого результату закінчується на `:`, замість звичайного закінчення. Натисніть <kbd>Q</kbd>, щоб вийти з пейджеру. Натисніть <kbd>пробіл</kbd>, щоб перейти на наступну сторінку. Натисніть <kbd>/</kbd> та напишіть бажане слово задля пошуку його на усіх сторінках. Натисніть <kbd>N</kbd>, для навігації між результатами пошуку.

source: > ## Limit Log Size
uk: ## Обмеження розміру відображеної історії змін

source: > > To avoid having `git log` cover your entire terminal screen, you can limit the > number of commits that Git lists by using `-N`, where `N` is the number of > commits that you want to view. For example, if you only want information from > the last commit you can use: > > ~~~ > $ git log -1 > ~~~ > {: .language-bash} > > ~~~ > commit 005937fbe2a98fb83f0ade869025dc2636b4dad5 (HEAD -> main) > Author: Vlad Dracula <vlad@tran.sylvan.ia> > Date: Thu Aug 22 10:14:07 2013 -0400 > > Discuss concerns about Mars' climate for Mummy > ~~~
uk: > >Щоб запобігти випадку, коли `git log` повністю займає ваш термінал, > ви можете обмежувати кількість комітів які відображує Git, використовуючи опцію `-N`, де `N` - кількість > комітів які би ви бажали бачити на екрані. Наприклад, якщо ви бажаєте побачити лише останній коміт, > використовуйте команду ~~~ $ git log -1 {: .language-bash} ~~~ commit 005937fbe2a98fb83f0ade869025dc2636b4dad5 (HEAD -> main) > Author: Vlad Dracula <vlad@tran.sylvan.ia> > Date: Thu Aug 22 10:14:07 2013 -0400 > > Discuss concerns about Mars' climate for Mummy > ~~~

source: > > You can also reduce the quantity of information using the > `--oneline` option: > > ~~~ > $ git log --oneline > ~~~ > {: .language-bash} > ~~~ > 005937f (HEAD -> main) Discuss concerns about Mars' climate for Mummy > 34961b1 Add concerns about effects of Mars' moons on Wolfman > f22b25e Start notes on Mars as a base > ~~~
uk: > > Ви також можете зменшити кількість інформації, використовуючи > опцію `--oneline`: > > ~~~ > $ git log --oneline > ~~~ > {: .language-bash} > ~~~ > 005937f (HEAD -> main) Discuss concerns about Mars' climate for Mummy > 34961b1 Add concerns about effects of Mars' moons on Wolfman > f22b25e Start notes on Mars as a base > ~~~

source: > > You can also combine the `--oneline` option with others. One useful > combination adds `--graph` to display the commit history as a text-based > graph and to indicate which commits are associated with the > current `HEAD`, the current branch `main`, or > [other Git references][git-references]: > > ~~~ > $ git log --oneline --graph > ~~~ > {: .language-bash} > ~~~ > * 005937f (HEAD -> main) Discuss concerns about Mars' climate for Mummy > * 34961b1 Add concerns about effects of Mars' moons on Wolfman > * f22b25e Start notes on Mars as a base > ~~~
uk: > > Ви також можете комбінувати опцію `--oneline` з іншими опціями. Одна корисна > комбінація додає `--graph` для графічного відображення історії комітів за допомогою > псевдографіки, вказуючи при цьому які коміти пов`язані з > поточним `HEAD`, поточним бранчем `main`, або > [іншими обʼєктами у Git репозиторії][git-references]: > > ~~~ > $ git log --oneline --graph > ~~~ > {: .language-bash} > ~~~ > * 005937f (HEAD -> main) Discuss concerns about Mars' climate for Mummy > * 34961b1 Add concerns about effects of Mars' moons on Wolfman > * f22b25e Start notes on Mars as a base > ~~~

source: > ## Directories
uk: > ## Директорії
