Repository: carpentries-i18n/i18n
Catalog: transifex/git-novice/*/08__04-changes.md.po
Languages: uk

source: > > Two important facts you should know about directories in Git. > > 1. Git does not track directories on their own, only files within them. > Try it for yourself: > > ~~~ > $ mkdir spaceships > $ git status > $ git add spaceships > $ git status > ~~~ > {: .language-bash} > > Note, our newly created empty directory `spaceships` does not appear in > the list of untracked files even if we explicitly add it (_via_ `git add`) to our > repository. This is the reason why you will sometimes see `.gitkeep` files > in otherwise empty directories. Unlike `.gitignore`, these files are not special > and their sole purpose is to populate a directory so that Git adds it to > the repository. In fact, you can name such files anything you like. > > 2. If you create a directory in your Git repository and populate it with files, > you can add all files in the directory at once by: > > ~~~ > git add <directory-with-files> > ~~~ > {: .language-bash} > > Try it for yourself: > > ~~~ > $ touch spaceships/apollo-11 spaceships/sputnik-1 > $ git status > $ git add spaceships > $ git status > ~~~ > {: .language-bash} > > Before moving on, we will commit these changes. > > ~~~ > $ git commit -m "Add some initial thoughts on spaceships" > ~~~ > {: .language-bash}
uk: > > Дві важливі речі, які ви повинні знати про директорії в Git. > > 1. Git не відстежує директорії самостійно, тільки файли всередині них. > Спробуйте власноруч: > > ~~~ > $ mkdir spaceships > $ git status > $ git add spaceships > $ git status > ~~~ > {: .language-bash} > > Зауважте, наша новостворена порожня директорія `spaceships` не з`являється в > списку невідстежуваних файлів, навіть якщо ми конкретно додамо їх (_через_ `git add`) до нашого > репозиторію. Ось чому ви іноді бачите файли `.gitkeep` > в інших порожніх директоріях. На відміну від `.gitignore`, ці файли не є особливими > і їх єдиною метою є заповнити директорію, щоб Git додав її до > репозиторію. Насправді, ви можете назвати такі файли до вашої довподоби. > > 2. Якщо ви створюєте директорію у вашому репозиторії Git і заповнюєте її файлами, > ви можете додати всі файли в директорії одразу: > > ~~~ > git add <directory-with-files> > ~~~ > {: .language-bash} > > Спробуйте власноруч: > > ~~~ > $ touch spaceships/apollo-11 spaceships/sputnik-1 > $ git status > $ git add spaceships > $ git status > ~~~ > {: .language-bash} > > Перш ніж рухатися далі, ми збережемо ці зміни. > > ~~~ > $ git commit -m "Add some initial thoughts on spaceships" > ~~~ > {: .language-bash}

source: To recap, when we want to add changes to our repository, we first need to add the changed files to the staging area (`git add`) and then commit the staged changes to the repository (`git commit`):
uk: Для повторення: коли ми хочемо додати зміни до нашого репозиторію, спочатку нам потрібно додати змінені файли в зону стейджингу (`git add`) а потім зберегти заплановані зміни до репозиторію (`git commit`):

source: ![The Git Commit Workflow](../fig/git-committing.svg)
uk: ![Процес запису комітів у Git](../fig/git-committing.svg)

source: > ## Choosing a Commit Message
uk: > ## Вибір повідомлення коміту

source: > > Which of the following commit messages would be most appropriate for the > last commit made to `mars.txt`? > > 1. "Changes" > 2. "Added line 'But the Mummy will appreciate the lack of humidity' to mars.txt" > 3. "Discuss effects of Mars' climate on the Mummy" > > > ## Solution > > Answer 1 is not descriptive enough, and the purpose of the commit is unclear; > > and answer 2 is redundant to using "git diff" to see what changed in this commit; > > but answer 3 is good: short, descriptive, and imperative.
uk: > > Які з наступних повідомлень коміту будуть найбільш оптимальними для > останнього коміту в `mars.txt`? > > 1. "Зміни" > 2. "Додано рядок 'But the Mummy will appreciate the lack of humidity' до mars.txt" > 3. "Обговорення впливу клімату на Марсі на Mummy" > > > ## Відповідь > > Відповідь 1 є недостатньо детальною, а мета коміту неясна; > > відповідь 2 дублює результат команди "git diff" яка відобразить зміни зроблені у цьому коміті; > > 3 відповідь - оптимальна: коротка, інформативна, та імперативна.

source: > ## Committing Changes to Git
uk: > ## Збереження змін у Git

source: > > Which command(s) below would save the changes of `myfile.txt` > to my local Git repository? > > 1. ~~~ > $ git commit -m "my recent changes" > ~~~ > {: .language-bash} > 2. ~~~ > $ git init myfile.txt > $ git commit -m "my recent changes" > ~~~ > {: .language-bash} > 3. ~~~ > $ git add myfile.txt > $ git commit -m "my recent changes" > ~~~ > {: .language-bash} > 4. ~~~ > $ git commit -m myfile.txt "my recent changes" > ~~~ > {: .language-bash} > > > ## Solution > > > > 1. Would only create a commit if files have already been staged. > > 2. Would try to create a new repository. > > 3. Is correct: first add the file to the staging area, then commit. > > 4. Would try to commit a file "my recent changes" with the message myfile.txt.
uk: > > Яка(які) з наведених нижче команд збережуть зміни у файлі `myfile.txt` > до мого локального Git репозиторію? > > 1. ~~~ > $ git commit -m "my recent changes" > ~~~ > {: .language-bash} > 2. ~~~ > $ git init myfile.txt > $ git commit -m "my recent changes" > ~~~ > {: .language-bash} > 3. ~~~ > $ git add myfile.txt > $ git commit -m "my recent changes" > ~~~ > {: .language-bash} > 4. ~~~ > $ git commit -m myfile.txt "my recent changes" > ~~~ > {: .language-bash} > > > ## Відповідь > > > > 1. Створить коміт, лише якщо файли вже були у зоні стейджінгу. > > 2. Намагатиметься створити новий репозиторій. > > 3. Правильна відповідь: спочатку додайте файл до зони стейджингу, потм зробіть коміт. > > 4. Спробує записати коміт файлу з назвою "my recent changes" з повідомленням myfile.txt.

source: > ## Committing Multiple Files
uk: > ## Коміт декількох файлів

source: > > The staging area can hold changes from any number of files > that you want to commit as a single snapshot. > > 1. Add some text to `mars.txt` noting your decision > to consider Venus as a base > 2. Create a new file `venus.txt` with your initial thoughts > about Venus as a base for you and your friends > 3. Add changes from both files to the staging area, > and commit those changes. > > > ## Solution > > > > The output below from `cat mars.txt` reflects only content added during > > this exercise. Your output may vary. > > > > First we make our changes to the `mars.txt` and `venus.txt` files: > > ~~~ > > $ nano mars.txt > > $ cat mars.txt > > ~~~ > > {: .language-bash} > > ~~~ > > Maybe I should start with a base on Venus. > > ~~~ > > {: .output} > > ~~~ > > $ nano venus.txt > > $ cat venus.txt > > ~~~ > > {: .language-bash} > > ~~~ > > Venus is a nice planet and I definitely should consider it as a base. > > ~~~ > > {: .output} > > Now you can add both files to the staging area. We can do that in one line: > > > > ~~~ > > $ git add mars.txt venus.txt > > ~~~ > > {: .language-bash} > > Or with multiple commands: > > ~~~ > > $ git add mars.txt > > $ git add venus.txt > > ~~~ > > {: .language-bash} > > Now the files are ready to commit. You can check that using `git status`. If you are ready to commit use: > > ~~~ > > $ git commit -m "Write plans to start a base on Venus" > > ~~~ > > {: .language-bash} > > ~~~ > > [main cc127c2] > > Write plans to start a base on Venus > > 2 files changed, 2 insertions(+) > > create mode 100644 venus.txt > > ~~~ > > {: .output}
uk: > > Зона стейджингу може зберігати зміни у будь-якій кількості файлів, > які ви хочете записати у один коміт. > > 1. Додайте текст до `mars.txt` про те, що ви вирішили > розглянути побудову бази на Венері > 2. Створіть новий файл `venus.txt` з вашими думками > стосовно Венери як бази для вас та ваших друзів > 3. Додайте зміни у обох файлах до зони стейджінгу, > та зробіть коміт цих змін. > > > ## Відповідь > > > > Результат нижче з файлу `cat mars.txt` відображає тільки контент доданий під час > > цієї вправи. Ваш результат може виглядати іншим чином. > > > > Спочатку ми робимо зміни у файлі `mars.txt` та `venus.txt` files: > > ~~~ > > $ nano mars.txt > > $ cat mars.txt > > ~~~ > > {: .language-bash} > > ~~~ > > Maybe I should start with a base on Venus. > > ~~~ > > {: .output} > > ~~~ > > $ nano venus.txt > > $ cat venus.txt > > ~~~ > > {: .language-bash} > > ~~~ > > Venus is a nice planet and I definitely should consider it as a base. > > ~~~ > > {: .output} > > Тепер ви можете додати обидва файли до зони стейджингу. Ми можемо зробити це однією командою: > > > > ~~~ > > $ git add mars.txt venus.txt > > ~~~ > > {: .language-bash} > > Або за допомогою декількох команд: > > ~~~ > > $ git add mars.txt > > $ git add venus.txt > > ~~~ > > {: .language-bash} > > Тепер файли готові для коміту. Ви можете перевірити це за допомогою `git status`. Якщо ви готові зробити коміт, використовуйте > > ~~~ > > $ git commit -m "Write plans to start a base on Venus" > > ~~~ > > {: .language-bash} > > ~~~ > > [main cc127c2] > > Write plans to start a base on Venus > > 2 files changed, 2 insertions(+) > > create mode 100644 venus.txt > > ~~~ > > {: .output}

source: > ## `bio` Repository
uk: > ## Репозиторій `bio`

source: > > * Create a new Git repository on your computer called `bio`. > * Write a three-line biography for yourself in a file called `me.txt`, > commit your changes > * Modify one line, add a fourth line > * Display the differences > between its updated state and its original state. > > > ## Solution > > > > If needed, move out of the `planets` folder: > > > > ~~~ > > $ cd .. > > ~~~ > > {: .language-bash} > > > > Create a new folder called `bio` and 'move' into it: > > > > ~~~ > > $ mkdir bio > > $ cd bio > > ~~~ > > {: .language-bash} > > > > Initialise git: > > > > ~~~ > > $ git init > > ~~~ > > {: .language-bash} > > > > Create your biography file `me.txt` using `nano` or another text editor. > > Once in place, add and commit it to the repository: > > > > ~~~ > > $ git add me.txt > > $ git commit -m "Add biography file" > > ~~~ > > {: .language-bash} > > > > Modify the file as described (modify one line, add a fourth line). > > To display the differences > > between its updated state and its original state, use `git diff`: > > > > ~~~ > > $ git diff me.txt > > ~~~ > > {: .language-bash}
uk: > > * Створіть новий репозиторій Git на вашому комп`ютері під назвою `bio`. > * Напишіть три рядки своєї біографії у файлі під назвою `me.txt`, > та зробіть коміт цих змін > * Змініть один з рядків, додайте четвертий рядок > * Покажіть відмінності > між оновленим файлом та його попередньою версією. > > > ## Відповідь > > > > Якщо необхідно, вийдіть з папки `planets`: > > > > ~~~ > > $ cd .. > > ~~~ > > {: .language-bash} > > > > Створіть нову папку `bio` та перейдіть до неї: > > > > ~~~ > > $ mkdir bio > > $ cd bio > > ~~~ > > {: .language-bash} > > > > Iніціалізуйте репозиторій Git: > > > > ~~~ > > $ git init > > ~~~ > > {: .language-bash} > > > > Створіть файл `me.txt` з вашою біографією, використовуючи `nano` або інший текстовий редактор. > > Коли будете готові, додайте його до зони стейджингу та запишіть коміт до репозиторію: > > > > ~~~ > > $ git add me.txt > > $ git commit -m "Add biography file" > > ~~~ > > {: .language-bash} > > > > Змініть файл як описано (змініть один рядок, додайте четвертий рядок). > > Для того щоб показати зміни > > між оновленим файлом та його попередньою версією, використайте `git diff`: > > > > ~~~ > > $ git diff me.txt > > ~~~ > > {: .language-bash}
