Repository: carpentries-i18n/i18n
Catalog: transifex/git-novice/*/10__06-ignore.md.po
Languages: uk

source: --- title: Ignoring Things teaching: 5 exercises: 0 questions: - "How can I tell Git to ignore files I don't want to track?" objectives: - "Configure Git to ignore specific files." - "Explain why ignoring files can be useful." keypoints: - "The `.gitignore` file tells Git what files to ignore." ---
uk: --- title: Ігнорування файлів teaching: 5 exercises: 0 questions: - "Як зробити щоб Git ігнорував файли, які я не хочу відстежувати?" objectives: - "Налаштувати Git для ігнорування певних файлів." - "Зрозуміти чому ігнорування файлів може бути корисним." keypoints: - "Файл `.gitignore` інформує Git про те, які файли треба ігнорувати." ---

source: What if we have files that we do not want Git to track for us, like backup files created by our editor or intermediate files created during data analysis? Let's create a few dummy files:
uk: Що робити, якщо у нас є файли, які ми не хочемо відстежувати у Git, наприклад, резервні файли, створені нашим редактором або проміжні файли, створені під час аналізу даних? Давайте створимо кілька фіктивних файлів:

source: and see what Git says:
uk: і подивимося що скаже Git:

source: Putting these files under version control would be a waste of disk space. What's worse, having them all listed could distract us from changes that actually matter, so let's tell Git to ignore them.
uk: Відстеження цих файлів за допомогою контролю версій буде марною тратою дискового простору. Що гірше, висвітлення змін в них, під час перегляду історії або статусу проєкту може відвернути нас від змін, які насправді мають значення, тож давайте скажемо Git, що їх треба ігнорувати.

source: We do this by creating a file in the root directory of our project called `.gitignore`:
uk: Ми можемо зробити це, створюючи у кореневій директорії нашого проєкту файл під назвою `.gitignore`:

source: These patterns tell Git to ignore any file whose name ends in `.dat` and everything in the `results` directory. (If any of these files were already being tracked, Git would continue to track them.)
uk: Цей синтакс наказує Git ігнорувати будь-який файл, ім'я якого закінчується на `.dat` та все, що знаходиться у директорії `results`. (Якщо будь-які з цих файлів вже відстежуються, Git продовжить їх відстежувати.)

source: Once we have created this file, the output of `git status` is much cleaner:
uk: Як тільки ми створили цей файл, результат `git status` стає набагато зрозумілішим:

source: The only thing Git notices now is the newly-created `.gitignore` file. You might think we wouldn't want to track it, but everyone we're sharing our repository with will probably want to ignore the same things that we're ignoring. Let's add and commit `.gitignore`:
uk: Єдина річ, яку Git помічає зараз - це новостворений файл `.gitignore`. Ви можете подумати, що ми не хотіли б відстежувати його, але всі, з ким ми ділимося нашим репозиторієм, ймовірно, захочуть ігнорувати те ж саме, що ми ігноруємо. Давайте додамо до репозиторію та зробимо коміт файлу `.gitignore`:

source: As a bonus, using `.gitignore` helps us avoid accidentally adding files to the repository that we don't want to track:
uk: Як бонус, використання `.gitignore` допомагає нам уникнути випадкового додавання до репозиторію файлів, які ми не хочемо відстежувати:

source: If we really want to override our ignore settings, we can use `git add -f` to force Git to add something. For example, `git add -f a.dat`. We can also always see the status of ignored files if we want:
uk: Якщо ми дійсно хочемо змінити наші налаштування ігнорування, ми можемо використати `git add -f`, щоб змусити Git додати щось. Наприклад, `git add -f a.dat`. Ми також завжди можемо бачити статус ігнорованих файлів, якщо хочемо:

source: > ## Ignoring Nested Files
uk: > ## Ігнорування файлів у піддиректоріях

source: > > Given a directory structure that looks like: > > ~~~ > results/data > results/plots > ~~~ > {: .language-bash} > > How would you ignore only `results/plots` and not `results/data`? > > > ## Solution > > > > If you only want to ignore the contents of > > `results/plots`, you can change your `.gitignore` to ignore > > only the `/plots/` subfolder by adding the following line to > > your .gitignore: > > > > ~~~ > > results/plots/ > > ~~~ > > {: .output} > > > > This line will ensure only the contents of `results/plots` is ignored, and > > not the contents of `results/data`. > > > > As with most programming issues, there > > are a few alternative ways that one may ensure this ignore rule is followed. > > The "Ignoring Nested Files: Variation" exercise has a slightly > > different directory structure > > that presents an alternative solution. > > Further, the discussion page has more detail on ignore rules.
uk: > > Враховуючи структуру директорій, яка виглядає як: > > ~~~ > results/data > results/plots > ~~~ > {: .language-bash} > > як зробити так, щоб Git ігнорував тільки `results/plots`, а не `results/data`? > > > ## Відповідь > > > > Якщо ви тільки хочете ігнорувати вміст > > `results/plots`, ви можете зробити це > > шляхом додавання наступного рядка до > > вашого .gitignore: > > > > ~~~ > > results/plots/ > > ~~~ > > {: .output} > > > > Цей рядок забезпечить ігнорування лише вмісту `results/plots`, але > > не вмісту `results/data`. > > > > Як і в більшості питань програмування, > > є ще кілька альтернативних способів, які можуть забезпечити виконання цього правила ігнорування. > > Вправа «Варіант ігнорування вкладених файлів» має трохи > > іншу структуру директорій, > > та пояснює альтернативне рішення. > > Крім того, сторінка обговорення має більш детальну інформацію про правила ігнорування.

source: > ## Including Specific Files
uk: > ## Додавання конкретних файлів

source: > > How would you ignore all `.dat` files in your root directory except for > `final.dat`? > Hint: Find out what `!` (the exclamation point operator) does > > > ## Solution > > > > You would add the following two lines to your .gitignore: > > > > ~~~ > > *.dat # ignore all data files > > !final.dat # except final.data > > ~~~ > > {: .output} > > > > The exclamation point operator will include a previously excluded entry. > > > > Note also that because you've previously committed `.dat` files in this > > lesson they will not be ignored with this new rule. Only future additions > > of `.dat` files added to the root directory will be ignored.
uk: > > Як ігнорувати всі файли `.dat` у кореневій директорії, за вийнятком > `final.dat`? > Підказка: Дізнайтеся, що робить «!» (оператор знаку оклику) > > > ## Відповідь > > > > Треба додати наступні два рядки до вашого файлу `.gitignore`: > > > > ~~~ > > *.dat # ignore all data files > > !final.dat # except final.data > > ~~~ > > {: .output} > > > > Оператор знаку оклику призведе до включення раніше виключеного запису. > > > > Зверніть увагу також на те, що, оскільки ви раніше вже зберегли файли `.dat` у комітах зроблених в цьому > > уроці, вони не будуть проігноровані з цим новим правилом. Тільки майбутні додавання > > `.dat` файлів до кореневої директорії будуть проігноровані.

source: > ## Ignoring Nested Files: Variation
uk: > ## Варіант ігнорування вкладених файлів

source: > > Given a directory structure that looks similar to the earlier Nested Files > exercise, but with a slightly different directory structure: > > ~~~ > results/data > results/images > results/plots > results/analysis > ~~~ > {: .language-bash} > > How would you ignore all of the contents in the results folder, but not `results/data`? > > Hint: think a bit about how you created an exception with the `!` operator > before. > > > ## Solution > > > > If you want to ignore the contents of > > `results/` but not those of `results/data/`, you can change your `.gitignore` to ignore > > the contents of results folder, but create an exception for the contents of the > > `results/data` subfolder. Your .gitignore would look like this: > > > > ~~~ > > results/* # ignore everything in results folder > > !results/data/ # do not ignore results/data/ contents > > ~~~ > > {: .output}
uk: > > Нехай ми маємо структуру каталогів, яка схожа на попередню вправу "Ігнорування файлів у піддиректоріях", > проте, з трішки іншою структурою директорій: > > ~~~ > results/data > results/images > results/plots > results/analysis > ~~~ > {: .language-bash} > > Як би ви проігнорували весь вміст у папці `results`, окрім `results/data`? > > Підказка: подумайте трохи про те, як ви попередньо створили виняток > за допомогою оператору `!`. > > > ## Відповідь > > > > Якщо ви хочете ігнорувати вміст > > `results/` але не `results/data/`, ви можете змінити ваш`.gitignore`, щоб ігнорувати > > вміст папки `results`, але створити виняток для вмісту > > підпапки `results/data`. Ваш `.gitignore` буде виглядати так: > > > > ~~~ > > results/* # ignore everything in results folder > > !results/data/ # do not ignore results/data/ contents > > ~~~ > > {: .output}

source: > ## Ignoring all data Files in a Directory
uk: > ## Ігнорування всіх Файлів даних у Директорії

source: > > Assuming you have an empty .gitignore file, and given a directory structure that looks like: > > ~~~ > results/data/position/gps/a.dat > results/data/position/gps/b.dat > results/data/position/gps/c.dat > results/data/position/gps/info.txt > results/plots > ~~~ > {: .language-bash} > > What's the shortest `.gitignore` rule you could write to ignore all `.dat` > files in `result/data/position/gps`? Do not ignore the `info.txt`. > > > ## Solution > > > > Appending `results/data/position/gps/*.dat` will match every file in `results/data/position/gps` > > that ends with `.dat`. > > The file `results/data/position/gps/info.txt` will not be ignored.
uk: > > Припустимо, що у вас порожній .gitignore файл, і дано структуру каталогів, яка виглядає як: > > ~~~ > results/data/position/gps/a.dat > results/data/position/gps/b.dat > results/data/position/gps/c.dat > results/data/position/gps/info.txt > results/plots > ~~~ > {: .language-bash} > > Яке найкоротше правило `.gitignore` ви можете написати, щоб ігнорувати файли `.dat` > в `result/data/position/gps`? Не ігноруйте `info.txt`. > > > ## Відповідь > > > > Додавання `results/data/position/gps/*.dat` буде відповідати кожному з файлів у `results/data/position/gps`, > > які закінчуються на `.dat`. > > Файл `results/data/position/gps/info.txt` не буде проігноровано.

source: > ## Ignoring all data Files in the repository
uk: > ## Ігнорування всіх файлів з даними у репозиторії

source: > > Let us assume you have many `.dat` files in different subdirectories of your repository. > For example, you might have: > > ~~~ > results/a.dat > data/experiment_1/b.dat > data/experiment_2/c.dat > data/experiment_2/variation_1/d.dat > ~~~ > {: .language-bash} > > How do you ignore all the `.dat` files, without explicitly listing the names of the corresponding folders? > > > ## Solution > > > > In the `.gitignore` file, write: > > > > ~~~ > > **/*.dat > > ~~~ > > {: .output} > > > > This will ignore all the `.dat` files, regardless of their position in the directory tree. > > You can still include some specific exception with the exclamation point operator.
uk: > > Припустимо, що у вас є багато файлів «.dat» в різних піддиректоріях вашого репозиторію. > Наприклад, у вас є: > > ~~~ > results/a.dat > data/experiment_1/b.dat > data/experiment_2/c.dat > data/experiment_2/variation_1/d.dat > ~~~ > {: .language-bash} > > Як ігнорувати всі файли «.dat», не вказуючи явно імена усіх відповідних папок? > > > ## Відповідь > > > > У файлі `.gitignore` напишіть: > > > > ~~~ > > **/*.dat > > ~~~ > > {: .output} > > > > Це ігноруватиме всі файли `.dat`, незалежно від їх позиції у дереві директорій. > > Ви все ще можете робити певні винятки з цього правила за допомогою знаку оклику.

source: > ## The Order of Rules
uk: > ## Порядок застосування правил

source: > > Given a `.gitignore` file with the following contents: > > ~~~ > *.dat > !*.dat > ~~~ > {: .language-bash} > > What will be the result? > > > ## Solution > > > > The `!` modifier will negate an entry from a previously defined ignore pattern. > > Because the `!*.dat` entry negates all of the previous `.dat` files in the `.gitignore`, > > none of them will be ignored, and all `.dat` files will be tracked.
uk: > > Нехай дано файл `.gitignore` з наступним вмістом: > > ~~~ > *.dat > !*.dat > ~~~ > {: .language-bash} > > Яким буде результат? > > > ## Відповідь > > > > Модифікатор `!` скасує запис з раніше визначеного шаблону ігнорування. > > Оскільки запис `! *.dat` скасовує всі попередні файли `.dat` в `.gitignore`, > > жоден з них не буде проігноровано, і всі файли `.dat` будуть відслідковуватися.

source: > ## Log Files
uk: > ## Log-файли

source: > > You wrote a script that creates many intermediate log-files of the form `log_01`, `log_02`, `log_03`, etc. > You want to keep them but you do not want to track them through `git`. > > 1. Write **one** `.gitignore` entry that excludes files of the form `log_01`, `log_02`, etc. > > 2. Test your "ignore pattern" by creating some dummy files of the form `log_01`, etc. > > 3. You find that the file `log_01` is very important after all, add it to the tracked files without changing the `.gitignore` again. > > 4. Discuss with your neighbor what other types of files could reside in your directory that you do not want to track and thus would exclude via `.gitignore`. > > > ## Solution > > > > 1. append either `log_*` or `log*` as a new entry in your .gitignore > > 3. track `log_01` using `git add -f log_01`
uk: > > Ви написали скрипт, який створює багато проміжних log-файлів з назвами `log_01`, `log_02`, `log_03`, т.д. > Ви хочете зберегти їх, але ви не хочете відстежувати їх через `git`. > > 1. Напишіть **один** `.gitignore` запис, що виключає файли форми `log_01`, `log_02`, т.д. > > 2. Перевірте свій "шаблон ігнорування", створивши деякі фіктивні файли з назвою `log_01`, т.д. > > 3. Уявіть, що файл `log_01` дуже важливий, та додайте його до вдслідковуваних файлів, не змінюючи `.gitignore`. > > 4. Обговоріть з сусідом, які інші типи файлів можуть перебувати у вашому проєкті, які ви не бажаєте відслідковувати і тому бажаєте проігнорувати їх з `.gitignore`. > > > ## Відповідь > > > > 1. додайте або `log_*` або `log*` як новий запис у вашому `.gitignore` > > 3. відстежте `log_01`, використовуючи `git add -f log_01`
