Repository: carpentries-i18n/i18n
Catalog: transifex/git-novice/*/11__07-github.md.po
Languages: uk

source: > > You may see a `-u` option used with `git push` in some documentation. This > option is synonymous with the `--set-upstream-to` option for the `git branch` > command, and is used to associate the current branch with a remote branch so > that the `git pull` command can be used without any arguments. To do this, > simply use `git push -u origin main` once the remote has been set up.
uk: > > Ви можете побачити опцію «-u», який використовується з «git push» у деякій документації. Ця > опція є синонімом опції `--set-upstream-to` для команди `git branch` > і використовується для зв`язку поточної гілки з віддаленою гілкою так, що > команда `git pull` може будти використана без будь-яких аргументів. Щоб зробити це, > просто використайте `git push -u origin main` після налаштування пульта дистанційного керування.

source: We can pull changes from the remote repository to the local one as well:
uk: Ми також можемо переносити зміни з віддаленого сховища на локальний:

source: Pulling has no effect in this case because the two repositories are already synchronized. If someone else had pushed some changes to the repository on GitHub, though, this command would download them to our local repository.
uk: Перетягування не має ніякого ефекту в цьому випадку, тому що два сховища вже синхронізовані. Якщо хтось ще завантажив якісь зміни до репозиторію на GitHub, хоч ця команда завантажить їх у наш локальний репозиторій.

source: > > Browse to your `planets` repository on GitHub. > Under the Code tab, find and click on the text that says "XX commits" (where "XX" is some number). > Hover over, and click on, the three buttons to the right of each commit. > What information can you gather/explore from these buttons? > How would you get that same information in the shell? > > > ## Solution > > The left-most button (with the picture of a clipboard) copies the full identifier of the commit > > to the clipboard. In the shell, ```git log``` will show you the full commit identifier for each > > commit. > > > > When you click on the middle button, you'll see all of the changes that were made in that > > particular commit. Green shaded lines indicate additions and red ones removals. In the shell we > > can do the same thing with ```git diff```. In particular, ```git diff ID1..ID2``` where ID1 and > > ID2 are commit identifiers (e.g. ```git diff a3bf1e5..041e637```) will show the differences > > between those two commits. > > > > The right-most button lets you view all of the files in the repository at the time of that > > commit. To do this in the shell, we'd need to checkout the repository at that particular time. > > We can do this with ```git checkout ID``` where ID is the identifier of the commit we want to > > look at. If we do this, we need to remember to put the repository back to the right state > > afterwards!
uk: > > Перегляньте ваш репозиторій `planets` на GitHub. > Під вкладкою Code, знайдіть та натисніть на текст, який говорить "XX commits" (де "XX" це якесь число). > Наведіть курсор і натисніть на три кнопки праворуч від кожного коміту. > Яку інформацію ви можете зібрати/вивчити з цих кнопок? > Як би ви отримали ту саму інформацію в shell? > > > ## Відповідь > > Ліва кнопка (з зображенням буфера обміну) копіює повний ідентифікатор коміту > > в буфер обміну. В shell, ```git log``` покаже вам повний ідентифікатор коміту для кожного > > коміту. > > > > Коли ви натиснете на середню кнопку, ви побачите всі зміни, які були зроблені в цьому > > конкретному коміті. Зелені затінені лінії вказують на додавання та видалення червоних. В shell ми > > можемо зробити ту саму річ з ```git diff```. А саме, ```git diff ID1..ID2```, де ID1 та > > ID2 ідентифікатори комітів (наприклад, ```git diff a3bf1e5..041e637```) покаже відмінності > > між двома комітами. > > > > Найправіша кнопка дозволяє переглядати всі файли в сховищі під час цього > > коміту. Для того, щоб зробити це в shell, нам потрібно було б перевірити репозиторій в той конкретний час. > > Ми можемо зробити це за допомогою ```git checkout ID```, де ID - ідентифікатор коміту, на який ми хочемо подивитися. > > Якщо ми зробимо це, нам потрібно пам`ятати про повернення репозиторію в потрібний стан > > після цього!

source: > ## Uploading files directly in GitHub browser
uk: > ## Завантаження файлів безпосередньо в браузері GitHub

source: > > Github also allows you to skip the command line and upload files directly to > your repository without having to leave the browser. There are two options. > First you can click the "Upload files" button in the toolbar at the top of the > file tree. Or, you can drag and drop files from your desktop onto the file > tree. You can read more about this [on this GitHub page](https://help.github.com/articles/adding-a-file-to-a-repository/)
uk: > > Github також дозволяє нам пропустити командний рядок ізавантажити файли безпосередньо до > вашого репозиторію без необхідності залишати браузер. Є два варіанти. > Перший - ви можете натиснути кнопку "Upload files" на панелі інструментів у верхній частині > дерева файлів. Або, можна перетягувати файли з робочого стору до дерева файлівю > Ви можете більше прочитати про це [на цій GitHub сторінці](https://help.github.com/articles/adding-a-file-to-a-repository/)

source: > ## GitHub Timestamp
uk: > ## Часова Мітка GitHub

source: > > Create a remote repository on GitHub. Push the contents of your local > repository to the remote. Make changes to your local repository and push these > changes. Go to the repo you just created on GitHub and check the > [timestamps]({{ page.root }}{% link reference.md %}#timestamp) of the files. How does GitHub > record times, and why? > > > ## Solution > > GitHub displays timestamps in a human readable relative format (i.e. "22 hours ago" or "three > > weeks ago"). However, if you hover over the timestamp, you can see the exact time at which the > > last change to the file occurred.
uk: > > Створіть віддалений репозиторій на GitHub. Відправте вміст вашого локального сховища > до віддаленого. Внесіть зміни до вашого локального сховища та відправте ці зміни. > Перейдіть до щойно створеного на GitHub репо і перевірте > [часові мітки]({{ page.root }}{% link reference.md %}#timestamp) файлів. Як GitHub > записує час і чому? > > > ## Відповідь > > GitHub відображає мітки часу у відносному форматі, що читається людиною (наприклад, "22 години назад" або "три > > тижні тому"). Однак, якщо ви наведете курсор на мітку часу, ви можете побачити точний час, в який > > остання зміна файлу відбулася.

source: > ## Push vs. Commit
uk: > ## Відправлення змін vs. Коміт

source: > > In this episode, we introduced the "git push" command. > How is "git push" different from "git commit"? > > > ## Solution > > When we push changes, we're interacting with a remote repository to update it with the changes > > we've made locally (often this corresponds to sharing the changes we've made with others). > > Commit only updates your local repository.
uk: > > В цьому епізоді, ми познайомилися з командою "git push". > Як "git push" відрізняється "git commit"? > > > ## Відповідь > > Коли ми відправляємо зміни, ми взаємодіємо з віддаленим репозиторієм, щоб оновити його зі змінами, > > ми зробили локально (часто це відповідає обміну змінами, які ми зробили з іншими). > > Commit оновлює лише локальний репозиторій.

source: > ## GitHub License and README files
uk: > ## GitHub Ліцензія та файли README

source: > > In this episode we learned about creating a remote repository on GitHub, but when you initialized > your GitHub repo, you didn't add a README.md or a license file. If you had, what do you think > would have happened when you tried to link your local and remote repositories? > > > ## Solution > > In this case, we'd see a merge conflict due to unrelated histories. When GitHub creates a > > README.md file, it performs a commit in the remote repository. When you try to pull the remote > > repository to your local repository, Git detects that they have histories that do not share a > > common origin and refuses to merge. > > ~~~ > > $ git pull origin main > > ~~~ > > {: .language-bash} > > > > ~~~ > > warning: no common commits > > remote: Enumerating objects: 3, done. > > remote: Counting objects: 100% (3/3), done. > > remote: Total 3 (delta 0), reused 0 (delta 0), pack-reused 0 > > Unpacking objects: 100% (3/3), done. > > From https://github.com/vlad/planets > > * branch main -> FETCH_HEAD > > * [new branch] main -> origin/main > > fatal: refusing to merge unrelated histories > > ~~~ > > {: .output} > > > > You can force git to merge the two repositories with the option `--allow-unrelated-histories`. > > Be careful when you use this option and carefully examine the contents of local and remote > > repositories before merging. > > ~~~ > > $ git pull --allow-unrelated-histories origin main > > ~~~ > > {: .language-bash} > > > > ~~~ > > From https://github.com/vlad/planets > > * branch main -> FETCH_HEAD > > Merge made by the 'recursive' strategy. > > README.md | 1 + > > 1 file changed, 1 insertion(+) > > create mode 100644 README.md > > ~~~ > > {: .output}
uk: > > У цьому епізоді ми дізналися про створення віддаленого репозиторію на GitHub, але коли ми ініціалізували наш > GitHub репо, ми не додали README.md або файл ліцензії. Якщо б ми це зробили, що, на вашу думку, > сталося б, коли ми намагалися зв`язати локальні та віддалені репозиторії? > > > ## Відповідь > > У цьому випадку ми побачимо конфлікт злиття через неспоріднені історії. Коли GitHub створює > > README.md файл, він виконує коміт у віддаленому репозиторії. Коли ви намагаєтеся витягнути віддалений > > репозиторій до вашого локального репозиторію, Git виявляє, що у них є історії, які не мають спільного > > походження і відмовляється від злиття.. > > ~~~ > > $ git pull origin main > > ~~~ > > {: .language-bash} > > > > ~~~ > > warning: no common commits > > remote: Enumerating objects: 3, done. > > remote: Counting objects: 100% (3/3), done. > > remote: Total 3 (delta 0), reused 0 (delta 0), pack-reused 0 > > Unpacking objects: 100% (3/3), done. > > From https://github.com/vlad/planets > > * branch main -> FETCH_HEAD > > * [new branch] main -> origin/main > > fatal: refusing to merge unrelated histories > > ~~~ > > {: .output} > > > > Ви можете змусити git об'єднати два сховища з опцією `--allow-unrelated-histories`. > > Будьте обережні, коли ви використовуєте цей параметр і уважно вивчіть вміст локальних і віддалених > > репозиторіїв перед об'єднанням.. > > ~~~ > > $ git pull --allow-unrelated-histories origin main > > ~~~ > > {: .language-bash} > > > > ~~~ > > From https://github.com/vlad/planets > > * branch main -> FETCH_HEAD > > Merge made by the 'recursive' strategy. > > README.md | 1 + > > 1 file changed, 1 insertion(+) > > create mode 100644 README.md > > ~~~ > > {: .output}
