Repository: carpentries-i18n/i18n
Catalog: transifex/git-novice/*/11__07-github.md.po
Languages: uk

source: --- title: Remotes in GitHub teaching: 45 exercises: 0 questions: - "How do I share my changes with others on the web?" objectives: - "Explain what remote repositories are and why they are useful." - "Push to or pull from a remote repository." keypoints: - "A local Git repository can be connected to one or more remote repositories." - "Use the SSH protocol to connect to remote repositories." - "`git push` copies changes from a local repository to a remote repository." - "`git pull` copies changes from a remote repository to a local repository." ---
uk: --- title: Віддалені сховища в GitHub teaching: 45 exercises: 0 questions: - "Як поділитися своїми змінами з іншими в мережі?" objectives: - "Пояснення, що таке віддалені репозиторії і чому вони корисні." - "Відправляти зміни до віддаленого репозиторію або отрмимувати зміни з нього." keypoints: - "Локальний репозиторій Git можна підключити до одного або декількох віддалених репозиторіїв." - "Використання протоколу SSH для підключення до віддалених репозиторіїв." - "`git push` копіює зміни з локального репозиторію до віддаленого репозиторію." - "`git pull` копіює зміни з віддаленого репозиторію в локальний репозиторій." ---

source: Version control really comes into its own when we begin to collaborate with other people. We already have most of the machinery we need to do this; the only thing missing is to copy changes from one repository to another.
uk: Контроль версій дійсно вступає в свою силу, коли ми починаємо співпрацювати з іншими людьми. У нас вже є велика частина техніки, яка нам потрібна для цього; єдине, чого не вистачає - копіювати зміни з одного репозиторію в інший.

source: Systems like Git allow us to move work between any two repositories. In practice, though, it's easiest to use one copy as a central hub, and to keep it on the web rather than on someone's laptop. Most programmers use hosting services like [GitHub](https://github.com), [Bitbucket](https://bitbucket.org) or [GitLab](https://gitlab.com/) to hold those main copies; we'll explore the pros and cons of this in a later episode.
uk: Такі системи, як Git, дозволяють переміщати роботу між будь-якими двома репозиторіями. Однак, практично найпростіше використовувати одну копію в якості центрального вузла, і зберегти його в мережі, аніж на чиємусь ноутбуці. Багато програмістів використовують хостинг сервіси, такі як [GitHub](https://github.com), [Bitbucket](https://bitbucket.org) або [GitLab](https://gitlab.com/) щоб зберігати основні копії; ми вивчимо плюси та мінуси цього в іншому епізоді.

source: Let's start by sharing the changes we've made to our current project with the world. To this end we are going to create a *remote* repository that will be linked to our *local* repository.
uk: Почнемо з обміну змінами, які ми внесли до нашого поточного проєкту зі світом. З цією метою ми збираємося створити *віддалений* репозиторій, який буде пов'язаний з нашим *локальним* репозиторієм.

source: ## 1. Create a remote repository
uk: ## 1. Створіть віддалений репозиторій

source: Log in to [GitHub](https://github.com), then click on the icon in the top right corner to create a new repository called `planets`:
uk: Увійдіть до [GitHub](https://github.com), потім натисніть на значок у верхньому правому куті, щоб створити новий репозиторій під назвою `planets`:

source: ![Creating a Repository on GitHub (Step 1)](../fig/github-create-repo-01.png)
uk: ![Створення репозиторію у GitHub (Крок 1)](../fig/github-create-repo-01.png)

source: Name your repository "planets" and then click "Create Repository".
uk: Назвіть ваш репозиторій "planets" і потім натисніть на "Create Repository".

source: Note: Since this repository will be connected to a local repository, it needs to be empty. Leave "Initialize this repository with a README" unchecked, and keep "None" as options for both "Add .gitignore" and "Add a license." See the "GitHub License and README files" exercise below for a full explanation of why the repository needs to be empty.
uk: Зауважте: Оскільки цей репозиторій буде підʼєднано до локального репозиторію, він має бути порожнім. Залиште "Initialize this repository with a README" непозначеним, та залиште "None" як опції для обох "Add .gitignore" та "Add a license." Ознайомтеся із вправою "GitHub License and README files" нижче для повного пояснення чому репозиторій повинен бути порожнім.

source: ![Creating a Repository on GitHub (Step 2)](../fig/github-create-repo-02.png)
uk: ![Створення репозиторію у GitHub (Крок 2)](../fig/github-create-repo-02.png)

source: As soon as the repository is created, GitHub displays a page with a URL and some information on how to configure your local repository:
uk: Як тільки репозиторій створено, GitHub відображає сторінку з URL і певною інформацією про те, як налаштувати локальний репозиторій:

source: ![Creating a Repository on GitHub (Step 3)](../fig/github-create-repo-03.png)
uk: ![Створення репозиторію у GitHub (Крок 3)](../fig/github-create-repo-03.png)

source: This effectively does the following on GitHub's servers:
uk: Це ефективно робить наступне на серверах GitHub:

source: If you remember back to the earlier [episode](../04-changes/) where we added and committed our earlier work on `mars.txt`, we had a diagram of the local repository which looked like this:
uk: Якщо ви пам'ятаєте, у одному з попередніх [епізодів](../04-changes/), де ми додавали та зберігали нашу попередню роботу над `mars.txt`, в нас була діаграма, яка зображувала локальний репозиторій, та виглядала так:

source: ![The Local Repository with Git Staging Area](../fig/git-staging-area.svg)
uk: ![Локальний репозиторій із зоною стейджингу](../fig/git-staging-area.svg)

source: Now that we have two repositories, we need a diagram like this:
uk: Тепер, коли ми маємо два репозиторії, нам потрібна така діаграма:

source: Note that our local repository still contains our earlier work on `mars.txt`, but the remote repository on GitHub appears empty as it doesn't contain any files yet.
uk: Зауважте, що наш локальний репозиторій все ще містить нашу попередню роботу над `mars.txt`, але віддалений репозиторій на GitHub зображується порожнім, оскільки він ще не містить жодних файлів.

source: ## 2. Connect local to remote repository
uk: ## 2. Підʼєднання локального репозиторію до віддаленого

source: Now we connect the two repositories. We do this by making the GitHub repository a [remote]({{ page.root}}{% link reference.md %}#remote) for the local repository. The home page of the repository on GitHub includes the URL string we need to identify it:
uk: Тепер підключаємо два сховища. Ми можемо це зробити за допомогою GitHub репозиторію [remote]({{ page.root}}{% link reference.md %}#remote) для локального репозиторію. Домашня сторінка репозиторію на GitHub включає рядок URL, який нам потрібен щоб ідентифікувати його:

source: Click on the 'SSH' link to change the [protocol]({{ page.root }}{% link reference.md %}#protocol) from HTTPS to SSH.
uk: Натисніть на посилання 'SSH', щоб змінити [protocol]({{ page.root }}{% link reference.md %}#protocol) від HTTPS до SSH.

source: > ## HTTPS vs. SSH
uk: > ## HTTPS в порівнянні з SSH

source: > > We use SSH here because, while it requires some additional configuration, it is a > security protocol widely used by many applications. The steps below describe SSH at a > minimum level for GitHub. A supplemental episode to this lesson discusses advanced setup > and concepts of SSH and key pairs, and other material supplemental to git related SSH.
uk: > > Ми тут використовуємо SSH тому що, поки він вимагає додаткову конфігурацію, це > протокол безпеки, який широко використовується багатьма програмами. Кроки нижче описують SSH на > мінімальному рівні GitHub. Додатковий епізод до цього уроку обговорює розширені налаштування > і концепції SSH і пари ключів, а також інші матеріали, що доповнюють git пов'язані SSH.

source: Copy that URL from the browser, go into the local `planets` repository, and run this command:
uk: Скопіюйте цю URL-адресу з браузера, зайдіть в локальне сховище `planets` репозиторію, та запустіть цю команду:

source: Make sure to use the URL for your repository rather than Vlad's: the only difference should be your username instead of `vlad`.
uk: Переконайтеся, що використовуєте URL-адресу для вашого сховища, а нет Vlad's: єдиною відмінністю має бути ваше ім'я користувача замість `vlad`.

source: `origin` is a local name used to refer to the remote repository. It could be called anything, but `origin` is a convention that is often used by default in git and GitHub, so it's helpful to stick with this unless there's a reason not to.
uk: `origin` - локальна назва, що використовується для позначення віддаленого репозиторію. Його модна було б назвати як завгодно, але `origin` - це конвенція, яка часто використовується за замовчуванням в git та GitHub, так що корисно дотримуватися цього, якщо немає особливої причини змінювати.

source: We can check that the command has worked by running `git remote -v`:
uk: Ми можемо перевірити, що команда працювала, запустивши `git remote -v`:

source: We'll discuss remotes in more detail in the next episode, while talking about how they might be used for collaboration.
uk: Більш детально ми обговоримо віддалені файли в наступному епізоді, поки поговоримо про те, як вони можуть бути використані для співпраці.

source: ## 3. SSH Background and Setup
uk: ## 3. SSH Фон та Налаштування

source: Before Dracula can connect to a remote repository, he needs to set up a way for his computer to authenticate with GitHub so it knows it’s him trying to connect to his remote repository.
uk: Перед тим, як Dracula може під`єднатися до віддаленого репозиторію, йому потрібно налаштувати спосіб автентифікації свого комп'ютера за допомогою GitHub, щоб він знав, що це він намагається під`єднатися до його віддаленого репозиторію.

source: We are going to set up the method that is commonly used by many different services to authenticate access on the command line. This method is called Secure Shell Protocol (SSH). SSH is a cryptographic network protocol that allows secure communication between computers using an otherwise insecure network.
uk: Ми збираємося налаштувати метод, який зазвичай використовується багатьма різними службами для автентифікації доступу в командному рядку. Цей метод називається Secure Shell Protocol (SSH). SSH це протокол криптографічної мережі, який дозволяє безпечний зв'язок між комп'ютерами за допомогою використання іншої небезпечної мережі.

source: SSH uses what is called a key pair. This is two keys that work together to validate access. One key is publicly known and called the public key, and the other key called the private key is kept private. Very descriptive names.
uk: SSH використовує те, що називається ключовою парою. Це два ключі, які працюють разом для перевірки доступу. Один ключ публічно відомий і називається відкритим ключем, а інший - приватним ключем. Дуже описові назви.

source: You can think of the public key as a padlock, and only you have the key (the private key) to open it. You use the public key where you want a secure method of communication, such as your GitHub account. You give this padlock, or public key, to GitHub and say “lock the communications to my account with this so that only computers that have my private key can unlock communications and send git commands as my GitHub account.”
uk: Ви можете думати про відкритий ключ як замок, і тільки у вас є ключ (приватний ключ), щоб відчинити його. Ви використовуєте відкритий ключ, де ви хочете безпечний спосіб зв'язку, наприклад, ваш GitHub акаунт. Ви даєте цей висячий замок або відкритий ключ GitHub і говорите: "Заблокувати повідомлення до мого облікового запису, так що тільки комп'ютери, які мають мій закритий ключ можуть розблокувати зв'язок і відправити git команди, як мій GitHub акаунт.”

source: What we will do now is the minimum required to set up the SSH keys and add the public key to a GitHub account.
uk: Те, що ми будемо робити зараз, це мінімум, необхідний для налаштування SSH-ключів і додавання відкритого ключа до GitHub акаунту.

source: > ## Advanced SSH
uk: > ## Розширений SSH

source: > A supplemental episode in this lesson discusses SSH and key pairs in more depth and detail.
uk: > Додатковий епізод в цьому уроці обговорює SSH і ключові пари більш глибоко і детально.

source: The first thing we are going to do is check if this has already been done on the computer you’re on. Because generally speaking, this setup only needs to happen once and then you can forget about it.
uk: Перше, що ми збираємося зробити, це перевірити, чи це вже зроблено на комп'ютері, на якому ви працюєте зараз. Тому що взагалі кажучи, ця установка повинна відбутися тільки один раз, і тоді ви можете забути про це.

source: > ## Keeping your keys secure
uk: > ## Дотримання ключів захищеними

source: > You shouldn't really forget about your SSH keys, since they keep your account secure. It’s good
uk: > Ви не повинні забувати про ваші SSH ключі, так як вони тримають ваш обліковий запис в безпеці. Це хороша

source: > practice to audit your secure shell keys every so often. Especially if you are using multiple
uk: > практика перевіряти захищені ключі shell. Особливо, якщо ви використовуєте кілька

source: > computers to access your account.
uk: > комп'ютерів для доступу до облікового запису.

source: We will run the list command to check what key pairs already exist on your computer.
uk: Ми запустимо команду списку (list - ls), щоб перевірити, які пари ключів вже існують на вашому комп'ютері.

source: Your output is going to look a little different depending on whether or not SSH has ever been set up on the computer you are using.
uk: Ваш результат буде виглядати трохи інакше в залежності від того, чи був коли-небудь SSH встановлений на комп'ютері, який ви використовуєте чи ні.

source: Dracula has not set up SSH on his computer, so his output is
uk: Dracula не налаштував SSH на його комп`ютері, тож його результат виглядає так

source: If SSH has been set up on the computer you're using, the public and private key pairs will be listed. The file names are either `id_ed25519`/`id_ed25519.pub` or `id_rsa`/`id_rsa.pub` depending on how the key pairs were set up. Since they don’t exist on Dracula’s computer, he uses this command to create them.
uk: Якщо SSH було встановлено на комп'ютері, який ви використовуєте, пари відкритих і приватних ключів будуть перераховані. Назви файлів будуть або `id_ed25519`/`id_ed25519.pub`, або `id_rsa`/`id_rsa.pub` залежно від того, як були створені пари ключів. Так як вони не існують на комп`ютері Dracula, він використовує цюкоманду, щоб створити їх.

source: ### 3.1 Create an SSH key pair
uk: ### 3.1 Створення пари ключів SSH

source: To create an SSH key pair Vlad uses this command, where the `-t` option specifies which type of algorithm to use and `-C` attaches a comment to the key (here, Vlad's email):
uk: Для створення пари ключів SSH Vlad використовує цю команду, де параметр `-t` визначає який тип алгоритму використати, та `-C` прикріплює коментар до ключа (тут електронна пошта Vlad):

source: If you are using a legacy system that doesn't support the Ed25519 algorithm, use: `$ ssh-keygen -t rsa -b 4096 -C "your_email@example.com"`
uk: Якщо ви використовуєте застарілу систему, яка не підтримує Ed25519 алгоритм, використовуйте: `$ ssh-keygen -t rsa -b 4096 -C "your_email@example.com"`

source: We want to use the default file, so just press <kbd>Enter</kbd>.
uk: Ми хочемо використовувати типовий файл, тому просто натисніть <kbd>Enter</kbd>.

source: Now, it is prompting Dracula for a passphrase. Since he is using his lab’s laptop that other people sometimes have access to, he wants to create a passphrase. Be sure to use something memorable or save your passphrase somewhere, as there is no "reset my password" option.
uk: Тепер це спонукає Dracula до пароля. Оскільки він використовує ноутбук своєї лабораторії, до якого іноді мають доступ інші люди, він хоче свторити пароль. Обов'язково використовуйте щось що запам'ятовується або збережіть пароль десь, оскільки немає опції «скинути мій пароль».

source: After entering the same passphrase a second time, we receive the confirmation
uk: Після введення того ж пароля вдруге ми отримуємо підтвердження

source: The "identification" is actually the private key. You should never share it. The public key is appropriately named. The "key fingerprint" is a shorter version of a public key.
uk: "identification" насправді є приватним ключем. Ви ніколи не повинні ділитися ним. Відкритий ключ названий відповідним чином. "key fingerprint" є коротшою версією відкритого ключа.

source: Now that we have generated the SSH keys, we will find the SSH files when we check.
uk: Тепер, коли ми створили ключі SSH, ми знайдемо файли SSH при перевірці.

source: ### 3.2 Copy the public key to GitHub
uk: ### 3.2 Копіювання відкритого ключа на GitHub

source: Now we have a SSH key pair and we can run this command to check if GitHub can read our authentication.
uk: Тепер у нас є пара ключів SSH, і ми можемо запустити цю команду, щоб перевірити, чи може GitHub читати нашу автентифікацію.

source: Right, we forgot that we need to give GitHub our public key!
uk: Так, ми забули, що нам потрібно надати GitHub наш відкритий ключ!

source: First, we need to copy the public key. Be sure to include the `.pub` at the end, otherwise you’re looking at the private key.
uk: По-перше, нам потрібно скопіювати відкритий ключ. Не забудьте включити «.pub» в кінці, в іншому випадку ви дивитеся на приватний ключ.

source: Now, going to GitHub.com, click on your profile icon in the top right corner to get the drop-down menu. Click "Settings," then on the settings page, click "SSH and GPG keys," on the left side "Account settings" menu. Click the "New SSH key" button on the right side. Now, you can add the title (Dracula uses the title "Vlad's Lab Laptop" so he can remember where the original key pair files are located), paste your SSH key into the field, and click the "Add SSH key" to complete the setup.
uk: Тепер, перейшовши в GitHub.com, натисніть на значок профілю в правому верхньому куті, щоб отримати спадне меню. Натисніть "Settings," потім на сторінці налаштувань, натисніть "SSH and GPG keys," ліворуч меню "Account settings". Натисніть "New SSH key" кнопку з правого боку. Тепер, ви можете додати заголовок (Dracula використовує заголовок "Vlad's Lab Laptop", таким чином, він запам`ятає де розташовані оригінальні ключові пари файлів), вставте SSH ключ в поле, і натисніть кнопку "Add SSH key", щоб завершити налаштування.

source: Now that we’ve set that up, let’s check our authentication again from the command line. ~~~ $ ssh -T git@github.com ~~~ {: .language-bash}
uk: Тепер, коли ми встановили це, давайте перевіримо нашу аутентифікацію знову з командного рядка. ~~~ $ ssh -T git@github.com ~~~ {: .language-bash}

source: Good! This output confirms that the SSH key works as intended. We are now ready to push our work to the remote repository.
uk: Добре! Цей результат підтверджує, що ключ SSH працює за призначенням. Тепер ми готові завантажити нашу роботу до віддаленого репозиторію.

source: ## 4. Push local changes to a remote
uk: ## 4. Завантаження локальних змін на віддалений репозиторій

source: Now that authentication is setup, we can return to the remote. This command will push the changes from our local repository to the repository on GitHub:
uk: Тепер, коли аутентифікація налаштована, ми можемо повернутися до віддаленого репозиторію. Ця команда завантажить зміни з нашого локального репозиторію до репозиторію на GitHub:

source: Since Dracula set up a passphrase, it will prompt him for it. If you completed advanced settings for your authentication, it will not prompt for a passphrase.
uk: Оскільки Dracula встановив парольну фразу, вона підкаже йому про це. Якщо ви виконали додаткові налаштування для автентифікації, команда не запитає пароль.

source: > > If the network you are connected to uses a proxy, there is a chance that your > last command failed with "Could not resolve hostname" as the error message. To > solve this issue, you need to tell Git about the proxy: > > ~~~ > $ git config --global http.proxy http://user:password@proxy.url > $ git config --global https.proxy https://user:password@proxy.url > ~~~ > {: .language-bash} > > When you connect to another network that doesn't use a proxy, you will need to > tell Git to disable the proxy using: > > ~~~ > $ git config --global --unset http.proxy > $ git config --global --unset https.proxy > ~~~ > {: .language-bash}
uk: > > Якщо мережа, до якої ви підключені, використовує проксі, є шанс, що ваша > остання команда зазнала невдачі з "Could not resolve hostname" як повідомлення про помилку. Щоб > вирішити це питання, потрібно розповісти Git про проксі: > > ~~~ > $ git config --global http.proxy http://user:password@proxy.url > $ git config --global https.proxy https://user:password@proxy.url > ~~~ > {: .language-bash} > > Коли ви підключаєтеся до іншої мережі, яка не використовує проксі, вам потрібно буде > сказати Git відключити проксі за допомогою: > > ~~~ > $ git config --global --unset http.proxy > $ git config --global --unset https.proxy > ~~~ > {: .language-bash}

source: > ## Password Managers
uk: > ## Менеджери паролів

source: > > If your operating system has a password manager configured, `git push` will > try to use it when it needs your username and password. For example, this > is the default behavior for Git Bash on Windows. If you want to type your > username and password at the terminal instead of using a password manager, > type: > > ~~~ > $ unset SSH_ASKPASS > ~~~ > {: .language-bash} > > in the terminal, before you run `git push`. Despite the name, [Git uses > `SSH_ASKPASS` for all credential > entry](https://git-scm.com/docs/gitcredentials#_requesting_credentials), so > you may want to unset `SSH_ASKPASS` whether you are using Git via SSH or > https. > > You may also want to add `unset SSH_ASKPASS` at the end of your `~/.bashrc` > to make Git default to using the terminal for usernames and passwords.
uk: > > Якщо у вашій операційній системі налаштовано менеджер паролів, `git push` > спробує використати його, коли йому потріне ім`я користувача і пароль. Наприклад, це > є типовою поведінкою для Git Bash на Windows. Якщо ви хочете ввести своє ім`я користувача > та пароль в терміналі замість використання менеджера паролів, > введіть: > > ~~~ > $ unset SSH_ASKPASS > ~~~ > {: .language-bash} > > в терміналі, перед `git push`. Незважаючи на ім`я, [Git використовує > `SSH_ASKPASS` для всіх облікових > записів](https://git-scm.com/docs/gitcredentials#_requesting_credentials), тож > ви можете скасувати `SSH_ASKPASS` незважаючи на те, чи ви використовуєте Git через SSH або > https. > > Ви також можете додати `unset SSH_ASKPASS` в кінці вашого `~/.bashrc` > щоб зробити Git типовим для використання термінала для імен користувачів та паролів.

source: Our local and remote repositories are now in this state:
uk: Наші локальні та віддалені сховища зараз у такому стані:

source: > ## The '-u' Flag
uk: > ## Опція '-u'
