Repository: carpentries-i18n/i18n
Catalog: transifex/git-novice/*/13__09-conflict.md.po
Languages: uk

source: --- title: Conflicts teaching: 15 exercises: 0 questions: - "What do I do when my changes conflict with someone else's?" objectives: - "Explain what conflicts are and when they can occur." - "Resolve conflicts resulting from a merge." keypoints: - "Conflicts occur when two or more people change the same lines of the same file." - "The version control system does not allow people to overwrite each other's changes blindly, but highlights conflicts so that they can be resolved." ---
uk: --- title: Конфлікти teaching: 15 exercises: 0 questions: - "Що робити, коли мої зміни конфліктують з чужими?" objectives: - "Пояснити, що таке конфлікти і коли вони можуть виникнути." - "Вирішення конфліктів, що виникають внаслідок об`єднання." keypoints: - "Конфлікти виникають, коли двоє або більше людей змінюють однакові рядки одного файлу." - "Система контролю версій не дозволяє людям перезаписувати зміни один одного наосліп, але виділяє конфлікти, щоб їх можна було вирішити." ---

source: As soon as people can work in parallel, they'll likely step on each other's toes. This will even happen with a single person: if we are working on a piece of software on both our laptop and a server in the lab, we could make different changes to each copy. Version control helps us manage these [conflicts]({{ page.root}}{% link reference.md %}#conflict) by giving us tools to [resolve]({{ page.root }}{% link reference.md %}#resolve) overlapping changes.
uk: Як тільки люди можуть працювати паралельно, вони, швидше за все, "наступлять один на одного". Це станеться навіть з однією людиною: якщо ми працюємо над частиною програмного забезпечення як на нашому ноутбуці, так і на сервері в лабораторії, ми можемо внести різні зміни в кожну копію. Контроль версій допомагає нам керувати ними [конфлікти]({{ page.root}}{% link reference.md %}#conflict) надаючи нам інструменти для [вирішення]({{ page.root }}{% link reference.md %}#resolve) змін, що перекриваються.

source: To see how we can resolve conflicts, we must first create one. The file `mars.txt` currently looks like this in both partners' copies of our `planets` repository:
uk: Щоб побачити, як ми можемо вирішити конфлікти, ми повинні спочатку створити їх. Файл `mars.txt` в даний час виглядає так в обох копіях партнерів нашого `planets` репозиторію:

source: Let's add a line to the collaborator's copy only:
uk: Додамо лише рядок до копії колаборанта:

source: and then push the change to GitHub:
uk: а потім відправимо наші зміни на GitHub:

source: Now let's have the owner make a different change to their copy *without* updating from GitHub:
uk: Тепер давайте власник зробить іншу зміну своєї копії *без* оновлення з GitHub:

source: We can commit the change locally:
uk: Ми можемо комітнути наші зміни локально:

source: but Git won't let us push it to GitHub:
uk: але Git не дозволить нам відправити зміни на GitHub:

source: ![The Conflicting Changes](../fig/conflict.svg)
uk: ![Суперечливі зміни](../fig/conflict.svg)

source: Git rejects the push because it detects that the remote repository has new updates that have not been incorporated into the local branch. What we have to do is pull the changes from GitHub, [merge]({{ page.root }}{% link reference.md %}#merge) them into the copy we're currently working in, and then push that. Let's start by pulling:
uk: Git відкидає це відправлення, оскільки виявляє, що віддалений репозиторій має нові оновлення, які не були включені до локальної гілки. Що ми повинні зробити, це витягнути зміни з GitHub, [об`єднати]({{ page.root }}{% link reference.md %}#merge) їх у копію, в якій ми зараз працюємо, а потім відправити їх. Давайте почнемо з отримання змін:

source: The `git pull` command updates the local repository to include those changes already included in the remote repository. After the changes from remote branch have been fetched, Git detects that changes made to the local copy overlap with those made to the remote repository, and therefore refuses to merge the two versions to stop us from trampling on our previous work. The conflict is marked in in the affected file:
uk: Команда `git pull` оновлює локальний репозиторій, щоб включити ті зміни, які вже включені у віддаленому репозиторії. Після того, як зміни з віддаленої гілки були отримані, Git виявляє, що зміни, внесені до локальної копії, перекриваються з тими, що вносяться до віддаленого сховища, і тому відмовляється об'єднати дві версії, щоб зупинити нас від видалення нашої попередньої роботи. Конфлікт позначений у файлі, що постраждав:

source: Our change is preceded by `<<<<<<< HEAD`. Git has then inserted `=======` as a separator between the conflicting changes and marked the end of the content downloaded from GitHub with `>>>>>>>`. (The string of letters and digits after that marker identifies the commit we've just downloaded.)
uk: Нашим змінам передує `<<<<<<< HEAD`. Потім Git вставив `=======` як роздільник між конфліктуючими змінами і позначив кінець вмісту, завантаженого з GitHub за допомогою `>>>>>>>`. (Рядок букв і цифр після цього маркера ідентифікує щойно завантажений коміт.)

source: It is now up to us to edit this file to remove these markers and reconcile the changes. We can do anything we want: keep the change made in the local repository, keep the change made in the remote repository, write something new to replace both, or get rid of the change entirely. Let's replace both so that the file looks like this:
uk: Тепер ми маємо відредагувати цей файл, щоб видалити ці маркери та узгодити зміни. Ми можемо зробити все, що хочемо: зберегти зміни, зроблені в локальному сховищі, зберегти зміни, зроблені у віддаленому сховищі, написати щось нове, щоб замінити обидва, або позбутися від змін повністю. Давайте замінимо обидва так, щоб файл виглядав наступним чином:

source: To finish merging, we add `mars.txt` to the changes being made by the merge and then commit:
uk: Щоб закінчити злиття, ми додаємо `mars.txt` до змін, що вносяться об`єднанням, а потім комітимо:

source: Now we can push our changes to GitHub:
uk: Тепер ми можемо відправити наші зміни на GitHub:

source: Git keeps track of what we've merged with what, so we don't have to fix things by hand again when the collaborator who made the first change pulls again:
uk: Git відстежує те, що ми об'єднали з чим, тому нам не потрібно знову виправляти речі вручну коли колаборант, який зробив першу зміну, знову отримує ці зміни:

source: We get the merged file:
uk: Ми отримуємо об'єднаний файл:

source: We don't need to merge again because Git knows someone has already done that.
uk: Нам не потрібно знову об`єднуватися, тому що Git знає, що хтось це вже зробив.

source: Git's ability to resolve conflicts is very useful, but conflict resolution costs time and effort, and can introduce errors if conflicts are not resolved correctly. If you find yourself resolving a lot of conflicts in a project, consider these technical approaches to reducing them:
uk: Здатність Git вирішувати конфлікти дуже корисна, але вирішення конфліктів вимагає часу і зусиль, і може виводити помилки, якщо конфлікти не вирішуються правильно. Якщо ви виявите, що вирішуєте багато конфліктів у проєкті, розгляньте ці технічні підходи до їх зменшення::

source: - Pull from upstream more frequently, especially before starting new work
uk: - Отримувати зміни частіше, особливо перед початком нової роботи

source: - Use topic branches to segregate work, merging to main when complete
uk: - Використовуйте тематичні гілки для розділення роботи, об'єднання до main, коли завершили

source: - Make smaller more atomic commits
uk: - Зробити менше величезних комітів

source: - Where logically appropriate, break large files into smaller ones so that it is
uk: - Там, де логічно доречно, розбити великі файли на менші, щоб було

source: less likely that two authors will alter the same file simultaneously
uk: менше шансів, що два автори змінять один і той самий файл одночасно

source: Conflicts can also be minimized with project management strategies:
uk: Конфлікти також можна мінімізувати за допомогою стратегій управління проєктами:

source: - Clarify who is responsible for what areas with your collaborators
uk: - Уточнюйте, хто відповідає за які сфери з вашими колаборантами

source: - Discuss what order tasks should be carried out in with your collaborators so
uk: - Обговорити, які завдання повинні виконуватися з вашими колаборантами, щоб

source: that tasks expected to change the same lines won't be worked on simultaneously - If the conflicts are stylistic churn (e.g. tabs vs. spaces), establish a project convention that is governing and use code style tools (e.g. `htmltidy`, `perltidy`, `rubocop`, etc.) to enforce, if necessary
uk: завдання, які очікують зміни одних і тих же ліній, не працювали одночасно - Якщо конфлікти є стилістичними (наприклад, таби vs. пробіли), втсановіть угоду проєкту, яка регулює та використовує інструменти стилю коду (наприклад, `htmltidy`, `perltidy`, `rubocop`, тд.) для виконання, якщо це необхідно

source: > ## Solving Conflicts that You Create
uk: > ## Вирішення Конфліктів, які Ви Створюєте

source: > > Clone the repository created by your instructor. > Add a new file to it, > and modify an existing file (your instructor will tell you which one). > When asked by your instructor, > pull her changes from the repository to create a conflict, > then resolve it.
uk: > > Клонуйте репозиторій, створений вашим інструктором. > Додайте до нього новий файл, > і змініть існуючий файл (ваш інструктор скаже, який з них). > За вказівкою вашого інструктора, > отримайте його зміни з репозиторію, щоб створити конфлікт, > а потім вирішіть його.

source: > ## Conflicts on Non-textual files
uk: > ## Конфлікти на Нетекстових файлах

source: > > What does Git do > when there is a conflict in an image or some other non-textual file > that is stored in version control? > > > ## Solution > > > > Let's try it. Suppose Dracula takes a picture of Martian surface and > > calls it `mars.jpg`. > > > > If you do not have an image file of Mars available, you can create > > a dummy binary file like this: > > > > ~~~ > > $ head -c 1024 /dev/urandom > mars.jpg > > $ ls -lh mars.jpg > > ~~~ > > {: .language-bash} > > > > ~~~ > > -rw-r--r-- 1 vlad 57095 1.0K Mar 8 20:24 mars.jpg > > ~~~ > > {: .output} > > > > `ls` shows us that this created a 1-kilobyte file. It is full of > > random bytes read from the special file, `/dev/urandom`. > > > > Now, suppose Dracula adds `mars.jpg` to his repository: > > > > ~~~ > > $ git add mars.jpg > > $ git commit -m "Add picture of Martian surface" > > ~~~ > > {: .language-bash} > > > > ~~~ > > [main 8e4115c] Add picture of Martian surface > > 1 file changed, 0 insertions(+), 0 deletions(-) > > create mode 100644 mars.jpg > > ~~~ > > {: .output} > > > > Suppose that Wolfman has added a similar picture in the meantime. > > His is a picture of the Martian sky, but it is *also* called `mars.jpg`. > > When Dracula tries to push, he gets a familiar message: > > > > ~~~ > > $ git push origin main > > ~~~ > > {: .language-bash} > > > > ~~~ > > To https://github.com/vlad/planets.git > > ! [rejected] main -> main (fetch first) > > error: failed to push some refs to 'https://github.com/vlad/planets.git' > > hint: Updates were rejected because the remote contains work that you do > > hint: not have locally. This is usually caused by another repository pushing > > hint: to the same ref. You may want to first integrate the remote changes > > hint: (e.g., 'git pull ...') before pushing again. > > hint: See the 'Note about fast-forwards' in 'git push --help' for details. > > ~~~ > > {: .output} > > > > We've learned that we must pull first and resolve any conflicts: > > > > ~~~ > > $ git pull origin main > > ~~~ > > {: .language-bash} > > > > When there is a conflict on an image or other binary file, git prints > > a message like this: > > > > ~~~ > > $ git pull origin main > > remote: Counting objects: 3, done. > > remote: Compressing objects: 100% (3/3), done. > > remote: Total 3 (delta 0), reused 0 (delta 0) > > Unpacking objects: 100% (3/3), done. > > From https://github.com/vlad/planets.git > > * branch main -> FETCH_HEAD > > 6a67967..439dc8c main -> origin/main > > warning: Cannot merge binary files: mars.jpg (HEAD vs. 439dc8c08869c342438f6dc4a2b615b05b93c76e) > > Auto-merging mars.jpg > > CONFLICT (add/add): Merge conflict in mars.jpg > > Automatic merge failed; fix conflicts and then commit the result. > > ~~~ > > {: .output} > > > > The conflict message here is mostly the same as it was for `mars.txt`, but > > there is one key additional line: > > > > ~~~ > > warning: Cannot merge binary files: mars.jpg (HEAD vs. 439dc8c08869c342438f6dc4a2b615b05b93c76e) > > ~~~ > > {: .output} > > > > Git cannot automatically insert conflict markers into an image as it does > > for text files. So, instead of editing the image file, we must check out > > the version we want to keep. Then we can add and commit this version. > > > > On the key line above, Git has conveniently given us commit identifiers > > for the two versions of `mars.jpg`. Our version is `HEAD`, and Wolfman's > > version is `439dc8c0...`. If we want to use our version, we can use > > `git checkout`: > > > > ~~~ > > $ git checkout HEAD mars.jpg > > $ git add mars.jpg > > $ git commit -m "Use image of surface instead of sky" > > ~~~ > > {: .language-bash} > > > > ~~~ > > [main 21032c3] Use image of surface instead of sky > > ~~~ > > {: .output} > > > > If instead we want to use Wolfman's version, we can use `git checkout` with > > Wolfman's commit identifier, `439dc8c0`: > > > > ~~~ > > $ git checkout 439dc8c0 mars.jpg > > $ git add mars.jpg > > $ git commit -m "Use image of sky instead of surface" > > ~~~ > > {: .language-bash} > > > > ~~~ > > [main da21b34] Use image of sky instead of surface > > ~~~ > > {: .output} > > > > We can also keep *both* images. The catch is that we cannot keep them > > under the same name. But, we can check out each version in succession > > and *rename* it, then add the renamed versions. First, check out each > > image and rename it: > > > > ~~~ > > $ git checkout HEAD mars.jpg > > $ git mv mars.jpg mars-surface.jpg > > $ git checkout 439dc8c0 mars.jpg > > $ mv mars.jpg mars-sky.jpg > > ~~~ > > {: .language-bash} > > > > Then, remove the old `mars.jpg` and add the two new files: > > > > ~~~ > > $ git rm mars.jpg > > $ git add mars-surface.jpg > > $ git add mars-sky.jpg > > $ git commit -m "Use two images: surface and sky" > > ~~~ > > {: .language-bash} > > > > ~~~ > > [main 94ae08c] Use two images: surface and sky > > 2 files changed, 0 insertions(+), 0 deletions(-) > > create mode 100644 mars-sky.jpg > > rename mars.jpg => mars-surface.jpg (100%) > > ~~~ > > {: .output} > > > > Now both images of Mars are checked into the repository, and `mars.jpg` > > no longer exists.
uk: > > Що робить Git > коли виникає конфлікт у зображені або іншому нетекстовому файлі, > що зберігається в контролі версій? > > > ## Відповідь > > > > Давайте спробуємо. Припустимо, Dracula робить фотографію Марсіанської поверхні та > > називає її `mars.jpg`. > > > > Якщо у вас немає файлу зображення Марса, ви мжете створити > > фіктивний бінарний файл ось так: > > > > ~~~ > > $ head -c 1024 /dev/urandom > mars.jpg > > $ ls -lh mars.jpg > > ~~~ > > {: .language-bash} > > > > ~~~ > > -rw-r--r-- 1 vlad 57095 1.0K Mar 8 20:24 mars.jpg > > ~~~ > > {: .output} > > > > `ls` показує нам, що було створено 1-кілобайт файл. Він повний > > випадкових байтів, прочитаних з спеціального файлу, `/dev/urandom`. > > > > Тепер, припустимо, Dracula додає `mars.jpg` до його репозиторію: > > > > ~~~ > > $ git add mars.jpg > > $ git commit -m "Add picture of Martian surface" > > ~~~ > > {: .language-bash} > > > > ~~~ > > [main 8e4115c] Add picture of Martian surface > > 1 file changed, 0 insertions(+), 0 deletions(-) > > create mode 100644 mars.jpg > > ~~~ > > {: .output} > > > > Припустимо, що Wolfman тим часом додав схожу фотографію. > > Його зображення - марсіанське небо, але воно *також* названо `mars.jpg`. > > Коли Dracula намагається відправити зміни, він отримує знайоме повідомлення: > > > > ~~~ > > $ git push origin main > > ~~~ > > {: .language-bash} > > > > ~~~ > > To https://github.com/vlad/planets.git > > ! [rejected] main -> main (fetch first) > > error: failed to push some refs to 'https://github.com/vlad/planets.git' > > hint: Updates were rejected because the remote contains work that you do > > hint: not have locally. This is usually caused by another repository pushing > > hint: to the same ref. You may want to first integrate the remote changes > > hint: (e.g., 'git pull ...') before pushing again. > > hint: See the 'Note about fast-forwards' in 'git push --help' for details. > > ~~~ > > {: .output} > > > > Ми дізналися, що повинні спочатку отримувати зміни і вирішувати будь-які конфлікти: > > > > ~~~ > > $ git pull origin main > > ~~~ > > {: .language-bash} > > > > Коли виникає конфлікт на зображенні або іншому двійковому файлі, git друкує > > таке повідомлення: > > > > ~~~ > > $ git pull origin main > > remote: Counting objects: 3, done. > > remote: Compressing objects: 100% (3/3), done. > > remote: Total 3 (delta 0), reused 0 (delta 0) > > Unpacking objects: 100% (3/3), done. > > From https://github.com/vlad/planets.git > > * branch main -> FETCH_HEAD > > 6a67967..439dc8c main -> origin/main > > warning: Cannot merge binary files: mars.jpg (HEAD vs. 439dc8c08869c342438f6dc4a2b615b05b93c76e) > > Auto-merging mars.jpg > > CONFLICT (add/add): Merge conflict in mars.jpg > > Automatic merge failed; fix conflicts and then commit the result. > > ~~~ > > {: .output} > > > > Повідомлення про конфлікт тут в основному таке ж, як і для `mars.txt`, але > > є один ключовий рядок: > > > > ~~~ > > warning: Cannot merge binary files: mars.jpg (HEAD vs. 439dc8c08869c342438f6dc4a2b615b05b93c76e) > > ~~~ > > {: .output} > > > > Git не може автоматично вставляти конфліктні маркери в зображення, як це робить > > для текстових файлів. Отже, замість редагування файлу зображення, ми повинні перевірити > > tверсію, яку ми хочемо зберегти. Потім ми можемо додати і комітнути цю версію. > > > > На ключовій лінії вище, Git зручно дав нам ідентифікатори коміту > > для двох версій `mars.jpg`. Наша версія `HEAD`, а версія Wolfman > > `439dc8c0...`. Якщо ми хочемо використовувати нашу версію, ми можемо використати > > `git checkout`: > > > > ~~~ > > $ git checkout HEAD mars.jpg > > $ git add mars.jpg > > $ git commit -m "Use image of surface instead of sky" > > ~~~ > > {: .language-bash} > > > > ~~~ > > [main 21032c3] Use image of surface instead of sky > > ~~~ > > {: .output} > > > > Якщо замість цього ми хочемо використовувати версію Wolfman, ми можемо використовувати `git checkout` > > з ідентифікатором коміту Wolfman, `439dc8c0`: > > > > ~~~ > > $ git checkout 439dc8c0 mars.jpg > > $ git add mars.jpg > > $ git commit -m "Use image of sky instead of surface" > > ~~~ > > {: .language-bash} > > > > ~~~ > > [main da21b34] Use image of sky instead of surface > > ~~~ > > {: .output} > > > > Ми також можемо зберігати *обидва* зображення. Загвоздка в тому, що ми не можемо їх залишити > > під однією й тією ж назвою. Але, ми можемо перевірити кожну версію послідовно > > і *перейменувати* файл, потім додати перейменовані версії. Спочатку перевірте кожне > > зображення і перейменуйте його: > > > > ~~~ > > $ git checkout HEAD mars.jpg > > $ git mv mars.jpg mars-surface.jpg > > $ git checkout 439dc8c0 mars.jpg > > $ mv mars.jpg mars-sky.jpg > > ~~~ > > {: .language-bash} > > > > Потім видаліть старий `mars.jpg` і додайте два нових файли: > > > > ~~~ > > $ git rm mars.jpg > > $ git add mars-surface.jpg > > $ git add mars-sky.jpg > > $ git commit -m "Use two images: surface and sky" > > ~~~ > > {: .language-bash} > > > > ~~~ > > [main 94ae08c] Use two images: surface and sky > > 2 files changed, 0 insertions(+), 0 deletions(-) > > create mode 100644 mars-sky.jpg > > rename mars.jpg => mars-surface.jpg (100%) > > ~~~ > > {: .output} > > > > Тепер обидва зображення Марса перевіряються в репозиторії, і `mars.jpg` > > більше не існує.

source: > ## A Typical Work Session
uk: > ## Типова Робоча Сесія

source: > > You sit down at your computer to work on a shared project that is tracked in a > remote Git repository. During your work session, you take the following > actions, but not in this order: > > - *Make changes* by appending the number `100` to a text file `numbers.txt` > - *Update remote* repository to match the local repository > - *Celebrate* your success with some fancy beverage(s) > - *Update local* repository to match the remote repository > - *Stage changes* to be committed > - *Commit changes* to the local repository > > In what order should you perform these actions to minimize the chances of > conflicts? Put the commands above in order in the *action* column of the table > below. When you have the order right, see if you can write the corresponding > commands in the *command* column. A few steps are populated to get you > started. > > |order|action . . . . . . . . . . |command . . . . . . . . . . | > |-----|---------------------------|----------------------------| > |1 | | | > |2 | | `echo 100 >> numbers.txt` | > |3 | | | > |4 | | | > |5 | | | > |6 | Celebrate! | `AFK` | > > > ## Solution > > > > |order|action . . . . . . |command . . . . . . . . . . . . . . . . . . . | > > |-----|-------------------|----------------------------------------------| > > |1 | Update local | `git pull origin main` | > > |2 | Make changes | `echo 100 >> numbers.txt` | > > |3 | Stage changes | `git add numbers.txt` | > > |4 | Commit changes | `git commit -m "Add 100 to numbers.txt"` | > > |5 | Update remote | `git push origin main` | > > |6 | Celebrate! | `AFK` |
uk: > > Ви сідаєте за комп'ютер, щоб працювати над спільним проєктом, який відстежується у > віддаленому репозиторії Git. Під час робочого сеансу ви приймаєте наступні > дії, але не в цьому порядку: > > - *Внесіть зміни *, додавши число '100' до текстового файлуe `numbers.txt` > - *Оновіть віддалений* репозиторій, щоб відповідати локальному репозиторію > - *Святкуйте* свій успіх з якимось напоєм(-ями) > - *Оновіть локальний* репозиторій, щоб відповідати віддаленому репозиторію > - *Перенесіть зміни в зону стейджингу*, щоб зробити коміт > - *Комітніть зміни* до локального репозиторію > > В якому порядку слід виконувати ці дії, щоб мінімізувати шанси > конфліктів? Наведіть команди вище в порядок, у стовпці *action* в таблиці > нижче. Коли ви розставите все у відповідному порядку, подивіться, чи можете ви написати відповідні команди в стовпці > *command*. Кілька кроків вже заповнені, щоб допомогти вам > розпочати. > > |order|action . . . . . . . . . . |command . . . . . . . . . . | > |-----|---------------------------|----------------------------| > |1 | | | > |2 | | `echo 100 >> numbers.txt` | > |3 | | | > |4 | | | > |5 | | | > |6 | Celebrate! | `AFK` | > > > ## Відповідь > > > > |order|action . . . . . . |command . . . . . . . . . . . . . . . . . . . | > > |-----|-------------------|----------------------------------------------| > > |1 | Update local | `git pull origin main` | > > |2 | Make changes | `echo 100 >> numbers.txt` | > > |3 | Stage changes | `git add numbers.txt` | > > |4 | Commit changes | `git commit -m "Add 100 to numbers.txt"` | > > |5 | Update remote | `git push origin main` | > > |6 | Celebrate! | `AFK` |
