Repository: carpentries-i18n/i18n
Catalog: transifex/git-novice/*/14__10-open.md.po
Languages: uk

source: --- title: Open Science teaching: 5 exercises: 5 questions: - "How can version control help me make my work more open?" objectives: - "Explain how a version control system can be leveraged as an electronic lab notebook for computational work." keypoints: - "Open scientific work is more useful and more highly cited than closed." ---
uk: --- title: Відкрита Наука teaching: 5 exercises: 5 questions: - "Як контроль версій допоможе мені зробити мою роботу більш відкритою?" objectives: - "Пояснити як система контролю версій може бути використана як електронний лабораторний ноутбук для обчислювальної роботи." keypoints: - "Відкрита наукова робота більш корисна і більш високо цитована, ніж закрита." ---

source: > The opposite of "open" isn't "closed".
uk: > Протилежність "відкрита" не є "закрита".

source: > The opposite of "open" is "broken".
uk: > Протилежність "відкритої" є "зламана".

source: Free sharing of information might be the ideal in science, but the reality is often more complicated. Normal practice today looks something like this:
uk: Вільний обмін інформацією може бути ідеальним в науці, але реальність часто складніша. Нормальна практика сьогодні виглядає приблизно так:

source: * A scientist collects some data and stores it on a machine
uk: * Вчений збирає деякі дані і зберігає їх на машині,

source: that is occasionally backed up by her department. * She then writes or modifies a few small programs (which also reside on her machine) to analyze that data. * Once she has some results, she writes them up and submits her paper. She might include her data -- a growing number of journals require this -- but she probably doesn't include her code. * Time passes. * The journal sends her reviews written anonymously by a handful of other people in her field. She revises her paper to satisfy them, during which time she might also modify the scripts she wrote earlier, and resubmits. * More time passes. * The paper is eventually published. It might include a link to an online copy of her data, but the paper itself will be behind a paywall: only people who have personal or institutional access will be able to read it.
uk: яка іноді підтримується його департаментом * Потім він пише або змінює кілька невеликих програм (які також знаходяться на його машині), щоб аналізувати ці дані. * Як тільки він має деякі результати, він пише їх і подає свою статтю. Він може включати свої дані - все більше число журналів вимагають цього - але він, ймовірно, не включає свій код. * Час проходить. * Журнал надсилає йому відгуки, написані анонімно кількома іншими людьми в його області. Він переглядає свою статтю, щоб задовольнити їх, за цей час він також може змінити скрипти, які він написав раніше, та перепубліковує. * Проходить більше часу. * Зрештою стаття опублікована. Вона може включати посилання на онлайн-копію його даних, але сама стаття буде платною: тільки люди, які мають особистий або інституційний доступ зможуть її прочитати.

source: For a growing number of scientists, though, the process looks like this:
uk: Хоча, для зростаючого числа вчених процес виглядає так:

source: * The data that the scientist collects is stored in an open access repository
uk: * Дані, які збирає вчений, зберігаються у репозиторії відкритого доступу

source: like [figshare](https://figshare.com/) or [Zenodo](https://zenodo.org), possibly as soon as it's collected, and given its own [Digital Object Identifier](https://en.wikipedia.org/wiki/Digital_object_identifier) (DOI). Or the data was already published and is stored in [Dryad](https://datadryad.org/). * The scientist creates a new repository on GitHub to hold her work. * As she does her analysis, she pushes changes to her scripts (and possibly some output files) to that repository. She also uses the repository for her paper; that repository is then the hub for collaboration with her colleagues. * When she's happy with the state of her paper, she posts a version to [arXiv](https://arxiv.org/) or some other preprint server to invite feedback from peers. * Based on that feedback, she may post several revisions before finally submitting her paper to a journal. * The published paper includes links to her preprint and to her code and data repositories, which makes it much easier for other scientists to use her work as starting point for their own research.
uk: як [figshare](https://figshare.com/) або [Zenodo](https://zenodo.org), ймовірно, як тільки ці дані були зібрані, і з огляду на свій [Цифровий ідентифікатор об`єкта](https://en.wikipedia.org/wiki/Digital_object_identifier) (DOI). Або дані вже були опубліковані і зберігаються в [Dryad](https://datadryad.org/). * Вчений створює нове сховище на GitHub для проведення своєї роботи. * Як він зробить свій аналіз, він відправляє зміни його скриптів (і, можливо, деякі вихідні файли) до цього репозиторію. Він також використовує сховище для своєї статті; цей репозиторій тоді є хабом для співпраці з його колегами. * Коли він задоволений станом своєї статті, він публікує версію на [arXiv](https://arxiv.org/) або інший сервер для друку, щоб запросити колег до написання відгуків. * На основі цих відгуків, він може опублікувати кілька редакцій перед тим, як нарешті подати свою статтю в журнал. * Опублікована стаття включає посилання на її препринт і до його коду та сховищ даних, що значно полегшує роботу іншим вченим використовувати його роботу як відправну точку для власних досліджень.

source: This open model accelerates discovery: the more open work is, [the more widely it is cited and re-used](https://doi.org/10.1371/journal.pone.0000308). However, people who want to work this way need to make some decisions about what exactly "open" means and how to do it. You can find more on the different aspects of Open Science in [this book](https://link.springer.com/book/10.1007/978-3-319-00026-8).
uk: Ця відкрита модель прискорює дослідження: чим робота є більш відкритою, [тим ширше вона цитується і повторно використовується](https://doi.org/10.1371/journal.pone.0000308). Однак людям, які хочуть працювати таким чином, потрібно приймати певні рішення про те, що саме означає «відкрити» і як це зробити. Ви можете знайти більше про різні аспекти відкритої науки в [цій книзі](https://link.springer.com/book/10.1007/978-3-319-00026-8).

source: This is one of the (many) reasons we teach version control. When used diligently, it answers the "how" question by acting as a shareable electronic lab notebook for computational work:
uk: Це одна з (багатьох) причин, чому ми навчаємо контролю версій. Коли використовується старанно, він відповідає на питання «як», діючи як електронний лабораторний ноутбук для обчислювальної роботи:

source: * The conceptual stages of your work are documented, including who did
uk: * Концептуальні етапи вашої роботи документовані, в тому числі, хто що і коли

source: what and when. Every step is stamped with an identifier (the commit ID) that is for most intents and purposes unique. * You can tie documentation of rationale, ideas, and other intellectual work directly to the changes that spring from them. * You can refer to what you used in your research to obtain your computational results in a way that is unique and recoverable. * With a version control system such as Git, the entire history of the repository is easy to archive for perpetuity.
uk: зробив. Кожен крок "штампується" ідентифікатором (ідентифікатор коміту), тобто для більшості намірів і цілей унікальний. * Ви можете прив'язати документацію обгрунтування, ідеї та іншу інтелектуальну роботу безпосередньо до змін, які виходять з них. * Ви можете звернутися до того, що ви використовували в своїх дослідженнях, щоб отримати ваші обчислювальні результати унікальним і відновлюваним чином. * За допомогою системи керування версіями, такої як Git, всю історію репозиторію легко архівувати на невизначений термін.

source: > ## Making Code Citable
uk: > ## Створення Коду можливим для Цитування

source: > > Anything that is hosted in a version control repository (data, code, papers, > etc.) can be turned into a citable object. You'll learn how to do this in > [the later episode on Citation]({{ page.root }}{% link _episodes/12-citation.md %}).
uk: > > Все, що розміщується в репозиторії контролю версій (дані, код, статті, > і т.д.) можна перетворити на придатний для використання об'єкт. Ви дізнаєтеся, як це зробити в > [в пізнішому епізоді про Цитування]({{ page.root }}{% link _episodes/12-citation.md %}).

source: > ## How Reproducible Is My Work?
uk: > ## Наскільки Відтворюваною Є Моя Робота?

source: > > Ask one of your labmates to reproduce a result you recently obtained > using only what they can find in your papers or on the web. > Try to do the same for one of their results, > then try to do it for a result from a lab you work with.
uk: > > Попросіть одного з ваших співробітників відтворити результат, який ви нещодавно отримали, > використовуючи тільки те, що вони можуть знайти в ваших статтях або в Інтернеті. > Спробуйте зробити те ж саме для одного з їх результатів, > потім спробуйте зробити це для результату з лабораторії, з якою ви працюєте.

source: > ## How to Find an Appropriate Data Repository?
uk: > ## Як Знайти Відповідний Репозиторій Даних?

source: > > Surf the internet for a couple of minutes and check out the data repositories > mentioned above: [Figshare](https://figshare.com/), [Zenodo](https://zenodo.org), > [Dryad](https://datadryad.org/). Depending on your field of research, you might > find community-recognized repositories that are well-known in your field. > You might also find useful [these data repositories recommended by Nature]( > https://www.nature.com/sdata/data-policies/repositories). > Discuss with your neighbor which data repository you might want to > approach for your current project and explain why.
uk: > > Попрацюйте в Інтернеті протягом декількох хвилин і перевіряйте репозитрії, > згаданих вище:: [Figshare](https://figshare.com/), [Zenodo](https://zenodo.org), > [Dryad](https://datadryad.org/). Залежно від вашої галузі досліджень, ви можете > fзнайти визнані спільнотою сховища, які добре відомі у вашій області. > Ви також можете знайти корисними [ці сховища даних, рекомендовані Nature]( > https://www.nature.com/sdata/data-policies/repositories). > Обговоріть зі своїм сусідом, до якого сховища даних ви можете > підійти для вашого поточного проєкту, і поясніть, чому.

source: > ## How to Track Large Data or Image Files using Git?
uk: > ## Як Відстежувати Великі Дані або Файли Зображень за допомогою Git?

source: > > Large data or image files such as `.md5` or `.psd` file types can be tracked within > a github repository using the [Git Large File Storage](https://git-lfs.github.com) > open source extension tool. This tool automatically uploads large file contents to > a remote server and replaces the file with a text pointer within the github repository. > > Try downloading and installing the Git Large File Storage extension tool, then add > tracking of a large file to your github repository. Ask a colleague to clone your > repository and describe what they see when they access that large file.
uk: > > Великі дані або файли зображень, такі як `.md5` або `.psd` типи файлів можуть бути відстежені в межах > репозиторію github, використовуючи [Git Велике Сховище Файлів](https://git-lfs.github.com) > інструмент розширення з відкритим кодом. Цей інструмент автоматично завантажує великий вміст файлу > на віддалений сервер і замінює файл текстовим вказівником у репозиторії github. > > Спробуйте завантажити та встановити інструмент розширення Git Large File Storage, а потім додати > відстеження великого файлу до сховища github. Попросіть колегу клонувати ваш > репозиторій і описати, що вони бачать, коли вони отримують доступ до цього великого файлу.
