Repository: carpentries-i18n/i18n
Catalog: transifex/git-novice/*/15__11-licensing.md.po
Languages: uk

source: --- title: Licensing teaching: 5 exercises: 0 questions: - "What licensing information should I include with my work?" objectives: - "Explain why adding licensing information to a repository is important." - "Choose a proper license." - "Explain differences in licensing and social expectations." keypoints: - "The `LICENSE`, `LICENSE.md`, or `LICENSE.txt` file is often used in a repository to indicate how the contents of the repo may be used by others." - "People who incorporate General Public License (GPL'd) software into their own software must make their software also open under the GPL license; most other open licenses do not require this." - "The Creative Commons family of licenses allow people to mix and match requirements and restrictions on attribution, creation of derivative works, further sharing, and commercialization." - "People who are not lawyers should not try to write licenses from scratch." ---
uk: --- title: Ліцензування teaching: 5 exercises: 0 questions: - "Яку інформацію про ліцензування я повинен включити у свою роботу?" objectives: - "Пояснення чому додавання ліцензійної інформації до репозиторію є важливим." - "Виберіть відповідну ліцензію." - "Пояснити відмінності в ліцензуванні та соціальних очікуваннях." keypoints: - "` Файл LICENSE`, `LICENSE.md`, або `LICENSE.txt` часто використовується в репозиторії, щоб вказати, як вміст репозиторію може використовуватися іншими." - "Люди, які включають програмне забезпечення General Public License (GPL'd) у власне програмне забезпечення, повинні зробити своє програмне забезпечення також відкритим під ліцензією GPL; більшість інших відкритих ліцензій цього не вимагають." - "Сімейство ліцензій Creative Commons дозволяє людям змішувати та відповідати вимогам та обмеженням щодо атрибуції, створення похідних творів, подальшого спільного використання та комерціалізації." - "Люди, які не є юристами, не повинні намагатися писати ліцензії з нуля." ---

source: When a repository with source code, a manuscript or other creative works becomes public, it should include a file `LICENSE` or `LICENSE.txt` in the base directory of the repository that clearly states under which license the content is being made available. This is because creative works are automatically eligible for intellectual property (and thus copyright) protection. Reusing creative works without a license is dangerous, because the copyright holders could sue you for copyright infringement.
uk: Коли репозиторій з вихідним кодом, рукописом або іншими творчими роботами стає публічним, він повинен включати файл `LICENSE` або `LICENSE.txt` у базовому каталозі репозиторію, де чітко вказано, під якою ліцензією надається контент. Це пояснюється тим, що творчі роботи автоматично мають право на захист інтелектуальної власності (і, отже, авторського права). Повторне використання творчих робіт без ліцензії є небезпечним, оскільки правовласники можуть подати до суду на вас за порушення авторських прав.

source: A license solves this problem by granting rights to others (the licensees) that they would otherwise not have. What rights are being granted under which conditions differs, often only slightly, from one license to another. In practice, a few licenses are by far the most popular, and [choosealicense.com](https://choosealicense.com/) will help you find a common license that suits your needs. Important considerations include:
uk: Ліцензія вирішує цю проблему, надаючи права іншим (ліцензіатам), яких вони в іншому випадку не мали б. Які права надаються, за яких умов відрізняються, часто лише незначно, від однієї ліцензії на іншу. На практиці, кілька ліцензій є найпопулярнішими, і [choosealicense.com](https://choosealicense.com/) допоможе вам знайти загальну ліцензію, яка відповідає вашим потребам. Важливі міркування включають:

source: * Whether you want to address patent rights.
uk: * Чи хочете ви вирішити патентні права.

source: * Whether you require people distributing derivative works to also
uk: * Якщо вам потрібно, щоб люди поширювали похідні роботи, щоб

source: distribute their source code. * Whether the content you are licensing is source code. * Whether you want to license the code at all.
uk: також поширювати їх вихідний код.. * Чи є вміст, який ви ліцензуєте, вихідним кодом. * Чи хочете ви ліцензувати код взагалі.

source: Choosing a license that is in common use makes life easier for contributors and users, because they are more likely to already be familiar with the license and don't have to wade through a bunch of jargon to decide if they're ok with it. The [Open Source Initiative](https://opensource.org/licenses) and [Free Software Foundation](https://www.gnu.org/licenses/license-list.html) both maintain lists of licenses which are good choices.
uk: Вибір ліцензії, яка є в загальному використанні полегшує життя для учасників і користувачів, тому що вони, швидше за все, вже знайомі з ліцензією і не повинні пробиратися через купу жаргону, щоб вирішити, чи нормально вони з нею. [Ініціатива з відкритим кодом](https://opensource.org/licenses) та [Фонд вільного програмного забезпечення](https://www.gnu.org/licenses/license-list.html) підтримують списки ліцензій, які є хорошим вибором.

source: [This article][software-licensing] provides an excellent overview of licensing and licensing options from the perspective of scientists who also write code.
uk: [Ця стаття][software-licensing] забезпечує відмінний огляд ліцензування та ліцензування варіантів з точки зору вчених, які також пишуть код.

source: At the end of the day what matters is that there is a clear statement as to what the license is. Also, the license is best chosen from the get-go, even if for a repository that is not public. Pushing off the decision only makes it more complicated later, because each time a new collaborator starts contributing, they, too, hold copyright and will thus need to be asked for approval once a license is chosen.
uk: Зрештою важливо те, що є чітке твердження щодо того, що таке ліцензія. Також ліцензію краще вибирати з get-go, навіть якщо для репозиторія, який не є публічним. Відштовхування рішення тільки ускладнює його пізніше, тому що кожен раз, коли колаборант починає вносити свій внесок, він також володіє авторським правом і, таким чином, потрібно буде попросити схвалення, як тільки буде обрана ліцензія.

source: > ## Can I Use Open License?
uk: > ## Чи можна використовувати відкриту ліцензію?

source: > > Find out whether you are allowed to apply an open license to your software. > Can you do this unilaterally, > or do you need permission from someone in your institution? > If so, who?
uk: > > Дізнайтеся, чи дозволено вам застосовувати відкриту ліцензію до вашого програмного забезпечення. > Чи можете ви зробити це в односторонньому порядку, > або вам потрібен дозвіл від когось у вашому закладі? > Якщо так, то хто?

source: > ## What licenses have I already accepted?
uk: > ## Які ліцензії я вже прийняв?

source: > > Many of the software tools we use on a daily basis (including in this workshop) are > released as open-source software. Pick a project on GitHub from the list below, or > one of your own choosing. Find its license (usually in a file called `LICENSE` or > `COPYING`) and talk about how it restricts your use of the software. Is it one of > the licenses discussed in this session? How is it different? > - [Git](https://github.com/git/git), the source-code management tool > - [CPython](https://github.com/python/cpython), the standard implementation of the Python language > - [Jupyter](https://github.com/jupyter), the project behind the web-based Python notebooks we'll be using > - [EtherPad](https://github.com/ether/etherpad-lite), a real-time collaborative editor
uk: > > Багато програмних засобів, які ми використовуємо щодня (в тому числі в цьому семінарі) > випущені як відкрите програмне забезпечення. Виберіть проєкт на GitHub зі списку нижче, або > один на ваш власний вибір. Знайдіть свою ліцензію (зазвичай у файлі під назвою `LICENSE` або > `COPYING`) і поговоріть про те, як це обмежує використання програмного забезпечення. Це одна з > ліцензій, обговорена на цій сесії? Чим вона відрізняється? > - [Git](https://github.com/git/git), інструмент управління вихідним кодом > - [CPython](https://github.com/python/cpython), стандартна реалізація мови Python > - [Jupyter](https://github.com/jupyter), проєкт за веб-ноутбуками Python, які ми будемо використовувати > - [EtherPad](https://github.com/ether/etherpad-lite), редактор спільної роботи в режимі реального часу
