Repository: carpentries-i18n/i18n
Catalog: transifex/git-novice/*/20__discuss.md.po
Languages: uk

source: --- layout: page title: Discussion ---
uk: --- layout: page title: Обговорення ---

source: ## Frequently Asked Questions
uk: ## Часті запитання

source: People often have questions about Git beyond the scope of the core material. Students who have completed the rest of the lessons might find value in looking through the following topics.
uk: У людей часто виникають питання про Git, що виходять за рамки основного матеріалу. Студенти, які завершили решту уроків, можуть знайти цінність у перегляді наступних тем.

source: Note that since this material isn't essential for basic Git usage, it won't be covered by the instructor.
uk: Зауважте, що оскільки цей матеріал не є важливим для базового використання Git, він не буде покритий інструктором.

source: ## More Advanced Git Configuration
uk: ## Додаткові налаштування Git

source: In [Setting Up Git]({{ page.root }}/02-setup/), we used `git config --global` to set some default options for Git. It turns out that these configuration options get stored in your home directory in a plain text file called `.gitconfig`.
uk: В [Налаштування Git]({{ page.root }}/02-setup/), ми використовували `git config --global`, щоб встановити деякі параметри за замовчуванням для Git. Виявляється, ці параметри конфігурації зберігаються у вашій домашній директорії у звичайному текстовому файлі під назвою `.gitconfig`.

source: This file can be opened in your preferred text editor. (Note that it is recommended to continue using the `git config` command, as this helps avoid introducing syntax errors.)
uk: Цей файл можна відкрити у бажаному текстовому редакторі. (Зауважте, що рекомендується продовжити використання команди `git config`, оскільки це допомагає уникнути введення синтаксичних помилок.)

source: Eventually, you will want to start customizing Git's behaviour. This can be done by adding more entries to your `.gitconfig`. The available options are described in the manual:
uk: Зрештою, ви захочете почати налаштовувати поведінку Git. Це можна зробити, додавши більше записів до вашого `.gitconfig`. Доступні параметри описані в посібнику:

source: In particular, you might find it useful to add aliases. These are like shortcuts for longer Git commands. For example, if you get sick of typing `git checkout` all the time, you could run the command:
uk: Зокрема, вам може знадобитися додати псевдоніми. Це як ярлики для довших команд Git. Наприклад, якщо вам набридло вводити `git checkout` весь час, ви можете запустити команду:

source: Now if we return to the example from [Exploring History]({{ page.root }}/05-history/) where we ran:
uk: Тепер, якщо ми повернемося до прикладу з [Досліджуючи історію]({{ page.root }}/05-history/), де ми запустили:

source: we could now instead type:
uk: ми могли б тепер надрукувати:

source: ## Styling Git's Log
uk: ## Стиль Git's Log

source: A good target for customization is output from the log. The default log is quite verbose but gives no graphical hints such as information about which commits were done locally and which were pulled from remotes.
uk: Гарною метою для налаштування є результат log. Типовий log досить багатослівний, але не дає графічних підказок, таких як інформація про те, які коміти були зроблені локально і які були витягнуті з віддалених.

source: You can use `git log --help` and `git config --help` to look for different ways to change the log output. Try the following commands and see what effect they have:
uk: Ви можете використовувати `git log --help` та `git config --help` для пошуку різних способів зміни результату log. Спробуйте наступні команди і подивіться, який ефект вони мають:

source: If you don't like the effects, you can undo them with:
uk: Якщо вам не подобаються ефекти, ви можете скасувати їх за допомогою:

source: > ## Undoing Git Configuration Changes
uk: > ## Скасування змін конфігурації Git

source: > > You can use the `--unset` flag to delete unwanted options from `.gitconfig`. > Another way to roll back changes is to store your `.gitconfig` using Git. > > For hints on what you might want to configure, > go to GitHub and search for "gitconfig". > You will find hundreds of repositories in which people have stored > their own Git configuration files. > Sort them by the number of stars and have a look at the top few. > If you find some you like, > please check that they're covered by an open source license before you clone them.
uk: > > Ви можете використовувати прапорець `--unset` для видалення небажаних параметрів з `.gitconfig`. > Інщий спосіб повернути зміни - зберігати ваш `.gitconfig` за допомогою Git. > > Щоб отримати підказки щодо того, що ви можете налаштувати, > перейдіть до GitHub та знайдіть "gitconfig". > Ви знайдете сотні репозиторіїв, в яких люди зберегли > свої власні файли конфігурації Git. > Сортувати їх за кількістю зірок і подивитися на кілька найкращих. > Якщо ви знайдете ті, які вам подобаються, > будь ласка, перевірте, що вони охоплені ліцензією з відкритим вихідним кодом, перш ніж клонувати їх.

source: ## Non-text Files
uk: ## Нетекстові файли

source: Recall when we discussed [Conflicts]({{ page.root }}/09-conflict/) there was a challenge that asked, "What does Git do when there is a conflict in an image or some other non-textual file that is stored in version control?"
uk: Пригадайте, коли ми обговорювали [Конфлікти]({{ page.root }}/09-conflict/) була задача, яка запитувала, "Що робить Git коли виникає конфлікт у зображенні або якомусь інщому нетекстовому файлі, що зберігається у контролі версій?"

source: We will now revisit this in more detail.
uk: Тепер ми переглянемо це більш детально.

source: Many people want to version control non-text files, such as images, PDFs and Microsoft Office or LibreOffice documents. It is true that Git can handle these filetypes (which fall under the banner of "binary" file types). However, just because it *can* be done doesn't mean it *should* be done.
uk: Багато людей хочуть керувати версіями нетекстових файлів, таких як зображення, PDF-файли та документи Microsoft Office або LibreOffice. Це правда, що Git може обробляти ці типи файлів (які потрапляють під банер «бінарних» типів файлів). Однак тільки тому, що це *можна* зробити, не означає, що це *слід* зробити.

source: Much of Git's magic comes from being able to do line-by-line comparisons ("diffs") between files. This is generally easy for programming source code and marked up text. For non-text files, a diff can usually only detect that the files have changed but can't say how or where.
uk: Велика частина магії Git походить від можливості робити порівняння по черзі («diffs») між файлами. Це, як правило, легко для програмування вихідного коду і розміченого тексту. Для нетекстових файлів різниця зазвичай може виявляти лише те, що файли змінилися але не можуть сказати, як і де.

source: This has various impacts on Git's performance and will make it difficult to compare different versions of your project.
uk: Це має різний вплив на продуктивність Git і ускладнить порівняння різних версій вашого проєкту.

source: For a basic example to show the difference it makes, we're going to go see what would have happened if Dracula had tried using outputs from a word processor instead of plain text.
uk: Для базового прикладу, щоб показати різницю, яку він робить, ми підемо подивитися, що б сталося, якби Dracula had спробував використання результатів з текстового процесора замість звичайного тексту.

source: Create a new directory and go into it:
uk: Створіть нову директорію і перейдіть в неї:

source: Use a program such as Microsoft Word or LibreOffice Writer to create a new document. Enter the same text that we began with before:
uk: Для створення нового документа використовуйте програму, таку як Microsoft Word або LibreOffice Writer. Введіть той самий текст, з якого ми починали раніше:

source: Save the document into the `planets-nontext` directory with the name of `mars.doc`. Back in the terminal, run the usual commands for setting up a new Git repository:
uk: Збережіть документ у директорії `planets-nontext` зщ назвою `mars.doc`. Знову в терміналі запустіть звичайні команди для налаштування нового репозиторію Git:

source: Then make the same changes to `mars.doc` that we (or Vlad) previously made to `mars.txt`.
uk: Потім внесіть ті ж зміни в `mars.doc`, які ми (або Vlad) раніше зробили в `mars.txt`.

source: Save and close the word processor. Now see what Git thinks of your changes:
uk: Збережіть і закрийте текстовий процесор. Тепер подивіться, що Git думає про ваші зміни:

source: Compare this to the earlier `git diff` obtained when using text files:
uk: Порівняйте це з попереднім `git diff`, отриманим при використанні текстових файлів:

source: Notice how plain text files give a much more informative diff. You can see exactly which lines changed and what the changes were.
uk: Зверніть увагу, як звичайні файли дають набагато більш інофрмативну різницю (diff). Ви можете побачити, які саме лінії змінилися і які були зміни.

source: An uninformative `git diff` is not the only consequence of using Git on binary files. However, most of the other problems boil down to whether or not a good diff is possible.
uk: Неінформативний `git diff` не є єдиним наслідком використання Git на бінарних файлах. Однак більшість інших проблем зводяться до того, чи можлива хороша різниця (diff).

source: This isn't to say you should *never* use Git on binary files. A rule of thumb is that it's OK if the binary file won't change very often, and if it does change, you don't care about merging in small differences between versions.
uk: Це не означає, що ви повинні *ніколи* використовувати Git на бінарних файлах. Великим правилом є те, що це нормально, якщо бінарний файл не змінюється дуже часто, і якщо він змінюється, вам не важливо об'єднуватися в невеликі відмінності між версіями.

source: We've already seen how a word processed report will fail this test. An example that passes the test is a logo for your organization or project. Even though a logo will be stored in a binary format such as `jpg` or `png`, you can expect it will remain fairly static through the lifetime of your repository. On the rare occasion that branding does change, you will probably just want to replace the logo completely rather than merge little differences in.
uk: Ми вже бачили, як опрацьований словесний репорт провалить цей тест. Прикладом, який проходить тест, є логотип для вашої організації або проєкту. Незважаючи на те, що логотип буде зберігатися в бінарному форматі, такому як `jpg` або `png`, ви можете очікувати, що він залишиться досить статичним протягом усього життя вашого репозиторію. У рідкісних випадках, коли брендинг змінюється, ви, ймовірно, просто хочете замінити логотип повністю, а не об'єднати невеликі відмінності.

source: ## Removing a File
uk: ## Видалення файлу

source: Adding and modifying files are not the only actions one might take when working on a project. It might be required to remove a file from the repository.
uk: Додавання та зміна файлів - це не єдині дії, які можна виконати під час роботи над проєктом. Можливо, буде потрібно видалити файл зі сховища.

source: Create a new file for the planet Nibiru:
uk: Створіть новий файл для планети Nibiru:

source: Now add to the repository like you have learned earlier:
uk: Тепер додайте в репозиторій, як ви навчилися раніше:

source: Nibiru is not a real planet. That was a silly idea. Let us remove it from the disk and let Git know about it:
uk: Nibiru - не справжня планета. Це була дурна ідея. Давайте видалимо її з диска і нехай Git знає про це:

source: The change has been staged. Now commit the removal, and remove the file from the repository itself. Note that the file will be removed in the new commit. The previous commit will still have the file, if you were to retrieve that specific commit.
uk: Зміна була перенесена у зону стейджингу. Тепер закомітьте видалення та видаліть файл з самого репозиторію. Зауважте, що файл буде вилучено у новому коміті. Попередній коміт все одно матиме файл, якщо ви хочете отримати цей конкретний коміт.

source: ## Removing a File with Unix
uk: ## Видалення файлу за допомогою Unix

source: Sometimes we might forget to remove the file through Git. If you removed the file with Unix `rm` instead of using `git rm`, no worries, Git is smart enough to notice the missing file. Let us recreate the file and commit it again.
uk: Іноді ми можемо забути видалити файл через Git. Якщо ви видалили файл за допомогою Unix `rm` замість використання `git rm`, не хвилюйтеся, Git досить розумний, щоб помітити відсутній файл. Давайте відтворимо файл і закомітимо його знову.

source: Now we remove the file with Unix `rm`:
uk: Тепер ми видаляємо файл за допомогою Unix `rm`:

source: See how Git has noticed that the file `nibiru.txt` has been removed from the disk. The next step is to "stage" the removal of the file from the repository. This is done with the command `git rm` just as before.
uk: Дивіться, як Git помітив, що файл `nibiru.txt` був видалений з диска. Наступним кроком є "стейджинг" видалення файлу з репозиторію. Це робиться за допомогою команди `git rm` так само, як і раніше.

source: The change that was made in Unix has now been staged and needs to be committed.
uk: Зміна, яка була зроблена в Unix, тепер була перенесена в зону стейджингу і повинна бути закомічена.

source: ## Renaming a File
uk: ## Видалення файлу

source: Another common change when working on a project is to rename a file.
uk: Іншою поширеною зміною під час роботи над проєктом є перейменування файлу.

source: Create a file for the planet Krypton:
uk: Створіть файл для планети Krypton:

source: Add it to the repository:
uk: Додайте його до репозиторію:

source: We all know that Superman moved to Earth. Not that he had much choice. Now his home planet is Earth.
uk: Всі ми знаємо, що Superman переїхав на Earth. Не те, щоб у нього було багато вибору. Тепер його рідна планета - Earth.

source: Rename the file `krypton.txt` to `earth.txt` with Git:
uk: Переіменуйте файл `krypton.txt` на `earth.txt` за допомогою Git:

source: The final step is commit our change to the repository:
uk: Останнім кроком є внесення змін до репозиторію:

source: ## Renaming a File with Unix
uk: ## Переіменування файлу за допомогою Unix

source: If you forgot to use Git and you used Unix `mv` instead of `git mv`, you will have a touch more work to do but Git will be able to deal with it. Let's try again renaming the file, this time with Unix `mv`. First, we need to recreate the `krypton.txt` file:
uk: Якщо ви забули використовувати Git і використовували Unix `mv` замість `git mv`, у вас буде більше роботи, але Git зможе впоратися з цим. Давайте спробуємо ще раз перейменувати файл, цього разу за допомогою Unix `mv`. По-перше, нам потрібно відтворити файл `krypton.txt`:

source: Let us rename the file and see what Git can figured out by itself:
uk: Давайте перейменуємо файл і подивимося, що Git може з'ясувати сам по собі:

source: Git has noticed that the file `krypton.txt` has disappeared from the file system and a new file `earth.txt` has showed up.
uk: Git помітив, що файл `krypton.txt` зник з файлової системи і з`явився новий файл `earth.txt`.

source: Add those changes to the staging area:
uk: Додайте ці зміни в зону стейджингу:

source: Notice how Git has now figured out that the `krypton.txt` has not disappeared - it has simply been renamed.
uk: Зверніть увагу, як Git тепер зрозумів, що `krypton.txt` не зник - його просто перейменували.

source: The final step, as before, is to commit our change to the repository:
uk: Останнім кроком, як і раніше, є внесення змін до репозиторію:

source: ## Further .gitignore concepts
uk: ## Більше концептів .gitignore

source: For additional documentation on .gitignore, please reference [the official git documentation](https://git-scm.com/docs/gitignore).
uk: Для додаткової документації на .gitignore, будь ласка, посилання [офіційна документація git](https://git-scm.com/docs/gitignore).

source: In the ignore exercise, learners were presented with two variations of ignoring nested files. Depending on the organization of your repository, one may suit your needs over another. Keep in mind that the way that Git travels along directory paths can be confusing.
uk: У вправі на ігнорування, учням були прелставлені дві варіації ігнорування вкладених файлів. Залежно від організації вашого репозиторію може задовольнити ваші потреби над іншим. Майте на увазі, що шлях, яким Git подорожує по шляхах директорій може бути заплутаним.

source: Sometimes the `**` pattern comes in handy, too, which matches multiple directory levels. E.g. `**/results/plots/*` would make git ignore the `results/plots` directory in any root directory.
uk: Іноді `**` шаблон стає теж в нагоді, який відповідає кратному рівню директорій. Наприклад, `**/results/plots/*` змусить git ігнорувати директорію `results/plots` у будь-якій кореневій директорії.

source: > ## Ignoring Nested Files: Challenge Problem
uk: > ## Ігнорування вкладених файлів: проблема задачі

source: > > Given a directory structure that looks like: > > ~~~ > results/data > results/plots > results/run001.log > results/run002.log > ~~~ > {: .language-bash} > > And a .gitignore that looks like: > > ~~~ > *.dat > ~~~
uk: > > Враховуючи структуру директорій, яка виглядає як: > > ~~~ > results/data > results/plots > results/run001.log > results/run002.log > ~~~ > {: .language-bash} > > Та .gitignore, яка виглядає так: > > ~~~ > *.dat > ~~~

source: > > How would you track all of the contents of `results/data/`, including `*.dat` > files, but ignore the rest of `results/`? > > > ## Solution > > > > To do this, your .gitignore would look like this: > > > > ~~~ > > *.dat # ignore the .dat files > > results/* # ignore the files in the results directory > > !results/data/ # do not ignore the files in results/data > > !results/data/* # do not ignore the .dat files in reults/data > > ~~~ > > {: .output}
uk: > > HЯк би ви відстежували весь вміст `results/data/`, включаючи файли `*.dat`, > але ігноруючи інші `results/`? > > > ## Відповідь > > > > Для цього ваш .gitignore буде виглядати так: > > > > ~~~ > > *.dat # ігноруйте файли .dat > > results/* # ігноруйте файли в директорії > > !results/data/ # не ігноруйте файли в results/data > > !results/data/* # не ігноруйте файли .dat в reults/data > > ~~~ > > {: .output}
