Repository: carpentries-i18n/i18n
Catalog: transifex/git-novice/*/22__guide.md.po
Languages: uk

source: --- layout: page title: "Instructor Notes" ---
uk: --- layout: page title: "Нотатки інструктора" ---

source: Using a software tool to handle the versions of your project files lets you focus on the more interesting/innovative aspects of your project.
uk: Використання програмного інструменту для обробки версій файлів вашого проєкту дозволяє зосередитися на більш цікавих/інноваційних аспектах вашого проєкту.

source: * Version control's advantages
uk: * Переваги контролю версій

source: * It's easy to set up
uk: * Його легко встановити

source: * Every copy of a Git repository is a full backup of a project and its history
uk: * Кожна копія репозиторію Git - це повне резервне копіювання проєкту та його історії

source: * A few easy-to-remember commands are all you need for most day-to-day version control tasks
uk: * Кілька простих для запам'ятовування команд - це все, що потрібно для більшості завдань керування версіями щодня

source: * The [GitHub][github] hosting service provides a web-based collaboration service
uk: * Хостинг [GitHub][github] надає колабораційний веб-сервіс

source: * Two main concepts
uk: * Два основних поняття

source: * *commit*: a recorded set of changes in your project's files
uk: * *commit*: записаний набір змін у файлах вашого проєкту

source: * *repository*: the history of all your project's commits
uk: * *repository*: історія всіх комітів вашого проєкту

source: * Why use GitHub?
uk: * Для чого користуватися GitHub?

source: * No need for a server: easy to set up
uk: * Немає необхідності в сервері: легко налаштувати

source: * GitHub's strong community: your colleagues are probably already there
uk: * Сильна спільнота GitHub: ваші колеги, напевно, вже є там

source: ## Overall
uk: ## Загалом

source: Version control might be the most important topic we teach, but Git is definitely the most complicated tool. However, GitHub presently dominates the open software repository landscape, so the time and effort required to teach fundamental Git is justified and worthwhile.
uk: Контроль версій може бути найважливішою темою, яку ми викладаємо, але Git, безумовно, є найскладнішим інструментом. Однак GitHub в даний час домінує у відкритому ландшафті репозиторію програмного забезпечення, тому час та зусилля, необхідні для вивчення фундаменту Git, виправдані та варті того.

source: Because of this complexity, we don't teach novice learners about many interesting topics, such as branching, hashes, and commit objects.
uk: Через цю складність, ми не вчимо початківців багатьом цікавим темам, такі як розгалуження, хеші так об`єкти комітів.

source: Instead we try to convince them that version control is useful for researchers working in teams or not, because it is
uk: Замість цього ми намагаємося переконати їх, що контроль версій корисний для дослідників, які працюють в командах чи ні, бо це

source: * a better way to "undo" changes,
uk: * кращий спосіб "скасувати" зміни,

source: * a better way to collaborate than mailing files back and forth, and
uk: * кращий спосіб для колаборування, ніж розсилка файлів туди-сюди, та

source: * a better way to share your code and other scientific work with the world.
uk: * кращий спосіб поділитися своїм кодом та іншою науковою роботою зі світом.

source: ## Teaching Notes
uk: ## Навчальні нотатки

source: * You can "split" your shell so that recent commands remain in view using [this](https://github.com/rgaiacs/swc-shell-split-window) script.
uk: * Ви можете "розділити" ваш термінал так, щоб останні команди залишалися в полі зору за допомогою [цього](https://github.com/rgaiacs/swc-shell-split-window) скрипту.

source: * Make sure the network is working *before* starting this lesson.
uk: * Переконайтеся, що мережа працює, *перш ніж* почати цей урок.

source: * Drawings are particularly useful in this lesson: if you have a whiteboard,
uk: * Малюнки особливо корисні в цьому уроці: якщо у вас є дошка,

source: [use it][drawings]!
uk: [користуйтеся нею][drawings]!

source: * Version control is usually not the first subject in a workshop,
uk: * Контроль версій, як правило, не перший предмет в семінарі,

source: so get learners to create a GitHub account after the session before. Remind learners that the username and email they use for GitHub (and setup during Git configuration) will be viewable to the public by default. However, there are many reasons why a learner may not want their personal information viewable, and GitHub has [resources for keeping an email address private][github-privacy].
uk: так що разом з учнями створіть обліковий запис GitHub після попередньої сесії. Нагадайте учням, що ім`я користувача та електронна пошта, яку вони використовують для GitHub (і налаштування під час конфігурації Git) будуть доступні для перегляди громадськості за замовчуванням. Однак, є багато причин, чому учень може не хотіти, щоб його особисту інформацію переглядали, і GitHub має [ресурси для зберігання адреси електронної пошти приватною][github-privacy].

source: * If some learners are using Windows, there will inevitably be issues
uk: * Якщо деякі учні використовують Windows, неминуче виникнуть проблеми

source: merging files with different line endings. (Even if everyone's on some flavor of Unix, different editors may or may not add a newline to the last line of a file.) Take a moment to explain these issues, since learners will almost certainly trip over them again. If learners are running into line ending problems, GitHub has a [page][github-line-endings] that helps with troubleshooting. Specifically, the [section on refreshing a repository][github-line-endings-refresh] may be helpful if learners need to change the `core.autocrlf` setting after already having made one or more commits.
uk: з об`єднанням файлів з різними закінченнями рядків. (Навіть якщо всі використовують той чи інший вариант Unix, різні редактори, в залежності від їх налаштувань, можуть додавати або не додавати новий рядок до останнього рядка файла.) Знайдіть хвилину, щоб пояснити ці питання, так як учні напевно будуть повертатися до них знову і знову. Якщо учні стикаються з проблемами закінчення лінії, GitHub має [сторінку][github-line-endings], що допомагає в усуненні несправностей. Зокрема, [розділ про оновлення репозиторію][github-line-endings-refresh] може бути корисним, якщо учням потрібно змінити налаштування `core.autocrlf` після того, як вже зробили один або кілька комітів.

source: * We don't use a Git GUI in these notes because we haven't found one that
uk: * Ми не використовуємо Git GUI в цих нотатках, тому що ми не знайшли той, який

source: installs easily and runs reliably on the three major operating systems, and because we want learners to understand what commands are being run. That said, instructors should demo a GUI on their desktop at some point during this lesson and point learners at [this page][github-gui].
uk: легко встановлюється і надійно працює на трьох основних операційних системах, і тому що ми хочемо, щоб учні розуміли. які команди виконуютьсяю Тим не менш, інструктори повинні демонстувати графічний інтерфейс на своєму робочому столі в якийсь момент під час цього уроку і точкових учнів на [цій сторінці][github-gui].

source: * Instructors should show learners graphical diff/merge tools like
uk: * Інструктори повинні показати учням графічні diff/merge інструменти, як

source: * When appropriate, explain that we teach Git rather than CVS, Subversion, or
uk: * При необхідності поясніть, що ми навчаємо Git, а не CVS, Subversion, або

source: Mercurial primarily because of GitHub's growing popularity: CVS and Subversion are now seen as legacy systems, and Mercurial isn't nearly as widely used in the sciences right now.
uk: Mercurial, перш за все, через зростаючу популярність GitHub: CVS та Subversion тепер розглядаються як застарілі системи, і Mercurial не так широко зараз використовується в науках.

source: * Further resources:
uk: * Більше ресурсів:

source: * [git-it][git-it] is a self-paced command-line Git demo,
uk: * [git-it][git-it] це самостійний командний рядок Git демо,

source: with [git-it-electron][git-it-electron] its GitHub Desktop successor. * [Code School][code-school] has a free interactive course, [Try Git][try-git]. * for instructors, [the Git parable][git-parable] is useful background reading
uk: з [git-it-electron][git-it-electron] його наступником GitHub Desktop. * [Code School][code-school] має безкоштовний інтерактивний курс [Try Git][try-git]. * для викладачів, [Git притча][git-parable] - корисне фонове читання

source: ## [Automated Version Control]({{ page.root }}{% link _episodes/01-basics.md %})
uk: ## [Автоматичний контроль версій]({{ page.root }}{% link _episodes/01-basics.md %})

source: * Ask, "Who uses 'undo' in their editor?" All say "Me". 'Undo' is the simplest
uk: * Запитайте, "Хто користується 'скасувати' у своєму редакторі?" Всі скажуть: "Я". 'Скасувати' - найпростіша

source: form of version control.
uk: форма контролю версій.

source: * Give learners a five-minute overview of what version control does for them
uk: * Дайте учням п'ятихвилинний огляд того, що для них робить контроль версій,

source: before diving into the watch-and-do practicals. Most of them will have tried to co-author papers by emailing files back and forth, or will have biked into the office only to realize that the USB key with last night's work is still on the kitchen table. Instructors can also make jokes about directories with names like "final version", "final version revised", "final version with reviewer three's corrections", "really final version", and, "come on this really has to be the last version" to motivate version control as a better way to collaborate and as a better way to back work up.
uk: перед зануренням в спостарігайте-та-робіть практичні роботи. Більшість з них спробують стати співавторами статей шляхом розсилки файлів туди-сюди, або заїдуть в офіс тільки для того, щоб зрозуміти, що USB-ключ з роботою минулої ночі все ще знаходиться на кухонному столі. Інструктори також можуть жартувати про директоорії з назвами, такими як "остаточна версія", "переглянута остаточна версія", "остаточна версія з трьома поправками", "дійсно остаточна версія", та, "ну ж бо, це дійсно має бути остання версія", щоб мотивувати контроль версій як кращий спосіб співпраці та як кращий спосіб резервного копіювання роботи.

source: ## [Setting Up Git]({{ page.root }}{% link _episodes/02-setup.md %})
uk: ## [Налаштування Git]({{ page.root }}{% link _episodes/02-setup.md %})

source: * We suggest instructors and students use `nano` as the text editor for this
uk: * Ми рекомендуємо інструкторам та учням використовувати `nano`, як текстовий редактор для цих

source: lessons because
uk: уроків, тому що

source: * it runs in all three major operating systems,
uk: * він працює у всіх трьох основних операційних системах

source: * it runs inside the shell (switching windows can be confusing to students), and
uk: * він працює всередині терміналу (перемикання вікон може заплутати учнів), та

source: * it has shortcut help at the bottom of the window.
uk: * у нижній частині вікна є клавіатурні скорочення.

source: Please point out to students during setup that they can and should use another text editor if they're already familiar with it.
uk: Будь ласка, вкажіть студентам під час налаштування, що вони можуть і повинні використовувати інший текстовий редактор, якщо вони вже знайомі з ним.

source: * When setting up Git, be very clear what learners have to enter: it is
uk: * Коли налаштовуєте Git, будьте дуже уважні що студенти повинні ввести: це

source: common for them to edit the instructor's details (e.g. email). Check at the end using `git config --list`.
uk: розповсюдженно для них редагувати деталі інструктора (наприклад, електронна пошта). В кінці кінців, перевірте за допомогою `git config --list`.

source: * When setting up the default branch name, if learners have a Git version
uk: * Під час налаштування типового імені гілки, якщо учні мають версію Git

source: older than 2.28, the default branch name can be changed for the lesson using `git branch -M main` if there are currently commits in the repository, or `git checkout -b main` if there are no commits/the repository is completely empty.
uk: старше ніж 2.28, ім`я гілки за замовчуванням можна змінити для уроку, використовуючи `git branch -M main`, якщо в репозиторії є коміти, або `git checkout -b main`, якщо немає комітів/репозиторій повністю пустий.

source: ## [Creating a Repository]({{ page.root }}{% link _episodes/03-create.md %})
uk: ## [Створення репозиторію]({{ page.root }}{% link _episodes/03-create.md %})

source: * When you do `git status`, Mac users may see a `.DS_Store` file showing as
uk: * Коли ви робите `git status`, користувачі Mac можуть бачити файл `.DS_Store`, що відображається як

source: untracked. This a file that Mac OS creates in each directory.
uk: неперевірений. Це файл, який Mac OS створює в кожній директорії.

source: * The challenge "Places to create repositories" tries to reinforce the idea
uk: * Завдання "місця для створення репозиторіїв" намагається підкріпити ідею,

source: that the `.git` folder contains the whole Git repo and deleting this folder undoes a `git init`. It also gives the learner the way to fix the common mistake of putting unwanted folders (like `Desktop`) under version control.
uk: що папка `.git` містить весб репо Git і видалення цієї папки скасовує `git init`. Це також дає учневі спосіб виправити загальну помилку введення небажаних папок (наприклад, `Desktop`) під контролем версій.

source: Instead of removing the `.git` folder directly, you can choose to move it first to a safer directory and remove it from there:
uk: Замість безпосереднього видалення папки `.git`, ви можете перемістити її спочатку в більш безпечну директорію і видалити її звідти:

source: The challenge suggests that it is a bad idea to create a Git repo inside another repo. For more discussion on this topic, please see [this issue][repos-in-repos].
uk: Завдання говорить про те, що це погана ідея створити репо Git всередині іншого репо. Для додаткової дискусії на цю тему, будь ласка, дивіться [це питання][repos-in-repos].

source: ## [Tracking Changes]({{ page.root }}{% link _episodes/04-changes.md %})
uk: ## [Відстеження змін]({{ page.root }}{% link _episodes/04-changes.md %})

source: * It's important that learners do a full commit cycle by themselves (make
uk: * Важливо, щоб учні робили повний цикл комітів самостійно (вносили

source: changes, `git diff`, `git add`, and `git commit`). The "`bio` repository" challenge does that.
uk: зміни, `git diff`, `git add`, та `git commit`). Завдання "репозиторій `bio`" робить це.

source: * This is a good moment to show a diff with a graphical diff tool. If you
uk: * Це хороший момент, щоб показати різницю з графічним інструментом diff. Якщо ви

source: skip it because you're short on time, show it once in GitHub.
uk: пропустили його, тому що у вас обмаль часу, покажіть його один раз в GitHub.

source: * One thing may cause confusion is recovering old versions. If, instead of
uk: * Одна річ може викликати плутанину - відновлення старих версій. Якщо замість

source: doing `$ git checkout f22b25e mars.txt`, someone does `$ git checkout f22b25e`, they wind up in the "detached HEAD" state and confusion abounds. It's then possible to keep on committing, but things like `git push origin main` a bit later will not give easily comprehensible results. It also makes it look like commits can be lost. To "re-attach" HEAD, use `git checkout main`.
uk: `$ git checkout f22b25e mars.txt` хтось робить `$ git checkout f22b25e`, вони заводяться у "відсторонений HEAD" стан і плутанина рясніє. Потім можна продовжувати комітити, але такі речі, як `git push origin main` трохи пізніше легко не дасть зрозумілих результатів. Це також може виглядати, що коміти були втрачені. Щоб "повторно прикріпити" HEAD, використовуйте `git checkout main`.

source: * This is a good moment to show a log within a Git GUI. If you skip it
uk: * Це хороший момент, щоб показати log в графічному інтерфейсі Git. Якщо ви пропустите його,

source: because you're short on time, show it once in GitHub.
uk: тому що у вас обмаль часу - покажіть його один раз на GitHub.

source: ## [Ignoring Things]({{ page.root }}{% link _episodes/06-ignore.md %})
uk: ## [Ігнорування речей]({{ page.root }}{% link _episodes/06-ignore.md %})

source: Just remember that you can use wildcards and regular expressions to ignore a particular set of files in `.gitignore`.
uk: Просто пам'ятайте, що ви можете використовувати шаблони і регулярні вирази, щоб ігнорувати особливий набір файлів в `.gitignore`.

source: ## [Remotes in GitHub]({{ page.root }}{% link _episodes/07-github.md %})
uk: ## [Пульти в GitHub]({{ page.root }}{% link _episodes/07-github.md %})

source: * Make it clear that Git and GitHub are not the same thing: Git is an open
uk: * Дайте зрозуміти, що Git і GitHub - це не одне і те ж: Git - це інструмент

source: source version control tool, GitHub is a company that hosts Git repositories in the web and provides a web interface to interact with repos they host.
uk: управління версією з відкритим кодом, GitHub - це компанія, яка розміщує Git репозиторії в Інтернеті та надає веб-інтерфейс для взаємодії з репозиторіями, які вони приймають.

source: * If your learners are advanced enough to be comfortable with SSH, tell them
uk: * Якщо ваші учні достатньо просунуті, щоб бути комфортними з SSH, скажіть їм,

source: they can use keys to authenticate on GitHub instead of passwords, but don't try to set this up during class: it takes too long, and is a distraction from the core ideas of the lesson.
uk: що вони можуть використовувати ключі для автентифікації на GitHub замість паролів, але не намагайтеся налаштувати це під час класу: це займає занадто багато часу, і це відволікає відволікає від основних ідей уроку.

source: * It is very useful to draw a diagram showing the different repositories
uk: * Дуже корисно намалювати діаграму з різними

source: involved.
uk: сховищами.

source: * When pushing to a remote, the output from Git can vary slightly depending on
uk: * При відправленні змін на віддалений репозиторій, результат від Git може незначно відрізнятис від того, що

source: what leaners execute. The lesson displays the output from git if a learner executes `git push origin main`. However, some learners might use syntax suggested by GitHub for pushing to a remote with an existing repository, which is `git push -u origin main`. Learners using syntax from GitHub, `git push -u origin main`, will have slightly different output, including the line `Branch main set up to track remote branch main from origin by rebasing.`
uk: виконують слухачі. урок відображає результат від git, якщо слухач виконує `git push origin main`. Однак деякі слухачі можуть використовувати синтаксис, запропонований GitHub, для відправлення на віддалений репозиторій вже з існуючим репозиторієм, тобто `git push -u origin main`. Слухачі, які використовують синтаксис від GitHub, `git push -u origin main`, будуть мати дещо інший результат, включаючи рядок `Branch main set up to track remote branch main from origin by rebasing.`

source: ## [Collaborating]({{ page.root }}{% link _episodes/08-collab.md %})
uk: ## [Колаборація]({{ page.root }}{% link _episodes/08-collab.md %})

source: * Decide in advance whether all the learners will work in one shared
uk: * Вирішіть заздалегідь, чи будуть всі учні працювати в одному спільному

source: repository, or whether they will work in pairs (or other small groups) in separate repositories. The former is easier to set up; the latter runs more smoothly.
uk: репозиторії, або вони будуть працювати в парах (або інших невеликих групах) в окремих репозиторіях. Перший варіант легше налаштувати; останній працює більш гладко.

source: * Role playing between two instructors can be effective when teaching the
uk: * Рольова гра між двома інструкторами може бути ефективною при викладанні

source: collaboration and conflict sections of the lesson. One instructor can play the role of the repository owner, while the second instructor can play the role of the collaborator. If it is possible, try to use two projectors so that the computer screens of both instructors can be seen. This makes for a very clear illustration to the students as to who does what.
uk: розділів про колаборацію та конфлікти. Один інструктор може грати роль власника репозиторію, в той час як другий інструктор може грати роль колаборанта. Якщо це можливо, спробуйте використовувати два проєктори так, що компʼютерні еркани обох інструкторів можна булоб побачити. Це було б дуже чіткою ілюстрацією для студентів щодо того, хто що робить.

source: * It is also effective to pair up students during this lesson and assign one
uk: * Також ефективно поєднувати унчів під час цього уроку і призначати одному

source: member of the pair to take the role of the owner and the other the role of the collaborator. In this setup, challenges can include asking the collaborator to make a change, commit it, and push the change to the remote repository so that the owner can then retrieve it, and vice-versa. The role playing between the instructors can get a bit "dramatic" in the conflicts part of the lesson if the instructors want to inject some humor into the room.
uk: члену пари роль власника, а іншому - роль колаборанта. У цій установці задачі можуть включати в себе прохання колаборанта внести зміни, закомітити це і відправити їх до віддаленого репозиторію, так що власник може потім отримати його, і навпаки. Роль гри між інструкторами може стати трохи "драматичною" в частині уроку про конфлікти, якщо інструктори хочуть ввести ще більше гумору.

source: * If you don't have two projectors, have two instructors at the front of the
uk: * Якщо у вас немає двох проєкторів - на початку кімнати повинні бути два

source: room. Each instructor does their piece of the collaboration demonstration on their own computer and then passes the projector cord back and forth with the other instructor when it's time for them to do the other part of the collaborative workflow. It takes less than 10 seconds for each switchover, so it doesn't interrupt the flow of the lesson. And of course it helps to give each of the instructors a different-colored hat, or put different-colored sticky notes on their foreheads.
uk: інструктори. Кожен інструктор робить свою частину демонстрації колаборації на власному компʼютері, а потім передає шнур проєктора туди-сюди з іншим інструктором, коли їм пора зробити іншу частину робочого процесу. Це займає менше 10 секунд для кожного перемикання, так що це не перериває потік уроку. І звичайно це допомагає дати кожному з інструкторів різнобарвний капелюх, або наліпити різнокольорові липкі нотатки на чолі.

source: * If you're the only instructor, the best way to create is clone the two
uk: * Якщо ви єдиний інструктор, найкращий спосіб створити - це клонувати два

source: repos in your Desktop, but under different names, e.g., pretend one is your computer at work:
uk: репо на робочому столі, але під різними назвами, наприклад, вдавати, що один з них є вашим комп'ютером на роботі:

source: * It's very common that learners mistype the remote alias or the remote URL
uk: * Дуже часто учні помилково вводять віддалений псевдонім або віддалений URL
