Repository: carpentries-i18n/i18n
Catalog: transifex/git-novice/*/22__guide.md.po
Languages: uk

source: when adding a remote, so they cannot `push`. You can diagnose this with `git remote -v` and checking carefully for typos. - To fix a wrong alias, you can do `git remote rename <old> <new>`. - To fix a wrong URL, you can do `git remote set-url <alias> <newurl> `.
uk: при додаванні віддаленого репозиторію, тому вони не можуть `відправити зміни`. Ви можете діагностувати це за допомогою `git remote -v` і ретельно перевірити наявність помилок. - Щоб виправити неправильний псевдонім, ви можете зробити `git remote rename <old> <new>`. - Щоб виправити неправильний URL, ви можете зробити `git remote set-url <alias> <newurl> `.

source: * Before cloning the repo, be sure that nobody is inside another repo. The
uk: * Перш ніж клонувати репо, переконайтеся, що ніхто не знаходиться всередині іншого репо.

source: best way to achieve this is moving to the `Desktop` before cloning: `cd && cd Desktop`.
uk: Найкращий спосіб досягти цього - перейти на `Робочий стіл` перед клонуванням: `cd && cd Desktop`.

source: * If both repos are in the `Desktop`, have them to clone their collaborator
uk: * Якщо обидва репо знаходяться в `Робочому столі` - нехай вони клонують репо свого співавтора

source: repo under a given directory using a second argument:
uk: під заданим каталогом, використовуючи другий аргумент:

source: * The most common mistake is that learners `push` before `pull`ing. If they
uk: * Найпоширенішою помилкою є те, що учні `відправляють` зміни перед тим, як `отримати` їх. Якщо вони

source: `pull` afterward, they may get a conflict.
uk: `отримають` зміни після їх відправлення - може виникнути конфлікт.

source: * Conflicts, sometimes weird, will start to arise. Stay tight: conflicts are
uk: * Почнуть виникати іноді дивні конфлікти. Зверніть увагу: конфлікти

source: next.
uk: наступні.

source: * Learners may have slightly different output from `git push` and `git pull`
uk: * Учні можуть мати трохи інший результат від `git push` та `git pull`,

source: depending on the version of git, and if upstream (`-u`) is used.
uk: залежно від версії git, і якщо використовується upstream (`-u`).

source: ## [Conflicts]({{ page.root }}{% link _episodes/09-conflict.md %})
uk: ## [Конфлікти]({{ page.root }}{% link _episodes/09-conflict.md %})

source: * Expect the learners to make mistakes. Expect *yourself* to make mistakes.
uk: * Очікуйте, що учні зроблять помилки. Очікуйте, що *ви* можете зробити помилки.

source: This happens because it is late in the lesson and everyone is tired.
uk: Це відбувається тому, що урок триває вже достатньо довго і всі втомилися.

source: * If you're the only instructor, the best way to create a conflict is:
uk: * Якщо ви єдиний інструктор, найкращий спосіб створити конфлікт:

source: * Clone your repo in a different directory, pretending is your computer at
uk: * Клонуйте свій репо в іншу директорію, вдаючи, що ваш компʼютер знаходиться на

source: work: `git clone https://github.com/vlad/planets.git planets-at-work`. * At the office, you make a change, commit and push. * At your laptop repo, you (forget to pull and) make a change, commit and try to push. * `git pull` now and show the conflict.
uk: роботі: `git clone https://github.com/vlad/planets.git planets-at-work`. * В офісі ви зробите зміни, закомітите та відправите зміни. * В репо на вашому компʼютері, ви (забули отримати зміни та) робите зміни, комітите та намагаєтеся відправити їх. * тепер введіть `git pull` та покажіть як виглядає конфлікт.

source: * Learners usually forget to `git add` the file after fixing the conflict and
uk: * Учні зазвичай забувають `git add` файл після виправлення конфлікту та

source: just (try to) commit. You can diagnose this with `git status`.
uk: просто (намагаються) комітять. Ви можете це продіагнозувати за допомогою `git status`.

source: * Remember that you can discard one of the two parents of the merge:
uk: * Памʼятайте, що можна відкинути одного з двох батьків злиття:

source: * discard the remote file, `git checkout --ours conflicted_file.txt`
uk: * відкинути віддалений файл, `git checkout --ours conflicted_file.txt`

source: * discard the local file, `git checkout --theirs conflicted_file.txt`
uk: * відкинути локальний файл, `git checkout --theirs conflicted_file.txt`

source: You still have to `git add` and `git commit` after this. This is particularly useful when working with binary files.
uk: Ви все ще повинні зробити `git add` та `git commit` після цього. Особливо це корисно при роботі з бінарними файлами.

source: * Keep in mind that depending on the Git version used, the outputs for
uk: * Майте на увазі, що в залежності від використовуваної версії Git, результати для

source: `git push` and `git pull` can vary slightly.
uk: `git push` та `git pull` можуть дещо відрізнятися.

source: ## [Open Science]({{ page.root }}{% link _episodes/10-open.md %})
uk: ## [Відкрита наука]({{ page.root }}{% link _episodes/10-open.md %})

source: ## [Licensing]({{ page.root }}{% link _episodes/11-licensing.md %})
uk: ## [Ліцензування]({{ page.root }}{% link _episodes/11-licensing.md %})

source: We teach about licensing because questions about who owns what, or can use what, arise naturally once we start talking about using public services like GitHub to store files. Also, the discussion gives learners a chance to catch their breath after what is often a frustrating couple of hours.
uk: Ми вчимо про ліцензування, тому що питання про те, хто володіє чим, або що може використовувати, виникають природно, як тільки ми починаємо говорити про використання державних послуг, як GitHub для зберігання файлів. Також дискусія дає учням шанс перевести їх дух після того, що часто розчаровує протягом декількох годин.

source: The Creative Commons family of licenses is recommended for many types of works (including software documentation and images used in software) but not software itself. Creative Commons [recommends][cc-faq-software] a software-specific license instead.
uk: Сімейство ліцензій The Creative Commons рекомендується для багатьох типів робот (включаючи програмну документацію та зображення, які використовуються в програмному забезпеченні), але не власне програмне забезпечення. Creative Commons [рекомендує][cc-faq-software] ліцензію на програмне забезпечення.

source: ## [Citation]({{ page.root }}{% link _episodes/12-citation.md %})
uk: ## [Цитування]({{ page.root }}{% link _episodes/12-citation.md %})

source: ## [Hosting]({{ page.root }}{% link _episodes/13-hosting.md %})
uk: ## [Хостинг]({{ page.root }}{% link _episodes/13-hosting.md %})

source: A common concern for learners is having their work publicly available on GitHub. While we encourage open science, sometimes private repos are the only choice. It's always interesting to mention the options to have web-hosted private repositories.
uk: Загальна турбота для учнів - мати їх роботу публічно доступною на GitHub. Хоча ми заохочуємо відкриту науку, іноді приватні репо є єдиним вибором. Завжди цікаво згадати варіанти розміщення приватних репозиторіїв.
