Repository: carpentries-i18n/i18n
Catalog: transifex/git-novice/*/25__reference.md.po
Languages: uk

source: ## Git Cheatsheets for Quick Reference
uk: ## Шпаргалки по Git'у для швидкого ознайомлення

source: * Printable Git cheatsheets in several languages are [available here](https://github.github.com/training-kit/) ([English version](https://github.github.com/training-kit/downloads/github-git-cheat-sheet.pdf)). More material is available from the [GitHub training website](http://try.github.io/).
uk: * Шпаргалки з Git'у кількома мовами [доступні тут](https://github.github.com/training-kit/) ([Українська версія](https://training.github.com/downloads/ua/github-git-cheat-sheet/)). Більше матеріалів можна знайти за посиланням [Навчальний сайт GitHub](http://try.github.io/).

source: * An [interactive one-page visualisation](http://ndpsoftware.com/git-cheatsheet.html)
uk: * [Інтерактивна односторінкова візуалізація](http://ndpsoftware.com/git-cheatsheet.html)

source: about the relationships between workspace, staging area, local repository, upstream repository, and the commands associated with each (with explanations). * Both resources are also available in other languages (e.g. Spanish, French, and more). * "[Happy Git and GitHub for the useR](http://happygitwithr.com)" is an accessible, free online book by Jenny Bryan on how to setup and use Git and GitHub with specific references on the integration of Git with RStudio and working with Git in R. * [Open Scientific Code using Git and GitHub](https://open-source-for-researchers.github.io/open-source-workshop/) - A collection of explanations and short practical exercises to help researchers learn more about version control and open source software.
uk: про взаємозв'язки між робочим простором, зоною підготовки, локальним сховищем, вищим сховищем та командами, пов'язаними з кожним з них (з поясненнями). * Обидва ресурси також доступні іншими мовами (наприклад, іспанською, французькою та іншими). * "[Happy Git and GitHub for the useR](http://happygitwithr.com)" - доступна, безкоштовна онлайн книга Дженні Брайан про те, як налаштувати та використовувати Git і GitHub, з конкретними посиланнями на інтеграцію Git з RStudio та роботу з Git в R. * [Open Scientific Code using Git and GitHub](https://open-source-for-researchers.github.io/open-source-workshop/) - - збірка пояснень та коротких практичних вправ, які допоможуть дослідникам дізнатися більше про контроль версій та програмне забезпечення з відкритим кодом.

source: ## Glossary
uk: ## Словник

source: {:auto_ids} changeset : A group of changes to one or more files that are or will be added to a single [commit](#commit) in a [version control](#version-control) [repository](#repository).
uk: {:auto_ids} changeset : Група змін до одного або декількох файлів, які є або будуть додані до одного [коміту](#commit) в [контролі версій](#version-control) [репозиторію](#repository).

source: commit : To record the current state of a set of files (a [changeset](#changeset)) in a [version control](#version-control) [repository](#repository). As a noun, the result of committing, i.e. a recorded changeset in a repository. If a commit contains changes to multiple files, all of the changes are recorded together.
uk: коміт : Для запису поточного стану набору файлів ([набір змін](#changeset)) у [контролі версій](#version-control) [репозиторію](#repository). Як іменник, результат коміту, тобто записаний набір змін у репозиторії. Якщо коміт містить зміни до декількох файлів, всі зміни записуються разом.

source: conflict : A change made by one user of a [version control system](#version-control) that is incompatible with changes made by other users. Helping users [resolve](#resolve) conflicts is one of version control's major tasks.
uk: конфлікт : Зміна, зроблена одним користувачем [система управління версіями](#version-control), несумісна зі змінами, внесеними іншими користувачами. Допомога користувачам [вирішити](#resolve) конфлікти є одним з основних завдань управління версіями.

source: HTTP : The Hypertext Transfer [Protocol](#protocol) used for sharing web pages and other data on the World Wide Web.
uk: HTTP : Hypertext Transfer [Протокол](#protocol), що використовується для обміну веб-сторінками та іншими даними у всесвітній павутині.

source: merge : (a repository): To reconcile two sets of changes to a [repository](#repository).
uk: об'єднати : (репозиторій): Для узгодження двох наборів змін з [репозиторіїв](#repository).

source: protocol : A set of rules that define how one computer communicates with another. Common protocols on the Internet include [HTTP](#http) and [SSH](#ssh).
uk: протокол : Набір правил, які визначають, як один комп'ютер спілкується з іншим. Загальні протоколи в інтернеті включають [HTTP](#http) та [SSH](#ssh).

source: remote : (of a repository) A version control [repository](#repository) connected to another, in such way that both can be kept in sync exchanging [commits](#commit).
uk: віддалений : (репозиторію) Контроль версій [репозиторій](#repository), підключений до іншого, таким чином, що обидва можуть бути збережені в синхронному обміні [комітів](#commit).

source: repository : A storage area where a [version control](#version-control) system stores the full history of [commits](#commit) of a project and information about who changed what, when.
uk: репозиторій : Область зберігання, де [конроль версій](#version-control) система зберігає повну історію [комітів](#commit) проєкту та інформацію про те, хто що змінив і коли.

source: resolve : To eliminate the [conflicts](#conflict) between two or more incompatible changes to a file or set of files being managed by a [version control](#version-control) system.
uk: вирішити : Для усунення [конфліктів](#conflict) між двома або більше несумісними змінами до файлу або набору файлів управляється системою [контроль версій](#version-control).

source: revision : A synonym for [commit](#commit).
uk: ревізія : Синонім [коміту](#commit).

source: SHA-1 : [SHA-1 hashes](https://en.wikipedia.org/wiki/SHA-1) is what Git uses to compute identifiers, including for commits. To compute these, Git uses not only the actual change of a commit, but also its metadata (such as date, author, message), including the identifiers of all commits of preceding changes. This makes Git commit IDs virtually unique. I.e., the likelihood that two commits made independently, even of the same change, receive the same ID is exceedingly small.
uk: SHA-1 : [SHA-1 hashes](https://en.wikipedia.org/wiki/SHA-1) - це те, що Git використовує для обчислення ідентифікаторів, у тому числі для комітів. Для їх обчислення Git використовує не тільки фактичну зміну коміту, але і його метадані (такі як дата, автор, повідомлення), включаючи ідентифікатори всіх комітів попередніх змін. Це робить ідентифікатори комітів Git практично унікальними. Тобто ймовірність того, що два коміти, зроблені незалежно один від одного, навіть однієї і тієї ж зміни, отримують один і той же ідентифікатор, надзвичайно мала.

source: SSH : The Secure Shell [protocol](#protocol) used for secure communication between computers.
uk: SSH : Secure Shell [протокол](#protocol) використовується для безпечного зв'язку між комп'ютерами.

source: timestamp : A record of when a particular event occurred.
uk: часова мітка : Запис про те, коли сталася певна подія.

source: version control : A tool for managing changes to a set of files. Each set of changes creates a new [commit](#commit) of the files; the version control system allows users to recover old commits reliably, and helps manage conflicting changes made by different users.
uk: контроль версій : Інструмент для керування змінами набору файлів. Кожен набір змін створює новий [коміт](#commit) файлів; система контролю версій дозволяє користувачам надійно відновлювати старі коміти, і допомагає керувати суперечливими змінами, внесеними різними користувачами.
